[{"code": "5021", "title": "Sustainable Eco-City Development", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSc Advanced Environmental Planning Technologies or MSc Urban Design", "description": "Course DescriptionThis course introduces the basic theories, practical approaches and key supporting methodologies for achieving sustainable urban planning and development. Learning will be conducted by way of formal lectures, development case studies and field trips. The \"three pillars\" of sustainable development --- social, economical and environmental considerations are emphasized. This course offers basic introduction to the methodological framework of the professional paradigm which the students will eventually operate in their planning and management careers.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5100", "title": "Special Topics in Environmental Planning (1)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSc Advanced Environmental Planning Technologies", "description": "Course DescriptionThis course introduces the latest developments in research and applications of sustainable urban planning and the integration of supporting technologies and approaches for sustainable urbanism. Lectures and seminars by both CUHK teachers and guest speakers from different disciplines and regions are the major components of this course. Students have the opportunities to learn from different perspectives and explore their research directions and career potentials through the inspirations and experience learnt from different guest speakers.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5101", "title": "Special Topics in Environmental Planning (2)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSc Advanced Environmental Planning Technologies", "description": "Course DescriptionThis course introduces the latest developments in research and applications of sustainable urban planning and the integration of supporting technologies and approaches for sustainable urbanism. Lectures and seminars by both CUHK teachers and guest speakers from different disciplines and regions are the major components of this course. Students have the opportunities to learn from different perspectives and explore their research directions and career potentials through the inspirations and experience learnt from different guest speakers.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5102", "title": "International Topical Studies in Sustainable Urbanism", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSc Advanced Environmental Planning Technologies", "description": "Course DesriptionThis course is intended to consolidate students' learning and to enable them to apply the knowledge they accumulated throughout the programme. Students will conduct a focused and practical study on current issues and important developments of sustainable urbanism in an international and inter-disciplinary context. Students may go on a two-week overseas study trip led by a teacher, attending seminars and site visits hosted by distinguished overseas planning or design schools or institutions. Alternatively, if available, students may choose to participate in a compact topical workshop hosted in Hong Kong.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5103", "title": "Spatial and Temporal Analysis Technology for Sustainable Urban Design", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in Advanced Environmental Planning Technologies Programme", "description": "Course DescriptionThis course is to introduce spatial and temporal analysis technology for sustainable urbanism. It emphasizes on the application of main related techniques in organizing, managing and analyzing spatial and temporal data to scientifically support sustainable urban design in description, prediction and prescription in different sub-topics including land use changes, population growth, transportation planning, and real estate pricing analysis and so on. In particular, the spatial and temporal processing, statistical and analytical functions of Geoinformation system (GIS) are discussed and studied to support sustainable urbanism. The course will prepare students to design sustainable urbanism in a scientific and quantitative way.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5104", "title": "Urban Remote Sensing", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSc Advanced Environmental Planning Technologies, MSSc Housing Studies and MSc Urban Design", "description": "Course DescriptionThis course introduces the urban application of remote sensing, including the principles of remote sensing at visible and near infrared (IR), thermal IR, and microwave regions. The course will focus on remote sensing and urban studies, remote sensing systems for urban areas, algorithms and techniques for urban attribute extraction, urban socioeconomic analysis, urban environmental analysis, urban growth and landscape change modeling.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5201", "title": "Scientific Simulations for Sustainable Urban Planning", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSc Advanced Environmental Planning Technologies and MSc Urban Design", "description": "Course DescriptionThis course will introduce urban simulation models and computational design techniques dealing with urban environmental issues including: atmosphere, urban wind and natural ventilation, daylight provision, solar radiation and solar heat gain, noise and ecological performance. The lectures and laboratory sessions will provide students with the necessary scientific computational tools and simulation assessment abilities to support decision-making for urban planning.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5202", "title": "Climate Change and Environmental Planning", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSc Advanced Environmental Planning Technologies and MSSc in Housing Studies", "description": "Course DescriptionThis course specifically highlights the global challenge of climate change and focuses on the adoption of scientific and quantitative approaches to manage this issue through urban planning. The course will outline the background and development of climate change policies both at international and city levels. It concentrates on the theories and practices of low carbon city planning and design, based on the concepts of mitigation and adaptation. Innovative planning approaches and tools such as Greenhouse gas inventory, carbon footprint, integrated resources management, industrial ecology, carbon trading, urban forestry and carbon sinks will be introduced.The course also assists the students to obtain an understanding of various important environmental planning issues such as ecological carrying capacity, ecological footprint, landscape ecology analysis, green infrastructure and wetland conservation in urban planning decision making, plan making and development control processes.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6100", "title": "Dissertation/Planning Design Project", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSc Advanced Environmental Planning Technologies", "description": "This course is devised as a consummation of the entire programme study. Students are required to demonstrate their learning and apply their knowledge and advanced technological skills acquired throughout the programme in this final dissertation/planning design project of a subject of their own choice. Research should be conducted on selected topics in urban/environmental planning or this could be an urban/environmental planning or design project under the supervision and guidance of a supervisor. Students should select a format of project according to their own capability and interest.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]