[{"code": "1001", "title": "The Beauty of Kunqu Opera", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "(UGED1061 is double-coded with ARTS1001.)\rThis course introduces students to the music, performance, literature and aesthetics of Kunqu opera in order to enhance their understanding of traditional Chinese culture, classical Chinese literature as well as performing arts. Selected scenes from Kunqu classics, such as The Peony Pavilion and The Palace of Eternal Youth will be analyzed and discussed before they are staged for appreciation. Under the teachers’ guidance, students will be able to experience the unity of song and dance as well as the artistic expression of emotions in the world of Kunqu opera.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1002", "title": "From Tradition to Modernity: Selected Readings of 20th Century Chinese Culture", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "The course is designed as a sequel to ARTS1000 (Classics of Chinese Humanities: Selected Readings) by focusing on a number of representative texts by famous Chinese intellectuals and writers. They bear witness to the mental deliberations of a generation—or two generations—caught between the forces of tradition and modernity as they found their way through the thicket of source materials from both Chinese and Western cultural traditions. Each author chooses to confront the legacies of Chinese tradition—literary, cultural, and intellectual—by subjecting them to a new reevaluation from modern perspectives derived from their newly acquired knowledge and/or experience from the West. Their modes of analysis have set a new intellectual and scholarly benchmark for later generations. In short, these texts have become modern “classics” in their own right.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1003", "title": "Introduction to Chinese Classics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "This course aims at illustrating the relationship between Chinese classics texts and Chinese culture. Through discussions of important texts in Confucianism, Daoism and Buddhism, students can gain a deeper understanding of these philosophical schools and the underlying features of Chinese tradition, beliefs and values.", "outcome": "預期修畢本科之後，學員能夠：1.  理解中國傳統文化精神的特質2.  掌握中國古代經典的基本思想3.  學習閱讀經典的方法4.  對人生價值有所反思，提升個人修養5.  對自我的身份有深刻的體認 Upon completion of this module, students should be able to:1. acquire a deeper understanding of the various aspects of Chinese tradition and culture.2. comprehend the special features of Chinese classic texts.3. understand the methods to read Chinese classic texts.4. appreciate the traditional Chinese moral value and applied them to their daily life.5. recognize and develop the self-identity.", "syllabus": "Course Syllabus:    1. Introduction：the concept and content of Chinese classics (國學).2. Texts of Confucianism [mainly Four Books (Great Learning, Doctrine of the Mean)     2.1 Confucian Analects, Mencius], Classic of Filial Piety and I Ching.]    2.2 Confucian values and its influences on Chinese culture.3. Texts of Daoism[mainly Laozi, Zhuangzi    3.1 Daoistic values and its influences on Chinese culture.4. Texts of Buddhism [mainly Heart Sutra(心經) and the The Platform Sutra of the Sixth Patriarch (六祖壇經)]     4.1 Buddhist values and its influences on Chinese culture.第一講﹕國學概說「國學」釋義 國學內涵之不同理解 今日言國學的時代意義第二、三講﹕《易經》哲學《易經》背景簡介《易經》《易傳》《易學》的分別象數易簡介義理易簡介第四、五講 ﹕孔子的主脈思想儒家思想興起的背景「禮」、「義」、「仁」三者的理論關係《論語》篇章選講第六、七講 ﹕孟子的中心思想《孟子》背景簡介《孟子》篇章選講孟子性善論、「良知」說及人禽之辨第八、九講 ﹕老子《道德經》疏釋《老子》背景簡介無為之修養與老子的境界形上學第九、十講 ﹕《莊子》中心思想《莊子》背景簡介《莊子》篇章選講《逍遙遊》與《齊物論》疏釋第十一講講﹕佛家基本名相引介原始佛教大小乘之別第十二講 ﹕般若精神《心經》、《金剛經》釋義應無所住而生其心第十三講 ﹕《維摩詰所說經》煩惱根源的詭譎表達佛教成佛的構想 ", "required_readings": "課程所編講義", "recommended_readings": "1.    陳傑思編著：《中華十大義理》，北京:中華書局，2008年2月。2.    章太炎講演、曹聚仁記錄:《國學概論》，成都：巴蜀書社，1987年7月。2.    錢穆:《國學概論》，臺北：臺灣商務印書館，1985年12月。3.    桑兵:《晚清民國的國學研究》上海:上海古籍出版社，2001年10月。4.    張岱年等著:《國學今論》，瀋陽：遼寧教育出版社，1992年6月。5.    陳衛星主編、陳文新審訂:《國學檔案》，武昌：武漢大學出版社，2011年11月。6.    錢基博著、傅宏星編校:《國學文選類纂》，上海:華東師範大學出版社，2010年10月。7.    黃壽祺、張立文：《周易譯注》，上海:上海古籍出版社，1989年5月。8.    朱伯昆主編:《易學漫步》，臺灣：學生書局，1996年11月。9.    宋‧朱熹：《四書章句集注》，北京，中華書局，1983年10月。10.    楊伯峻：《論語譯注》，香港:中華書局，1980年12月。11.    楊伯峻：《孟子譯注》，香港:中華書局，1984年5月。12.    鄧立光:《老子新詮--無為之治及其形上理則》，上海：上海古籍出版社，2007年6月。13.    陳鼓應：《老子注譯及評介》，北京:中華書局，1984年5月。14.    陳鼓應：《莊子今注今譯》，北京:中華書局，1991年10月。15.    郭慶藩:《莊子集釋》，北京:中華書局，1997年10月。16.    方廣錩編纂：《般若心經譯注集成》，上海:上海古籍出版社，1994年9月。17.    郭朋校釋：《壇經校釋》，北京市：北京中華書局，1989年12月。18.    楊曾文校寫：《敦煌新本 六祖壇經》，上海:上海古籍出版社，1995年6月。19.    宋‧普濟：《五燈會元》，北京:中華書局，1984年10月。", "terms": {"2020-21 Term 1": {"--LEC (6820)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Dr. TANG Lap Kwong, \n\rProfessor TAO Kwok Cheung"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2020-21 Term 2": {"--LEC (6179)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Dr. TANG Lap Kwong, \n\rProfessor TAO Kwok Cheung"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 1": {"--LEC (6448)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Yasumoto Int'l Acad Park LT9"], "instructors": ["Staff"], "meetingDates": ["8/9", "15/9"]}}, "2021-22 Term 2": {"--LEC (4596)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Y.C. Liang Hall 104"], "instructors": ["Staff"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Examination": "70", "Test or quiz": "30"}}, {"code": "1004", "title": "Introduction to Environmental Humanities: Debates in China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "This course introduces to students the emerging field of environmental humanities with a particular focus on China. Human activities have been drastically transforming the ecosystem. How do we in the humanities understand the changing nature, live with pollution, and make sense of ecological deterioration? How do technology, capital and state intertwine and contribute to climate changes and environmental crises? How do people in the humanities engage with issues of sustainability and environmental justice in everyday life? This course introduces major concerns in the field of environmental humanities through the lens of China, the “World’s Factory” and the most populated country with the second largest economy, whose environmental challenges have great implications for the rest of the world. This course will first survey topics of scientific and technological intervention of our natural world in the Anthropocene era. It then looks at case studies of specific topics such as agricultural sustainability, waste management, water crisis, species extinction, and environmental justice. Each topic will contain one week discussion of the topic’s global manifestations and related debates in China, and one week’s introduction on humanities response to the issues. Students will be guided to develop critical understanding of our natural world and to develop innovative ideas and humanistic responses.", "outcome": "By the end of the semester, students should: be familiar with key concepts and approaches in environmental humanities understand the major United Nation Sustainable Development Goals.  acquire critical understanding of the selected topics of ecological crises  acquire an understanding of how experts in the arts and humanities use innovative methods to represent and analyze these related issues experiment with innovative methods using humanistic tools to comment on the urgent ecological challenges  本科目旨在让學生在學期末能夠 了解環境人文學的主要概念和方法 理解聯合國可持續發展的重要目標 對課程中探討的幾大生態危機議題有批判性的認識 了解人文藝術領域的專家如何使用創新方式再現、分析這些議題  嘗試使用人文學科的創新方式評議當下嚴峻的生態危機", "syllabus": "1. Introduction: What is Environmental Humanities?2. What is the Anthropocene and what can we in the humanities do about it?3-4. How do we sustain agricultural production? Debates on Genetically Modified Organism (GMO) 5-6. How do we manage the ever-growing amount of waste? Debates on plastic waste  7-8. How do we ensure water and other energy supplies for human activities without jeopardizing non-human beings and the environment? Debates on Three Gorges Dam 9-10. How serious is mass extinction? What are its consequences? Debates on wildlife consumption and preservation11-12. What is Environmental Justice? How to talk about it in the Humanities? Humanistic understanding of living with pollution in rural China13. Group Project Presentation 1. 導論：什麼是環境人文學科？2. 什麼是人類紀？我們人文學科該如何應對？3-4. 農業的可持續性發展：有關轉基因的爭論5-6. 與日俱增的垃圾問題：有關塑料垃圾管理的爭論7-8. 在保證人類活動所需的水和其他能源的供應時如何不危及其他生物和環境？有關三峽水壩的爭論9-10. 物種滅絕有多嚴重？有哪些後果？關於野生動物消費與保護的爭論11-12. 什麼是環境正義？如何在人文學科內討論環境正義問題? 從人文角度理解中國村民如何與污染共處13. 小組課題演示", "required_readings": " Robert S. Emmett and David Nye. 2017. The Environmental Humanities. A Critical Introduction. MIT Press.  Nixon, Rob. 2013. Slow Violence and the Environmentalism of the Poor. Harvard University Press.  Tsing, Anna. 2017. Arts of Living on a Damaged Planet: Ghosts and Monsters of the Anthropocene. University of Minnesota Press.  Schneider, Mindi. 2017. “Wasting the Rural: Meat, Manure, and the Politics of Agro-Industrialization in Contemporary China”. GeoForum. Vol.78, p.89-97 Heggelund, Gørild Merethe. 2004. Selected sections. In Environment and resettlement politics in China: the Three Gorges Project. Aldershot, Hants, England; Burlington, VT: Ashgate. Lora-Wainwright, Anna, Yiyun Zhang, Yunmei Wu, and Benjamin Van Rooij. 2012. \"Learning to Live with Pollution: The Making of Environmental Subjects in a Chinese Industrialized Village.\"  The China Journal (68):106-124.  Halskov Hansen, Mette, and Zhaohui Liu. 2017. \"Air Pollution and Grassroots Echoes of “Ecological Civilization” in Rural China.\" The China Quarterly:1-20.  Steinhardt, H. Christoph, and Fengshi Wu. 2016. \"In the Name of the Public: Environmental Protest and the Changing Landscape of Popular Contention in China.\"  The China Journal 75:61-82. ", "recommended_readings": "To be provided in class", "terms": {"2021-22 Term 2": {"--LEC (8544)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Staff"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Attendance": "10", "Homework or assignment": "30", "Project": "50", "Participation": "10"}}, {"code": "1005", "title": "Introduction to Music and Philosophy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkDiscussionLecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "This course introduces music and philosophy as intersecting practices through which human beings give meaning to the world around them. By exploring philosophy through music and music through philosophy from cross-cultural perspectives, the course exposes students to a variety of ways that knowledge, existence, religion, ethics, politics, culture, and sound converge.Rather than a comprehensive introduction to the fields of philosophy and music, this course uses a topical approach to explore several themes in these fields through discussion of selected musical examples and readings presented within an interdisciplinary framework. No background in music or philosophy is assumed or required.", "outcome": "Students will: Become familiar with a broad range of musical and philosophical traditions from diverse geographical locations and historical eras Acquire global perspectives on the arts and humanities, and learn to situate their own perspectives and experiences within a global context Develop fundamental critical thinking and research skills—how to read, listen, think, and write critically about music and philosophy Cultivate an appreciation of the role of music and philosophy in the development of various forms of human community Appreciate the interdisciplinary nature of musicology, philosophy, and humanities in general", "syllabus": "Unit 1: Classical Traditions of Greece and ChinaUnit 2: Religion, Music, and Philosophy Unit 3: Music and Contemporary Thought ", "required_readings": "Students will read selected excerpts from the following works:Plato. Five Dialogues. Translated by G. M. A. Grube, Hackett Publishing Co., 2002.Plato. The Republic of Plato. Edited by James Adam, Cambridge University Press, 1963.Cook, Scott. “‘Yue Ji’ 樂記 -- Record of Music: Introduction, Translation, Notes, and Commentary.” Asian Music, vol. 26, no. 2, Apr. 1995, pp. 1–96. Feld, Steven. Sound and Sentiment: Birds, Weeping, Poetics, and Song in Kaluli Expression. University of Pennsylvania Press, 1990.Cassirer, Ernst. The Philosophy of Symbolic Forms. Routledge, 2019.Levi-Strauss, Claude. “The Structural Study of Myth.” The Journal of American Folklore, vol. 68, no. 270, Oct. 1955, pp. 428–444. Hildegard of Bingen. Hildegard of Bingen’s Book of Divine Works with Letters and Songs. Edited by Matthew Fox, Bear & Co., 1987.Aslan, Reza. No God but God: The Origins, Evolution, and Future of Islam. Random House, 2011.Rūmī, Jalāl al-Dīn. Rumi: In the Arms of the Beloved. Translated by Jonathan Star, Penguin Group, 2008.Kant, Immanuel. Critique of the Power of Judgment. Edited by Paul Guyer et al., Cambridge University Press, 2009.Burke, Edmund. Philosophical Inquiry into the Origin of Our Ideas of the Sublime and Beautiful. Simon & Brown, 2018.Zhao, Tingyang. “A Political World Philosophy in Terms of All-Under-Heaven (Tianxia).” Diogenes, vol. 56, no. 1, Feb. 2009, pp. 5–18. Lyotard, Jean-François. The Postmodern Condition: A Report on Knowledge. University of Minnesota Press, 1984.In addition to these texts, in-depth listening and discussion of musical examples will be a core element of the class, and students will be required to listen to assigned musical examples outside of class.", "recommended_readings": "", "terms": {"2021-22 Term 2": {"--LEC (8590)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Sino Building UG06"], "instructors": ["Staff"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Attendance": "10", "Examination": "40", "Others": "50"}}, {"code": "6000", "title": "Reconnections: Studying China across humanistic disciplines", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Faculty Office of Arts (PG)", "requirements": "", "description": "The state of humanities in academia the world over is in crisis. Part of the crisis is caused by global trends toward financial and technological capitalism, but the other part of the problem has to be sought in the humanistic disciplines themselves. Over-specialization in research, fragmentation among and within disciplines, the pressure of utilitarian goals (such as grant-getting for faculty promotion and practical job-orientation for students) are but some of the manifestations obvious to all. How to remedy the situation? Short of an institutional overhaul, we might begin from our own academic base, humanities departments under the Faculty of Arts.From an academic point of view, over-specialization in the humanities departments results in scholars working in narrow and isolated fields without interaction with colleagues in other departments and fields. The study of China also suffers from such an academic trend, which results in fragmentary studies of narrowly defined topics that fail to connect with each other and with the larger background. A further problem, particularly evident in some humanities fields, is the over-reliance on Western theory, which is applied to Chinese data without reflection or mediation. Certain theoretical excesses, as exemplified in the work of Michel Foucault and other poststructuralist theorists, have led to a general distrust of the human subject itself. Indeed, even the word “humanities” has lost its meaning. This seminar is designed to explore new ways of making “connections” or “reconnections” across various disciplines and theoretical domains, it is broadly-based by design and all-inclusive in content. It is also intended to serve as a general forum for faculty-student discussion so as to provide a stimulus for humanistic scholarship and future research.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]