[{"code": "6001", "title": "Research Methodology in Behavioural Studies I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Business Administration", "requirements": "For students in MPhil-PhD Management; or MPhil-PhD Marketing", "description": "This course is divided into two main parts. The first part is focused on the application of the philosophy of science to behavioral research in business. Basic concepts such as explanation, scientific laws, and theory are introduced and discussed. The second part provides an introduction to the various stages of scientific research which include research design, measurement scale and development, sampling design, data collection and statistical analysis. Even though mathematical proofs and statistical derivations will be reduced to a minimum, having the knowledge of basic statistics and matrix manipulations will be helpful.", "outcome": "After finishing this course, it is expected that students should: - Be able to understand and comment on the appropriateness of various methodologies used in survey research - Be able to select an appropriate research design independently for their own research - Be able to learn new methodologies in the future independently based on what they have learned in this course", "syllabus": "This is a research-oriented graduate level course on research methodology.  There are four major objectives of this course:(1) It discusses the nature of scientific quantitative survey research methods;(2) It introduces to graduate students common quantitative statistical techniques used in management survey research;(3) It familiarizes students with key methodological concerns when conducting management research using surveys;  (4) It provides students with hand-on knowledge on statistical packages and how they are used in survey-based management research.", "required_readings": " Kerlinger, F.N. & Lee, H.B. (2000) Foundations of behavioral research. Fourth Edition, Belmont CA:Cengage Learning. Hair, J.F., Anderson, R.E., Tatham, R.L., & Black, W.C. (1998). Multivariate data analysis. Fifth Edition, New Jersey: Prentice Hall.  Johnson, R.A., & Wichern, D.W. (1982).  Applied Multivariate Statistical Analysis.  NJ:Prentice Hall Inc. Neter, J., Kutner, M.H., Nachtsheim, C.J. & Wasserman, W. (1996). Applied linear statistical models. Chicago:Irwin. Bollen, K.A. (1989). Structural Equations with Latent Variables.  NY:John Wiley & Sons. Bryk, A.S. & Raudenbush, S.W. (1992). Hierarchical linear models – Applications and data analysis methods. Newbury Park:Sage Publications. Hedges, L.V. & Olkin, I (1985). Statistical methods for meta-analysis.  San Diego:Harcourt Brace Jovanovich, Publishers. Nunnally, J.C., & Bernstein, I.H. (1994).  Psychometric theory.  NY:McGraw-Hill Series in Psychology. Pedhazur, E.J. (1983). Multiple regression in behavioral research – Explanation and prediction.  NY:Holt, Rinehart & Winston. Cohen, J. & Cohen, P. (1983). Applied multiple regression/correlation analysis for the behavioral sciences.  NJ:Erlbaum.Loehlin, J.C. (1992). Latent variable models: An introduction to factor, path, and structural analysis.  NJ:Lawrence Erlbaum Associates, Publishers. SAGE University series: Quantitative Applications in the Social Sciences Green, S.B., Salkind, N.J., & Akey, T.M. (2000).  Using SPSS for Windows – Analyzing and understanding data.  NJ:Prentice Hall. ", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (2337)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor LAW Shing Keung"]}}}, "assessments": {"Examination": "40", "Homework or assignment": "40", "Participation": "20"}}, {"code": "6002", "title": "Research Methodology in Behavioural Studies II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Business Administration", "requirements": "For students in MPhil-PhD Management; or MPhil-PhD Marketing; Prerequisite: BASA6001", "description": "This course is the continuation of BSA6001. The course covers selected advanced topics associated with the behavioral research process. In particular, students will learn how to apply various types of research design and statistical methods, and how to interpret the results. Sample topics include among others experimental design, measurement theory, cross-cultural research, significance tests and statistical power, interaction and moderating effects, multi-level analysis, confirmatory factor analysis, and structural equation modeling. Even though mathematical proofs and statistical derivations will be reduced to a minimum, having the knowledge of basic statistics and matrix manipulations will be helpful. Prerequisite: BASA6001", "outcome": "Course Outcomes\r 1. Knowledge of major experimental approaches for studying human behaviors.\r 2. Techniques in analyzing data collected from experiments.\r 3. Hands-on experience in experimental design, administration, data analysis, and report writing.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (1145)": {"startTimes": ["9:30", "9:30"], "endTimes": ["12:15", "12:15"], "days": [2, 4], "locations": ["Cheng Yu Tung Bldg 613", "Cheng Yu Tung Bldg 613"], "instructors": ["Professor KWONG Yuk Yee Jessica", "Professor KWONG Yuk Yee Jessica"]}}}}]