[{"code": "5100", "title": "Perspectives in Biochemical Sciences", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MSc Biochem & Biomedical Sci; For students in MSc Biomedical Engineering", "description": "This course presents the latest developments and advancements in biochemical sciences as well as the current topics in the society. It aims to alert students the trends and recent breakthrough in biochemistry in medical research. Issues such as stem cell research and infectious diseases shall be examined in this course.", "outcome": "Upon successful completion of this course, students should be able to:  1) Demonstrate a broad understanding of biochemical and molecular approaches in life sciences with impacts to our society.  2) Demonstrate a deep understanding of at least one area of contemporary biochemical research.  3) Critically evaluate contemporary research literature and research programs.   4) Support a high-level biochemical research program.  5) Master communication skills in presenting the research findings through effective oral and written presentations.", "syllabus": " Introduction to Scientific Information Searching and How to read a paper Synthetic Life Recent Advances in the Pathogenesis and Treatment of Influenza Virus Recent Advances in our Understanding of HIV Infection and AIDS Biochemistry and Infections Gut Microbiota Uncovering the Molecular Basis of Human Cancer Apoptosis and Anti-cancer Drug Development Cancer and Photodynamic Therapy Green Fluorescent Proteins and Their Use in Biomedical Sciences Mitochondrial dysfunction in neurodegenerative diseases Hormones of the Hypothalamus, Pituitary and Pineal ", "required_readings": "Readings recommended by teachers.", "recommended_readings": "Readings recommended by teachers.", "terms": {"2020-21 Term 1": {"--LEC (3514)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. LO Fai Hang, \n\rProfessor CHAN King Ming, \n\rProfessor CHOW Hei Man, \n\rProfessor FONG Wing Ping, \n\rProfessor KONG Siu Kai, \n\rProfessor KWAN Hoi Shan, \n\rProfessor LEUNG Kwok Nam, \n\rProfessor NG Tzi Bun, \n\rProfessor SHAW Pang Chui"]}}}, "assessments": {"Essays": "20", "Examination": "70", "Homework or assignment": "10"}}, {"code": "5120", "title": "Biochemical Genetics and Forensic Sciences", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MSc Biochem & Biomedical Sci; For students in MSc Biomedical Engineering", "description": "The first part of the lecture covered in this course includes principles of genetics at the molecular level, physical and biochemical nature of hereditary materials, molecular mechanisms of DNA replication, mutation, and repair, molecular basis of genetic disorders and their diagnosis. The second part of the lecture covers collection and processing of biological samples from crime scenes, DNA analysis using RFLP and PCR-STR typing methods, interpretation of DNA typing results, and court presentation of such biological evidence. Mitochondrial DNA typing and Y chromosome DNA typing will also be discussed.", "outcome": "Upon successful completion of this course, students should be able to: 1) Exhibit a knowledge base in genetics at the molecular level. 2) Demonstrate the knowledge of common and advanced laboratory techniques in molecular biology. 3) Understand and apply the principles and techniques of molecular biology. 4) Master communication skills in presenting the research findings through effective oral and written presentations. 5) Demonstrate a commitment to professional integrity and ethical behavior consistent with the missions of the university and accepted standards of professional conduct.", "syllabus": " Physical and biochemical nature of hereditary materials Principles of genetics Replication, mutation and repair of DNA Genetic Disorders Inherited metabolic diseases and their diagnosis Therapeutics for genetic disorders Forensic Science & Biological Evidence Identity Testing, DNA Extraction & Quantitation Forensic genetics and RFLP Typing PCR-based STR Profiling & Others Forensic Issues & Quality Requirements for DNA Testing Y Chromosome Testing, Mitochondrial DNA Sequencing & Result Interpretation Reporting, Case Studies & Court Testimony", "required_readings": "Readings recommended by teachers.", "recommended_readings": "Readings recommended by teachers.", "terms": {"2020-21 Term 1": {"--LEC (1980)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Mr. WONG Dart Man, \n\rProfessor NGO Chi Ki Jacky"]}}}, "assessments": {"Essays": "20", "Examination": "70", "Test or quiz": "10"}}, {"code": "5200", "title": "Technology in Molecular Biology", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MSc Biochem & Biomedical Sci; For students in MSc Biomedical Engineering", "description": "This course is designed to acquaint students with the field of biochemical technology. The course covers the basic recombinant DNA technology, contemporary applications of biochemical technology in DNA sequencing and genome mapping, RNA biology and technology, drug discovery and development. Contemporary application of computing skills in data mining for biotechnological studies will also be discussed. Specifically, it includes the use of computational softwares and databases for DNA and protein sequence analysis. In addition, the recent advances in forensic DNA analysis, transgenic technology, and authentication of Chinese medicinal materials will also be discussed. ", "outcome": "Upon successful completion of this course, students should be able to: 1) Demonstrate knowledge and comprehension of core concepts, which includes but is not limited to recombinant DNA technology, mammalian cell culture, protein expression and purification, and antibody engineering. 2) Demonstrate knowledge of ethical principles regarding the use of biotechnology. 3) Demonstrate the ability to understand, analyze and evaluate original research literature and to communicate this understanding using appropriate technology.", "syllabus": " Recombinant DNA Technology RNA Biology and Technology CRISPR Functions and Applications DNA Sequencing Cancer genomics and metagenomics Pharmacogenomics and precision medicine Information retrieval and bioinformatics tools Note Database searching and systems biology Note Drug Discovery Current Approaches to Authenticate Chinese Medicinal Material ", "required_readings": "Readings recommended by teachers.", "recommended_readings": "Readings recommended by teachers.", "terms": {"2020-21 Term 2": {"--LEC (3627)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [3], "locations": ["Li Koon Chun Hall LT1"], "instructors": ["Dr. NG Ka Leung, \n\rProfessor CHAN Ting Fung Philos, \n\rProfessor NGO Chi Ki Jacky, \n\rProfessor SHAW Pang Chui, \n\rProfessor TSUI Kwok Wing, \n\rProfessor WAN Chi Cheong David"]}}}, "assessments": {"Essays": "20", "Examination": "80"}}, {"code": "5220", "title": "Biochemical and Biomedical Technology", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MSc Biochem & Biomedical Sci; For students in MSc Biomedical Engineering", "description": "This course is an extension of the other course “BBMS5200 Technology in Molecular Biology”. It begins with an introduction to the basic principles of protein analyses. Modern approaches to identify and characterize cellular proteins will be introduced. Based on these technologies, bioengineering of proteins (e.g. enzymes and antibodies) which are of medical and industrial importance will be illustrated. The application of x-ray crystallography in protein structural studies will also be introduced. The course also covers the contemporary applications of biochemical technology in mammalian cell culture technology, stem cell biology and CAR-T cells biotechnology.", "outcome": "Upon successful completion of this course, students should be able to: 1) Demonstrate knowledge and comprehension of core concepts, which includes but is not limited to structure of the human genome, pharmacogenomics, drug discovery and diagnostics, and softwares and databases used in Bioinformatics. 2) Demonstrate knowledge of ethical principles regarding the use of biotechnology. 3) Demonstrate the ability to understand, analyze and evaluate original research literature and to communicate this understanding using appropriate technology.", "syllabus": " Mammalian Cell Culture Technology Stem Cell Biology and Application of Stem Cells Protein Structure and Functions Antibody Engineering Chimeric Antigen Receptor (CAR) – T Cells Technology Thermostable Proteins and Enzyme Technology Principles in Protein Crystallography ", "required_readings": "Readings recommended by teachers.", "recommended_readings": "Readings recommended by teachers.", "terms": {"2020-21 Term 2": {"--LEC (2307)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [2], "locations": ["Cheng Yu Tung Building LT1A"], "instructors": ["Dr. LEE Ming Ming Marianne, \n\rProfessor AU Wing Ngor Shannon, \n\rProfessor FONG Wing Ping, \n\rProfessor KONG Siu Kai, \n\rProfessor TSANG Suk Ying"]}}}, "assessments": {"Essays": "20", "Examination": "80"}}, {"code": "6100", "title": "Biochemistry and Public Health", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MSc Biochem & Biomedical Sci; For students in MSc Biomedical Engineering", "description": "This course is concerned with the biochemical impacts in environment and food as they relate to public health. Attention is given to different approaches to pest control, water management, sewage management and treatment, and pollution from hazardous biochemicals and chemicals. Food additives, biochemical, chemical and microbial contaminants, and naturally occurring toxins associated with foods will also be discussed.", "outcome": "Upon successful completion of this course, students should be able to: 1) Identify current biochemical impacts in our environment and food.  2) Review the literature and give reports on biochemical approaches to different area which includes but is not limited to infectious disease, pollution from hazardous biochemicals, and food additives. 3) Analyze case studies of public health issues (e.g., toxins associated with foods), biochemical impacts in pest control, water management, sewage management and treatment, etc.). 4) Demonstrate the ability to understand, analyze and evaluate original research literature and to communicate this understanding using appropriate technology.", "syllabus": " Allergic Diseases in Hong Kong & Their Treatments Current Issues of Infectious Diseases Introduction to Biochemistry of Toxic Natural Products and Chemicals Toxicant Processing in vivo Diagnosis, Treatment and Prevention of Toxicity Environmental Health Water Management Sewage Management Water-associated Diseases and Strategies for Prevention Food Additives & Food Labeling Nutrition & Health I - Nutrient Deficiency Nutrition & Health II - Chronic Disease Development Air Pollution & Public Health Metal Intoxications Pesticides & Trace Organics ", "required_readings": "Readings recommended by teachers.", "recommended_readings": "Readings recommended by teachers.", "terms": {"2020-21 Term 2": {"--LEC (3628)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [5], "locations": ["Yasumoto Int'l Acad Park LT2"], "instructors": ["Dr. NG Ka Leung, \n\rProfessor CHAN King Ming, \n\rProfessor KWAN Kin Ming, \n\rProfessor NG Tzi Bun, \n\rProfessor WONG Chun Kwok"]}}}, "assessments": {"Essays": "20", "Examination": "80"}}, {"code": "6120", "title": "Clinical Biochemistry and Diseases", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MSc Biochem & Biomedical Sci; For students in MSc Biomedical Engineering", "description": "This course provides students with an introduction to the normal pathways of carbohydrate, lipid, nucleotide and amino acid metabolism. The course will outline the biochemical mechanisms for controlling these pathways under different physiological and nutritional conditions and discuss the importance of diseases arising from defects in these pathways. Particular emphasis will be placed on the biochemical mechanisms concerning the etiology, symptoms and treatment of diseases such as diabetes mellitus, atherosclerosis and other lipid disorders, inborn errors of carbohydrates and amino acid metabolism. Also, how biochemical test results are utilized for the diagnosis and monitoring of diseases are described.", "outcome": "Upon successful completion of this course, students should be able to: 1) Explain the biochemical mechanisms and pathophysiological processes of common biochemical diseases and disorders. 2) Explain the rationale and theoretical basis for methods used in the diagnosis and monitoring of common biochemical diseases. 3) Analyze biochemical results and suggest the likely pathological etiology, and identify testing where appropriate. 4) Demonstrate the ability to understand, analyze and evaluate original research literature and to communicate this understanding using appropriate technology.", "syllabus": " Carbohydrate metabolism with clinical correlations Lipid metabolism with clinical correlations Amino acid metabolism with clinical correlations Nucleic Acids Metabolism and Gout Formation Cardiovascular Diseases Neurodiseases Clinical Chemistry ", "required_readings": "Readings recommended by teachers.", "recommended_readings": "Readings recommended by teachers.", "terms": {"2020-21 Term 1": {"--LEC (1981)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [3], "locations": ["Yasumoto Int'l Acad Park LT3"], "instructors": ["Dr. NGAI Hung Kui, \n\rProfessor KWAN Yiu Wa, \n\rProfessor LAU Kwok Fai, \n\rProfessor WONG Chun Kwok"]}}}, "assessments": {"Essays": "20", "Examination": "80"}}, {"code": "6200", "title": "Methods in Biochemistry", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MSc Biochemical and Biomedical Sciences or MSc Biomedical Engineering\nNot for students who have taken LSCI5462", "description": "This course will allow students to gain theoretical and practical, hands-on knowledge of various advanced research methodologies and their applications in biochemical research and pre-clinical services. Methods include: • Ion exchange chromatography • Spectrophotometry • SDS-Polyacrylamide gel electrophoresis and Western blot analysis • Enzymatic assay • DNA cloning technologies and DNA electrophoresis • PCR and site-directed mutagenesis • Bacterial transformation and culture • Recombinant protein expression and purification • Human cell culture and cytotoxicity assay • Fluorescence technology: and flow cytometry, confocal microscopy, fluorescence spectrum scanning and measurement", "outcome": "Upon successful completion of this course, students should be able to: 1) Describe the concepts of modern analytical and instrumental techniques relevant to measurements in biochemical research and pre-clinical services.  2) Master a number of biochemical techniques such as polyacrylamide gel electrophoresis and Western blot analysis, enzymatic assay, DNA electrophoresis and DNA fingerprinting , PCR and polymorphism analysis, human cell culture and cytotoxicity assay, ELISA and flow cytometry, Rasmol and computer tools for analysis, Bacterial transformation and test for food contamination, statistical analysis of toxic chemicals in environment and fermentation technology. 3) Justify the selection of different bio-analytical methods to characterize the composition of a complex sample. 4) Critically evaluate the merits, limitations and future trends of various biochemical analytical techniques. 5) Work in a collaborative manner with others on a team, contributing to the management, planning and implementation of a task. 6) Demonstrate a commitment to professional integrity and ethical behavior consistent with the missions of the university and accepted standards of professional conduct.", "syllabus": " Chromatography Electrophoresis Proteomics DNA Cloning Techniques Recombinant Proteins Cell culture, cytotoxicity assays Fluorescence and Microscopy  Flow Cytometry ", "required_readings": "Readings recommended by teachers.", "recommended_readings": "Readings recommended by teachers.", "terms": {"2020-21 Term 1": {"-L01-LAB (2283)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [6], "locations": ["Online Teaching"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor CHAN King Ming, \n\rProfessor FONG Wing Ping, \n\rProfessor KONG Siu Kai"]}}}, "assessments": {"Examination": "45", "Lab reports": "55"}}, {"code": "6220", "title": "MSc Project", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MSc Biochem & Biomedical Sci", "description": "Students will be required to do a project or a literature survey and/or a mini research on a current topic in biochemistry or biomedical sciences under the supervision of a teaching staff of Department of Biochemistry.", "outcome": "Upon successful completion of this course, students should: 1) Be knowledgeable in the field and pursue life-long learning in practice. 2) Be able to well-planned experiments to test hypothesis using the scientific method approach. 3) Be able to carefully execute experiments with suitable skills. 4) Be able to analyze data with good interpretation using statistical skills. 5) Be able to evaluate its outcome and report the results in a professional manner with a precise and accurate summary. 6) Be able to synthesis of knowledge and produce new applications. 7) Be able to communicate effectively and professionally both in writing and by means of presentations to both specialist and a general audience.  8) Demonstrate a commitment to professional integrity and ethical behavior consistent with the missions of the university and accepted standards of professional conduct.", "syllabus": "Perform a mini research project or a literature survey on a current biochemistry or biomedical science topic under supervision.", "required_readings": "Readings recommended by teachers.", "recommended_readings": "Readings recommended by teachers.", "terms": {"2020-21 Term 1": {"-J01-PRJ (1263)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor CHAN Ting Fung Philos, \n\rProfessor LAU Kwok Fai, \n\rProfessor NG Tzi Bun, \n\rProfessor ZHANG Shoudong"]}}, "2020-21 Term 2": {"-J01-PRJ (2212)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Dr. LO Fai Hang, \n\rDr. NGAI Hung Kui, \n\rProfessor AU Wing Ngor Shannon, \n\rProfessor CHAN Michael Kenneth, \n\rProfessor CHAN Ting Fung Philos, \n\rProfessor CHOW Hei Man, \n\rProfessor KWAN Kin Ming, \n\rProfessor LAU Kwok Fai, \n\rProfessor NGO Chi Ki Jacky, \n\rProfessor SHAW Pang Chui, \n\rProfessor TSANG Suk Ying, \n\rProfessor WONG Wing Tak Jack"]}}}, "assessments": {"Presentation": "30", "Report": "70"}}, {"code": "6300", "title": "Management and Accreditation of Biochemical Laboratory", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MSc Biochemical and Biomedical Sciences or MSc Biomedical Engineering\nNot for students who have taken LSCI5463", "description": "The aims of this course are to introduce basic concepts and adequate skills of laboratory management, safety and quality assurance in biochemical laboratories. Special topics such as biochemical testing and manufacturing process, good laboratory practice, laboratory accreditation, genetic testing and experimental protocols and method validation ect, will be discussed.", "outcome": "Upon successful completion of this course, students should: 1) Be knowledgeable in the areas of intellectual property, license, patent and accreditation system. 2) Be able to understand the basic concepts and adequate skills of laboratory management. 3) Be able to understand the basic concepts and adequate skills of laboratory management. 4) Be able to execute safety and quality assurance protocols in biochemical laboratories according to standards.  5) Be able to perform biochemical testing and manufacturing process, good laboratory and manufacturing practice, laboratory accreditation, genetic testing and method validation etc.", "syllabus": " Accreditation Program of AAALAC International for Care and Use of Laboratory Animals Clinical Laboratory Sciences and Practice Quality Assurance in Clinical Laboratory Good Manufacturing Practice (GMP) Intellectual Property Rights Relevant to Biotechnology Enforcement of IPRs, Agreement Basics and Licensing Preparation for Establishing a Biotech Start-up Management of R&D: from People to Lab Management of R&D: from Lab to Portfolio Establishment and Management of a Biotech Start-up ", "required_readings": "Readings recommended by teachers.", "recommended_readings": "Readings recommended by teachers.", "terms": {"2020-21 Term 2": {"--LEC (1990)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [6], "locations": ["Lee Shau Kee Building LT5"], "instructors": ["Dr WONG Yuen Ting, \n\rDr. YEUNG Hiu Yan, \n\rProfessor CHEUNG Kam Yin, \n\rProfessor CHO Chi Shing, \n\rProfessor LEE Chi Ming, \n\rProfessor YEUNG Shu Ying"]}}}, "assessments": {"Essays": "20", "Examination": "60", "Presentation": "20"}}, {"code": "6500", "title": "Research Methods and Literature Review in Biochemical and Biomedical Sciences", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MSc Biochemical and Biomedical Sciences", "description": "This course aims at providing students in the MSc programme with the essential concepts of basic research methods, project management, scientific writing and presentation skills, statistical analysis of data and academic honesty in the field of biochemical and biomedical sciences. Students must submit a literature review or a research proposal for examination by the end of the course.", "outcome": "Upon successful completion of this course, students should be able to: • Have an in-depth knowledge in scientific method and research management;  • Develop competencies in finding, reading and critically evaluating relevant scientific literature;  • Acquire skills in information searching, scientific writing and oral communication;  • Master generic skills such as critical thinking, team building and lifelong learning techniques;  • Understand the basic statistical concepts and perform statistical analysis of biological data;  • Learn the importance of academic honesty.", "syllabus": " Start a Scientific Project Using ‘Scientific Method’ How to Write a Scientific Document and an M.Sc. Thesis Scientific Conduct and Ethical Issues Basic Statistics for Handling Experimental Data ", "required_readings": "Readings recommended by teachers.", "recommended_readings": "Readings recommended by teachers.", "terms": {"2020-21 Term 1": {"-J01-PRJ (1365)": {"startTimes": ["19:00", "TBA"], "endTimes": ["21:00", "TBA"], "days": [4, "TBA"], "locations": ["Online Teaching", "TBA"], "instructors": ["Dr. LO Fai Hang, \n\rDr. NGAI Hung Kui, \n\rProfessor AU Wing Ngor Shannon, \n\rProfessor CHAN Michael Kenneth, \n\rProfessor CHAN Ting Fung Philos, \n\rProfessor CHOW Hei Man, \n\rProfessor KWAN Kin Ming, \n\rProfessor LAU Kwok Fai, \n\rProfessor NGO Chi Ki Jacky, \n\rProfessor SHAW Pang Chui, \n\rProfessor TSANG Suk Ying, \n\rProfessor WONG Wing Tak Jack", "Dr. LO Fai Hang, \n\rDr. NGAI Hung Kui, \n\rProfessor AU Wing Ngor Shannon, \n\rProfessor CHAN Michael Kenneth, \n\rProfessor CHAN Ting Fung Philos, \n\rProfessor CHOW Hei Man, \n\rProfessor KWAN Kin Ming, \n\rProfessor LAU Kwok Fai, \n\rProfessor NGO Chi Ki Jacky, \n\rProfessor SHAW Pang Chui, \n\rProfessor TSANG Suk Ying, \n\rProfessor WONG Wing Tak Jack"]}}}, "assessments": {"Presentation": "30", "Report": "70"}}, {"code": "6520", "title": "MSc Research Project", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MSc Biochemical and Biomedical Sciences\nPrerequisite: BBMS6500", "description": "Students will be required to do a research project on a current topic in biochemistry or biomedical sciences under the supervision of a teaching staff of School of Life Sciences. Students must submit an MSc thesis for examination by the end of the course.", "outcome": "Upon successful completion of this course, students should be able to: • Have in-depth knowledge and skills in scientific method and research process;  • Develop competencies in finding, reading and critically evaluating relevant scientific literature;  • Execute experiments and analyze data carefully;  • Perform statistical analysis of data with good interpretation and discussion;  • Master generic skills such as critical thinking, team building and lifelong learning techniques;  • Understand the importance of academic honesty.", "syllabus": " Introduction for Research-type M.Sc. Project Rules and Safety in Research Labs Conduct a research project on a current biochemistry or biomedical science topic under supervision", "required_readings": "Readings recommended by teachers.", "recommended_readings": "Readings recommended by teachers.", "terms": {"2020-21 Term 2": {"-J01-PRJ (1375)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor CHAN Michael Kenneth, \n\rProfessor CHOW Hei Man, \n\rProfessor LAU Kwok Fai, \n\rProfessor NGO Chi Ki Jacky, \n\rProfessor SHAW Pang Chui, \n\rProfessor WONG Wing Tak Jack"]}}}, "assessments": {"Presentation": "30", "Report": "70"}}]