[{"code": "2000", "title": "Frontiers in Biochemistry", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "", "description": "This course presents the latest developments and advancements in biochemistry and molecular biology. It aims to alert students the trends and recent breakthroughs in biochemical and biomedical research. Contents will vary from year to year.\r", "outcome": "Students are expected to understand recent developments in research fields related to Biochemistry and Molecular Biology. Basic and novel concepts of various topics and their future developments will be introduced and elaborated by teachers. Students are expected to read the recommended readings provided for each lecture topic, and to search for additional information in the library and online to study on their own. Towards the end of the course, students are required to present an idea of their interest in a poster format.\r  繁體 透過本課程，學生將了解有關生物化學與分子生物學研究領域的最新發展。各種主題的基本概念和它們的未來發展將得到介紹和闡述。在每個演講的主題學生都可從閱讀推薦讀物、以及在圖書館或網上尋找更多的信息。在接近課程的尾聲，學生必須利用海報格式去展述一個自選題目。  简体 透过本课程，学生将了解有关生物化学与分子生物学研究领域的最新发展。各种主题的基本概念和它们的未来发展将得到介绍和阐述。在每个演讲的主题学生都可从阅读推荐读物、以及在图书馆或网上寻找更多的信息。在接近课程的尾声，学生必须利用海报格式去展述一个自选题目。", "syllabus": "Lecture topics are determined by individual teaching staffs of the course. They vary every year to reflect the latest development in the field of biochemical research. The lecture topics can be briefly classified into three major areas: New Research Areas (e.g. synthetic biology), Cellular Biochemistry (e.g. stem cells), and Biochemistry of Diseases (e.g. cancer, Alzheimer).\r  繁體 課程講座的題目是由個別教學人員所決定 。每年有所不同，以反映生化研究領域的最新發展 。講座主題可以簡要地分為三個主要領域：新的研究領域（如合成生物學），細胞生物化學（例如幹細胞），以及生物化學和疾病（如癌症，老年癡呆症等）。  简体 课程讲座的题目是由个别教学人员所决定 。每年有所不同，以反映生化研究领域的最新发展 。讲座主题可以简要地分为三个主要领域：新的研究领域（如合成生物学），细胞生物化学（例如干细胞），以及生物化学和疾病（如癌症，老年痴呆症等）。", "required_readings": "Lecture handout for each of the topics will be uploaded to the accompanied Blackboard site a week before the lecture. Required readings for each topic will be provided by the teaching staff concerned. The reading materials are expected to change every year to reflect the latest development in the research field.", "recommended_readings": "Additional reading materials will be provided by individual teachers.\r Students are also encouraged to use the online PubMed search engine (http://pubmed.gov) to find related reference materials for self-study.", "terms": {"2020-21 Term 2": {"--LEC (7323)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Lee Shau Kee Building LT6"], "instructors": ["Dr. NGAI Hung Kui, \n\rProfessor AU Wing Ngor Shannon, \n\rProfessor FONG Wing Ping, \n\rProfessor HUI Jerome Ho Lam, \n\rProfessor KONG Siu Kai, \n\rProfessor NGO Chi Ki Jacky, \n\rProfessor SHAW Pang Chui, \n\rProfessor TSANG Suk Ying"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (5594)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [3], "locations": ["T.Y.Wong Hall LT"], "instructors": ["Dr. NGAI Hung Kui, \n\rProfessor AU Wing Ngor Shannon, \n\rProfessor FONG Wing Ping, \n\rProfessor HUI Jerome Ho Lam, \n\rProfessor LAU Wilson Chun Yu, \n\rProfessor NGO Chi Ki Jacky, \n\rProfessor SHAW Pang Chui, \n\rProfessor TSANG Suk Ying"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Presentation": "10", "Short answer test or exam": "90"}}, {"code": "2030", "title": "Fundamentals of Biochemistry", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "-", "description": "The course introduces the fundamental principles of biochemistry that are essential for all life science disciplines. It covers the importance of water, structure-function relationships of biomolecules (including amino acids, proteins, carbohydrates, lipids and nucleic acids), the biochemical logic of the metabolic pathways, and an overview of metabolism with emphasis on how biomolecules interconvert into each other.\r", "outcome": "1. To appreciate the importance of water in living organism.\r 2. To understand the structure-function relationships of different types of biomolecules.\r 3. To understand the chemical logic (thermodynamics, mechanism, and catalysis) behind biochemical reactions.\r 4. To have an overview of metabolic pathways, and appreciate how biomolecules are interconverting with each other.", "syllabus": "1. Water – the medium of life \r - Molecular structure of water\r - Weak interactions in aqueous system\r - Acid/base equilibrium and buffers \r  2. Biomolecules\r - Carbohydrates\r - Lipids\r - Nucleotide and nucleic acids\r - Proteins\r  3. Thermodynamics \r - Free energy as a measure of a reaction's tendency to proceed spontaneously\r - Concepts of 'high-energy' compounds and coupled reactions \r - Low of energy and cycling of carbon/nitrogen in the biosphere\r - Energy relationship between catabolic and anabolic pathway\r - Oxidation of carbon fuels as a major source of cellular energy\r - NAD(P)H/FADH2 as universal electron carriers\r - ATP is synthesized by proton gradients across membrane generated by transferring electrons to oxygen\r - The light reaction of photosynthesis generates both proton gradients and reducing equivalents\r - The dark reaction of photosynthesis uses the reducing power generated for biosynthesis of sugar from CO2 \r  4. Enzyme catalysis\r - Enzymes affect reaction rates but not equilibria\r - Enzymes increase reaction rates by lowering the activation free energy\r - Concepts of transition-state complementarity\r - Why biochemical reaction is stereospecific?\r - Basic enzyme kinetics\r - Enzymes are good target for drug design \r  5. Chemical logic of biochemical reactions \r - Electronegativity and polarity of covalent bond\r - Six different types of biochemical reactions \r - Reactions in the glycolytic pathway are used as examples to illustrate the recurring motifs in metabolic pathway \r - Vitamins as co-factors in enzyme catalysis\r  6. Overviews of metabolism\r - Convergent catabolism\r - Divergent anabolism\r - Cyclic pathway\r - Regulatory strategy", "required_readings": "Nelson & Cox, Lehninger Principles of Biochemistry, W.H. Freeman\r Berg, Tymoczko & Stryer, Biochemistry, W.H. Freeman", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (5312)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor LAU Kwok Fai"], "meetingDates": ["9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11", "4/12"]}}, "2021-22 Term 1": {"--LEC (6500)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Lee Shau Kee Building LT6"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor LAU Kwok Fai"], "meetingDates": ["10/9", "17/9", "24/9"]}}}, "assessments": {"Short answer test or exam": "50", "Selected response test or exam": "50"}}, {"code": "2070", "title": "Research Internship", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "", "description": "This course is designed to allow students to gain practical experience in scientific research in a laboratory or biotechnology firm during the summer period or term time. All research or internship projects, locally or overseas, must be approved by the School.\r", "outcome": "After completing the course, students should be able to:1.      experience to carry out an independent research under supervision by a faculty staff;2.      design simple experiments and follow protocols to carry out some biochemical analyses;3.      obtain data and carry out data analysis with simple statistics, and 4.      learn how to write a brief scientific report. Objectives for students development:1.      Learn how to integrate basic biochemistry techniques to perform some experiments or develop an assay.2.      Learn how to collect and read literature in a specific area of research.3.      Learn how to design simple experiments, carry out the experimental procedure independently, and work as a member of the team.4.      Learn how to compile or collect data with accuracy and precision.5.      Learn how to analyze the data obtained and write a short paper to summarize  the experiments or work done.6.      Better prepare students to learn time management skills and do independent research for their final year project (Supervised Research)", "syllabus": "There is no specific content for this course which is guided by a supervisor and the project is to be assigned by the supervisor. Summer Interns (including DREAM) may take this course but a local supervisor or supervisor from Biochemistry Program has to be assigned in addition to the internship supervisor for marking. Title of the project report must be different from other courses. Duration (study period):Students taking this course usually start their experiments in the summer or early at term start and complete the project with a report written for marking by the end of first term. Deadline of submission of report is at term end. Two markers (including the supervisor and an extra marker is needed for dual supervisors) will evaluate the report (assessment form attached). Job nature:Students may hold a project on testing and purification of a biomolecule, cloning of a gene, detection of a gene mutation, performing PCR assay or ELISA assay, purification of a recombinant protein, developing an assay from modified protocols, doing literature search of patents and help filing a patent application in a patent law firm, doing data mining (In Silico analyses) or sequence analyses, testing of a drug, etc. Report for evaluation:1.   The report should include a cover page with the title of the research, followed with a one page abstract (< 250 words), an introduction, materials and methods, results and discussion, acknowledgement, and references. 2.   Rationale of the study and background information should be covered in the introduction with some literature review and justification of why you are working on this project (importance of the project). Carefully explain the procedure of the experiments and technical details of how the assay is carried out in the section of materials and methods. After presenting the results and discuss the meaning of the results, explain briefly what could be done next or what could have been done better to obtain better results. 3.   Explain the limitations of the present study. At the end, a conclusion has to be made in the discussion part to end the report. 4.   Usually, 3-5 figures and tables should be enough for such a short report of around 30 pages with word count < 6,000. Students may consider follow the journal format of Biochemical and Biophysical Research Communications. Who should take this course:All Biochemistry majors are welcome to take this course which is an elective course (group C). For those who have participated the DREAM program, any research projects in local government departments or biotech company and those who joined a law firm for internship with literature (patent) research are also welcome to join this course as well.", "required_readings": "To be assigned by supervisor.", "recommended_readings": "WebThis website explain how to write a scientific report:http://geog.arizona.edu/~comrie/geog230/report.htm", "terms": {"2020-21 Term 1": {"-J01-PRJ (5149)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHAN Ting Fung Philos"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2021-22 Term 1": {"-J01-PRJ (7753)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN Ting Fung Philos"], "meetingDates": ["09/09/2021 - 02/12/2021"]}}, "2021-22 Term 2": {"-J01-PRJ (6783)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN Ting Fung Philos"], "meetingDates": ["14/01/2022 - 22/04/2022"]}}}}, {"code": "3030", "title": "Methods in Biochemistry", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "Pre-requisite: BCHE2030 or permission of instructor.", "description": "This course aims at introducing quantitative analyses of biochemical reactions and subcellular components to students. Methods for purification and studies of biomolecules will also be introduced. Techniques including chromatography, gel electrophoresis, centrifugation, fluorescent spectrophotometry and microscopy will be covered. The use of radioisotopes and non-radioactive labelling methods will also be included.\r", "outcome": "After completing the course, students should be able to understand both the basic principles and the practical aspects of different methods of biochemical analyses, including chromatography, electrophoresis, centrifugation, radioisotopes and fluorescence techniques. The knowledge gained will be useful in their final year project “Supervised Research in Biochemistry”.", "syllabus": "Fluorescence Technology: This block is intended to introduce to students an in-depth knowledge of the principles of fluorescence and its applications for biochemistry and cell biology research. Topics include principles of fluorescence, design and application of fluorescence probes, fluorescence measurements, special techniques and recent advances in fluorescence technology.\r  Chromatography: This session will introduce various chromatography techniques used in biochemistry, for example, partition chromatography, adsorption chromatography, ion exchange chromatography, gel filtration and affinity chromatography. Their use in the purification of proteins will be illustrated. \r  Electrophoresis: This session will introduce the basic theory of electrophoresis. Particular emphasis will be given to the two basic methods used in the study of proteins, namely sodium dodecyl sulfate-polyacrylamide gel electrophoresis and isoelectric focusing. The use of electrophoresis in the study of nucleic acid will be discussed. In addition, the application of the instrumental technique capillary electrophoresis will also be covered.\r  Centrifugation: This session will introduce the basic theory of centrifugation and the mathematical expression of sedimentation rate. We will also discuss different types of centrifuge and rotor commonly used in biochemical studies. The principles of differential centrifugation and density gradient centrifugation, and their applications in biochemical research will be covered.\r  X-ray Crystallography: X-ray crystallography is a common method for determination of the three-dimensional structure of proteins. Its basic principles and procedure will be introduced.\r  Radioisotopes: This session will introduce the nature of radioactivity and types of radioactive decay. Detection methods based on gas ionization, excitation of solid/solution and exposure of photographic emulsions will be discussed. Radiation and biohazard safety of handling radioisotopes will be covered. Applications of radioisotopes in studying metabolic pathways, protein-ligand interactions and DNA/RNA labeling will be discussed.", "required_readings": "Textbook:\r  Principles and Techniques of Practical Biochemistry 7th edition, 2010 Edited by Keith Wilson and John Walker, Cambridge University Press.", "recommended_readings": "Reference:\r   Other reading materials (including reference books, journals articles and web sites) will be given by individual teachers.", "terms": {"2020-21 Term 2": {"--LEC (6150)": {"startTimes": ["11:30", "10:30"], "endTimes": ["12:15", "12:15"], "days": [4, 2], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor FONG Wing Ping, \n\rProfessor KONG Siu Kai", "Professor AU Wing Ngor Shannon, \n\rProfessor FONG Wing Ping, \n\rProfessor KONG Siu Kai"], "meetingDates": ["14/1", "21/1", "28/1", "4/2", "12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 2": {"--LEC (7815)": {"startTimes": ["10:30", "11:30"], "endTimes": ["12:15", "12:15"], "days": [2, 4], "locations": ["Science Centre L1", "William M W Mong Eng Bldg LT"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor FONG Wing Ping, \n\rProfessor LAU Wilson Chun Yu", "Professor AU Wing Ngor Shannon, \n\rProfessor FONG Wing Ping, \n\rProfessor LAU Wilson Chun Yu"], "meetingDates": ["11/1", "18/1", "25/1", "13/1", "20/1", "27/1"]}}}, "assessments": {"Essay test or exam": "20", "Short answer test or exam": "50", "Selected response test or exam": "30"}}, {"code": "3040", "title": "Proteins and Enzymes", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "Pre-requisite: BCHE2030 or permission of instructor.", "description": "Three-dimensional conformations of proteins and protein folding will be discussed with emphasis on structure-function relationships. Basic concepts of proteomic techniques and the investigations of protein structures will be covered. Enzyme catalysis will be introduced with respect to coenzyme requirements, kinetics, catalytic mechanism and regulation of enzymatic activities.\r", "outcome": "After completing the course, students should be able to: 1. describe the hierarchy of protein structure; 2. illustrate the structural motifs of protein;3. explain the principles of protein folding;4. learn about some selected types of protein, for example, membrane proteins, DNA-binding proteins and ubiquitin;5. know the different methods for studying protein-protein interactions;6. understand the basic principles in enzymology, including kinetics, mechanism and regulation of activity; and 7. realize the clinical and industrial applications of enzymes.繁體完成課程後，學生應能：1. 描述蛋白質結構的層次;2. 認識蛋白質結構的基本單位;3. 解釋蛋白質摺合的原理;4. 了解一些特選蛋白質的結構和功用;5. 明白不同研究蛋白質 - 蛋白質相互作用的方法;6. 認識酶，包括輔酶的作用，酶的動力學，催化作用機制及調控機理;7. 了解酶於臨床醫學及工業上的應用。简体完成课程后，学生应能：1. 描述蛋白质结构的层次;2. 认识蛋白质结构的基本单位;3. 解释蛋白质折合的原理;4. 了解一些特选蛋白质的结构和功用;5. 明白不同研究蛋白质 - 蛋白质相互作用的方法;6. 认识酶，包括辅酶的作用，酶的动力学，催化作用机制及调控机理;7. 了解酶于临床医学及工业上的应用。", "syllabus": "Protein Structure, Folding and Stability: This session will discuss the basic principles governing the structure of protein. As protein molecules are organized in a structural hierarchy, topology diagrams will be used to illustrate the motifs of protein structure. In particular, the alpha-domain structures, beta structures and the alpha/beta structures will be discussed.   The key concepts of thermodynamics and kinetics in the process of protein folding and the stabilization of protein structure will be illustrated.Structure-Function Relationship in Selected Proteins:  Specific examples will be used to illustrate the general structure of membrane proteins.  Chaperone are proteins that help correct protein folding while ubiquitin, together with the proteasome system, is responsible for protein degradation. They will be discussed with respect to their structure-function relationship. Transcription factors are DNA-binding proteins that regulate gene activity. Different DNA binding motifs will be introduced.   Proteins can be engineered to improve their properties.  Methods like DNA shuffling will be discussed.Protein-Protein Interaction:  The different methods for studying protein-protein interaction will be introduced. Among the methods are qualitative ones like co-immunoprecipitation, chemical cross linking, yeast two hybrid system, fluorescent resonance energy transfer, as well as quantitative ones like surface plasmon resonance and isothermal titration calorimetry.   The use of mass spectrometry in the identification of protein will be discussed.Introduction to Enzymes:  The basic characteristics of enzymes as biocatalysts, for example the specificity, ability to be regulated and the catalytic power will be introduced. Ribonucleic acids having catalytic activities will be mentioned. The enzyme nomenclature system and the requirement of coenzymes and metals ions for various enzymatic reactions will also be discussed.Enzyme Kinetics:  Different methods for measuring enzyme activities and the precautions needed when performing enzyme assays will be discussed. Michaelis-Menten enzyme steady state kinetics will be covered, with particular emphasis on the significance of the Km and kcat values. Different types of enzyme inhibitors, including allosteric ones, will be introduced. The various means by which enzyme activities can be regulated will be mentioned. Examples will be given to illustrate how the different amino acid residues in the active site of the enzyme contribute to the activity of the enzyme.Clinical and Industrial Enzymology:  This session will introduce the use of enzymes in different clinical applications, for example, the plasma enzyme activity assay as a diagnostic tool, the use of enzyme as a reagent to measure the concentration of certain metabolites, the use of enzyme inhibitor as drugs and the use of enzyme itself as a therapeutic agent. Examples will also be given to illustrate the application of enzymes in industries, particularly, in pharmaceutical and food industries.繁體蛋白質的結構，摺合和穩定性：目的是向學生介紹蛋白質結構的一些基本原則，亦會利用拓撲圖來說明蛋白質的結構基序。內容亦包括蛋白質摺合和蛋白質結構穩定的熱力學和動力學的關鍵概念。特選蛋白質的結構與功能關係：具體的例子包括不同的膜蛋白，協助蛋白質摺合的分子伴侶蛋白，負責蛋白質降解的泛素與蛋白酶體系統，透過與DNA結合來調節基因活動的轉錄因子蛋白。課程亦會介紹蛋白工程，例如透過DNA重組來提高蛋白質的性能。 蛋白質 - 蛋白質相互作用：課程內會討論的方法包括定性的方法，如免疫共沉澱，化學交聯，酵母雙雜交系統，熒光共振能量轉移 ; 以及定量的方法如表面等離子體共振和等溫滴定量熱法等。內容亦包括質譜在蛋白質鑑定的應用。酶的介紹：目的是向學生介紹酶作為生物催化劑的基本特徵，例如特異性，被調控的能力和催化的能力。內容亦會探討具催化活力的核糖核酸，協助各種酶反應的輔酶和金屬離子，酶的命名系統等。酶動力學：目的是向學生介紹測量酶活性的不同方法和當中必須注意的事項。內容亦包括不同類型的酶抑製劑及調節酶活性的不同機制。此外，亦會透過實際例子來說明酶活性部位的氨基酸如何推動酶的活性。臨床及工業酶學：此部份將介紹酶在不同臨床領域上的應用，例如，檢測血液中酶的活性來作臨床診斷，利用酶作為試劑來檢定某些代謝物的濃度，使用酶的活性抑製劑作為藥物，甚或使用酶本身作為一種治療劑。此外，亦會介紹酶在工業上，特別是在製藥和食品工業上的應用。简体蛋白质的结构，折合和稳定性：目的是向学生介绍蛋白质结构的一些基本原则，亦会利用拓扑图来说明蛋白质的结构基序。内容亦包括蛋白质折合和蛋白质结构稳定的热力学和动力学的关键概念。特选蛋白质的结构与功能关系：具体的例子包括不同的膜蛋白，协助蛋白质折合的分子伴侣蛋白，负责蛋白质降解的泛素与蛋白酶体系统，透过与DNA结合来调节基因活动的转录因子蛋白。课程亦会介绍蛋白工程，例如透过DNA重组来提高蛋白质的性能。 蛋白质 - 蛋白质相互作用：课程内会讨论的方法包括定性的方法，如免疫共沉淀，化学交联，酵母双杂交系统，荧光共振能量转移 ; 以及定量的方法如表面等离子体共振和等温滴定量热法等。内容亦包括质谱在蛋白质鉴定的应用。酶的介绍：目的是向学生介绍酶作为生物催化剂的基本特征，例如特异性，被调控的能力和催化的能力。内容亦会探讨具催化活力的核糖核酸，协助各种酶反应的辅酶和金属离子，酶的命名系统等。酶动力学：目的是向学生介绍测量酶活性的不同方法和当中必须注意的事项。内容亦包括不同类型的酶抑制剂及调节酶活性的不同机制。此外，亦会透过实际例子来说明酶活性部位的氨基酸如何推动酶的活性。临床及工业酶学：此部份将介绍酶在不同临床领域上的应用，例如，检测血液中酶的活性来作临床诊断，利用酶作为试剂来检定某些代谢物的浓度，使用酶的活性抑制剂作为药物，甚或使用酶本身作为一种治疗剂。此外，亦会介绍酶在工业上，特别是在制药和食品工业上的应用。", "required_readings": "-", "recommended_readings": "References: 1. Fundamentals of Enzymology: the Cell and Molecular Biology of Catalytic Proteins. N. C. Price and L. Stevens, 3rd edition. Oxford University Press, 1999. 2. Proteins: Structure and Function. D. Whitford, John Wiley & Sons Ltd., 2005.3. Biochemistry. J.M. Berg, J.L. Tymoczko and L. Stryer, New York: W.H. Freeman, 2012. 4. Introduction to Protein Structure. C. Branden and J. Tooze, 2nd edition. New York: Garland Pub., 1999.", "terms": {"2020-21 Term 1": {"--LEC (6223)": {"startTimes": ["8:30", "8:30"], "endTimes": ["9:15", "10:15"], "days": [1, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor FONG Wing Ping", "Professor FONG Wing Ping"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2021-22 Term 1": {"--LEC (5400)": {"startTimes": ["8:30", "8:30"], "endTimes": ["9:15", "10:15"], "days": [1, 3], "locations": ["William M W Mong Eng Bldg 407", "Science Centre L4"], "instructors": ["Professor FONG Wing Ping", "Professor FONG Wing Ping"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11", "8/9", "15/9"]}}}, "assessments": {"Essay test or exam": "40", "Homework or assignment": "20", "Short answer test or exam": "16", "Selected response test or exam": "24"}}, {"code": "3050", "title": "Molecular Biology", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "Not for students who have taken BCHE4010 or BIOL2310.", "description": "This course discusses basic areas of molecular biology, including characteristics of DNA and RNA, genomic elements, DNA replication, transcription, translation, mutation, repair, gene regulation and epigenetics.\r", "outcome": "1. To understand the basic phenomena of life in the molecular biology level, which include the characteristics of DNA and RNA, genome and elements, DNA replication, DNA mutation and repair, transcription, translation, gene regulation and epigenetics.\r 2. To know the major differences of the above phenomena between prokaryotic and eukaryotic organisms.\r  1. 從分子生物學角度了解生命現象，包括：DNA和RNA的性質，真核基因組和元件的特質，基因的複製、轉錄、轉譯、變異、修複、調控和表徵遺傳。\r 2. 明白上述現象在真核細胞和原核細胞的分別。\r  1. 从分子生物学角度了解生命现象，包括：DNA和RNA的性质，真核基因组和元件的特质，基因的复制、转录、转译、变异、修复、调控和表征遗传。\r  2. 明白上述现象在真核细胞和原核细胞的分别。", "syllabus": "1. Characteristics of DNA and RNA, 2. Eukaryotic genome and elements, 3. DNA replication, 4. DNA mutation, 5. DNA repair, 6. Transcription of DNA, 7. RNA processing, 8. Transcriptional regulation, 9. Protein translation, 10. Translational control, 11. epigenetics.\r  1. DNA和RNA的性質，2. 基因組和元件，3. DNA複製，4. DNA轉錄，5. RNA修飾，6. 轉錄調控，7. DNA變異，8. DNA修補， 9. 蛋白質轉譯及調控，10. 表徵遺傳。\r  1. DNA和RNA的性质，2. 基因组和组件，3. DNA复制，4. DNA转录，5. RNA修饰，6. 转录调控，7. DNA变异，8. DNA修补， 9. 蛋白质转译及调控，10. 表征遗传。", "required_readings": "", "recommended_readings": "J.M. Berg, J.L. Tymoczko, L. Stryer (2012) Biochemistry. 7th Edition.\r D.L. Nelson, M.M. Cox (2012) Lehninger Principles of Biochemistry 6th Edition.", "terms": {"2020-21 Term 2": {"--LEC (7652)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor SHAW Pang Chui"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}}, "2021-22 Term 2": {"--LEC (7381)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Lady Shaw Bldg LT1"], "instructors": ["Professor SHAW Pang Chui"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Essay test or exam": "80", "Short answer test or exam": "20"}}, {"code": "3070", "title": "Recombinant DNA Techniques", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "Not for students who have taken BCHE4020.", "description": "This course covers the basic concepts of recombinant DNA techniques, including restriction and modification enzymes and their applications in recombinant DNA techniques, analyses of nucleic acids, insertion of DNA fragment into prokaryotic and eukaryotic vectors and transformation of model organisms and expression of recombinant proteins.\r", "outcome": "1. To know the enzymes and techniques for DNA manipulation, detection, amplification, sequencing, transformation, protein expression and the study of gene expression and analysis of genomes.2. To be able to integrate the knowledge obtained for dealing with actual examples.  1. 知悉各種酶和技術以用作DNA操控、探測、擴增、測序、轉化、蛋白質和基因表達和基因組分析。2. 能夠將有關知識整合以解決實際的例子。1. 知悉各种酶和技术以用作DNA操控、探测、扩增、测序、转化、蛋白质和基因表达和基因组分析。2. 能够将有关知识整合以解决实际的例子。", "syllabus": "1. Restriction and modification enzymes, 2. Separation and joining of DNA, 3. Prokaryotic and eukaryotic vectors and their introduction to cells, 4. Generation of libraries, 5. To obtain clones of a specific gene, 6. Production of protein from cloned gene, 7. Polymerase chain reaction and applications, 8. Studying gene expression and function, 9. Studying genomes.1. 內切酶和修飾酶， 2. DNA分離和連接，3. 真核和原核生物的載體和細胞轉染，4. 基因庫的製造，5. 基因克隆的篩選，6. 從克隆的基因製造蛋白質，7. 聚合酶鍵式反應和應用，8. 基因表達和功用的研究，9. 基因組的研究。1. 内切酶和修饰酶， 2. DNA分离和连接，3. 真核和原核生物的载体和细胞转染，4. 基因库的制造，5. 基因克隆的筛选，6. 从克隆的基因制造蛋白质，7. 聚合酶键式反应和应用，8. 基因表达和功用的研究，9. 基因组的研究。", "required_readings": "-", "recommended_readings": "Brown, T.A. (2010) Gene cloning and DNA analysis. An introduction. 6th Edition.", "terms": {"2020-21 Term 2": {"--LEC (7653)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor SHAW Pang Chui"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 2": {"--LEC (7834)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [4], "locations": ["William M W Mong Eng Bldg LT"], "instructors": ["Professor SHAW Pang Chui"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Homework or assignment": "40", "Short answer test or exam": "60"}}, {"code": "3080", "title": "Bioenergetics and Metabolism", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "Pre-requisite: BCHE2030 or permission of instructor.", "description": "This course covers basic concepts of how biological organisms obtain energy and perform metabolism to build different biomolecules. The following biochemical processes underlying energy transformation in living organisms will be discussed: photosynthesis, glycolysis, citric acid cycle, electron transport, oxidative phosphorylation, fatty acid oxidation. Biosynthesis of carbohydrates, lipids, nucleic acids, and proteins will be provided. The integration of metabolic pathways will also be discussed.", "outcome": "Module 1: After completion of this module, students should be able to understand metabolic pathways such as the production of energy and the utilization of energy in biosynthesis of metabolic fuels – carbohydrates, lipids and proteins. Module 2: Upon completion of this module, students should be able to understand metabolic pathways for the synthesis and degradation of nucleotides. They will also appreciate the importance of these pathways for cellular events and therapeutic development.", "syllabus": "Overview of Bioenergetics and MetabolismOverview of Bioenergetics and Metabolism Glycolysis and the Catabolism of Hexoses1. Glycolysis: a central pathway of glucose metabolism2. Utilization of other sugars as metabolic fuels3. Pentose phosphate pathway: production of reducing powder and formation of pentose sugars  The Citric Acid Cycle1. Common pathway for oxidation of acetyl group2. Regulation and amphibolic nature of TCA cycle Oxidative Phosphorylation and Photophosphorylation1. Structure and function of electron transport chain2. Mechanism of ATP synthesis 3. Structure of photosynthesis apparatus, light harvesting centre and reaction centre4. The generation of ATP and Calvin cycle Qxidation of Fatty Acids1.     Utilization of fatty acid as metabolic fuels2.     Degradative pathway for fatty acid of even or odd number of carbons3.     Formation and utilization of ketone bodies Oxidation of Amino Acids and the Urea Cycle1.     Pathways of amino acid degradation2.     Metabolic fates of amino groups3.     Nitrogen excretion and the urea cycle Carbohydrate Biosynthesis1.     Gluconeogenesis2.     Biosynthesis of glycogen, other carbohydrates and complex carbohydrates Lipid Biosynthesis1.     Biosynthesis of fatty acids and triacylglycerol2.     Biosynthesis of membrane phospholipids3.     Biosynthesis of cholesterol, steroids and isoprenoids Biosynthesis of Amino Acids1.      Biosynthesis of amino acids2.      Molecules derived from amino acids Integration of MetabolismIntegration of Metabolism Biosynthesis of Nucleotide MetabolismBiosynthesis of degradation of nucleotides", "required_readings": ".", "recommended_readings": "References:1.  Lehninger Principles of Biochemistry by David L. Nelson & Michael M. Cox.2.  Biochemistry by Lubert Stryer.3.  Principles of Biochemistry by Donald J. Voet, Judith G.. Voet & Charlotte W. Pratt.", "terms": {"2020-21 Term 1": {"--LEC (6660)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. NGAI Hung Kui"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}}, "2021-22 Term 1": {"--LEC (6595)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Y.C. Liang Hall 103"], "instructors": ["Dr. NGAI Hung Kui"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}}, {"code": "3090", "title": "Self-study Modules in Biochemistry", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "LectureSeminar", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "Not for students who have taken BCHE3092. Pre-requisite: BCHE2000.", "description": "Students will study special biochemical topics on their own, under the supervision of a faculty member. Each student is required to make oral presentations and submit short written reports. In so doing, students will also develop general self-learning skills.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3092", "title": "Self-study Modules in Biochemistry and Professional Development", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "Not for students who have taken BCHE3090. Pre-requisite: BCHE2000.", "description": "This course aims to enhance studentsâ€™ abilities and competence in information search, critical reading and analysis, and communication in biochemistry. In addition, transferable skills and strategies for professional development necessary for career entry and for a sustainable satisfying career are also our emphases. Through different course activities, students should also be able to develop their generic skills in collaborative teamwork, problem solving, and peer-assessment.", "outcome": "1. Acquire skills in information search for scientific topics  2. Learn to apply and integrate different approaches to address biochemical questions  3. Learn to read scientific papers critically  4. Learn to make clear and effective presentation and discussion in oral and written formats  5. Develop skills in generating innovative ideas for scientific research  6. Develop a sense of team spirit of collaborative work and problem solving skills  7. Learn to integrate learning potentials, interests, personal values and professional skills for career development   1. 掌握對課題文獻資料的搜尋技巧  2. 學習應用和整合解決生物化學問題的不同方法  3. 學習具備對科學論文的批判性的思維閲讀能力  4. 學習具備清楚的口頭彙報和書寫報告的能力  5. 發展培養科研的創新思維能力  6. 發展團隊合作和解決問題的能力  7. 學習整合學習潛能，興趣，個人價值觀和專業技巧，從事職業發展的能力   1. 掌握对课题文献资料的搜寻技巧  2. 学习应用和整合解决生物化学问题的不同方法  3. 学习具备对科学论文的批判性的思维阅读能力  4. 学习具备清楚的口头汇报和书写报告的能力  5. 发展培养科研的创新思维能力  6. 发展团队合作和解决问题的能力  7. 学习整合学习潜能，兴趣，个人价值观和专业技巧，从事职业发展的能力", "syllabus": "This course includes lectures on reading and presentation of a scientific paper. Sessions for oral presentations and discussion will be arranged in small groups. A set of scientific papers on various biochemistry topics will be assigned to students to obtain wide scope of biochemistry knowledge. Students are requested to give one group oral presentation on an assigned paper and submit an individual written report on the relevant research topic in the term end.  In addition, this course will include a workshop series on career entry and trajectory development. Case studies and examples on combining developing transferable skills in global commercialization and career development will be discussed. This course content will also be supplemented with e-learning resources (www.bch.cuhk.edu.hk/learnbiochem). 本科包括一些關於科學論文閲讀和寫作的講座。口頭彙報和討論將以小組的形式進行。教授會派給學生一系列有關生物化學課題的科學論文，使學生獲得廣泛的生物化學知識。學生需要做兩個口頭彙報，內容為一篇由教授指派的文章及一篇學生自選研究文章。學生需在學期結束前遞交一份書寫報告。此外，本科將包括一個有關預備和專業發展職業一系列的研討會，以討論可轉讓技能在全球商業化和職業發展中結合開發的案例研究和範例。  本科包括一些关于科学论文阅读和写作的讲座。口头汇报和讨论将以小组的形式进行。教授会派给学生一系列有关生物化学课题的科学论文，使学生获得广泛的生物化学知识。学生需要做两个口头汇报，内容为一篇由教授指派的文章及一篇学生自选研究文章。学生需在学期结束前递交一份书写报告。此外，本科将包括一个有关预备和专业发展职业一系列的研讨会，以讨论可转让技能在全球商业化和职业发展中结合开发的案例研究和范例。", "required_readings": "Relevant reference materials will be provided by the supervisor.", "recommended_readings": "Relevant reference materials will be provided by the supervisor.", "terms": {"2020-21 Term 1": {"AS01-SEM (4804)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "14:15"], "days": [2, 6], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor SHAW Pang Chui", "Professor AU Wing Ngor Shannon, \n\rProfessor SHAW Pang Chui"], "meetingDates": ["8/9", "15/9", "22/9", "24/10"]}, "BS01-SEM (4805)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "14:15"], "days": [2, 6], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor CHAN Michael Kenneth", "Professor AU Wing Ngor Shannon, \n\rProfessor CHAN Michael Kenneth"], "meetingDates": ["8/9", "15/9", "22/9", "24/10"]}, "CS01-SEM (4806)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "14:15"], "days": [2, 6], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor CHAN Ting Fung Philos", "Professor AU Wing Ngor Shannon, \n\rProfessor CHAN Ting Fung Philos"], "meetingDates": ["8/9", "15/9", "22/9", "24/10"]}, "DS01-SEM (4807)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "14:15"], "days": [2, 6], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Dr. LO Fai Hang, \n\rProfessor AU Wing Ngor Shannon", "Dr. LO Fai Hang, \n\rProfessor AU Wing Ngor Shannon"], "meetingDates": ["8/9", "15/9", "22/9", "24/10"]}, "ES01-SEM (4808)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "14:15"], "days": [2, 6], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor NGO Chi Ki Jacky", "Professor AU Wing Ngor Shannon, \n\rProfessor NGO Chi Ki Jacky"], "meetingDates": ["8/9", "15/9", "22/9", "24/10"]}, "FS01-SEM (4809)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "14:15"], "days": [2, 6], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Dr. NGAI Hung Kui, \n\rProfessor AU Wing Ngor Shannon", "Dr. NGAI Hung Kui, \n\rProfessor AU Wing Ngor Shannon"], "meetingDates": ["8/9", "15/9", "22/9", "24/10"]}, "GS01-SEM (4810)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "14:15"], "days": [2, 6], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor AU Wing Ngor Shannon", "Professor AU Wing Ngor Shannon"], "meetingDates": ["8/9", "15/9", "22/9", "24/10"]}}, "2021-22 Term 1": {"AS01-SEM (4809)": {"startTimes": ["10:30", "10:30"], "endTimes": ["14:15", "12:15"], "days": [6, 2], "locations": ["Yasumoto Int'l Acad Park LT9", "Wong Foo Yuan Bldg 402"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor SHAW Pang Chui", "Professor AU Wing Ngor Shannon, \n\rProfessor SHAW Pang Chui"], "meetingDates": ["23/10", "7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}, "BS01-SEM (6449)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "14:15"], "days": [2, 6], "locations": ["T.C. Cheng Bldg 102", "Yasumoto Int'l Acad Park LT9"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor CHAN Michael Kenneth", "Professor AU Wing Ngor Shannon, \n\rProfessor CHAN Michael Kenneth"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11", "23/10"]}, "CS01-SEM (6450)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "14:15"], "days": [2, 6], "locations": ["Wong Foo Yuan Bldg 403", "Yasumoto Int'l Acad Park LT9"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor CHAN Ting Fung Philos", "Professor AU Wing Ngor Shannon, \n\rProfessor CHAN Ting Fung Philos"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11", "23/10"]}, "DS01-SEM (6451)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "14:15"], "days": [2, 6], "locations": ["William M W Mong Eng Bldg 406", "Yasumoto Int'l Acad Park LT9"], "instructors": ["Dr. LO Fai Hang, \n\rProfessor AU Wing Ngor Shannon", "Dr. LO Fai Hang, \n\rProfessor AU Wing Ngor Shannon"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11", "23/10"]}, "ES01-SEM (6452)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "14:15"], "days": [2, 6], "locations": ["Wong Foo Yuan Bldg 107B", "Yasumoto Int'l Acad Park LT9"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor NGO Chi Ki Jacky", "Professor AU Wing Ngor Shannon, \n\rProfessor NGO Chi Ki Jacky"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11", "23/10"]}, "FS01-SEM (6453)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "14:15"], "days": [2, 6], "locations": ["Science Centre 139", "Yasumoto Int'l Acad Park LT9"], "instructors": ["Dr. NGAI Hung Kui, \n\rProfessor AU Wing Ngor Shannon", "Dr. NGAI Hung Kui, \n\rProfessor AU Wing Ngor Shannon"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11", "23/10"]}, "GS01-SEM (8173)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "14:15"], "days": [2, 6], "locations": ["T.C. Cheng Bldg 103", "Yasumoto Int'l Acad Park LT9"], "instructors": ["Professor AU Wing Ngor Shannon", "Professor AU Wing Ngor Shannon"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11", "23/10"]}}}, "assessments": {"Homework or assignment": "25", "Presentation": "75"}}, {"code": "3110", "title": "Chemical Biology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "Pre-requisite: BCHE2030 and one of the following three courses: CHEM1070 or 1072 or 1280.", "description": "The discipline of chemical biology is focused on the application of chemical principles, particularly organic chemistry, to the study and manipulation of biological systems. Two major focus areas include the development of chemical tools to proteins and cells, and in the identification and creation of novel compounds as therapeutics for the treatment of human disease. The course will begin with a brief review of organic chemistry fundamentals and bio-orthogonal ligand reactions. It will then cover case studies to illustrate the power of chemical biology to solve important problems at the chemistry-biology interface.", "outcome": "Knowledge   Recall the fundamental aspects of chirality and basic reaction mechanisms in organic chemistry.  Know the core bio-orthogonal reactions that can be used with biological systems.  Be aware of the important biological and biomedical problems being tackled by scientists.  Account for how chemical biology methods are used within biomedical research and pre-clinical drug discovery.  Skill   Students will be able to assess, evaluate and choose appropriate chemical biology methods to use in their future research studies.  Value   Chemical biology approaches have led to advances that have led to creation of multiple active biotech companies. The knowledge gained will equip them with the skills needed to pursue careers in disciplines at the chemistry and biology interface.   知識  •回顧有機化學中空間螺旋特性的基本知識和化學反應機理。 •瞭解可應用於生物系統的核心生物正交反應。 •關注科學家正在研究的重要生物學和生物醫學課題。 •說明化學生物學方法如何可以應用在生物醫學的研究和臨床前藥物的新發現。  技能 •學生將能夠測試，評估和選擇適當的化學生物學方法以用於未來的研究。  價值 •化學生物學的研究催生了多家活躍的生物科技公司的創建。學生獲得的相關知識將使他們具備在化學和生物學跨學科領域工作所需的專業技能。  知识 •回顾有机化学中空间螺旋特性的基本知识和化学反应机理。•了解可应用于生物系统的核心生物正交反应。•关注科学家正在研究的重要生物学和生物医学课题。•说明化学生物学方法如何可以应用在生物医学的研究和临床前药物的新发现。 技能•学生将能够测试，评估和选择适当的化学生物学方法以用于未来的研究。 价值•化学生物学的研究催生了多家活跃的生物科技公司的创建。学生获得的相关知识将使他们具备在化学和生物学跨学科领域工作所需的专业技能。 ", "syllabus": "   Week  Topic    週   主题    1  The properties of atoms and how they form bonds   Periodic properties (atomic and ionic radii, electron affinity, ionization energy, electronegativity)    Lewis theory, Atomic orbitals, hybrid orbitals and     Molecular Geometry      1  原子性質及化學鍵生成    1. 週期性（原子和離子半徑，電子親和力，電離能，負電性）    2. 路易斯理論，原子軌道，混成軌道    3. 分子幾何    2  Organic chemistry principles relevant to biological reactions I   Stereochemistry    Nucleophiles and electrophiles    Nucleophilic substitution reactions (SN1 and SN2)    Chemical synthesis based on nucleophilic substitution reactions      2  與生物反應相關的有機化學原理一    1.  立體化學    2.  親核試劑和 親電試劑    3.  親核取代反應 (SN1 and SN2)    4.  基於親核取代反應的化學合成    3  Organic chemistry principles relevant to biological reactions II   Functional groups in proteins and nucleic acids    Nucleophilic substitution reactions in biology    Carboxylic acids and their derivatives    Chemical reactions on carboxyl groups      3  與生物反應相關的有機化學原理二 1.  蛋白質和核酸中的官能團 2.  生物學中的親核取代反應 3.  羧酸及其衍生物 4.  羰基化學反應    4  Chemical synthesis of peptides    Mechanism and thermodynamics of peptide bond formation    Protecting groups    Solid phase peptide synthesis    Native chemical ligation and their derivatives      4  肽的化學合成 1.  肽鍵形成的機理和熱力學 2.  保護基團 3.  固相肽合成 4. 本身已具有的官能團的化學連接及其衍生物    5  Natural and bioconjugate protein reactions    Bioorthogonal reactions for protein labeling and conjugation    Expressed protein ligation    Isopeptide formation in biology: SpyTag/SpyCatcher reaction, ubiquitination, etc.      5  天然蛋白及生物接合蛋白的化學反應    1. 用於蛋白質標記和接合的生物正交反應    2. 基因表達蛋白的連接反應    3. 生物學中的異肽形成：SpyTag / SpyCatcher反應，泛素化等。    6  Chemistry of enzymes and coenzymes    Enzymes and catalysis    Chemistry of selected coenzymes    Michaelis-Menton Kinetics    Catalytic antibodies      6  酶和輔酶的化學    1. 酶與催化    2. 代表性輔酶的化學    3. Michaelis-Menton動力學    4. 催化性抗體    7  Chemical Biology of Carbohydrates    Monosaccharides: structure and reactivity    Oligosaccharides and polysaccharides     Enzymatic reactions of carbohydrates    Midterm Examination (Weeks 1-6)     7  碳水化合物的化學生物學    1. 單醣：結構和反應性    2. 寡糖和多醣    3. 碳水化合物的酶促反應  期中考試（1-6週）     8  From genes to proteins    DNA Replication and RNA Transcription     Structure of DNA    Structure of RNA    Synthesis of proteins by protein translation      8  蛋白質的生物合成 1.  DNA複製和RNA轉錄 2.  DNA的結構 3.  RNA的結構 4.  蛋白質轉譯和合成    9  Directed Evolution    Directed Evolution of Nucleic Acids and Enzymes     Nucleic acid selection (SELEX)    Protein evolution to screen for novel properties (Phage-display, Yeast display, E. coli display, mRNA display)      9  定向進化    1. 核酸和酶的定向進化    2. 核酸選擇（SELEX）    3. 蛋白質進化及新特性篩選（噬菌體展示，酵母展示，大腸桿菌展示，mRNA展示）    10  Incorporating unnatural amino acids into proteins    Evolution of tRNA synthetases for incorporation of UAAs    Use of the pyrrolysine tRNA/tRNA synthetase for UAA incorporation    Application of UAA incorporation for biological and biotechnological studies      10  蛋白質中非天然氨基酸的納入    1. tRNA合成酶的進化和UAA納入    2. 吡咯賴氨酸tRNA / tRNA合成酶在UAA納入中的使用    3. UAA納入在生物和生物技術研究的應用    11  Special Topics (Novel Roles of Metals in Biology)   Zinc and magnesium ions in hydrolytic reactions (metalloproteases, polymerases)    Heme and non-heme iron proteins    Nickel ions in organometallic reactions    Molybdenum and tungsten containing enzymes    cis-Pt(NH3)2Cl2 as an anticancer therapeutic      11  專題研究 (金屬在生物學中的新作用)    1.  水解反應中的鋅和鎂離子（金屬蛋白酶，聚合酶）    2.  血紅素和非血紅素鐵蛋白    3.  有機金屬反應中的鎳離子    4.  含鉬和鎢的酶    5.  cis-Pt(NH3)2Cl2作為抗癌藥    12  Special Topics (Protein therapeutics and protein delivery)   Antibodies     CRISPR (Gene editing)    Transcription Factors (Cellular Reprogramming)    Strategies for overcoming the barriers to cellular delivery       12  專題研究 (蛋白質治療和蛋白質遞送） 1.  抗體 2.  CRISPR（基因編輯） 3.  轉錄因子（細胞重新編程） 4.  克服細胞遞送障礙的策略    13  Review and Final Examination (Weeks 7-12)    13  評論和期末考試 （7-12週）       周 主题     1 原子性质及化学键生成   1. 周期性（原子和离子半径，电子亲和力，电离能，负电性）   2. 刘易斯理论，原子轨道，混成轨道   3. 分子几何     2 与生物反应相关的有机化学原理一   1.  立体化学   2.  亲核试剂和 亲电试剂   3.  亲核取代反应 (SN1 and SN2)   4.  基于亲核取代反应的化学合成     3 与生物反应相关的有机化学原理二1.  蛋白质和核酸中的官能团2.  生物学中的亲核取代反应3.  羧酸及其衍生物4.  羰基化学反应     4 肽的化学合成1.  肽键形成的机理和热力学2.  保护基团3.  固相肽合成4. 本身已具有的官能团的化学连接及其衍生物     5 天然蛋白及生物接合蛋白的化学反应   1. 用于蛋白质标记和接合的生物正交反应   2. 基因表达蛋白的连接反应   3. 生物学中的异肽形成：SpyTag / SpyCatcher反应，泛素化等。     6 酶和辅酶的化学   1. 酶与催化   2. 代表性辅酶的化学   3. Michaelis-Menton动力学   4. 催化性抗体     7 碳水化合物的化学生物学   1. 单醣：结构和反应性   2. 寡糖和多醣   3. 碳水化合物的酶促反应 期中考试（1-6周）     8 蛋白质的生物合成1.  DNA复制和RNA转录2.  DNA的结构3.  RNA的结构4.  蛋白质转译和合成     9 定向进化   1. 核酸和酶的定向进化   2. 核酸选择（SELEX）   3. 蛋白质进化及新特性筛选（噬菌体展示，酵母展示，大肠杆菌展示，mRNA展示）     10 蛋白质中非天然氨基酸的纳入   1. tRNA合成酶的进化和UAA纳入   2. 吡咯赖氨酸tRNA / tRNA合成酶在UAA纳入中的使用   3. UAA纳入在生物和生物技术研究的应用     11 专题研究 (金属在生物学中的新作用)   1.  水解反应中的锌和镁离子（金属蛋白酶，聚合酶）   2.  血红素和非血红素铁蛋白   3.  有机金属反应中的镍离子   4.  含钼和钨的酶   5.  cis-Pt(NH3)2Cl2作为抗癌药     12 专题研究 (蛋白质治疗和蛋白质递送）1.  抗体2.  CRISPR（基因编辑）3.  转录因子（细胞重新编程）4.  克服细胞递送障碍的策略     13 评论和期末考试 （7-12周）  ", "required_readings": "To be announced in the lecture", "recommended_readings": "To be announced in the lecture", "terms": {"2020-21 Term 2": {"--LEC (8251)": {"startTimes": ["13:30", "14:30"], "endTimes": ["14:15", "16:15"], "days": [3, 1], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor CHAN Michael Kenneth", "Professor CHAN Michael Kenneth"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2", "11/1", "18/1", "25/1", "1/2", "8/2"]}}, "2021-22 Term 2": {"--LEC (8295)": {"startTimes": ["13:30", "14:30"], "endTimes": ["14:15", "16:15"], "days": [3, 1], "locations": ["William M W Mong Eng Bldg 408", "Mong Man Wai Bldg 715"], "instructors": ["Professor CHAN Michael Kenneth", "Professor CHAN Michael Kenneth"], "meetingDates": ["12/1", "19/1", "26/1", "10/1", "17/1", "24/1"]}}}, "assessments": {"Essays": "40", "Short answer test or exam": "60"}}, {"code": "3650", "title": "Molecular Biology and Recombinant DNA Laboratory", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "Not for students who have taken BCHE4610.", "description": "A set of experiments to illustrate various molecular biology and recombinant DNA techniques will be performed. These include recombinant DNA construction and characterization, DNA sequencing and analyses, DNA authentication, gene expression study. Students are preferred to attend BCHE3050 and BCHE3070.\r", "outcome": "1. Students should be able to perform simple experiments using molecular biology and recombinant DNA techniques such as DNA preparation, construction and analyses of recombinant DNA, generation of cDNA, DNA sequencing and polymerase chain reaction. 2. Students should be able to grasp the basic concept of molecular biology and recombinant DNA techniques. 3. Knowledge gained from this course is useful for the final year course Supervised Research in Biochemistry and other research work.1. 學生能利用各種分子生物和重組DNA技術，例如DNA和cDNA的製備，重組DNA的構建和分析，DNA序列分析，聚合酶鍵式反應等來進行簡單的實驗。2. 學生能了解分子生物和重組DNA技術的基本原理。3. 所學的內容將有助學生於畢業年修讀專題實驗研究和進行其它研究活動。1. 学生能利用各种分子生物和重组DNA技术，例如DNA和cDNA的制备，重组DNA的构建和分析，DNA序列分析，聚合酶键式反应等来进行简单的实验。2. 学生能了解分子生物和重组DNA技术的基本原理。3. 所学的内容将有助学生于毕业年修读专题实验研究和进行其它研究活动。", "syllabus": "Recombinant DNA construction, DNA transformation, plasmid DNA preparation, paternity test, DNA sequencing, bioinformatic analyses, gene expression study.重組DNA構建，DNA轉化，質粒DNA製備，親子鑒定，DNA測序，生物信息分析，基因表達。重组DNA构建，DNA转化，质粒DNA制备，親子鑒定，DNA测序，生物信息分析，基因表达。", "required_readings": "-", "recommended_readings": "", "terms": {"2020-21 Term 2": {"-L01-LAB (7651)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Science Ctr East Block E402"], "instructors": ["Professor SHAW Pang Chui"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 2": {"-L01-LAB (6594)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Science Ctr East Block E402"], "instructors": ["Professor SHAW Pang Chui"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Homework or assignment": "10", "Lab reports": "25", "Others": "10", "Short answer test or exam": "10", "Selected response test or exam": "45"}}, {"code": "3730", "title": "Analytical Biochemistry Laboratory", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "Not for students who have taken BCHE3630. Co-requisite: BCHE3030.", "description": "This laboratory course provides basic training in biochemical techniques. Students will learn the application of different biochemical methods in the qualitative and quantitative analyses of biologically active molecules. This course is identical to the BCHE3630 Methods in Biochemistry Laboratory offered in 2014 or before.\r", "outcome": "Students are expected to learn different methods for biochemical analyses, including chromatography, electrophoresis, protein crystallization, centrifugation and fluorescence techniques. Knowledge gained from this course is useful for the final year course “Supervised Research in Biochemistry” and other research work. 學生將學習不同的生化分析方法，包括層析，電泳，蛋白質結晶，離心和熒光技術。所獲知識將有助進行各項的生物化學實驗研究課題。学生将学习不同的生化分析方法，包括层析，电泳，蛋白质结晶，离心和荧光技术。所获知识将有助进行各项的生物化学实验研究课题。", "syllabus": "Fluorescence Techniques: Because of its outstanding sensitivity, reliability, non-invasiveness and friendliness to our environment, detection of target molecules by using fluorescence has been a common technology for various types of biochemical and biomedical studies. This session attempts to introduce to students different fluorescence techniques including the use of fluorometer, fluorescence plate reader, confocal microscope, and flow cytometer for a number of biochemical analyses.Ion Exchange Chromatography:  Chromatography is a technique which depends on the distribution of a molecule between two different phases, a stationary phase and a mobile phase.  Depending on the stationary phase used, there are different kinds of chromatography which allow for separation of molecules with different properties.  In the experiment, ion exchange chromatography will be used to separate three different proteins.Sodium Dodecyl Sulfate-Polyacrylamide Discontinuous Gel Electrophoresis:  SDS is an anionic detergent which binds strongly to protein at a constant ratio such that all the SDS-treated proteins are negatively charged. Besides having the same charge to mass ratio, the SDS-treated proteins also have the same shape. Consequently, when electrophoresed in the molecular sieving polyacrylamide gel, they will be separated according to size and their molecular weight can be determined with reference to the standards.Separation of Sub-cellular Components by Differential Centrifugation:  Differential centrifugation will be used to separate sub-cellular components for biochemical analysis.  Different sub-cellular components, such as the nucleus and the cell membrane, have different sedimentation properties and therefore, they can be differentially sedimented to the bottom of the centrifuge tube. In this experiment, we will attempt to separate key cellular components (the nucleus, the mitochondria/membrane and the cytosol fractions) using a simple centrifuge. The experiment was designed to show that by varying the parameters of centrifugation, one could selectively separate cellular components into fractions with distinctive biochemical characteristics.Crystallization of Lysozyme: The X-ray crystallography is a very important technique to study the three-dimensional structure of proteins. A good X-ray diffraction pattern, however, requires a large protein crystal that is free of contaminants and aggregation. In this experiment, students will acquire the basic skills of producing a crystal of lysozyme. In addition, the effects of different protein and salt concentrations on lysozyme crystallization will also be investigated.熒光技術：由於其出色的靈敏度，可靠性和非侵入性，通過使用熒光檢測目標分子一直是各類生物化學和生物醫學研究通用的技術。實驗會介紹不同的熒光技術，包括使用的熒光機，熒光微孔板檢測儀，激光共聚焦顯微鏡，流式細胞儀等等。離子交換層析：層析是一種依賴分子在固定相和流動相之間分佈的技術。利用不同的固定相，可以將具有不同性質的分子分離。在實驗中，學生將會利用離子交換層析法分離三種不同的蛋白質。十二烷基硫酸鈉 - 聚丙烯酰胺凝膠電泳：十二烷基硫酸鈉能與蛋白質透過一個恆定的比率結合，使得所有經處理的蛋白都帶相應的負電荷。因此，在分子篩聚丙烯酰胺凝膠電泳時，蛋白將根據大小有不同的電泳速度。透過與標準蛋白的比較，可以計算出蛋白的分子量。差速離心分離：實驗將利用差速離心分離亞細胞的不同部分。不同的細胞部分，如細胞核和細胞膜，具有不同的沉降性，因此，它們可以透過差異沉降到離心管的底部。這個實驗的目的是要顯示通過改變離心分離的參數，我們可以選擇性地分離出各種具鮮明生化特性的細胞部分。溶菌酶的結晶：X-射線晶體學是研究蛋白質三維結構一個非常重要的技術。然而一個理想的X-射線衍射圖案，需要一個大的蛋白質晶體。在實驗中，學生將學會生產溶菌酶的晶體。此外，亦會探討不同的蛋白濃度和鹽濃度對結晶的影響。荧光技术：由于其出色的灵敏度，可靠性和非侵入性，通过使用荧光检测目标分子一直是各类生物化学和生物医学研究通用的技术。实验会介绍不同的荧光技术，包括使用的荧光机，荧光微孔板检测仪，激光共聚焦显微镜，流式细胞仪等等。离子交换层析：层析是一种依赖分子在固定相和流动相之间分布的技术。利用不同的固定相，可以将具有不同性质的分子分离。在实验中，学生将会利用离子交换层析法分离三种不同的蛋白质。十二烷基硫酸钠 - 聚丙烯酰胺凝胶电泳：十二烷基硫酸钠能与蛋白质透过一个恒定的比率结合，使得所有经处理的蛋白都带相应的负电荷。因此，在分子筛聚丙烯酰胺凝胶电泳时，蛋白将根据大小有不同的电泳速度。透过与标准蛋白的比较，可以计算出蛋白的分子量。差速离心分离：实验将利用差速离心分离亚细胞的不同部分。不同的细胞部分，如细胞核和细胞膜，具有不同的沉降性，因此，它们可以透过差异沉降到离心管的底部。这个实验的目的是要显示通过改变离心分离的参数，我们可以选择性地分离出各种具鲜明生化特性的细胞部分。溶菌酶的结晶：X-射线晶体学是研究蛋白质三维结构一个非常重要的技术。然而一个理想的X-射线衍射图案，需要一个大的蛋白质晶体。在实验中，学生将学会生产溶菌酶的晶体能。此外，亦会探讨不同的蛋白浓度和盐浓度对结晶的影响。", "required_readings": "The students will be given a laboratory manual with details, including the basic principles and the procedures of the experiments.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"-L01-LAB (7016)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Science Ctr East Block E402"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor FONG Wing Ping, \n\rProfessor KONG Siu Kai"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"-L01-LAB (4389)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Science Ctr East Block E402"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor FONG Wing Ping, \n\rProfessor LAU Wilson Chun Yu"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Lab reports": "50", "Participation": "10", "Short answer test or exam": "40"}}, {"code": "4030", "title": "Clinical Biochemistry", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "Pre-requisite: BCHE2030 or permission of instructor.", "description": "This course presents the basic principles in clinical biochemistry and its methodology. Tests of functions will be described. \r", "outcome": "After completing the course, students should be able to:\r - Acquire core knowledge on clinical biochemistry; - Understand the relationship of biochemistry to clinical problems; - Appreciate the applications of biochemistry to modern medicine; - Applying knowledge of clinical chemistry for diagnosis of diseases.\r - Develop generic skills such as critical thinking, writing and lifelong learning skills.\r  繁體 完成本課程後，學生應該能夠： - 獲得臨牀生物化學核心知識; - 了解生物化學與臨牀問題的關係; - 欣賞生物化學在現代醫學的應用; - 運用臨牀生物化學知識診斷疾病。\r - 發展共通能力，如寫作，批判思考，和終身學習的技能。\r  简体 完成本课程后，学生应该能够： - 获得临床生物化学核心知识; - 了解生物化学与临床问题的关系; - 欣赏生物化学在现代医学的应用; - 运用临床生物化学知识诊断疾病。\r - 发展共通能力，如写作，批判思考，和终身学习的技能。", "syllabus": "- The Endocrine System: An Overview\r - Biochemical Effects of Tumors\r - Liver Functions and Diseases\r - Diagnosis of the Central Nervous System: The Cerebrospinal Fluid\r - Introduction to Molecular Hematology\r - Iron Metabolism and Anemia\r - Introduction to Biomarkers\r - Topics on Translational Research\r - Introduction, Plasma Lipids, and Lipoproteins\r - Atherogenesis and Atherosclerotic Disease\r - Traditional and Other Novel Atherosclerosis Risk Factors\r - Lipid-lowering Therapy for Primary or Secondary Prevention\r - Heart Attacks-Acute Coronary Syndrome, Advances in Diagnosis and Treatment\r - Molecular Endocrinology on Diabetes Mellitus, Updates on Pathogenesis\r - Presentation, Diagnosis and Treatment of Diabetes Mellitus\r - Electrolytes and Water Balance\r - Disorders of Electrolytes and Water Balance\r - Acid-Base Regulation\r - Disorders of Acid-Base\r - Collection of Samples from Patients\r - Development of Clinical Biochemistry Assays\r  繁體 - 內分泌系統的概述\r - 腫瘤的生化效應\r - 肝功能及肝疾病\r - 神經中樞系統的診斷：腦脊髓液\r - 分子血液學的介紹\r - 鐵代謝和貧血\r - 生物標記的介紹\r - 轉譯研究\r - 血脂，和血脂蛋白的介紹\r - 動脈粥樣硬化的形成及相關疾病\r - 導致動脈粥樣硬化傳統及嶄新的危險因素\r - 降脂治療作初級及二級預防\r - 心臟病與急性冠狀動脈綜合症的診斷和治療的進展\r - 糖尿病的分子內分泌學，發病機制，臨牀表現及治療的進展\r - 電解質和水平衡\r - 電解質和水平衡的紊亂\r - 酸鹼調控\r - 酸鹼調控的障礙\r - 如何收集病人的樣本\r - 臨牀生物化學檢驗的開發\r  简体 - 内分泌系统的概述\r - 肿瘤的生化效应\r - 肝功能及肝疾病\r - 神经中枢系统的诊断：脑脊髓液\r - 分子血液学的介绍\r - 铁代谢和贫血\r - 生物标记的介绍\r - 转译研究\r - 血脂，和血脂蛋白的介绍\r - 动脉粥样硬化的形成及相关疾病\r - 导致动脉粥样硬化传统及崭新的危险因素\r - 降脂治疗作初级及二级预防\r - 心脏病与急性冠状动脉综合症的诊断和治疗的进展\r - 糖尿病的分子内分泌学，发病机制，临床表现及治疗的进展\r - 电解质和水平衡\r - 电解质和水平衡的紊乱\r - 酸碱调控\r - 酸碱调控的障碍\r - 如何收集病人的样本\r - 临床生物化学检验的开发", "required_readings": "Articles recommended by teachers.", "recommended_readings": "1. Philip D. Mayne. Clinical Chemistry in Diagnosis and Treatment. Edward Arnold, 6th ed. (QY90.Z54 1994).\r  2. Shauna C. Anderson & Susan Cockayne. Clinical Chemistry: Concepts and Application. New York: McGraw-Hill, Medical Pub, Division. (QY90.C6423 2003).\r  3. Lela Buckingham & Maribeth L. Flaws. Molecular Diagnostics: Fundamentals, Methods, & Clinical Applications. Philadelphia: F.A. Davis. (QU58.B83 2007).\r  4. Articles recommended by teachers.", "terms": {"2020-21 Term 2": {"--LEC (6821)": {"startTimes": ["8:30", "12:30"], "endTimes": ["10:15", "13:15"], "days": [3, 1], "locations": ["Lee Shau Kee Building LT7", "William M W Mong Eng Bldg LT"], "instructors": ["Dr. LO Fai Hang, \n\rProfessor KONG Siu Kai", "Dr. LO Fai Hang, \n\rProfessor KONG Siu Kai"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2", "11/1", "18/1", "25/1", "1/2", "8/2"]}}, "2021-22 Term 2": {"--LEC (5547)": {"startTimes": ["8:30", "12:30"], "endTimes": ["10:15", "13:15"], "days": [3, 1], "locations": ["Mong Man Wai Bldg LT2", "Lady Shaw Bldg LT6"], "instructors": ["Dr. LO Fai Hang, \n\rProfessor KONG Siu Kai", "Dr. LO Fai Hang, \n\rProfessor KONG Siu Kai"], "meetingDates": ["12/1", "19/1", "26/1", "10/1", "17/1", "24/1"]}}}, "assessments": {"Essays": "10", "Essay test or exam": "50", "Short answer test or exam": "34", "Selected response test or exam": "6"}}, {"code": "4040", "title": "Aspects of Neuroscience", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "Pre-requisite: BCHE2030 or permission of instructor.", "description": "This course will discuss the structure and components of nervous tissue in relation to its functions. Aspects of metabolism special to the nerve and brain will be examined. These include energy metabolism, water and electrolyte balance, exchanges between blood and brain, and between brain and cerebrospinal fluid, neurotransmitters and modulators, nutrition and development of the nervous system, neuroendocrinology and the biochemistry of mental diseases.", "outcome": "    After reading this course, students are expected be able to:     After reading this course, students are expected be able to: - Outline the special features of the nervous system and its components. - Describe the functions of the nervous system both at the cellular and molecular levels. - Explain how neurons communicate with each other in cellular and molecular terms. - Explain the pathophysiology of certain neurological and neuropsychiatric disorders, and the biochemical basis of treating them.    ", "syllabus": "    1     1. Structure and function of the central nervous system.  2. Cells of the nervous system 3. Myelin: a. Structure and function              b. Biosynthesis and genes regulating its biosynthesis             c. Diseases related to myelin dysfunction, eg, multiple sclerosis 4. Biochemistry, physiology and pharmacology of transport system:             a. Blood-brain-CSF barriers             b. Cellular (Membrane) transport               c. Axoplasmic transport 5. Ion channels, potentials and signal conduction 6. Brief introduction of neurochemical techniques:             a. Preparation of brain slice             b. Preparation of synaptosomes             c. Chemical and surgical lesion             d. Tissue culture             e. Molecular biology 7. Metabolism:             a. Brief review of brain metabolism             b. Some inherited neurological diseases related to                 metabolic disorders           c. Nutrition and brain function 8. Biochemistry, physiology and pharmacology of synaptic transmission:             a. Classification of neurotransmitters             b. Biosynthesis of transmitters and their regulation             c. Termination of neurotransmission             d. Properties and molecular biology of receptors              e. 2nd messengers and signal transduction             f. Modulation of signal transmission 9. Biochemistry and molecular biology of neurological and psychiatric disorders:             a. Myasthenia gravis             b. Parkinson’s disease             c. Alzheimer's disease             d. Huntington’s disease           e. Affective disorders and schizophrenia    ", "required_readings": "    Jack R     Jack R. Cooper, Floyd E. Bloom, Robert H. Roth., The biochemical basis of neuropharmacology, 8th edn., New York, Oxford University Press, 2003. (Neuropharmacology) Eric R. Kandel, James H. Schwartz, Thomas M. Jessell, Principles of neural science, 4th edn, New York, McGraw-Hill, Health Professions Division, 2000. (Neurophysiology) John Nolte. Elsevier's integrated neuroscience, Mosby/Elsevier, 2007. (Neuroscience general) G.J. Siegel, R.W. Albers, S.T. Brady and D.L. Price (Eds.). Basic neurochemistry, 7th edn, Elsevier Academic Press, Mass, 2006. (Neurochemistry) Larry Squire et al. Fundamental neuroscience, 3rd edn. Elsevier / Academic Press, 2008. (Neuroscience general) Paul A. Young, Paul H. Young, Daniel L. Tolbert, Basic clinical neuroscience, 2nd edn. Lippincott Williams & Wilkins, 2008. (Clinical neuroscience)      ", "recommended_readings": "    Shin-Ho Chung, Olaf S     Shin-Ho Chung, Olaf S. Andersen, Vikram Krishnamurthy, Biological Membrane Ion Channels: Dynamics, Structure, and Applications, Springer, 2007 Constance Hammond, Cellular and molecular neurophysiology 3rd edn. Elsevier/Academic Press, 2008. Lajtha A, et al. Handbook of Neurochemistry and Molecular Neurobiology: Neural Signaling Mechanisms, Boston, MA: Springer, 2009. Eric J. Nestler, Steven E. Hyman, Robert C. Malenka., Molecular neuropharmacology a foundation for clinical neuroscience,  2nd edn. McGraw-Hill  NY, 2009. Cyndy Davis Sanberg, Paul R. Sanberg, Cell Therapy, Stem Cells, and Brain Repair, Humana Press Inc., 2007.   Other journal articles given in class      ", "terms": {"2020-21 Term 1": {"--LEC (6071)": {"startTimes": ["11:30", "10:30"], "endTimes": ["12:15", "12:15"], "days": [1, 4], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor CHOW Hei Man, \n\rProfessor LAU Kwok Fai", "Professor CHOW Hei Man, \n\rProfessor LAU Kwok Fai"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "10/9", "17/9", "24/9"]}}, "2021-22 Term 1": {"--LEC (4815)": {"startTimes": ["11:30", "10:30"], "endTimes": ["12:15", "12:15"], "days": [1, 4], "locations": ["Fung King Hey Bldg Swire Hall2", "Y.C. Liang Hall 104"], "instructors": ["Professor CHOW Hei Man, \n\rProfessor LAU Kwok Fai", "Professor CHOW Hei Man, \n\rProfessor LAU Kwok Fai"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11", "9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Essay test or exam": "70", "Short answer test or exam": "30"}}, {"code": "4060", "title": "Basic and Applied Immunology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "", "description": "This course aims at providing students with the essential concepts of basic and applied immunology. Topics to be covered include architecture and development of the immune system, antigens and antibodies, immunoglobulin genes and diversity, the major histocompatibility system and T cell receptors, tolerance and autoimmunity, and integration of immune responses. The effector mechanisms of the immune system will be introduced, with special emphasis on the role of innate and acquired immunity in health and disease. The relationship of immunology to clinical problems of infectious disease, immunodeficiency, hypersensitivity, transplantation and cancer will be discussed. The applications of immunology to modern medicine and biotechnology, including vaccination, monoclonal antibody production and antibody engineering will also be covered. Students are advised to take BCHE2030 or equivalent before taking this course.\r", "outcome": "After completing the course, students should be able to: \r - have an in-depth knowledge of the key features of the immune system;  - comprehend the integrated nature of the immune system; - understand the molecular basis for generation of antibody diversity, immune response, self-tolerance and disorders in the immune system; - appreciate the relevance of the immune system in our daily lives & the applications in biotechnology; - have developed competence in accessing & reviewing scientific literature, and critical appraisal of information; - develop generic skills such as critical thinking, writing and lifelong learning skills.\r  繁體 完成本課程後，學生應該能夠： - 深入瞭解免疫系統的特點; - 理解免疫系統的綜合性; - 瞭解抗體的多樣性，免疫反應，自我寬容和免疫系統疾病的分子基礎; - 欣賞免疫系統在生物技術及日常生活的應用; - 發展審閱文獻和評價相關資料的能力;  - 發展共通能力，如批判思考，寫作和終身學習的技能。\r  简体 完成本课程后，学生应该能够： - 深入了解免疫系统的特点; - 理解免疫系统的综合性; - 了解抗体的多样性，免疫反应，自我宽容和免疫系统疾病的分子基础; - 欣赏免疫系统在生物技术及日常生活的应用; - 发展审阅文献和评价相关资料的能力;  - 发展共通能力，如批判思考，写作和终身学习的技能。", "syllabus": "- Overview of Our Immune System\r - Nature of Antigens & Immunogens\r - Lymphoid Tissues & Immunocytes\r - Immunoglobulin Structure & Functions\r - Antibody Diversity\r - The Major Histocompatibility Complex\r - T Cells & T Cell Receptors\r - Integration of Immune Responses\r - Immunological Tolerance\r - The Complement System\r - Cytokines in Health & Disease\r - Immunity to Microbes\r - Emerging and Re-emerging Infectious Diseases\r - Immunodeficiency & AIDS\r - Allergy & Hypersensitivity Reactions\r - Transplantation Immunology\r - Tumour Immunology\r - Clinical Applications of Immunology\r  繁體 - 免疫系統的概述\r - 抗原及免疫原的性質\r - 淋巴組織與免疫細胞\r - 免疫球蛋白的結構與功能\r - 抗體多樣性\r - 主要組織相容性複合體\r - T細胞和T細胞受體\r - 免疫應答的綜合性\r - 免疫耐受\r - 補體系統\r - 細胞因子在健康與疾病\r - 抵抗微生物的免疫力\r - 新出現和重現的傳染病\r - 免疫缺陷和愛滋病\r - 過敏與超敏反應\r - 移植免疫學\r - 腫瘤免疫學\r - 免疫學的臨床應用\r  简体 - 免疫系统的概述\r - 抗原及免疫原的性质\r - 淋巴组织与免疫细胞\r - 免疫球蛋白的结构与功能\r - 抗体多样性\r - 主要组织相容性复合体\r - T细胞和T细胞受体\r - 免疫应答的综合性\r - 免疫耐受\r - 补体系统\r - 细胞因子在健康与疾病\r - 抵抗微生物的免疫力\r - 新出现和重现的传染病\r - 免疫缺陷和爱滋病\r - 过敏与超敏反应\r - 移植免疫学\r - 肿瘤免疫学\r - 免疫学的临床应用", "required_readings": "Readings recommended by teachers.", "recommended_readings": "1. Kindt, Goldsby & Osborne (2007) Kuby Immunology (6th Ed.) Freeman (QW504.K53 2007).\r 2. Coico & Sunshine (2009) Immunology: A Short Course (6th Ed.) Wiley-Blackwell (QW504.B35 2009).\r 3. Elgert (2009) Immunology: Understanding the Immune System (2nd Ed.) Wiley-Blackwell (QW504.E54 2009).\r 4. Male (2006) Immunology, (6th Ed.) Mosby. (QW504.R65 2006).\r 5. Murphy et al. (2008) Janeway’s Immunobiology (7th Ed.) Garland Science. (QW504.J37 2008).", "terms": {"2020-21 Term 1": {"--LEC (6231)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "11:15"], "days": [3, 5], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Dr. PANG Kok Shuen, \n\rProfessor KONG Siu Kai", "Dr. PANG Kok Shuen, \n\rProfessor KONG Siu Kai"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12", "11/9", "18/9", "25/9"]}}, "2021-22 Term 1": {"--LEC (5030)": {"startTimes": ["10:30", "10:30"], "endTimes": ["11:15", "12:15"], "days": [5, 3], "locations": ["Lee Shau Kee Building LT1", "Science Centre L2"], "instructors": ["Dr. PANG Kok Shuen, \n\rProfessor KONG Siu Kai", "Dr. PANG Kok Shuen, \n\rProfessor KONG Siu Kai"], "meetingDates": ["10/9", "17/9", "24/9", "8/9", "15/9"]}}}, "assessments": {"Essay test or exam": "25", "Short answer test or exam": "35", "Selected response test or exam": "40"}}, {"code": "4070", "title": "Management and Accreditation of Biochemical Laboratory", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "Not for students who have taken BBMS6300. Pre-requisite: BCHE2030 or permission of instructor.", "description": "This course is to prepare our students with the necessary knowledge and skills for career development and to meet the future demands in the biomedical industries. Core knowledge such as basic concepts and skills of laboratory management, safety and quality assurance in biochemical laboratories will be introduced. Special topics in biochemical testing, manufacturing process, good laboratory practice, laboratory accreditation, and validation of experimental protocols and methods will also be discussed. Part of the class will be taught with MSc students under different course code and assessment scheme.\r", "outcome": "After completing the course, students should be able to:\r 1. understand the concepts of laboratory management; 2. acquire adequate skills of laboratory management; 3. understand quality assurance and execute safety requirements in biochemical laboratories; 4. understand the requirements of good laboratory practice, laboratory accreditation, and validation of experimental protocols and methods.\r  By the end of the course, students will be able to appreciate and apply the knowledge and skills for biochemical laboratory management and understand the requirements of good laboratory practice, laboratory accreditation and method validation.\r   完成本科後，學生將能夠：  1.了解實驗室管理的概念；\r 2. 獲得管理實驗室的能力；\r 3.了解和執行生化實驗室安全和質量保證的需要；\r 4.了解良好實驗室規範，實驗室認可和實驗方案和方法驗證的要求。\r  在本科結束後，學生將能夠欣賞和應用生化實驗室管理的知識和技能，了解良好實驗室規範，實驗室認可和方法驗證等要求。   完成本科后，学生将能够： 1.了解实验室管理的概念；\r 2.获得管理实验室的能力；\r 3.了解和执行生化实验室安全和质量保证的需要；\r 4.了解良好实验室规范，实验室认可和实验方案和方法验证的要求。\r  在本科结束后，学生将能够欣赏和应用生化实验室管理的知识和技能，了解良好实验室规范，实验室认可和方法验证等要求。", "syllabus": "1. Clinical Laboratory Sciences and Practice; 2. Quality Assurance in Clinical Laboratory; 3. Quality Programs for Forensic DNA Laboratory; 4. Good Laboratory Practice (GLP); 5. Good Manufacturing Practice (GMP); 6. Accreditation and Laboratory Quality Management System; 7. Accreditation Program of AAALAC International for Care and Use of Laboratory Animals; 8. Issues of Intellectual Properties.\r   1. 臨牀實驗室科學與實踐；\r 2. 臨牀實驗室質量保證；\r 3. 法醫DNA實驗室質量計劃；\r 4. 良好實驗室規範（GLP）；\r 5. 良好生產規範（GMP）；\r 6. 認證和實驗室質量管理體系；\r 7. 國際AAALAC認證方案，實驗動物的使用和護理； \r 8. 知識產權問題。\r   1. 临牀实验室科学与实践；\r 2. 临牀实验室质量保证；\r 3. 法医DNA实验室质量计划；\r 4. 良好实验室规范（GLP）；\r 5. 良好生产规范（GMP）；\r 6. 认证和实验室质量管理体系；\r 7. 国际AAALAC认证方案，实验动物的使用和护理；\r 8. 知识产权问题。", "required_readings": "Recommended by individual teachers.", "recommended_readings": "1. Book: Laboratory management: quality in laboratory diagnosis. Candis A. Kinkus. New York: Demos Medical, 2012.\r 2. Book Chapter: KC Tsimillis, S Michael (2015) Quality Management and Quality Assurance in Medical Laboratories, Laboratory Management Information Systems: Current Requirements and Future Perspectives, Chapter 8, 136-153. Hershey, Pennsylvania.", "terms": {"2020-21 Term 2": {"--LEC (7321)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [6], "locations": ["Online Teaching"], "instructors": ["Dr WONG Yuen Ting, \n\rDr. YEUNG Hiu Yan, \n\rProfessor CHO Chi Shing, \n\rProfessor LAU Kwok Fai, \n\rProfessor YEUNG Shu Ying"], "meetingDates": ["16/1", "23/1", "30/1", "6/2"]}}, "2021-22 Term 2": {"--LEC (4493)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [6], "locations": ["Yasumoto Int'l Acad Park LT2"], "instructors": ["Dr WONG Yuen Ting, \n\rDr. YEUNG Hiu Yan, \n\rProfessor CHO Chi Shing, \n\rProfessor LAU Kwok Fai, \n\rProfessor YEUNG Shu Ying"], "meetingDates": ["15/1", "22/1", "29/1"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "30", "Short answer test or exam": "50"}}, {"code": "4080", "title": "Biochemistry for Forensic Sciences", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "Pre-requisite: BCHE2030 or permission of instructor.", "description": "This course aims at introducing various biochemical principles and techniques for forensic analysis to the students. Students will learn how to observe, collect, analyze and evaluate evidence found at crime scenes. The first part addresses the identification of biological fluids such as blood, semen, and saliva from crime scene. The emphasis will be on the biochemical technologies used in the presumptive and confirmatory tests. The second part covers DNA analysis using RFLP and PCR-STR typing methods, interpretation of DNA typing results, and court presentation of such biological evidence. Mitochondrial DNA typing and Y chromosome DNA typing will also be discussed. It is anticipated that students will apply the biochemistry knowledge they have acquired in junior years in the course. In addition to the core academic knowledge, various in-class activities will also be integrated for students to appreciate the importance and to apply the knowledge they have learnt in class. Teaching takes place in the evening. Part of the class will be taught with MSc students under different course code and assessment scheme.\r", "outcome": "After finishing this course, students will be able to: \r - Develop an understanding of the concept and theory of forensic analysis.\r - Understand the analytical techniques involved. \r - Discuss the application of forensic science to crime detection.\r - Develop practical skills in problem solving, teamwork, and life-long learning.\r  繁體 完成本課程後，學生將能夠： - 拓展對科學鑑證的理論分析和概念理解\r - 了解科學鑑證的分析技術\r - 應用科學鑑證幫助偵查罪案\r - 制定解決問題的實際技能，樹立團隊精神和學會終身學習的技巧\r  简体 完成本课程后，学生将能够： - 拓展对科学鉴证的理论分析和概念理解\r - 了解科学鉴证的分析技术\r - 应用科学鉴证帮助侦查罪案\r - 制定解决问题的实际技能，树立团队精神和学会终身学习的技巧", "syllabus": "Introduction to the forensic sciences\r Forensics work flow (collection, examination, analysis, reporting)\r Evidence sampling, storage, handling and analysis techniques\r Forensic serology\r DNA and DNA fingerprinting\r Evidence documentation\r  繁體 科學鑑證導論 科學鑑證的流程 (證據收集，審查，分析與報告)\r 證據採樣，存儲，處理和分析技術 科學鑑證血清學 DNA和DNA指紋技術\r 證據文件儲存  简体 科学鉴证导论 科学鉴证的流程 (证据收集，审查，分析与报告)\r 证据采样，存储，处理和分析技术 科学鉴证血清学 DNA和DNA指纹技术\r 证据文件储存", "required_readings": "", "recommended_readings": "Forensic DNA Typing: Biology, Technology, and Genetics of STR Markers, John M. Butler, 2nd Edition. Academic Press.", "terms": {"2020-21 Term 1": {"--LEC (5447)": {"startTimes": ["14:30", "18:30"], "endTimes": ["16:15", "21:15"], "days": [3, 5], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Mr. WONG Dart Man, \n\rProfessor LAU Kwok Fai", "Mr. WONG Dart Man, \n\rProfessor LAU Kwok Fai"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11", "4/12"]}}, "2021-22 Term 1": {"--LEC (8882)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [5], "locations": ["Yasumoto Int'l Acad Park LT2"], "instructors": ["Mr. WONG Dart Man, \n\rProfessor LAU Kwok Fai"], "meetingDates": ["10/9", "17/9", "24/9"]}}}, "assessments": {"Essays": "10", "Essay test or exam": "50", "Short answer test or exam": "40"}}, {"code": "4090", "title": "Biochemistry for Sport and Exercise", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "", "description": "This course aims at introducing various biochemical aspects of sports and physical activities of human beings to the students. The course will cover fundamental sports physiology and basic anatomy; major proportion of the lectures will be dedicated to designated topics related to the biochemical aspects of sports and physical activities, such as energy utilization, neuro-muscular control, nutrition and fat cell biochemistry, fatigue and recovery, traumas and therapeutics, principles of doping, etc. Lectures will be supplemented with discussions and presentations.\r", "outcome": "- Master the fundamental sports physiology and anatomy;- Comprehend the basic knowledge of the selected topics of sports biochemistry;- Recognize, analyze, and comment on the relationship between biochemistry and sports science;- Develop practical skills in goal-setting, problem-solving, team-work, and communication skills through different types of learning activities;- Gain learning methodologies that promote life-long learning in biochemistry and other related disciplines.繁體- 掌握基本的運動生理學和解剖學；- 理解與運動生物化學相關的各科知識理論；- 明白，分析及評論生物化學和運動科學在理論上和應用上的關係；- 透過各類型的學習活動，培訓制定目標、解决難題，團隊合作和溝通技巧等重要的個人能力素質；- 領略終身學習之重要性及發展其相關方法。簡體- 掌握基本的运动生理学和解剖学；- 理解与运动生物化学相关的各科知识理论；- 明白，分析及评论生物化学和运动科学在理论上和应用上的关系；- 透过各类型的学习活动，培训制定目标、解决难题，团队合作和沟通技巧等重要的个人能力素质；- 领略终身学习之重要性及发展其相关方法。", "syllabus": "- Introduction to muscle and skeleton physiology and anatomy;- Introduction to basic neuro-muscular control for motion and proprioceptor;- Biochemistry of bone, soft tissues, and muscle;- Energy generation and utilization;- Biology and biochemistry of fat cells;- Introduction to the cardiovascular system and blood;- Biochemistry of heart beat and blood pressure control;- Biochemical principles of physical training;- Endocrine effect of sports on sports activities;- Biochemical principles of doping;- Ischemia, inflammation, spasm, and micro-traumas in sports conditions;- Biochemical principles of sports traumas and therapeutics;- Biochemical basis of fatigue and recovery;- Biochemical basis of the exercises prescribed for disease populations.繁體基本肌肉及骨骼生理學和解剖學；運動神經肌肉控制和本體感受器；骨骼，軟組織和肌肉的生物化學；能量釋放及利用；脂肪細胞生物學及生物化學；血液和心血管系統；心跳和血壓的生物化學；生物化學與體能訓練；運動與內分泌系統；藥檢的生化原理；運動時出現的缺血，炎症，痙攣，微創傷等狀況的生物化學；運動創傷和治療的生化原理；疲勞與復元的生化原理；為病患者設計的運動的生化基礎。簡體基本肌肉及骨骼生理学和解剖学；运动神经肌肉控制和本体感受器；骨骼，软组织和肌肉的生物化学；能量释放及利用；脂肪细胞生物学及生物化学；血液和心血管系统；心跳和血压的生物化学；生物化学与体能训练；运动与内分泌系统；药检的生化原理；运动时出现的缺血，炎症，痉挛，微创伤等状况的生物化学；运动创伤和治疗的生化原理；疲劳与复元的生化原理；为病患者设计的运动的生化基础。", "required_readings": "-", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (4693)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Y.C. Liang Hall G04"], "instructors": ["Dr. LO Fai Hang"], "meetingDates": ["15/1", "22/1", "29/1", "5/2"]}}, "2021-22 Term 2": {"--LEC (7413)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Mong Man Wai Bldg 704"], "instructors": ["Dr. LO Fai Hang"], "meetingDates": ["14/1", "21/1", "28/1"]}}}, "assessments": {"Homework or assignment": "30", "Presentation": "10", "Participation": "10", "Short answer test or exam": "50"}}, {"code": "4130", "title": "Molecular Endocrinology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "-", "description": "This course describes the chemical structures and biological functions of hormones in vertebrates with special emphasis on human subjects. The evolution of hormonal regulation in vertebrates, as compared with neural control, will be discussed. The organization and operation of different hypothalamus-pituitary-peripheral endocrine gland axes will be discussed. Emphasis will be placed on the molecular aspects of endocrine action. Current advances in molecular endocrinology techniques will be introduced. Students are advised to take BCHE2030 or equivalent before taking this course.\r", "outcome": "    After completing the course, students should be able to:     After completing the course, students should be able to: 1.      understand the homeostatic controls in our body using the endocrine system; 2.      understand how polypeptide hormones and lipid soluble hormones act on their target cells to activate various intracellular signalling pathways; 3.      understand the concepts of hormonal control via feedback mechanisms; 4.      understand the etiology and diagnosis of diseases from hormone defects, such as gigantism and Cushing Syndrome.   By the end of the course, students will be able to appreciate the complexes of hormonal control of growth, metabolism, reproduction and development.   Objectives for students development: 1.      students will be able to understand the special terms in endocrine systems and hormone, so that they will be able to read papers or journal articles in the area of endocrinology and molecular endocrinology; 2.      students will be able to understand how we may design experiments to examine the functions and actions of hormones; and 3.      students be able to work with peers to discuss and understand the basic mechanisms and actions of hormones in our endocrine system.   Objectives of the course:   Objectives of this course are to elaborate the chemical structures and biological functions of hormones in vertebrates with special emphasis on human subjects to life science students in their senior years. The organization and operation of different hypothalamus-pituitary-peripheral endocrine gland axes will be discussed. Basic concepts of molecular actions of hormones are also covered. Students are expected to work as group for studying and learn how to read simple journal articles.      ", "syllabus": "1. Mechanisms of Hormone Action 2. Signaling, Neuro-endocrine System and Methodologies 3. Hypothalamic and Pituitary Hormones 4. Steroidogenesis 5. Actions of Adrenal Steroid Hormones 6. Pancreatic Hormone 7. Diabete Mellitus 8. Hormonal Control of Sex Differentiation and Reproduction 9. Male & Female Reproductive Physiology: Pregnancy, Parturition and Lactation 10. Growth hormone, Prolactin, and their Receptors 11. Hypothalamic-Pituitary-IGF Axis 12. Sympathoadrenal Systems and Catecholamines 13. Hypothalamic-Pituitary-Thyroid Axis 14. Thyroid Actions, Goiter and Graves Disease 15. Calcium Homeostasis and Mineralization 16. Bone Metabolism and Therapies for Disease of Calcium Homeostasis 17. Bone Metabolism: Vitamin D and Therapies for diseases of calcium homeostasis 18. Gastrointestinal Hormones: Evolution and Pathophysiology 19. Posterior Pituitary Hormones and Blood Pressure Control 20. Melatonin and the Pineal Gland: Myths and Facts", "required_readings": "    Textbook     Textbook Hadley, ME & Levine, JE (2007). Endocrinology, 6th Edition. Upper Saddle River, N.J., 500 p. (WK100. H17 2007)      ", "recommended_readings": "    References     References Greenspan, FS & Shoback, DM (2007). Basic and Clinical Endocrinology, 8th Edition. McGraw Hill, New York, 1025 p. Kronenberg, HM. (Editor) (2008). Williams Textbook of Endocrinology, 11th Edition. Elsevier Saunders, 1927 p. (WK100. T49 2008)   Web http://www.endocrineweb.com/whatisendo.html   Youtube Introduction 1 (Brain and Hypothalamus, e.g. TRH and TSH):  http://www.youtube.com/watch?v=g1U_HNi7sDU   Youtube Introduction 2 (Endocrine System and Hormone Actions, e.g. Thyroid Actions):  http://www.youtube.com/watch?v=hLeBNyB1qKU&feature=related   Youtube Intorduction 3 (endocrine Syetem and Hormones):  http://www.youtube.com/watch?v=1IQQPtyE7Lc    ", "terms": {"2021-22 Term 2": {"--LEC (4390)": {"startTimes": ["16:30", "13:30"], "endTimes": ["18:15", "14:15"], "days": [2, 4], "locations": ["Mong Man Wai Bldg 707", "Mong Man Wai Bldg 707"], "instructors": ["Dr. LO Fai Hang, \n\rProfessor LAU Wilson Chun Yu", "Dr. LO Fai Hang, \n\rProfessor LAU Wilson Chun Yu"], "meetingDates": ["11/1", "18/1", "25/1", "13/1", "20/1", "27/1"]}}}, "assessments": {"Essays": "40", "Essay test or exam": "40", "Short answer test or exam": "20"}}, {"code": "4640", "title": "Aspects of Neuroscience Laboratory", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "", "description": "This course consists of a set of experiments to illustrate various biochemical techniques for the study of neurochemistry. Students are advised to take the lecture course BCHE4040 simultaneously.\r", "outcome": "1. Comprehend the basic knowledge and laboratory skills in neuronal cell biology and neurological diagnosis;2. Recognize how various aspects of neuroscience are important that benefit our daily life;3. Recognize, analyze, and comment on the scientific and ethical issues of certain topics of neuroscience;4. Develop practical skills in problem-solving and communication through different types of learning activities;5. Gain learning methodologies that promote life-long learning in neuroscience and other life science-related discipline.繁體1. 學習神經細胞生物學以及診斷中樞神經系統疾病的生物化學原理和實驗；2. 了解神經科學對日常生活的重要性；3. 了解，分析和評論一些關於神經科學的學術和道德的議題；4. 學習解決難題以及溝通的技巧；5. 培養終身學習的習慣。简体1. 学习神经细胞生物学以及诊断中枢神经系统疾病的生物化学原理和实验；2. 了解神经科学对日常生活的重要性；3. 了解，分析和评论一些关于神经科学的学术和道德的议题；4. 学习解决难题以及沟通的技巧；5. 培养终身学习的习惯。", "syllabus": "1. Knowledge-oriented sessions-It contains briefing/tutorial sessions, in which the core knowledge of relevant scientific knowledge of neuroscience will be presented;2. Research-orientated sessions-It contains a series of research practical sessions, in which students will receive training in the basic techniques in neuronal cell research.3. Application-oriented sessions-It contains a series of advanced practical sessions, in which students will be introduced with some techniques for the biochemical analysis of suspected neurological disorders.4. Student-centred learning-Students will form groups to investigate a specific topic related to various aspects of neuroscience; at the end of the course, the students will present orally their findings.繁體1. 知識為本學習本部分將透過小組討論等形式教授神經科學中與課程相關的基礎知識；2. 神經科學基礎實驗本部分將訓練學生有關神經細胞的基礎實驗技巧；3. 神經科學基礎實驗本部分將讓學生學習診斷中樞神經系統疾病的生物化學原理和實驗；4. 學生為本學習本部分學生將分組作專題探討並於學期終就研究成果作口頭報告。简体1. 知识为本学习本部分将透过小组讨论等形式教授神经科学中与课程相关的基础知识；2. 神经科学基础实验本部分将训练学生有关神经细胞的基础实验技巧；3. 神经科学基础实验本部分将让学生学习诊断中枢神经系统疾病的生物化学原理和实验；4. 学生为本学习本部分学生将分组作专题探讨并于学期终就研究成果作口头报告。", "required_readings": "Laboratory Diagnosis in Neurology (Brigitte Wildemann et al) WL141.N38 (2010).", "recommended_readings": "Lung HL, Leung KN, Stadlin A, Ma CM, Tsang D. (2001): Induction of tumor necrosis factor receptor type 2 gene expression by tumor necrosis factor-alpha in rat primary astrocytes. Life Sci. 23;68(18):2081-91.G.J. Siegel et al (Eds.). Basic neurochemistry, 7th edn., Raven, NY, 2006. 7. Eric R. Kandel et al. Principles of neural science, 4th ed. McGraw-Hill, NY, Health Professions Division, 2000.Yang CM, Luo SF, Wang CC, Chiu CT, Chien CS, Lin CC, Hsiao LD.(2000): Tumour necrosis factor-alpha- and interleukin-1beta-stimulated cell proliferation through activation of mitogen-activated protein kinase in canine tracheal smooth muscle cells. Br J Pharmacol.;130(4):891-9.Jurisic V, Bogdanovic G, Kojic V, Jakimov D, Srdic T. (2006): Effect of TNF alpha on Raji cells at different cellular levels estimated by various methods. Ann Hematol.85(2):86-94.A.P.Falkensammer C, Johrer K, Gander H, Ramoner R, Putz T, Rahm A, Greil R, Bartsch G, Thurnher M. (2006): IL-4 inhibits the TNF-alpha induced proliferation of renal cell carcinoma (RCC) and cooperates with TNF-alpha to induce apoptotic and cytokine responses by RCC: implications for antitumor immune responses.Cancer Immunol Immunother. 55: 1228-1237.  Luo JC, Shin VY, Yang YH, Wu WK, Ye YN, So WH, Chang FY, Cho CH.(2005): Tumor necrosis factor-alpha stimulates gastric epithelial cell proliferation. Am J Physiol Gastrointest Liver Physiol.;288(1):G32-8. Epub 2004 Jul 15.", "terms": {"2020-21 Term 1": {"-L01-LAB (7166)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Science Centre 190"], "instructors": ["Dr. LO Fai Hang"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}}, "2021-22 Term 1": {"-L01-LAB (6755)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Science Centre 190"], "instructors": ["Dr. LO Fai Hang"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}, "assessments": {"Lab reports": "25", "Presentation": "25", "Participation": "10", "Selected response test or exam": "40"}}, {"code": "4760", "title": "Immunology and Haematology Laboratory", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "Not for students who have taken BCHE4660.", "description": "This laboratory course serves to provide students with basic training in immunological and haematological techniques at both the molecular and cellular levels. Various aspects and practical applications of the methodology in immunochemistry, cellular immunology and molecular immunology will be illustrated. Students are advised to take the lecture course BCHE4060 simultaneously. This course is similar to the BCHE4660 Basic and Applied Immunology Laboratory offered in 2014 or before.\r", "outcome": "After completing the course, students should be able to:- Understand the role and features of our immune and blood system;- Understand the principles of the innate and acquired immunity;- Appreciate the complexes of control and regulation of immune response;- Understand the relationship of immunology and haematology to clinical problems;- Appreciate the applications of immunology and haematology to modern medicine and biotechnology;- Develop skills in the critical evaluation of immunology and haematology research and theories;- Acquired competence and generic skills such as written and oral communication of immunology, haematology and critical thinking and analysis in the preparation of laboratory reports.完成本課程後，學生應該能夠：- 了解免疫系統和血液系統的特點；- 理解免疫系統的綜合性；- 了解抗體的多樣性，免疫反應，自我寬容和免疫系統疾病的分子基礎；- 欣賞免疫系統和血液系統在生物技術及日常生活的應用；- 發展在免疫學和血液學研究和理論的批判技能；- 獲得書面和口頭的溝通技巧，具備分析免疫學和血液學化驗報告批判思維的能力。完成本课程后，学生应该能够：- 了解免疫系统和血液系统的特点；- 理解免疫系统的综合性；- 了解抗体的多样性，免疫反应，自我宽容和免疫系统疾病的分子基础；- 欣赏免疫系统和血液系统在生物技术及日常生活的应用；- 发展在免疫学和血液学研究和理论的批判技能；- 获得书面和口头的沟通技巧，具备分析免疫学和血液学化验报告批判思维的能力。", "syllabus": "- Understand the principle, control and regulation of immune and haematological system. - Understand the relationship of immunology and haematology to clinical problems thought lab tutorial. - Presentation on immunological and haematological techniques.- 了解免疫系統和血液系統的特點、控制及調節；- 透過導修課理解免疫系統和血液系統疾病；- 進行免疫和血液技術簡佈。- 了解免疫系统和血液系统的特点、控制及调节；- 透过导修课理解免疫系统和血液系统疾病；- 進行免疫和血液技术简布。", "required_readings": "Readings recommended by teachers.", "recommended_readings": "www.protocol-online.org/prot/Molecular_Biology/Protein/Protein_Electrophoresis/SDS-PAGE/ Hudson L & Hay FC (2002) “Antibody interaction with Antigen” in Practical Immunology. Blackwell, pp. 207-263. Hudson L & Hay FC (2002) “Immunoassay” in Practical Immunology. Blackwell, pp. 342-352. Widmann, F. K. and Itatani, C. A. (1998) An Introduction to Clinical Immunology and Serology (2nd ed.) F. A. Davis Co., Chapter 19, p. 421-432. Haematology / Gary W. Moore, Gavin Knight, Andrew D. Blann , Gary Moore Dr. Gavin Knight Dr.; Andrew D Blann. Oxford ; New York : Oxford University Press 2010.", "terms": {"2020-21 Term 1": {"-L01-LAB (7168)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Science Centre 188"], "instructors": ["Dr. LO Fai Hang"], "meetingDates": ["10/9", "17/9", "24/9"]}}, "2021-22 Term 1": {"-L01-LAB (6853)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Science Centre 190"], "instructors": ["Dr. LO Fai Hang"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Essay test or exam": "25", "Lab reports": "30", "Presentation": "25", "Participation": "10", "Short answer test or exam": "10"}}, {"code": "4830", "title": "Medical Biochemistry Laboratory", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "", "description": "This course aims at introducing the principles and applications of medical biochemistry. In addition to theories, diagnostic tests for various biochemical parameters in different specimens; as well as the typical techniques of diagnostic microbiology will also be covered.", "outcome": "After completing the course, students should be able to understand the relationship of clinical biochemistry to clinical problems and to appreciate the applications of clinical biochemistry to modern medicine; Students will acquire basic techniques related to diagnostic microbiology; Students will acquire competence and generic skills such as the critical thinking and analytical in medical biochemistry. 完成課程後，學生將能理解醫學生物化學和臨床問題之間的關係；他們更能從而體會到醫學生物化學在現代醫學中的應用。 學生能學習與診斷微生物學有關的基本技術； 學生亦將發展在醫學生物化學中的批判性思維和分析能力。 完成课程后，学生将能理解医学生物化学和临床问题之间的关系；他们更能从而体会到医学生物化学在现代医学中的应用。 学生能学习与诊断微生物学有关的基本技术； 学生亦将发展在医学生物化学中的批判性思维和分析能力。", "syllabus": "1. Diabetes Mellitus2. Liver Functions3. Urinalysis4. Hypogonadism5. Diagnostic microbiology 1. 糖尿病2. 肝功能3. 尿液分析4. 性腺功能低下症5. 診斷微生物學 1. 糖尿病2. 肝功能3. 尿液分析4. 性腺功能低下症5. 诊断微生物学", "required_readings": "1. Zilva, Pannall and Mayne.(1994). Carbohydrate metabolism. Clinical Chemistry in diagnosis and treatment. Edward Arnold, pp.195-222.2. Anderson and Cockayne. (1993). Carbohydrates. Clinical Chemistry, Concept and Application. W.B. Saunders Company, pp.139-162.3. Philp D. Mayne. (1994). Alkaline Phosphatase. Clinical Chemistry in diagnosis and treatment. Edward Arnold, pp. 306-307.4. Hadley M.E., Levine J.E. Endocrinology, 6th ed., New ed., Upper Saddle River, NJ : Pearson Prentice Hall, 2007.5. DeGroot L.J., Jameson J.L. Endocrinology, 5th ed., Philadelphia : Elsevier Saunders, 20066. Mahon C.R. and Lehman D.C. Textbook of diagnostic microbiology, 6th ed., St. Louis, Missouri : Elsevier Saunders, 2019.", "recommended_readings": "1. Davies MJ, Gray IP. (1996). Impaired glucose tolerance. Bristish Medical Journal. 312(7026), 264-265.2. Weinger KMS, Jacobson AM, Draelos MT, Finkelstein DM, Simonson DC. (1995). Blood glucose estimation and symptoms during hyperglycemia and hypoglycemia in patients with insulin-dependent diabetes mellitus. American Journal of Medicine. 98(1), 22-31.3. Ter Borg F, Ten Kate FJW. (1998). Relation between laboratory test results and histological hepatitis activity in indiniduals positive for hepatitis B surface antigen and antibodies to hepatitis B e antigen. Lancet. 351(9120), 1914.4. Badur S, Grangeot-Keros L, Pillot J. (1992). HbsAg in urine: a new approach for the detection of urinary antigens. Clin. Exp. Immunol. 87, 298-303.5. Kennedy RC, Ionescu Matiu I, Adler Storthz K, Henkel RD, Sanchez Y, Dreesman GR. (1983). Characterization of anti-hepatitis B surface antigen monoclonal antibodies. Intervirology . 19, 176-180.6. Robert Wel, George J. Knlght, Danlel H. Zlmmerman, Howard E. Bond. (1977). Solid-phase enzyme immunoassay for hapatitis B surface antigen. Clin. Chem. 23(5), 813-815.7. Whitehead MW, Hawkes ND, Hainsworth I, Kingham JGC. (1999). A prospective study of the causes of notably raised aspartate aminotransferase of liver origin. Gut. 45, 129-133.8. International Federation of Clinical Chemistry (IFCC). (1986). IFCC Method for alanine aminotransferase. J. Clin. Chem. Clin. Biochem. 24, 481-495.9. International Federation of Clinical Chemistry (IFCC). (1986). IFCC Method for aspartate aminotransferase. J. Clin. Chem. Clin. Biochem. 24, 497-510.10. Bhutani VK, Johnson L, Sivieri EM. (1999). Preditive ability of a predischarge hour-specific serum bilirubin for subsequent significant hyperbilirubinemia in healthy term and near-term newborns. Pediatrics. 103(1), 6-14.11. Kuroki S, Okamoto S, Kosahara K, Kishinaka M, Yamashita H, Ichimiya H, Chijiiwa KOH. (1994). Effect of bilirubin drainage on serum 7*-hydroxycholesterol level in patients with obstructive jaundice. J. Surg. Res. 57, 352-359.12. Freemantle J, Freemantle MJ, Badrick T. (1994). Ascorbate interference in common clinical assays performed on three analyzers. Clin. Chem. 40, 950-951.13. Moshkin AV. (1994). Bilirubin and risk of coronary artery disease. Clin. Chem. 40, 1600. 14. Vink KL, Schuurman W, Van Gansewinkel R. (1986). Use of the caffeine reagent in direct spectrophotometry of bilirubin. Clin. Chem. 32, 1389-93.15. Lenton EA, Neal LM, Sulaiman R. (1982) Plasma concentrations of human chorionic gonadotropin from the time of implantation until the second week of pregnancy. Fertil Steril. 37, 773-778.16. Braunstein GD, Rasor J, Adler D, Danzer H, Wade ME. (1976) Serum human chorionic gonadotropin levels throughout normal pregnancy. Am J Obstet Gynecol 126, 678-681.17. Braunstein GD, Vaitukaitis JL, Carbone PP, Ross GT. (1973) Ectopic production of human chorionic gonadotrophin by neoplasms. Ann Intern Med. 78, 39-45.18. Diez M, Cerdan FJ, Pollan M, Maestro ML, Ortega MD, Martinez S, Moreno G, Balibrea JL. (1994). Prognostic significance of preoperative serum CA 19.9 assay in patients with colorectal carcinoma. Anticancer Res. 14, 2819-25.19. Nakane Y, Okamura S, Akehira K, Boku T, Okusa T, Tanaka K, Hioki K. (1994). Correlation of preoperative carcinoembryonic antigen levels and prognosis of gastric cancer patients. Cancer. 73, 2703-8.20. Staab HJ, Anderer FA, Brummendorf T, Stumpf E, Fischer R. (1981). Prognostic value of preoperative serum CEA level compared to clinical staging. I. colorectal carcinoma. Br. J. Cancer. 44, 652-62.", "terms": {"2020-21 Term 2": {"-L01-LAB (6694)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Science Ctr East Block E402"], "instructors": ["Dr. LO Fai Hang"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}}, "2021-22 Term 2": {"-L01-LAB (6411)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Science Ctr East Block E402"], "instructors": ["Dr. LO Fai Hang"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Essay test or exam": "20", "Lab reports": "50", "Participation": "10", "Short answer test or exam": "20"}}, {"code": "4901", "title": "Senior Experimental Project I", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "Not for students who have taken BCHE4910. Pre-requisite: BCHE3090 or BCHE3092.", "description": "In this course, students carry out an independent laboratory research project either provided by the supervisor or jointly decided with the student. To fulfill the course requirement, students are required to discuss their progress with their supervisors regularly and submit a research proposal.\r", "outcome": "Students taken this course are expected to develop the following abilities: 1. Integrate the knowledge and skills learnt previously in other courses 2. Survey scientific literature relevant to their research project 3. Read scientific literature critically to identify the scientific questions or problems 4. Design independent research project to address the scientific questions 5. Acquire hands-on research techniques in conducting experiments 6. Develop problem-solving abilities 7. Improve skills in writing scientific proposal 8. Develop a sense of responsibility and term spirit  繁體 學生將會發展以下能力： 1, 應用在課堂中獲得的知識及技能 2. 搜尋文獻的技巧 3. 具批判性思維閱讀及分析文獻的內容，並認知及思考當中的科學問題 4. 就自己的專題研究題目，設計實驗去解說科學問題 5. 各式實驗的操作能力 6. 解決問題的能力 7. 書寫研究計劃報告的能力 8. 有責任感及團體精神  简体 学生将会发展以下能力： 1, 应用在课堂中获得的知识及技能 2. 搜寻文献的技巧 3. 具批判性思维阅读及分析文献的内容，并认知及思考当中的科学问题 4. 就自己的专题研究题目，设计实验去解说科学问题 5. 各式实验的操作能力 6. 解决问题的能力 7. 书写研究计划报告的能力 8. 有责任感及团体精神", "syllabus": "The students should take the initiative to discuss with their supervisors and compromise a topic for the independent research project. The students should first survey the background of their research project and identify the scientific questions they want to address. The students then design and perform the experiments for this project under the guidance of the supervisors and submit a research proposal in the term end.  繁體 學生要於學期開始前主動聯絡教授，並訂出研究課題。學生就該研究課題搜尋相關文獻，並確定研究方向。學生要設計實驗，進行研究，並於學期結束前遞交一份研究計劃。  简体 学生要于学期开始前主动联络教授，并订出研究课题。学生就该研究课题搜寻相关文献，并确定研究方向。学生要设计实验，进行研究，并于学期结束前递交一份研究计划。", "required_readings": "Relevant reference materials will be provided by the supervisor.", "recommended_readings": "Relevant reference materials will be provided by the supervisor.", "terms": {"2020-21 Summer Session": {"-J01-PRJ (1341)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LO Fai Hang, \n\rDr. NGAI Hung Kui, \n\rProfessor NGAI Sai Ming"], "meetingDates": ["18/05/2021 - 29/06/2021"]}}}, "assessments": {"Essays": "40", "Others": "60"}}, {"code": "4902", "title": "Senior Experimental Project II", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "Not for students who have taken BCHE4910. Pre-requisite: BCHE3090 or BCHE3092.", "description": "Students are required to discuss their progress with their supervisor(s) regularly and submit a progress report at the end of the term. For student who will not be enrolled in BCHE4903, a final report in the form of a manuscript and an oral presentation are assessed at the end of term for performance.\r", "outcome": "Students taken this course are expected to develop the following abilities: 1. Integrate the knowledge and skills learnt previously in other courses 2. Survey scientific literature relevant to their research project 3. Read scientific literature critically to identify the scientific questions or problems 4. Design independent research project to address the scientific questions 5. Acquire hands-on research techniques in conducting experiments 6. Develop problem-solving abilities 7. Develop data analysis and interpretation skills in logical and scientific ways 8. Improve skills in scientific writing and oral presentation 9. Develop a sense of responsibility and term spirit  繁體 學生將會發展以下能力： 1. 應用在課堂中獲得的知識及技能 2. 搜尋相關文獻的技巧 3. 具批判性思維閱讀及分析文獻的內容，並認知及思考當中的科學問題 4. 就自己的專題研究題目，設計實驗去解說科學問題 5. 各式實驗的操作能力 6. 解決問題的能力 7. 數據分析，並合乎邏輯性和具科學角度地表述出來 8. 書寫合符標準的科技論文及口頭報告的能力 9. 有責任感及團體精神  简体 学生将会发展以下能力： 1. 应用在课堂中获得的知识及技能 2. 搜寻相关文献的技巧 3. 具批判性思维阅读及分析文献的内容，并认知及思考当中的科学问题 4. 就自己的专题研究题目，设计实验去解说科学问题 5. 各式实验的操作能力 6. 解决问题的能力 7. 数据分析，并合乎逻辑性和具科学角度地表述出来 8. 书写合符标准的科技论文及口头报告的能力 9. 有责任感及团体精神", "syllabus": "The students should continue to work on the research project from BCHE4901. Students should discuss the progress with their supervisors and submit a progress report in the term end. If the students will not continue to work on the research project in BCHE4903, they should submit a final report in the form of manuscript and present orally in the term end.  繁體 學生就BCHE4901的研究課題繼續進行研究，並定期向教授匯報及討論研究所得的數據。於學期結束前遞交一份研究進展報告。如不修讀BCHE4903，學生須遞交一份書面報告及作口頭報告。  简体 学生就BCHE4901的研究课题继续进行研究，并定期向教授汇报及讨论研究所得的数据。于学期结束前递交一份研究进展报告。如不修读BCHE4903，学生须递交一份书面报告及作口头报告。", "required_readings": "Relevant reference materials will be provided by the supervisor.", "recommended_readings": "Relevant reference materials will be provided by the supervisor.", "terms": {"2020-21 Term 1": {"-J01-PRJ (4905)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LO Fai Hang, \n\rDr. NGAI Hung Kui, \n\rProfessor NGAI Sai Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2021-22 Term 1": {"-J01-PRJ (8071)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LO Fai Hang, \n\rDr. NGAI Hung Kui, \n\rProfessor NGAI Sai Ming"], "meetingDates": ["10/09/2021 - 03/12/2021"]}}}, "assessments": {"Essays": "50", "Others": "50"}}, {"code": "4903", "title": "Senior Experimental Project III", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "Not for students who have taken BCHE4910. Pre-requisite: BCHE3090 (or BCHE3092) & BCHE4902.", "description": "In this course, students continue to work on and finish up the research project from BCHE4902. Relevant data analysis and conclusion formulation are performed after discussion with supervisors. A final report in the form of a manuscript and an oral presentation are assessed at the end of term for performance.\r", "outcome": "Students taken this course are expected to develop the following abilities: 1. Integrate the knowledge and skills learnt previously in other courses 2. Survey scientific literature relevant to their research project 3. Read scientific literature critically to identify the scientific questions or problems 4. Design independent research project to address the scientific questions 5. Acquire hands-on research techniques in conducting experiments 6. Develop problem-solving abilities 7. Develop data analysis and interpretation skills in a logical and scientific ways 8. Improve skills in scientific writing and oral presentation 9. Develop a sense of responsibility and term spirit  繁體 學生將會發展以下能力： 1. 應用在課堂中獲得的知識及技能 2. 搜尋相關文獻的技巧 3. 具批判性思維閱讀及分析文獻的內容，並認知及思考當中的科學問題 4. 就自己的專題研究題目，設計實驗去解說科學問題 5. 各式實驗的操作能力 6. 解決問題的能力 7. 數據分析，並合乎邏輯性和具科學角度地表述出來 8. 書寫符合標準科技論文格式的書面報告及口頭報告的能力 9. 有責任感及團體精神  简体 学生将会发展以下能力： 1. 应用在课堂中获得的知识及技能 2. 搜寻相关文献的技巧 3. 具批判性思维阅读及分析文献的内容，并认知及思考当中的科学问题 4. 就自己的专题研究题目，设计实验去解说科学问题 5. 各式实验的操作能力 6. 解决问题的能力 7. 数据分析，并合乎逻辑性和具科学角度地表述出来 8. 书写符合标准科技论文格式的书面报告及口头报告的能力 9. 有责任感及团体精神", "syllabus": "The students should continue to work on the research project from BCHE4902. Students should discuss the progress with their supervisors and submit a final report in the form of manuscript and present orally in the term end.  繁體 學生就BCHE4902的研究課題繼續進行研究，並定期向教授匯報及討論研究所得的數據。於學期結束前遞交一份科技論文並作口頭報告。  简体 学生就BCHE4902的研究课题继续进行研究，并定期向教授汇报及讨论研究所得的数据。于学期结束前递交一份科技论文并作口头报告。", "required_readings": "Relevant reference materials will be provided by the supervisor.", "recommended_readings": "Relevant reference materials will be provided by the supervisor.", "terms": {"2020-21 Term 2": {"-J01-PRJ (8683)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LO Fai Hang, \n\rDr. NGAI Hung Kui, \n\rProfessor NGAI Sai Ming"], "meetingDates": ["12/01/2021 - 20/04/2021"]}}, "2021-22 Term 2": {"-J01-PRJ (7078)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LO Fai Hang, \n\rDr. NGAI Hung Kui, \n\rProfessor NGAI Sai Ming"], "meetingDates": ["14/01/2022 - 22/04/2022"]}}}, "assessments": {"Essays": "40", "Others": "20", "Presentation": "40"}}, {"code": "4910", "title": "Group Research in Biochemistry", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Biochemistry Pgm Comm", "requirements": "Not for students who have taken BCHE4902 or LSCI4000. Pre-requisite: BCHE3090 or BCHE3092.", "description": "This course is a capstone course consists of group projects to investigate the heated topics related to Biochemistry, such that students will be inspired by how Biochemistry has made its impact on the globalized knowledge-based society of Hong Kong. \r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5101", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Biochemistry", "description": "Students shall be required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in general biochemistry and in-depth knowledge in a particular field of biomedical sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (2379)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2380)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "5201", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Biochemistry", "description": "Students shall be required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in general biochemistry and in-depth knowledge in a particular field of biomedical sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (2376)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2381)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "5301", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Biochemistry", "description": "Students shall be required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in general biochemistry and in-depth knowledge in a particular field of biomedical sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (2350)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2403)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7101", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Biochemistry", "description": "Students shall be required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in general biochemistry and in-depth knowledge in a particular field of biomedical sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (2377)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2378)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7201", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Biochemistry", "description": "Students shall be required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in general biochemistry and in-depth knowledge in a particular field of biomedical sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (2349)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2375)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7301", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Biochemistry", "description": "Students shall be required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in general biochemistry and in-depth knowledge in a particular field of biomedical sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (2351)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2379)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-S01-SEM (2133)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-S01-SEM (2189)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7401", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Biochemistry", "description": "Students shall be required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in general biochemistry and in-depth knowledge in a particular field of biomedical sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (2352)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2444)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-S01-SEM (2134)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-S01-SEM (2292)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7501", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Biochemistry", "description": "Students shall be required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in general biochemistry and in-depth knowledge in a particular field of biomedical sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (2346)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2402)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-S01-SEM (2242)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-S01-SEM (2188)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7601", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Biochemistry", "description": "Students are required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in biochemistry and in-depth knowledge in a particular field of biochemical sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (2347)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2376)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-S01-SEM (2537)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-S01-SEM (2618)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7701", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Biochemistry", "description": "Students are required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in biochemistry and in-depth knowledge in a particular field of biochemical sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (2348)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2377)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-S01-SEM (2538)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-S01-SEM (2629)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "8003", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Biochemistry", "description": "In this course, a student is required to meet regularly with his/her supervisor who provides necessary guidance and supervision to write up a thesis and monitors the student’s academic progress.", "outcome": "Development of research skills, including field and/or laboratory studies and data analysis as related to the students' thesis research.", "syllabus": "-    Identify a research topic-    Develop a research hypothesis-    Prepare a research proposal-    Develop research methodology and experimental design-    Conduct an original research with impact in a specific field or subject-    Analyze experimental results and make appropriate data interpretation-    Prepare a research dissertation/thesis and related manuscripts for publication", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-M01-TMC (2987)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor CHAN Michael Kenneth, \n\rProfessor CHU Ka Hou, \n\rProfessor FONG Wing Ping, \n\rProfessor NGO Chi Ki Jacky, \n\rProfessor SHAW Pang Chui, \n\rProfessor WONG Kam Bo"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-M01-TMC (2373)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor CHAN Michael Kenneth, \n\rProfessor CHU Ka Hou, \n\rProfessor NGO Chi Ki Jacky, \n\rProfessor SHAW Pang Chui, \n\rProfessor WONG Kam Bo"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-M01-TMC (2245)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor CHAN Michael Kenneth, \n\rProfessor CHAN Ting Fung Philos, \n\rProfessor CHU Ka Hou, \n\rProfessor FONG Wing Ping, \n\rProfessor KANG Byung Ho, \n\rProfessor LAU Wilson Chun Yu, \n\rProfessor NGO Chi Ki Jacky, \n\rProfessor SHAW Pang Chui, \n\rProfessor WONG Kam Bo"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-M01-TMC (2660)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor CHAN Michael Kenneth, \n\rProfessor CHAN Ting Fung Philos, \n\rProfessor CHU Ka Hou, \n\rProfessor KANG Byung Ho, \n\rProfessor LAU Wilson Chun Yu, \n\rProfessor NGO Chi Ki Jacky, \n\rProfessor SHAW Pang Chui, \n\rProfessor WONG Kam Bo"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}}, {"code": "8006", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "6.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Biochemistry", "description": "In this course, a student is required to meet regularly with his/her supervisor who provides necessary guidance and supervision to write up a thesis and monitors the student’s academic progress.", "outcome": "Development of research skills, including field and/or laboratory studies and data analysis as related to the students' thesis research.", "syllabus": "-    Identify a research topic-    Develop a research hypothesis-    Prepare a research proposal-    Develop research methodology and experimental design-    Conduct an original research with impact in a specific field or subject-    Analyze experimental results and make appropriate data interpretation-    Prepare a research dissertation/thesis and related manuscripts for publication", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-M01-TMC (3515)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor CHAN Ho Yin Edwin, \n\rProfessor CHAN Michael Kenneth, \n\rProfessor CHAN Ting Fung Philos, \n\rProfessor FONG Wing Ping, \n\rProfessor JIANG Liwen, \n\rProfessor LAU Wilson Chun Yu, \n\rProfessor NGO Chi Ki Jacky, \n\rProfessor SHAW Pang Chui, \n\rProfessor WONG Kam Bo"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-M01-TMC (2374)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor CHAN Ho Yin Edwin, \n\rProfessor CHAN Michael Kenneth, \n\rProfessor FONG Wing Ping, \n\rProfessor JIANG Liwen, \n\rProfessor LAU Wilson Chun Yu, \n\rProfessor NGO Chi Ki Jacky, \n\rProfessor SHAW Pang Chui, \n\rProfessor WONG Kam Bo"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-M01-TMC (2485)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-M01-TMC (2661)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}}, {"code": "8012", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "12.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Biochemistry", "description": "In this course, a student is required to meet regularly with his/her supervisor who provides necessary guidance and supervision to write up a thesis and monitors the student’s academic progress.", "outcome": "Development of research skills, including field and/or laboratory studies and data analysis as related to the students' thesis research.", "syllabus": "-    Identify a research topic-    Develop a research hypothesis-    Prepare a research proposal-    Develop research methodology and experimental design-    Conduct an original research with impact in a specific field or subject-    Analyze experimental results and make appropriate data interpretation-    Prepare a research dissertation/thesis and related manuscripts for publication", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-M01-TMC (3516)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN Michael Kenneth, \n\rProfessor FONG Wing Ping, \n\rProfessor KANG Byung Ho, \n\rProfessor KONG Siu Kai, \n\rProfessor NGO Chi Ki Jacky, \n\rProfessor SHAW Pang Chui, \n\rProfessor WONG Kam Bo"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-M01-TMC (2369)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN Michael Kenneth, \n\rProfessor FONG Wing Ping, \n\rProfessor JIANG Liwen, \n\rProfessor KANG Byung Ho, \n\rProfessor KONG Siu Kai, \n\rProfessor LAU Wilson Chun Yu, \n\rProfessor NGO Chi Ki Jacky, \n\rProfessor SHAW Pang Chui, \n\rProfessor WONG Kam Bo"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-M01-TMC (2486)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor CHAN Ho Yin Edwin, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor FONG Wing Ping, \n\rProfessor NGO Chi Ki Jacky, \n\rProfessor SHAW Pang Chui, \n\rProfessor WONG Kam Bo"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-M01-TMC (2662)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor AU Wing Ngor Shannon, \n\rProfessor CHAN Ho Yin Edwin, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor FONG Wing Ping, \n\rProfessor NGO Chi Ki Jacky, \n\rProfessor SHAW Pang Chui, \n\rProfessor WONG Kam Bo"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}}]