[{"code": "2110", "title": "Principles of Curriculum and Instruction Design for Early Childhood Education", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkDiscussionLecture", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course is designed for students to understand the principles of curriculum in early childhood education and how teachers can deliver their teaching in kindergarten classrooms. The major principles of curriculum theories and issues are highlighted for students to develop an ability of curriculum planning and implementation in the future. To strengthen student teachers’ professional knowledge, skills, and attitudes for designing and implementing activities for young children, the learning and teaching processes in early childhood education are also discussed.\r", "outcome": "At the end of this course, students are expected to:\r 1. Understand principles in curriculum and instruction in the kindergarten context; 2. Analyze models of and approaches to curriculum planning and implementation in kindergarten settings; 3. Apply learning and teaching strategies to design children’s learning activities and for classroom management in kindergarten settings; 4. Plan and organize a meaningful learning environment to support children’s holistic development.", "syllabus": "1. Nature of curriculum studies and models of curriculum development\r 2. Principles of organizing the early childhood curriculum\r 3. Curriculum approaches in kindergarten settings\r 4. Curriculum planning for children’s holistic development\r 5. Creating a child-centred learning environment by using appropriate learning and teaching strategies", "required_readings": "1. Curriculum Development Council. (2017). Kindergarten Education Curriculum Guide: Joyful Learning through Play, Balanced Development All the Way. Retrieved from https://www.edb.gov.hk/attachment/en/curriculumdevelopment/major-level-ofedu/preprimary/ENG_KGECG_2017.pdf\r 2. DeVries, R. (2002). Understanding constructivist education. In R. DeVries, B. Zan, C. Hildebrandt, R. Edmiaston, & C. Sales (Eds.), Developing constructivist early childhood curriculum: Practical principles and activities (pp. 3–11). New York, NY: Teachers College Press.\r 3. Eliason, C. & Jenkins, L. (2016). A practical guide to early childhood curriculum (10th ed.). Upper Saddle River, New Jersey: Pearson Prentice Hall.\r 4. Hatch, J. A. (2012). From theory to curriculum: Developmental theory and its relationship to curriculum and instruction in early childhood education. In N. File, J. Mueller, & D. Wisneski (Eds.), Curriculum in early childhood education: Re-examined, rediscovered, renewed (pp. 42-53). New York, NY: Routledge.\r 5. Gandini, L. (2012). Connecting through caring and learning spaces. In C. Edwards, L. Gandini, & G. Forman(Eds.), The hundred languages of children: The Reggio Emilia experience in transformation (pp. 317–342). Santa Barbara, CA: Praeger.\r 6. Roopnarine, J. L., & Johnson, J. E. (2013). Approaches to early childhood education. Upper Saddle River, New\r Jersey: Pearson.", "recommended_readings": "1. Catron, C. E., & Allen, J. (2008). Early Childhood Curriculum: A Creative-Play Model (4th ed.). Upper Saddle River, New Jersey: Pearson Prentice Hall. \r 2. Millar, L., and Devereux, J. (eds) (2006). Supporting Children's Learning in the Early Years. Oxon: Routledge.\r 3. Pound, L., and Hughes, K, (2005). How Children Learn: From Montessori to Vygotsky: Educational Theories and\r Approaches Made Easy. Leamington Spa: Step Forward.\r 4. 陳淑敏 (2001)。幼稚園建構教學：理論與實務。台北：心理出版社。\r 5. 陳淑琦 (2007)。幼兒教育課程設計。台北：心理出版社。\r 6. 周淑惠 (2006) 。幼兒園課程與教學：探究取向之主題課程。台北：心理出版社。", "terms": {"2020-21 Term 1": {"--LEC (4916)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor LEUNG Kit Ying Suzannie"]}}}, "assessments": {"Classwork": "20", "Essays": "50", "Presentation": "30"}}, {"code": "2120", "title": "Teaching and Learning through Play in Early Childhood Education", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLectureOthersProject", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course aims to introduce the characteristics, theories and practices of play as a teaching and learning strategy in ECE. The participants will develop awareness of the importance of play in child development from theoretical and empirical perspectives, and acquire techniques to enhance the child's cognitive and language development, as well as arts and creativity performance through play-based activities. The course will also equip participants with knowledge and skills related to play activity design, play resources planning and the assessment of play.", "outcome": "Upon completion of the course, participants should be able to: 1. Understand the characteristics, theories and practices of play;2. Design and implement play activities to foster young children’s language, cognitive, social, emotional, and physical development;3. Develop resources for play activities; 4. Assess children's learning and development in play.", "syllabus": " The course will cover the following topics: Characteristics and classification of play; Classical and contemporary theories of play; Play and learning； Play and language development; Play and science education; Play and creative expression in art and music; Indoor and outdoor play; Play and technology; Play-based curriculum; Assessing play and children’s development. ", "required_readings": " Hughes, F. P. (2010). Children, play and development. Los Angeles, US: Sage. Andrews, M. (2012). Exploring play for early childhood studies. Exeter: Learning Matters. Fleer, M. (2013). Play in the early years. Port Melbourne, VIC: Cambridge University Press.", "recommended_readings": " Andrade, C. (2019). Benefits of Play for the Social and Emotional Development of Children in Kindergarten.  Bodrova, E., Germeroth, C., & Jeong, D. J. (2013). Play and self-regulation: Lessons from Vygotsky. American Journal of Play, 6(1), 111-123.  Broadhead, P., & Burt, A. (2012). Understanding young children’s learning through play: Building playful pedagogies. New York: Routledge.  Chmelynski, C. (2006). Play teaches what testing can’t touch: Humanity. Education Digest: Essential Readings Condensed for Quick Review, 72(3), 10-13.  Eberle, S. G. (2011). Playing with the multiple intelligences: How play helps them grow. American Journal of Play, 4(1), 19-51.  Eberle, S. G. (2014). The elements of play: Toward a philosophy and a definition of play. Journal of Play, 6(2), 214-233.  Fleer, M. (2009). Understanding the dialectical relations between everyday concepts and scientific concepts within play-based programs. Research in Science Education, 39(2), 281-306.  Fleer, M., & Peers, C. (2012). Beyond cognitivisation: Creating collectively constructed imaginary situations for supporting learning and development. Australian Educational Researcher, 39(4) 413-430.  Gross, C. M. (2012). Science concepts young children learn through water play. Dimensions of Early Childhood, 40(2), 3-12.  Gupta, A. (2009). Vygotskian perspectives on using dramatic play to enhance children’s development and balance creativity with structure in the early childhood classroom. Early Child Development and Care, 179(8), 1041-1054.  Henricks, T. S. (2014). Play as self-realization: Toward a general theory of play. American Journal of Play, 6(2), 190-213.  Holmes, R. M., & Romeo, L. (2013). Gender, play, language, and creativity in preschoolers. Early Child Development and Care, 183(11), 1531-1543.  Jones, E., & Reynolds, G. (2011). The play’s the thing: Teachers’ roles in children’s play (2nd ed.). New York: Teachers College Press.  Linder, T., & Linas, K. (2009). A functional, holistic approach to developmental assessment through play: The transdisciplinary play-based assessment (2nd ed.). Zero to Three, 30(1), 28-33.  Newton, E., & Jenvey, V. (2011). Play and theory of mind: Associations with social competence in young children. Early Child Development and Care, 181(6), 761-773.  Nwokah, E., Hsu, H., & Gulker, H. (2013). The use of play materials in early intervention: The dilemma of poverty. American Journal of Play, 5(2), 187-218.  Parks, A. N., & Blom, D. C. (2013). Helping young children see math in play. Teaching Children Mathematics, 20(5), 310-317.  Park, B., Chae, J., & Boyd, B. F. (2008). Young children’s block play and mathematical learning. Journal of Research in Childhood Education, 23(2), 157-162.  Pyle, A., & Alaca, B. (2018). Kindergarten children's perspectives on play and learning. Early Child Development and Care, 188(8), 1063-1075.  Ranz-Smith, D. J. (2012). Explicating the place of play: Resolving dilemmas of research-to-practice. Journal of Early Childhood Teacher Education, 33(1), 85-101.  Reisman, M. (2011). Learning stories: Assessment through play. Exchange: The Early Childhood Leaders’ Magazine Since 1978, 198, 90-93.  Roskos, K., & Christie, J. (2011). The play-literacy nexus and the importance of evidence-based techniques in the classroom. American Journal of Play, 4(2), 204-224.  Russ, S. W., & Wallace, C. E. (2013). Pretend play and creative processes. American Journal of Play, 6(1), 136-148.  Saracho, O. N. (2012). An integrated play-based curriculum for young children. New York: Routledge.  Saracho, O. N., & Spodek, B. (2006). Young children’s literacy-related play. Early Child Development and Care, 176(7), 707-721.  Stodden, D. F., & Goodway, J. D. (2007). The dynamic association between motor skill development and physical activity. Journal of Physical Education, Recreation & Dance (JOPERD), 78(8), 33-34.  Torquati, J., &Ernst, J. A. (2013). Beyond the walls: Conceptualizing natural environments as “third educators”. Journal of Early Childhood Teacher Education, 34(2), 191-208.  Tsao, Y. (2008). Using guided play to enhance children’s conversation, creativity and competence in literacy. Education, 128(3), 515-520. ", "terms": {"2020-21 Term 2": {"--LEC (8747)": {"startTimes": ["12:30"], "endTimes": ["15:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. CHAN To"]}}}, "assessments": {"Classwork": "30", "Essays": "50", "Presentation": "20"}}, {"code": "2130", "title": "Language and Literacy in the Early Years", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLectureOthersVisit", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course aims at providing students with fundamental concepts of language and literacy in early childhood. Through exploring theories of children's early literacy, this course overviews language development and developmentally appropriate instruction in kindergarten curriculum for young children. It equips pre-service teachers with knowledge and skills in the design and implementation of teaching plans for language development, with a focus on listening, speaking, writing, and reading. Finally, this course enables students to appreciate the value of multimodal perspectives in children's emergent literacy and recognize the importance of the learning environment (such as the bilingual and multicultural learning environment of Hong Kong) in supporting children's language and literacy development.", "outcome": "Upon completion of the course, participants should be able to:  To recognize and analyse the theories of children's language development. To design appropriate teaching plans for facilitating children's learning of Chinese and English, with a focus on listening, speaking, writing, and reading. To appreciate the value of multimodal perspectives in children's emergent literacy.  To recognize the importance of the learning environment in supporting children's language and literacy development.", "syllabus": " Language development in early childhood Early language in a multimodal perspective  Emergent literacy curriculum/ activities for Chinese learning English as a second language for children Emergent literacy curriculum/ activities for English learning Non-Chinese speaking children in Hong Kong kindergarten settings", "required_readings": " Ewing, R., Callow, J. Rushton, K. (2016). Language and literacy development in early childhood. Port Melbourne, VIC : Cambridge University Press  Machado, J.M. (2015). Early childhood experiences in language arts: Early literacy (11th ed.). Belmont, CA: Wadsworth. ", "recommended_readings": " Cheung, H., Chung, K. K. H., Wong, S. W. L., McBride-Chang, C., Penny, T. B., & Ho, C. S-H. (2010). Speech perception, metalinguistic awareness, reading, and vocabulary in Chinese-English bilingual children. Journal of Educational Psychology, 102(2), 367-380. Chow, B. W.-Y. , Hui, N. N. A. & Chui, B. H.-T. (2018). Creative literacy activities promote positive reading attitude in children learning English as a foreign language. Journal of Research in Reading, 41, 278 - 289. Chow, B. W.-Y., McBride-Chang, C., & Cheung, H. (2010). Parent-child reading in English as a second language: Effects on language and literacy development of Chinese kindergartners. Journal of Research in Reading, 33(3), 284–301. Jalongo, M.R. (2014). Early childhood language arts (6th ed.). Boston, MA: Pearson/Allyn & Bacon. Luongo-Orlando, K. (2010). The cornerstones to early literacy: Childhood experiences that promote learning in reading, writing, and oral language. Markham, Ont.: Pembroke Publishers. Narey, M. J. (2017). Multimodal perspectives of language, literacy, and learning in Early Childhood: The Creative and Critical \"Art\" of Making Meaning. Switzerland: Springer International Publishing AG. Otto, B. (2015). Literacy development in early childhood: Reflective teaching for birth to age eight. Upper Saddle River, N.J. Pearson/Merrill Prentice Hall. Tong, X. L., & McBride-Chang, C. (2010). Developmental models of learning to read Chinese words. Developmental Psychology, 46(6), 1662–1676. Wright, S. (Ed.). (2012). Children, meaning-making and the arts (2nd Ed). Frenchs Forest: Pearson Education. Yip, V. & Matthews, S. (2007). The bilingual child: Early development and language contact. Cambridge: Cambridge University Press. (2010) 。《幼兒園讀寫萌發課程》(第二版)。台北:五南圖書。 謝錫金 (2014) 。《香港幼兒口語發展》(第二版)。香港 : 香港大學出版社。", "terms": {"2020-21 Term 2": {"--LEC (6338)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. KOU Zhihui, \n\rProfessor TSANG Wai Chung"]}}}, "assessments": {"Essays": "40", "Others": "20", "Presentation": "40"}}, {"code": "2140", "title": "STEM Education and Early Math, Science Learning Experience", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLectureOthersProject", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course is designed to help participants understand STEM (Science, Technology, Engineering, and Mathematics) education with a focus on foundational concepts in early mathematics and science. Participants will explore different approaches to developing appropriate learning activities to foster young children's cognitive development in mathematics and science domains. This course will cover learning theories, teaching methods and key learning trajectories for developing young children's concepts and knowledge in the following topics: counting, early geometry, measurement, patterning and ordering, comparison and classification, and topics in life science, physical science, earth and environmental science, engineering, technology and science applications. The course would also extend participants' awareness of STEM education by drawing substantially on theories and practices in ECE settings.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2210", "title": "Foundations of Education", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DebateDiscussionLecture", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course seeks to provide students with an overview of a variety of perspectives on education, so that students will have a general understanding of how philosophies underlying teaching and learning in early childhood could be practised against the broader economic, social, cultural, and historical context of Hong Kong. Students will be introduced to such educational foundations as the ideas about education, philosophy of education, epistemology of education (theories of educational knowledge), and sociology of education, and will also be taught a brief history of educational development in post-war Hong Kong. Through discussions and class activities, students are guided to grasp the fundamentals of education, understand the important ideas about teaching and learning, and have an overview of related issues in education in general and early childhood education in particular.\r", "outcome": "To enable students:\r 1. to grasp the essence of some fundamental concepts, perspectives, and theories in the field of education\r 2. to apply these concepts, perspectives, and theories in examining the situation of early childhood education in Hong Kong\r 3. to understand the practical implications of such views and practices for early childhood education practitioners", "syllabus": "1. Introduction\r 2. Ideas of education\r 3. History of education in post-war Hong Kong – esp the emergence of early childhood education\r 4. Knowledge and Curriculum\r 5. Curriculum and Early Childhood Education\r 6. Teaching and Teachers\r 7. Learning and Educational Psychology\r 8. Diversification of learners’ needs\r 9. Teacher training in Hong Kong\r 10. Social roles of Education\r 11. Educational inequality\r 12. Group presentations\r 13. Conclusion", "required_readings": "---", "recommended_readings": "1. Arthur, J. and Davies, I. (eds) (2009) The Routledge Education Studies Reader, New York and London: Routledge.\r 2. Arthur, J., Davison, J., and Pring, R. (eds) (2017) Education Matters, New York and London: Routledge.\r 3. Arthur, J. and Peterson, A. (eds) (2011) The Routledge Companion to Education, New York and London: Routledge.\r 4. Ball, S. (ed) (2004) The RoutledgeFalmer Reader in Sociology of Education, London and New York: Routledge.\r 5. Bartlett, S. and Burton, D. (2016) Introduction to Education Studies, Fourth Edition, Los Angeles: SAGE.\r 6. Burden, P.R. and Byrd, D.M. (1994) Methods for Effective Teaching, Boston: Allyn and Bacon.\r 7. Byram, R. and Dube, H. (2008) Planning for Success: Effective Teaching and Learning Methods, New York: Continuum International Publishing Group.\r 8. Cahn, S.M. (ed) (1970) The Philosophical Foundations of Education, New York: Harper & Row.\r 9. Carr, W. (ed) (2005) The RoutledgeFalmer Reader in Philosophy of Education, London and New York: Routledge.\r 10. Dewey, J. (2004) Democracy and Education, New York: Dover Publications Inc.\r 11. Fenstermacher, G.D. and Soltis, J.F. (1986) Approaches to Teaching, New York and London: Teachers College, Columbia University.\r 12. Frankena, W. (1965) Three Historical Philosophies of Education: Aristotle, Kant and Dewey, Illinois: Scott, Foresman & Co.\r 13. Marsh, C. (2004) Key Concepts for Understanding Curriculum, Third Edition, London and New York: RoutledgeFalmer.\r 14. Ng Lun, N.H. (1984) Interactions of East and West: development of public education in early Hong Kong, Hong Kong: Chinese University Press.\r 15. Noddings, N. (2012) Philosophy of Education, Third Edition, Philadelphia: Westview Press.\r 16. Ornstein, A.C. and Hunkins, F.P. (2009) Curriculum: Foundations, Principles, and Issues, Seventh Edition, Harlow: Pearson Educational Leadership.\r 17. Ornstein, A.C., Levin, D.U., Gutek, G. and Vocke, D.E. (eds) (2016) Foundations of Education, 13th Edition, Boston, Mass.: Cengage Learning.\r 18. Peters, R.S. (Eds.) (1973) Philosophy of Education (Oxford: Oxford University Press).\r 19. Sadovnik, A., Cookson, P.W., Jr., and Semel, S.F. (eds) (2013) Exploring Education: An Introduction to the foundations of education, Fourth Edition, London: Routledge.\r 20. Sweeting, A.E. (1990) Education in Hong Kong Pre- 1841 to 1941: Fact and Opinion. Hong Kong: Hong Kong University Press.\r 21. Sweeting, A.E. (1993) A Phoenix Transformed: The reconstruction of Education in Post-war Hong Kong, Hong Kong: Oxford University Press.\r 22. 陸鴻基 (2004)。《從榕樹下到電腦前 : 香港教育的故事》。香港：進一步出版社。\r 23. 廖廸生、張兆和、蔡志祥(合編)(2001) 。《香港歷史、文化與社會一：教與學篇》。香港：香港科技大學華南研究中心。\r 24. 廖廸生、張兆和、蔡志祥(合編)(2001) 。《香港歷史、文化與社會二：教學與實踐篇》。香港：香港科技大學華南研究中心。\r 25. 曾榮光 (1998)。《香港教育政策剖析》。香港：三聯書店。\r 26. 香港專上學生聯會與中文大學學生會(合編)(1982) 。《香港教育透視》。香港：廣角鏡出版社。\r 27. 方美賢 (1975)。《香港早期教育發展史》。香港：中國學社。", "terms": {"2020-21 Term 1": {"--LEC (8778)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. WONG Yi Lee"]}}}, "assessments": {"Discussion": "20", "Essays": "50", "Presentation": "30"}}, {"code": "2310", "title": "Psychological Development of Young Children", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkDiscussionExerciseLectureProject", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course will discuss the psychological development of humans and focus on the period of early childhood up to about six years old. It will offer a survey of different important subfields,\r such as the development of the nervous system and the brain, perceptual abilities, cognitive abilities, social abilities, language, intelligence, personality and atypical development. Emphases will be put on the scientific methodology adopted by psychologists, major theories and key concepts, and the integration of theories and applications in real-world scenario.\r", "outcome": "Upon completion of this course, you are expected to be able to:\r 1. Understand key concepts and major theories related to the psychological development of young children; 2. Understand children’s perspective based on psychological knowledge; 3. Develop critical thinking skills in analyzing developmental phenomena related to young children; 4. Apply and relate psychology to real-world issues related to young children", "syllabus": "1. Issues in developmental studies\r 2. Prenatal development and early infancy\r 3. The brain and the nervous system\r 4. Perceptual development\r 5. Cognitive development\r 6. Intelligence and individual differences\r 7. Language development\r 8. Personality development\r 9. Social development\r 10. Stress and health\r 11. Atypical development\r Please refer to the course outline of respective teacher for details", "required_readings": "Required readings (if any) would depend on individual instructors.\r 1. Boyd, D. G., & Bee, H. L. (2014). The Developing Child (International Edition). Essex, UK: Pearson.", "recommended_readings": "1. Bergin, C. C., & Bergin, D. A. (2015). Child and adolescent development in your classroom (2nd Ed). Stamford, CT: Cengage.\r 2. Berk, L. E. (2017). Development through the lifespan (7th Edition). Boston: Pearson.\r 3. Feldman, R.S (2017). Development across the life span. Eighth edition. Boston: Pearson. [中譯本: 發展心理學---人的畢生發展 (蘇彥捷等譯)。北京:世界圖書出版公司。]", "terms": {"2020-21 Term 1": {"--LEC (6539)": {"startTimes": ["12:30"], "endTimes": ["15:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Dr. WONG Pak Ho"]}}}, "assessments": {"Others": "35", "Presentation": "15", "Selected response test or exam": "50"}}, {"code": "2320", "title": "Social and Emotional Development of Young Children", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkDebateDiscussionIndependent StudyLectureProjectWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "Fear, anger, sadness, love and attachment, joy and happiness. How have these basic human emotions evolved? How do children acquire and express these emotions, and how do they affect child development? This course covers a wide range of theories, perspectives, and practices on the social and emotional development of children from infancy through the sixth year, with particular focus on family, schools, and culture as sources of socialization. Special attention will be given to the practical implications of the related behavioural and emotional problems often found among school children. These include aggression, social anxiety, oppositional behaviour, and other internalizing and externalizing difficulties. These topics will be presented with a practical focus on helping children with these and other social-emotional problems.\r", "outcome": "At the end of the course, students should be able to:\r 1. Compare and contrast the different theoretical perspectives that explain various aspects of children’s social and emotional development.\r 2. Demonstrate understanding of the cultural, family, and school contexts that shape children’s social and emotional development.\r 3. Cultivate their abilities in the application, analysis, synthesis, and evaluation of related knowledge.\r 4. Enhance their sensitivity to atypical development in children’s social and emotional functioning,", "syllabus": "1. Theories of social-emotional development (biological, cognitive, and sociocultural perspectives)\r 2. Attachment and abuse\r 3. Social cognition: Understanding self and others\r 4. Functions of play\r 5. Atypical social-cognitive development\r 6. Biological and behavioral bases of self-regulation\r 7. Autonomy and compliance\r 8. Development of intentional communication\r 9. Aggression\r 10. Moral emotions, empathy, and prosocial behavior\r 11. Emotion expression and emotion regulation\r 12. Atypical emotional development", "required_readings": "1. Hakim-Larson, J. (2018). Emotional Development and Families: Socialization Across the Lifespan. London: Palgrave. ISBN : 9781137356321 ISBN : 1137356324", "recommended_readings": "1. Brownell, C. A., & Kopp, C. B. (Eds.). (2010). Socioemotional development in the toddler years: Transitions and transformations. New York: Guilford Press. ISBN-13: 978-1593854966 ISBN-10: 159385496X", "terms": {"2020-21 Term 2": {"--LEC (5204)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor Skyler Thomas HAWK"]}}}, "assessments": {"Essay test or exam": "15", "Homework or assignment": "20", "Report": "30", "Selected response test or exam": "35"}}, {"code": "2330", "title": "Physical and Motor Development of Young Children", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkDiscussionExerciseLectureProject", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "Pre-requisite: CHED4410.", "description": "This course will discuss current policies and issues related to young children’ physical and motor development across regions, as well as knowledge and skills developed by research and theories on movements concepts of gross motor skills and fundamental movement skills, which are essentials to our students who engage in early childhood education in the future. A developmentally appropriate curriculum for young children provides experiences which encourage development in the psychomotor, affective, and cognitive areas. The content of physical education in early childhood education program consists of both fundamental motor skills and movement concepts. Acquiring these basic movement patterns increases a child’s potential for learning more advanced sport skills and lifetime physical activities.\r", "outcome": "Upon completion of this course, you are expected to be able to:\r 1. familiarize curriculum guidelines on physical and motor skill domains of early childhood education recommended\r by education departments across regions\r 2. understand students’ growth and development in physical and motor skill domains\r 3. develop the visions on up to date teaching strategies and curriculums for young children\r 4. develop skills and knowledge in teaching movement concepts, gross motor skills and fundamental movement skills for young children\r 5. understand and apply various developmental theories into practices\r 6. design age- and developmental-appropriate curriculums and activities for developing young children’s physical and motor skills\r 7. learn safety protocols for teaching young children’s physical activities\r 8. develop innovative thinking for designing motivational learning activities\r 9. be able to develop self-reflection skills throughout the learning process\r 10. develop professional manner and positive attitudes for teaching young children in kindergartens (code of ethics)", "syllabus": "1. Contemporary Issues & Research Related to Physical and Motor Development of Young Children in Early Childhood Education\r 2. Regional and Local Curriculums for Young Children’s Physical and Motor Development\r 3. Developmental Theories and Research for Early Childhood Education\r 4. Enhancing Learning Through Play\r 5. Growth and Development of Young Children\r 6. Body Awareness - Help Young Children Understand Their Bodies\r 7. Gross & Fine Motor Skills\r 8. Laban’s Movement & Fundamental Movement Skills\r 9. Rhythmic Activities\r 10. Health & Wellness and Physical Activities for Young Children\r 11. Instructional Strategies in Physical Activities for Young Children\r 12. Proper Ways & Concepts to Assess Young Children’s Physical Abilities\r 13. Safety Issues in Teaching Physical Activities\r 14. Teaching Young Children with Exceptional Needs in Physical Activities\r 15. Ethical Issues Related to Teaching Young Children", "required_readings": "1. Biddle, K.A.G., Garcia-Nevarez, A., Henderson, W.J.R., & Valero-Kerrick, A. (2014). Early childhood education: becoming a professional. Thousand Oaks, California: SAGE.\r 2. Gallahue. D.L., Ozmun, J.C., & Goodway, J.D. (2012). Understanding motor development: infants, children, adolescents and adults (7th ed.). New York: McGraw-Hill.\r 3. Levine, L.E., & Munsch, J. (2016). Child development from infancy to adolescence: an active learning approach. Thousand Oaks, California: SAGE.\r 4. The Curriculum Development Council, Hong Kong Special Administrative Region (2017). Kindergarten education curriculum guide. Education Bureau, HKSARG.( https://www.edb.gov.hk/attachment/en/curriculumdevelopment/major-level-ofedu/preprimary/ENG_KGECG_2017.pdf )\r 5. The Curriculum Development Council, HKSAR (2013). Reference materials on physical activities in kindergartens. Education Bureau, HKSARG. ( https://www.edb.gov.hk/attachment/en/curriculumdevelopment/ major-level-of-edu/preprimary/phy-act-inkg.pdf )", "recommended_readings": "1. Crandell, T., Crandell, C., & Vander Zanden, J. (2012). Human development (10th ed.). New York: McGraw-Hill.\r 2. Colombo, L., & Bianchi, R. (2010). Preschool children: Physical activity, behavioral assessment and developmental challenges. New York: Nova Science.\r 3. Doherty, J., & Brennan, P. (2014). Physical education 5-11: A guide for teachers (2nd ed.). New York: Routledge.\r 4. Hearron, P.F. (2013). Guiding young children (9th ed.). Boston: Pearson.\r 5. Kostelnik, M.J., Soderman, A.K., Whiren, A.P., & Rupiper, M.L. (2014). Developmentally appropriate curriculum: Best practices in early childhood education (6th ed.). Boston: Pearson.\r 6. Levine, L.E., & Munsch, J. (2018). Child development – an active learning approach (3rd ed.). Los Angeles: SAGE.\r 7. Macintyre, C. (2001). Enhancing learning through play – a developmental perspective for early years settings. London: David Fulton.\r 8. Moravcik, E., Nolte, S., & Feeney, S. (2013). Meaningful curriculum for young children. Boston: Pearson.", "terms": {"2020-21 Term 1": {"--LEC (8556)": {"startTimes": ["12:30"], "endTimes": ["15:15"], "days": [1], "locations": ["Lee Shau Kee Archi Bldg G04"], "instructors": ["Dr. CHEUNG Sin Ting Juanita"]}}}, "assessments": {"Classwork": "25", "Others": "50", "Presentation": "25"}}, {"code": "2510", "title": "Health, Nutrition and Safety for Young Children", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkDiscussionLectureVisit", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course provides a comprehensive overview of health, safety and nutritional needs of young children. There will be discussion on theoretical rationale, guidelines and strategies to meet these needs of young children in childcare and school settings. Topics to be discussed include: personal hygiene, common childhood diseases, preventing and responding to emergencies, planning learning experiences on health education, communication with parents, as well as child abuse and neglect.\r", "outcome": "By the end of the course, students are expected to be able to:\r 1. State common illnesses among young children and describe the screening procedures to assess a child’s health status\r 2. Identify sources of nutrients and appropriate meal planning\r 3. Describe health and safety regulations required for child care and kindergarten settings\r 4. Explain the role of the teachers in identifying suspected child abuse and/or neglect", "syllabus": "1. nature and scope of health care education in early childhood\r 2. concepts of health; strategies to promote children’s holistic health\r 3. personal hygiene for working with young children\r 4. safety, common illnesses and infectious diseases and promoting safety in home, at school and in the community for young children\r 5. basic concepts in nutrition education, healthy living styles, and oral health for young children\r 6. The strategies of developing and evaluation of health related activities/ curriculum\r 7. environmental safety: causes of common accidents in preschool settings; basic principles in handling injuries\r 8. child protection: characteristics of maltreatment; procedure in handling suspected cases of child abuse", "required_readings": "1. 鍾志從 (2015): 《幼兒健康與安全：含營養與健康的 概念》。台北：華騰文化。\r 2. Curriculum Development Council (2017). Guide to the pre-primary curriculum. Hong Kong: Curriculum Development Council.", "recommended_readings": "1. Marotz, L.R., Cross, M. Z., & Rush, J.M. (2014). Health, safety, and nutrition for young child. Albany, NY: Clifton Park, Cengage Learning.\r 2. Robertson, C. (2013). Safety, nutrition and health in early education. Belmont, CA: Cengage\r 3. Pimento, B. , & Kernsted, D. (2015). Healthy foundations in early childhood settings. Ontario: Nelson Education.\r 4. Sorte, J., Daeschel, I., & Amador, C. (2016). Nutrition, health and safety for young children: promoting wellness. Upper Saddle River, NJ: Pearson Education.\r 5. 楊金寶、尹亭雲 (2015): 《幼兒園教保活動課程：健康安全實用手冊》。台北：揚智。\r 6. 周麗婷 (2013): 《嬰幼兒健康照護》。台北：華騰文化。\r 7. 郭靜晃 (2016): 《兒童健康與安全》。台北：揚智。\r 8. 香港中文大學醫學院公共衛生學院健康教育及促進健康中心 (2000): 《學前教育機構健康飲食指引》、\r 9. 《學前健康教育課程系列》、《學前機構安全錦囊》。處理虐待兒童個案程序指引 (2015): 社會福利署。", "terms": {"2020-21 Term 1": {"--LEC (4738)": {"startTimes": ["13:30"], "endTimes": ["16:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Mr CHEUNG Chi Leung"]}}}, "assessments": {"Discussion": "20", "Homework or assignment": "50", "Presentation": "30"}}, {"code": "3110", "title": "Classroom Communication for Early Childhood Teachers", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkDiscussionLecture", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course is designed for students to understand the philosophy and practical application of classroom dialogues in early childhood classrooms. The details of conversation of the everyday activities of child-teacher interaction and the ways of interpreting each other's messages in terms of the interactional context through explicit and implicit communication are covered. Dialogic episodes of teaching and learning in play and activities in various teaching approaches are discussed, and strategies of effective classroom communication for early childhood teachers are highlighted.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3120", "title": "Inclusive Education in Early Childhood Settings", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLectureOthersVisit", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course aims at exploring the concepts and issues of inclusive education in Hong Kong kindergartens by providing an overview of theories and practices in early childhood inclusive education, as well as the inclusive education services in Hong Kong. This course equips participants with knowledge of behavioural characteristics of children with special needs, enabling them to refer student cases to various kinds of professionals in school settings, e.g. psychologists, therapists or social workers. Participants will learn about the application of teaching strategies in an inclusive classroom and the design of an inclusive curriculum to accommodate different learning needs of young children in kindergartens. The course also emphasizes the importance of home-school collaboration as pivotal to inclusive education in kindergartens.", "outcome": "Upon completion of the course, participants should be able to:  To evaluate implementation of inclusive education in Hong Kong kindergartens by using relevant theories. To discuss and analyse the behavioural characteristics of children with special needs. To apply appropriate teaching strategies of inclusive education. To design an inclusive curriculum for accommodating children's learning diversities. To value the importance of home-school collaboration as pivotal to inclusive education in kindergartens.", "syllabus": " Background and philosophy of inclusive education  Inclusive education services in Hong Kong Behavioral characteristics of children with different learning diversities  Teaching strategies for early childhood inclusive classrooms Curriculum planning for early childhood inclusive education Home-school collaboration for inclusive education ", "required_readings": "Gargiulo, R. M., & Kilgo, J. L. (2018). An introduction to young children with special needs: Birth through age eight (5th ed.). London, UK: Sage Publishing. ", "recommended_readings": " Akram, G., Thomson, A. H., Boyter, A. C., & McLarty, M. (2009). ADHD and the role of medication: Knowledge and perceptions of qualified and student teachers. European Journal of Special Needs Education, 24(4), 423-436. doi:10.1080/08856250903223088 Arcia, E., Frank, R., Sánchez-LaCay, A., & Fernáindez, M. C. (2000). Teacher understanding of ADHD as reflected in attributions and classroom strategies. Journal of Attention Disorders, 4(2), 91-101. doi:10.1177/108705470000400203 Bailey, B., Arciuli, J., & Stancliffe, R. J. (2016). Effects of ABRACADABRA literacy instruction on children with autism spectrum disorder. Journal of Educational Psychology, doi:10.1037/edu0000138 Bruns, D. A., & Mogharreban, C. C. (2007). The gap between beliefs and practices: Early childhood practitioners' perceptions about inclusion. Journal of Research in Childhood Education, 21(3), 229-241. doi:10.1080/02568540709594591 Chan, S., & Yuen, M. (2015). Teachers' beliefs and practices for nurturing creativity in students: Perspectives from teachers of gifted students in hong kong. Gifted Education International, 31(3), 200-213. doi:10.1177/0261429413511884 Fyssa, A., Vlachou, A., & Avramidis, E. (2014). Early childhood teachers' understanding of inclusive education and associated practices: Reflections from Greece. International Journal of Early Years Education, 22(2), 223-237. doi:10.1080/09669760.2014.909309 , L. P., & Yeung, S. S. (2007). Integrated education: Barriers and chance. Hong Kong Journal of Early Childhood, 6, 49-53. Kontos, S., Moore, D., & Giorgetti, K. (1998). The ecology of inclusion. Topics in Early Childhood Special Education, 18(1), 38-48. doi:10.1177/027112149801800107 Lai, F. T. T., Li, E. P. Y., Ji, M., Wong, W. W. K., & Lo, S. K. (2016). What are the inclusive teaching tasks that require the highest self-efficacy? Teaching and Teacher Education, 59, 338-346. doi:10.1016/j.tate.2016.07.006 Liasidou, A. (2007). Inclusive education policies and the feasibility of educational change: The case of cyprus. International Studies in Sociology of Education, 17(4), 329-347. doi:10.1080/09620210701666972 Mulholland, S. M., Cumming, T. M., & Jung, J. Y. (2015). Teacher attitudes towards students who exhibit ADHD-type behaviours. Australasian Journal of Special Education, 39(1), 15-36. doi:10.1017/jse.2014.18 Saloviita, T. (2015). Measuring pre-service teachers' attitudes towards inclusive education: Psychometric properties of the TAIS scale. Teaching and Teacher Education, 52, 66-72. doi:10.1016/j.tate.2015.09.003 UNESCO. (2009). Policy Guidelines on Inclusion in Education. Paris: UNESCO. Retrieved from: http://unesdoc.unesco.org/images/0017/001778/177849e.pdf. Wong, D., Pearson, V., Ip, F., & Lo, E. (1999). A slippery road to equality: Hong kong's experience of unplanned integrated education. Disability & Society, 14(6), 771. Zhu, J., Li, H. & Hsieh, W-Y. (2017). Implementing inclusive education in an early childhood setting: a case study of a Hong Kong kindergarten. Early Child Development and Care. DOI: 10.1080/03004430.2017.1307841", "terms": {"2020-21 Term 2": {"--LEC (8748)": {"startTimes": ["12:30"], "endTimes": ["15:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor LEUNG Kit Ying Suzannie"]}}}, "assessments": {"Essays": "50", "Presentation": "40", "Report": "10"}}, {"code": "3210", "title": "Early Childhood Education Policy and Practices in Hong Kong", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLectureProject", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course aims to help prospective teachers to gain an understanding of the Hong Kong early childhood education services in relation to their occupational well-being and working environment. It is designed to provide prospective teachers with analytical tools to comprehend and review educational policies and their implementation in early childhood settings. Educational issues and policies in Hong Kong will be analyzed from an international-comparative perspective and a local concern for efficiency and equity. Topics for analysis may include: (1) early childhood education curriculum reform in Hong Kong since 1980s (2) pre-primary education voucher scheme; (3) school quality and governance; (4) learner diversity; (5) teacher education and qualification; and (6) health and safety issues in early childhood education.\r", "outcome": "After completing the course, students should be able to:\r 1. demonstrate an understanding of major issues and their underlying rationale and problems with reference to early childhood education in Hong Kong; 2. review issues related to early childhood education and their implications, and make informed judgments on such issues; 3. develop an understanding of policy and practices of schools and functions of schools from various perspectives; and\r 4. analyze how policies are made and consultations are conducted in early childhood settings in Hong Kong.", "syllabus": "1. Curriculum reform in early childhood education; 2. Voucher scheme; 3. School quality and governance; and\r 4. Health and safety issues in early childhood education\r 5. Current topics in early childhood education by guest speakers", "required_readings": "---", "recommended_readings": "1. Chen, J. J., Li, H., & Wang, J. Y. (2017). Implementing theproject approach: A case study of hybrid pedagogy in a Hong Kong kindergarten. Journal of Research in Childhood Education, 31(3), 324-341.\r 2. Cheng, D. P. W. (2001). Difficulties of Hong Kong teachers’ understanding and implementation of ‘play’ in the curriculum. Teaching and teacher education, 17, 857-869.\r 3. Cheng, D. P. W. (2010). Exploring the tactfulness of implementing play in the classroom: A Hong Kong experience. Asia-Pacific Journal of Teacher Education, 38(1), 69-82.\r 4. Cheng, D. P. W. (2012). The relation between early childhood teachers’ conceptualization of ‘play’ and their practice: Implication for the process of learning to teach. Frontier Education China, 7(1), 65-84.\r 5. Committee on Free Kindergarten Education (2015). Children first: Right start for all. Report of the committee on free kindergarten education. Hong Kong: Government Printer.\r 6. Curriculum Development Committee (1984). Guide to the kindergarten curriculum (in Chinese only). Hong Kong: Government Printer.\r 7. Curriculum Development Committee (1987). Guidelines on nursery class activities. Hong Kong: Government Printer.\r 8. Curriculum Development Council (1993). Guide to the kindergarten curriculum. Hong Kong: Government Printer.\r 9. Curriculum Development Council (1996; 2006). Guide to the pre-primary curriculum. Hong Kong: Government Printer.\r 10. Curriculum Development Council (2017). Kindergarten education curriculum guide. Hong Kong: Government Printer.\r 11. Education Bureau (2014). Overview of subjects to be studied and progress of related work of the Committee on Free\r Kindergarten Education (LC Paper No. CB (4)225/14-15(01)). Retrieved from http://www.legco.gov.hk/yr14-15/english/panels/ed/ed_fke/papers/ed_fke20141216cb4-225-1-e.pdf\r 12. Education Bureau (2017). Performance indicators (kindergartens). Hong Kong: Government Printer.\r 13. Education Bureau (2018). Enhanced quality assurance framework for kindergarten education (Education Bureau\r Circular No. 11/2018). Retrieved from https://www.edb.gov.hk/attachment/en/edu-system/preprimary-kindergarten/quality-assurance-framework/EDBC18011E.pdf\r 14. Education Bureau (2018). Handbook on quality review for kindergartens. Hong Kong: Government Printer.\r 15. Education Bureau (2018). School self-evaluation manual. Retrieved from https://www.edb.gov.hk/attachment/en/edu-system/preprimary-kindergarten/quality-assurance-framework/sse/SSE_Manual_2018_EN.pdf\r 16. Education Bureau and Social Welfare Department (2006). Operation manual for pre-primary institutions. Hong Kong: Government Printer.\r 17. Education and Manpower Bureau and Social Welfare Department. (2002). Performance indicators (pre-primary institutions) domain on management and organization (2nd ed.). Hong Kong: Government Printer.\r 18. Education and Manpower Bureau and Social WelfareDepartment. (2001). Performance indicators (pre-primary institutions) domain on learning and teaching (2nd ed.). Hong Kong: Government Printer.\r 19. Education and Manpower Bureau and Social Welfare Department. (2002). Performance indicators (pre-primary institutions) domain on support to children and school culture (2nd ed.). Hong Kong: Government Printer.\r 20. Education and Manpower Bureau and Social Welfare Department. (2003). Performance indicators (pre-primary institutions) domain on children’s development (2nd ed.). Hong Kong: Government Printer.\r 21. Education Department and Social Welfare Department (2002). Working party on harmonization of pre-primary services. Consultation Document. Hong Kong: Government Printer.\r 22. Fung, K. H., & Lee, C. K. (2008). A critical review of the early childhood education (ECE) curriculum development in Hong Kong. Journal of Basic Education, 17(1), 33–57.\r 23. Fung, K. H., & Lam, C. C. (2009). The pre-primary education voucher scheme of Hong Kong: A promise of quality education provision? Education Journal, 36(1-2), 153-170.\r 24. Fung, K. H., & Lam, C. C. (2011). Empowering parents’ choice of schools: The rhetoric and reality of how Hong Kong kindergarten parents choose schools under thevoucher scheme. Current Issues in Education, 14(1). Retrieved from http://cie.asu.edu/\r 25. Fung, K. H., & Lam, C. C. (2012). The tension between parents’ informed choice and school transparency: Consumerism in the Hong Kong education voucher scheme. International Journal of Early Childhood, 44(1), 31-52.\r 26. Helm, J.H., & Katz, L. (2011). Young investigators: The project approach in the early years (2nd ed.). NY: Teachers College Press.\r 27. Ho, C. W. D. (2008). Exploring the definitions of quality early childhood programmes in a market-driven context: Case studies of two Hong Kong preschools. International Journal of Early Years Education, 16(3), 223-36.\r 28. Katz, L.G., & Chard, S.C. (1989). Engaging children’s minds: The project approach. Norwood, NJ: Ablex\r 29. Kindergarten Inspection Section. (2012). 5-Year qualityreview report (2007–2012). Hong Kong: Education Bureau, HKSAR (In Chinese only).\r 30. Li, H., Wong, J. M. S., & Wang, X. C. (2008). Early childhood education voucher in Hong Kong: Perspectives from online communities. International Journal of Early Childhood, 40(2), 49-63.\r 31. Li, H., Wong, J. M. S., & Wang, X. C. (2010). Affordability, accessibility, and accountability: Perceived impacts of the pre-primary education vouchers in Hong Kong. Early Childhood Research Quarterly, 25(1), 125-138.\r 32. Li, H., & Fong, R. W. (2014). Implementing 15-year free education in Hong Kong: Dilemmas and practical solutions. Hong Kong Teachers’ Centre Journal, 13, 1-14.\r 33. Li, Y. L. (2003). Underpinnings of teachers’ professional development: A new conceptualization of field experience. Asia-Pacific Education Review, 4(1), 11-18.\r 34. Li, Y. L. (2009). The perspectives and experiences of Hong Kong preschool teacher mentors: Implications for mentoring. Teacher Development, 13(2), 147-158.\r 35. Lonka, K., Hakkarainen, K., & Sintonen, M. (2007). Progressive inquiry learning for children: Experiences,\r possibilities, limitation. European Early Childhood Education Research Journal, 8(1), 7-23.\r 36. Rao, N. (2010). Educational policy, kindergarten curriculum guidelines and the quality of teaching and learning: Lessons\r from kindergartens in Hong Kong. International Journal of Early Childhood Education, 16(2), 27–39.\r 37. Rao, N., & Koong, M. (2000). Enhancing preschool education in Hong Kong. International Journal of Early Childhood, 32(2), 1–11.\r 38. Rao, N., & Li, H. (2009). Quality matters: Early childhood education policy in Hong Kong. Early Child Development and Care, 179(3), 233-245.\r 39. Rao, N., Koong, M, Kwong, M., & Wong, M. (2003). Predictors of preschool process quality in a Chinese context. Early Childhood Research Quarterly, 18, 331-250. \r 40. The Reconstituted Working Party on Kindergarten Education (1995). Report of the reconstituted working party on kindergarten education. Hong Kong: Government Printer.\r 41. Wong, J. M., & Rao, N. (2015). The evolution of early childhood education policy in Hong Kong. International Journal of Child Care and Education Policy, 9(3), 1-16.\r 42. Yang, W., Wang, J., & Li, H. (2017). Achieving a balance between affordability, accessibility, accountability, sustainability and social justice: The early childhood education polices in Hong Kong. In H. Li, Park, E. & J. J. Chen (eds.), Early childhood education policies in Asia Pacific: Advanced in theory and practice (pp. 51-71). Singapore: Springer.\r 43. Yuen, L. H. F. (2009). From foot to shoes: Kindergartners’ families’ and teachers’ perceptions of the project approach.\r Early Childhood Education Journal, 37, 23-33.\r 44. 社會福利署、香港社會服務聯會聯合工作小組編 (1990)。《日間幼兒園活動指引》。香港：社會福利署。\r 45. 馮潔皓 (2014)。二十一世紀的香港幼兒教育課程改革：回顧與前瞻。《教育學報》，第42 卷，第2 期，頁95-112。\r 46. 馮潔皓、李子建及尹弘颷 (2008)。香港幼兒教育課程文件：回顧與批評。《香港教師中心學報》，第7 期，頁28-40。\r 47. 課程發展委員會編 (1987)。《幼兒班活動指引》。香港：政府印務局。", "terms": {"2020-21 Term 2": {"--LEC (8876)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Mr. CHIK Pun Shing Babie"]}}}, "assessments": {"Discussion": "15", "Essays": "55", "Presentation": "30"}}, {"code": "3220", "title": "Multicultural Early Years Education in Hong Kong", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-tripLectureOthers", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "Children from low-income, immigrant and ethnic minority are the fast growing groups in early years’ education. As such, this course aims to equip students with the essential knowledge, skills and attitudes to enhance the learning effectiveness of children from diverse cultural backgrounds. Students will be: (a) examining international perspectives on multicultural early years’ education; (b) engaging in dialogues with serving kindergarten personnel and families of diverse cultural backgrounds to deepen their understanding of the critical issues and challenges in fostering multicultural early childhood education; (c) applying culturally relevant pedagogy and approaches to foster an equitable and inclusive learning environment for all preschoolers from kindergartens to primary schools; (d) critically reflecting on the prevailing policies and provisions in early years and provide suggestions to address the problems; and (e) appreciating culturally responsive home-school collaboration to positively engage multicultural families in their children’s kindergartens to primary.", "outcome": "Upon completion of the course, participants should be able to:  Employ a critical lens of multiculturalism to address the learning and teaching issues in early years; Effectively apply culturally relevant pedagogy in promoting positive engagement of both mainstream and non-mainstream young children from early years to primary schooling; Demonstrate intercultural competence in working with parents from diverse cultural backgrounds; Critically analyse the policy documents and provision relating to enhancing multicultural early years education;  Foster an equitable and inclusive learning environment for holistic engagement of early years within the Hong Kong context.", "syllabus": " International perspectives on multicultural early years’ education. Issues and challenges in multicultural early years’ education (class, race, religion, equity, social justice etc.). Community engagement and/or field study to develop the essential knowledge, skills and attitudes towards young children with diverse cultural backgrounds in Hong Kong. Policy analysis on enhancing multicultural early years education in Hong Kong. Critical reflection on culturally relevant pedagogy and curriculum in early years e.g. multimodal languages, story-approach, technology-based. Appreciation of culturally responsive family engagement to enhance the learning outcomes of children from low income, Chinese immigrant and ethnic minority backgrounds. ", "required_readings": "Souto-Manning, M. (2013). Multicultural Teaching in the Early Childhood Classroom: Approaches, Strategies, and Tools, Preschool–2nd Grade. New York: Teachers College Press.", "recommended_readings": " Abdullah, A. C. (2009). Multicultural education in early childhood: Issues and challenges. Journal of International Cooperation in Education, 12(1), 159-175. Acevedo, M. V. (2019). Young children playing their way into intercultural understanding. Journal of Early Childhood Literacy, 19(3), 375-398. Ang, L. (2010). Critical perspectives on cultural diversity in early childhood: Building an inclusive curriculum and provision. Early Years, 30(1), 41–52. Arber, R. (2005). Speaking of race and ethnic identities: exploring multicultural curricula. Journal of Curriculum Studies, 37(6), 633–52. Education Bureau (website), Overview of Kindergarten Education in Hong Kong, https://www.edb.gov.hk/en/edu-system/preprimary-kindergarten/overview/index.html Grant, K. B. & Ray, J. A. (2016). Home, school, and community collaboration: Culturally responsive family engagement (3rd ed.). SAGE Publications. Jacques, C., & Villegas, A. (2018). Strategies for Equitable Family Engagement. Retrieved from https://statesupportnetwork.ed.gov/system/files/equitable_family_engag_508.pdf MacNaughton, G., Hughes, P. and Smith, K. (2006). Listening to Children: New Insights, Challenges and Possibilities. Centre for Equity and Innovation in Early Childhood: Melbourne, Australia. Manning, M. Baruth, L. & Lee, L. (6th Ed.) (2017). Multicultural education of children and adolescents. New York: Routledge.  Kelly, Clare. 2010. Hidden worlds: Young children learning literacy in multicultural contexts. Stoke-on-Trent: Trentham. Lareau, A. (2000). Home advantage: Social class and parental intervention in elementary education. Rowman & Littlefield Publishers.  Rhedding-Jones, J. (2010). Critical multicultural practices in early childhood education. In S. May & C. E. Sleeter (Eds.), Critical multiculturalism: Theory and praxis (pp. 73–86). New York: Routledge. Schoorman, D. (2011). Reconceptualizing teacher education as a social justice undertaking: Underscoring the urgency for critical multiculturalism in early childhood education. Childhood Education, 87(5), 341–344. Siraj-Blatchford, I., & Clarke, P. (2000). Supporting identity, diversity and language in the early years. Buckingham, England and Philadelphia: Open University Press. Souto-Manning, M.(2010). Multicultural teaching in the early childhood classroom: Approaches, strategies and tools Preschool - 2nd grade. New York: Teachers College, Columbia University. Yuen, Y. M. C. (2018). Social equity and home-school collaboration in multicultural early years education. In Y. Guo (Ed.), Home-school relations: International perspectives. (pp.137 – 154), Singapore: Springer. Yuen, C. Y. (2016). Enhancing early childhood schooling of South Asian children in Hong Kong: Beliefs and perceptions of kindergarten teachers and principals. Early Child Development and Care, 186(3), 403-418. Zhou, G., Zhong L. (2018). Chinese immigrant parents’ involvement in their children’s school-based education: Behaviours and perceptions. In Y. Guo (Ed.), Home-school relations: International perspectives. (pp.89-111), Singapore: Springer.", "terms": {"2020-21 Term 1": {"--LEC (8080)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Esther Lee Bldg 302"], "instructors": ["Professor YUEN Yuet Mui"]}}}, "assessments": {"Fieldwork or field study": "30", "Others": "50", "Presentation": "20"}}, {"code": "4010", "title": "Teaching Practice I", "career": "Undergraduate", "units": "5.00", "grading": "Graded", "components": "Field Studies/Field-tripOthersWorkshop", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course is designed for students to prepare to be professional and quality kindergarten teachers in the Hong Kong context. Students are required to design, implement and evaluate their learning activities to children aged 2 to 6. The learning activities should be integrated with the six domains emphasized in the Kindergarten Education Curriculum Guide. Developmentally appropriate practices with professional teachers’ knowledge, skills and attitude are expected to be delivered in the kindergarten classrooms. In this course, basic strategies of classroom observation, environment setting and daily operation are also introduced.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4020", "title": "Teaching Practice II", "career": "Undergraduate", "units": "5.00", "grading": "Graded", "components": "Field Studies/Field-tripOthersWorkshop", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course is designed for students to deepen their professional knowledge, skills and attitude based on what they learnt from the Teaching Practice I. On top of designing, implementation and evaluating the integrated activities for young children, students are required to conduct their classroom teaching through observation, assessment and reflection. In this course, the rationale of “assessment inform teaching” is highlighted. Students have to identify a problem in their classrooms and then design tailor-made classes based on theories and approaches which they have learnt in the programme. The concepts and practices on evaluation and reflection of the classroom teaching performance are emphasized. Students are expected to apply advanced strategies of classroom management and environment setting to respond to their teaching reflections.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4341", "title": "Teaching Strategies for Young Children with Special Educational Needs", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkDiscussionLectureVisit", "campus": "", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course is to equip students with in-depth knowledge and skills to work with individual children in special child care settings. The focus is on developing strategies and individualized educational plan to meet children’s developmental needs. Specific training models and programmes for working with special needs children are evaluated. There is also a discussion on working collaboratively with members in a multidisciplinary team.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4540", "title": "Research Project", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkOthersProjectInteractive Tutorial", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "Students will work individually to pursue independent study on approved topics and areas under the supervision of teachers appointed by the Department/Faculty of Education.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]