[{"code": "2120", "title": "Cell Biology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Pre-requisite: LSCI1002.", "description": "This course helps students build up solid foundation in cell biology for their future research and studies in life sciences. Core modules of this course include: 1. Functions of technology and engineering in advancing understanding of cell; 2. Chemistry and physics of cell membrane and its mechanism of communications and transportation; 3. Endomembrane system and cytoskeleton in intracellular structuring and trafficking; and 4. Mechanisms of signal transduction in cell proliferation and programmed cell death. As the final capstone module of this course, the significance of cell biology in understanding and improving human health and disease will be discussed. Clinical researchers may be invited to share their innovative research design and findings and to inspire our students about the importance of basic discoveries in applied studies.Topics 1-8 introduce students our current understanding about the structures, functions and mechanisms of a number of components in a eukaryotic cell and illustrate how these components interact, leading to cell proliferation and programmed cell death. The final capstone topic “Clinical Application of Cell Biology” inspires the students about how they can apply what they have learned in the previous topics, seemingly fundamental and discrete, in an integrative manner for understanding and improving human health and diseases. This capstone topic will also stimulate the students to think out of the box and realize the significance of basic research in applied studies.Senior Student Mentorship Programme (SSMP) is implemented in this course so that the hundreds of students will be assigned into groups, mentoring by some selected senior students, who have taken this course before with good academic results. Besides sharing their learning experiences and answering their mentees’ questions about cell biology, these senior students, who are mostly engaging in experimental projects in their capstone courses, can also inspire their mentees about the innovation and design of their scientific studies. Clinical researchers are also invited to share their innovative research design and finding and to inspire our students about integration and application of some basic discoveries in cell biology for understanding and improving human health and diseases.", "outcome": "1. To recognize the structures, functions and mechanisms of some basic components of a eukaryotic cell; 2. To explain how normal cells are maintained by regulating their division and death; and\r 3. To apply the knowledge of cell biology in understanding and treatment of diseases, which are caused by changes or losses in cell functions. \r  1.認識真核細胞某些基本成分的結構, 功能和機制; 2.通過調節分裂和死亡來解釋正常細胞是如何維持的; 和 3.運用細胞生物學的知識來理解和治療由於細胞功能的變化或損失而引起的疾病。\r  1.认识真核细胞某些基本成分的结构, 功能和机制; 2.通过调节分裂和死亡来解释正常细胞是如何维持的; 和 3.运用细胞生物学的知识来理解和治疗由于细胞功能的变化或损失而引起的疾病。\r  ", "syllabus": "Specific topics include: 1. Introduction: Cell Biology & Microscopy; 2. Membranes: Their Chemistry, Structure and Functions; 3. Transport across Membrane: Overcoming the Permeability Barrier; 4. The Endomembrane System: Transport within a Eukaryotic Cell; 5. Signal Transduction Mechanisms: Their Messengers and Receptors; 6. Cytoskeleton: Structures for Maintaining Cell Shape and Internal Organization; 7. Cell Cycle: The Events of Cell Growth and Division; 8. Apoptosis: A Programme to Cell Death; 9. Clinical Application of Cell Biology (Capstone Topic)\r  具體的主題包括: 1. 簡介：細胞生物學與顯微學; 2. 細胞膜：化學，結構和功能; 3. 穿越細胞膜運輸：克服滲透障礙; 4. 內膜系統：真核細胞內的運輸; 5. 信號轉導機制：信使和受體; 6. 細胞骨架：維持細胞形態和內部組織的結構; 7. 細胞週期：細胞生長和分裂; 8. 細胞凋亡：細胞死亡的程序; 9. 細胞生物學的臨床應用\r  具体的主题包括: 1. 简介：细胞生物学与显微学; 2. 细胞膜：化学，结构和功能; 3. 穿越细胞膜运输：克服渗透障碍; 4. 内膜系统：真核细胞内的运输; 5. 信号转导机制：信使和受体; 6. 细胞骨架：维持细胞形态和内部组织的结构; 7. 细胞周期：细胞生长和分裂; 8. 细胞凋亡：细胞死亡的程序; 9. 细胞生物学的临床应用", "required_readings": "Hardin J., Bertoni G., Kleinsmith L.J. and Becker W.M. Becker’s World of the Cell, Ninth Edition, Boston: Benjamin Cummings.", "recommended_readings": "Primary research papers with high scientific merits suggested by the invited clinical researchers", "terms": {"2020-21 Term 1": {"--LEC (7516)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. CHIU Chi Ming Lawrence"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}, "2021-22 Term 1": {"--LEC (7909)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Lee Shau Kee Building LT6"], "instructors": ["Dr. CHIU Chi Ming Lawrence"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Essay test or exam": "20", "Short answer test or exam": "20", "Selected response test or exam": "60"}}, {"code": "2210", "title": "Ecology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Pre-requisite: LSCI1002.", "description": "This course provides students with an introduction to the general principles of ecology. The course covers four broad areas: behavioural ecology, population ecology, community ecology and ecosystem ecology. Behavioural ecology examines how behaviour contributes to survival and reproduction. The relationship between behaviour, ecology and evolution is emphasized. Population ecology concerns how populations grow and how they are limited by food, competition and predation. The community ecology component will focus on factors that determine the structure and function of biological communities, including nutrient cycles and biogeochemistry. The course will conclude with a module on ecosystem ecology discussing how ecosystem structure, function and services may be influenced by disturbances. Mathematical models will be used to illustrate the theoretical background for topics discussed.\r", "outcome": "Knowledge\r • Understand key concepts in behavioural, population, community and ecosystem ecology (e.g. population regulation, competition and predation, life-history strategies, optimal theories, sexual selection, adaptation, social behaviour, kin selection, food webs, species diversity, community structure, biogeochemical cycles, ecosystem resilience)\r • Appreciate important questions and key issues in modern ecology\r  Skill\r • Application of the scientific method to ecological problems\r • Understand the concepts of experimental design and hypothesis testing in ecology\r • Find and collect information from the primary literature\r • Critically analyse information from the primary literature\r • Application of modern ecological knowledge to real-world environmental issues and problems\r  Value\r • Understand the factors driving the distribution and abundance of living organisms and their behaviour\r • Recognize the ecological basis of global and regional environmental problems \r • Develop an ecological perspective of the major global environmental problems (e.g. biodiversity crisis, climate change) and their solutions\r  知識 • 理解行為生態學、種群生態學及群落生態學中的重要概念（例如，種群調節， 競爭與捕食， 生活史策略，最適性理論，性選擇理論， 適應， 社群行為， 親本選擇， 食物網， 以及物種多樣性） • 關注現代生態學研究中的重要問題和焦點  技能 • 把科學方法應用到生態學 • 理解生態學中實驗設計和假設證明的內容 • 查找和收集文獻 • 客觀分析文獻 • 運用圖表描述和表達生態學的觀點  價值 • 熟悉現代生態學中的重要問題和重點； • 熟悉並闡釋全球化的環境問題（例如，生物多樣性危機） • 認識全球及區域環境問題的生態學基礎   知识 • 理解行为生态学、种群生态学及群落生态学中的重要概念（例如，种群调节， 竞争与捕食， 生活史策略，最适性理论，性选择理论， 适应， 社群行为， 亲本选择， 食物网， 以及物种多样性） • 关注现代生态学研究中的重要问题和焦点  技能 • 把科学方法应用到生态学 • 理解生态学中实验设计和假设证明的内容 • 查找和收集文献 • 客观分析文献 • 运用图表描述和表达生态学的观点  价值 • 熟悉现代生态学中的重要问题和重点； • 熟悉并阐释全球化的环境问题（例如，生物多样性危机） • 认识全球及区域环境问题的生态学基础", "syllabus": "I. Population Ecology\r 1. Population growth & regulation\r 2. Demography\r 3. Intraspecific competition\r 4. Interspecific competition\r 5. Predator prey relationships\r  II. Behavioural Ecology\r 1. Introduction\r 2. Optimal theories\r 3. Ecology of territory\r 4. Group behaviour\r 5. Alternative strategies\r 6. Altruism\r  III. Community and Trophic Ecology\r 1. Diversity, species richness and their measurement\r 2. Island Biogeography\r 3. Energy flow in ecosystems\r 4. Biogeochemical cycles of major elements\r 5. Methods for studying food chains and food webs\r  IV. Ecosystem Ecology\r 1. Patterns of ecosystem development\r 2. Effects of disturbance on ecosystem structure and function\r 3. Ecosystem resilience and stability\r  I. 種群生態學\r 1. 種群增長與調節\r 2. 種群統計學\r 3. 種內競爭\r 4. 種間競爭\r 5. 捕食者-被食者的相互作用\r  II. 行為生態學\r 1. 概論\r 2. 最適性理論\r 3. 領域行為\r 4. 群體行為\r 5. 其他行為策略\r 6. 利他行為\r  III. 群落生態學\r 1. 物種多樣性及物種豐度\r 2. 島嶼生物地理學\r 3. 生態系統中的能量流動\r 4. 群落穩定性及群落結構", "required_readings": "", "recommended_readings": "1. Smith, T.M. and R. L. Smith. 2015. Elements of Ecology, 9th edition, Pearson, San Francisco. ISBN 978-1-292-07740-6\r 2. Krebs, J.R. & N.B. Davis. An Introduction to Behavioural Ecology, 4th edition, Wiley-Blackwell Scientific Publications. ISBN: 978-1-405-11416-5\r 3. Kaiser et al. 2012. Marine Ecology: Processes, Systems, and Impacts. 2nd edition, Oxford University Press. ISBN: 978-0-199-22702-0", "terms": {"2020-21 Term 2": {"--LEC (6836)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor LEE Shing Yip"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 2": {"--LEC (7313)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Mong Man Wai Bldg LT1"], "instructors": ["Professor LEE Shing Yip"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Essay test or exam": "60", "Short answer test or exam": "40"}}, {"code": "2213", "title": "Ecology Laboratory", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Corequisite:BIOL2210", "description": "This course introduces the fundamental concepts and basic laboratory techniques used in ecological investigations.\r", "outcome": "Knowledge\r • Basic ecological techniques including sample collection, data collection, data analysis, basic statistics and data reporting\r • Analysis of habitats and populations\r • Observe record and quantify animal behaviours\r • Students will learn the importance and basic techniques of hypotheses testing\r   Skill\r • Application of scientific method to ecology\r • Understand the concepts of experimental design and hypothesis testing in ecology\r • Present and report ecological findings and ideas using charts, graphs, diagrams and tables \r   知識 • 生態學的基本技術，包括樣品採集，數據收集，數據分析，基本統計分析和數據報告 • 種群及其棲息地的分析 • 動物行為的觀察記錄與量化 • 學生將認識到假設證定的重要性和基本技巧  技術 • 將科學方法應用到生態學 • 理解生態學中實驗設計以及假設證定的理念 • 利用各種圖表，圖形， 表格解說生態學的發現和觀點", "syllabus": "Analysis of Habitat\r Population Growth and Competition\r Demography\r Analysis of Populations\r Behavioural Ecology\r  棲息地分析 群落生長和競爭 種群統計學 群落分析 行為生態學", "required_readings": "", "recommended_readings": "Laboratory Manual is provided.", "terms": {"2020-21 Term 2": {"AL01-LAB (6837)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Science Ctr East Block E108"], "instructors": ["Professor CHUI Pui Yi"], "meetingDates": ["18/1"]}, "BL01-LAB (6848)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Science Ctr East Block E108"], "instructors": ["Professor CHUI Pui Yi"], "meetingDates": ["25/1"]}}, "2021-22 Term 2": {"AL01-LAB (6598)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Science Ctr East Block E108"], "instructors": ["Staff"], "meetingDates": ["10/1", "17/1", "24/1"]}, "BL01-LAB (6313)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Science Ctr East Block E108"], "instructors": ["Staff"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Lab reports": "40", "Others": "20", "Short answer test or exam": "30", "Selected response test or exam": "10"}}, {"code": "2313", "title": "Genetics Laboratory", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Co-requisite: BIOL2410.", "description": "This experimental course introduces fundamental concepts and basic techniques used in general genetics and molecular genetics.\r", "outcome": "1) understand the fundamental theory of general and molecular genetics; 2) master basic experimental skills used for general and molecular genetics research;  3) analyze and apply the learnt concepts and skills in solving related genetics problems.\r  1) 瞭解普通遺傳學及分子遺傳學基礎理論\r 2) 掌握普通及分子遺傳學研究的基本實驗技能\r 3) 分析幷應用這些學到的理論和技能解决相關的遺傳學問題.", "syllabus": "1. Polytene chromosomes from Chironmomus salivary glands \r 2. Human genetics \r 3. UV mutagenesis in Saccharomyces cerevisiae \r 4. Transformation of Escherichia coli \r 5. VNTR analysis of D1S80 locus\r  1. 搖蚊幼蟲的多線染色體 ;  2. 人類遺傳 ;  3. 紫外線誘發酵母的突變 ;  4 . 大腸桿菌的轉型 ;  5. 串聯重覆的分析", "required_readings": "", "recommended_readings": "Laboratory Manual is provided.", "terms": {"2020-21 Term 2": {"AL01-LAB (7837)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Science Centre 295"], "instructors": ["Miss YAM Kwan Mei"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}, "BL01-LAB (7838)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Science Centre 295"], "instructors": ["Miss YAM Kwan Mei"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}, "CL01-LAB (4970)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Science Centre 295"], "instructors": ["Miss YAM Kwan Mei"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}, "DL01-LAB (5020)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Science Centre 295"], "instructors": ["Miss YAM Kwan Mei"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"AL01-LAB (6599)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Science Centre 295"], "instructors": ["Miss YAM Kwan Mei"], "meetingDates": ["11/1", "18/1", "25/1"]}, "BL01-LAB (6600)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Science Centre 295"], "instructors": ["Miss YAM Kwan Mei"], "meetingDates": ["12/1", "19/1", "26/1"]}, "CL01-LAB (6499)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Science Centre 295"], "instructors": ["Miss YAM Kwan Mei"], "meetingDates": ["11/1", "18/1", "25/1"]}, "DL01-LAB (6500)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Science Centre 295"], "instructors": ["Miss YAM Kwan Mei"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Lab reports": "35", "Others": "25", "Selected response test or exam": "40"}}, {"code": "2410", "title": "General Genetics", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Not for students who have taken BIOL2310. Pre-requisite: LSCI1002 and BIOL2120.", "description": "This course deals with the fundamental principles of heredity eukaryotes with emphasis on Mendelian inheritance, non-Medelian inheritance, linkage and mapping, structure of DNA/RNA and chromosome, and inheritance patterns of genetic diseases.", "outcome": "Learning Outcomes: By the end of the course, a successful student should be able to: 1) understand the fundamental theory of transmission genetics and the relationship between genes and traits;2) describe pedigree analysis and the inheritance of human genetic disorders;3) apply scientific method and analyses with the underlying genetic principles課程學習結束後, 學生應該可以:1) 掌握傳播遺傳學的基本理論以及基因與性狀的相互關係;2) 描述血統分析和人類遺傳疾病的遺傳;3) 應用科學方法並根據潛在的遺傳原理進行分析课程学习结束后, 学生应该可以:1) 掌握传播遗传学的基本理论以及基因与性状的相互关系;2) 描述血统分析和人类遗传疾病的遗传;3) 应用科学方法并根据潜在的遗传原理进行分析", "syllabus": "Mendelian inheritance; Inheritance patterns of genetic diseases; Chromosome transmission during cellular and sexual reproduction; Extension of Mendelian inheritance; Non-Mendelian inheritance; Genetic linkage & mapping孟德爾遺傳; 基因疾病的遺傳模式; 細胞和有性生殖過程中的染色體傳播; 孟德爾遺傳的延伸; 非孟德爾遺傳; 遺傳連鎖與遺傳作圖门德尔遗传; 基因疾病的遗传模式; 细胞和有性生殖过程中的染色体传播; 门德尔遗传的延伸; 非门德尔遗传; 遗传连锁与遗传作图", "required_readings": "Brooker, Robert J. 2015. Genetics: analysis and principles. 5th ed. McGraw.Hill", "recommended_readings": "Klug, WS & Cummings, MR. 2006. Concepts of Genetics. 8th ed. MacMillan Snustad, DP & Simmons, MJ.  2006.  Principles of Genetics. 4th ed. J. Wiley.", "terms": {"2020-21 Term 2": {"--LEC (7115)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor NG Wang Kit"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 2": {"--LEC (5684)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [2], "locations": ["Sir Run Run Shaw Hall"], "instructors": ["Professor GUO Dianjing"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Essay test or exam": "55", "Homework or assignment": "5", "Short answer test or exam": "40"}}, {"code": "2420", "title": "Population Genetics", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Co-requisite: BIOL2410.", "description": "This course will provide a general introduction to population genetics, with emphasis on the interaction of evolutionary processes (including mutation, natural selection, genetic drift, inbreeding, and gene flow) in determining the genetic composition of natural populations and the biological/conservation implications of these information.\r", "outcome": "Knowledge\r By the end of the course, a student will be expected to understand:\r 1) the fundamental principles of population genetics, molecular evolution and evolutionary ecology; 2) how various ecological and historic processes, such as natural selection, genetic drift and migration, influence the patterns of genetic variation within and among populations; 3) the applications of population genetics data and techniques in other biological and practical disciplines.\r  Skill\r 1) To develop the ability to quantitatively interpret genetic data in natural populations. \r 2) To understand the molecular techniques that enable evaluation of genetic diversity in natural populations for conservation management and agricultural/medical purposes. \r  Value\r Population genetics theory has renewed relevance for understanding genomic-scale patterns of genetic diversity, as a mean to identify genes of importance in human diseases, agricultural diseases and breeding, and to develop conservation and management strategies. This can equip students with quantitative thinking on genetics for future engagement in related disciplines, including education, conservation, biotechnology and medical fields.\r  知識 課程學習結束後, 學生應該 :\r 1) 掌握族群遺傳學、分子演化和演化生態學的基礎理論; 2）了解各種生態和歷史過程，如自然選擇，遺傳漂變和遷移，如何影響族群內和族群間的遺傳多樣性; 3）了解族群遺傳學數據及技術於其他生物學和實踐學科中的潛在應用範圍。\r  技能 1）掌握從量化角度去解釋自然族群遺傳數據的能力。\r 2）掌握用於評估自然種族遺傳多樣性的分子技術，以及其於保育管理和農業/醫療目的上應用。\r  價值 族群遺傳學理論讓我們對了解遺傳多樣性對物種存續重要性及意義有新的認知，這有利於我們找出對人類疾病、農業疾病和育種有重要價值的基因或對偶基因，並應用這些資訊去製定保育及管理政策的提供了科學上數據佐證。本課程可以使學生從量化的角度去思考遺傳學理論及數據，以便將來參與相關學科，包括教育、保育、生物技術和醫學領域。  知识 课程学习结束后, 学生应该 :\r 1) 掌握族群遗传学、分子演化和演化生态学的基础理论; 2) 了解各种生态和历史过程，如自然选择，遗传漂变和迁移，如何影响族群内和族群间的遗传多样性; 3) 了解族群遗传学数据及技术于其他生物学和实践学科中的潜在应用范围。\r  技能 1）掌握从量化角度去解释自然族群遗传数据的能力。\r 2）掌握用于评估自然种族遗传多样性的分子技术，以及其于保育管理和农业/医疗目的上应用。\r  价值 族群遗传学理论让我们对了解遗传多样性对物种存续重要性及意义有新的认知，这有利于我们找出对人类疾病、农业疾病和育种有重要价值的基因或对偶基因，并应用这些信息去制定保育及管理政策的提供了科学上数据左证。本课程可以使学生从量化的角度去思考遗传学理论及数据，以便将来参与相关学科，包括教育、保育、生物技术和医学领域。", "syllabus": "Phenotypic and genetic variation in natural populations\r Hardy-Weinberg principle and its extension\r Genetic drift, natural selection and migration\r Quantitative genetics\r Molecular population genetics\r Conservation genetics\r  自然種群中的表型和遺傳變異 Hardy-Weinberg原理及其延伸\r 遺傳漂變、自然選擇和遷移 定量遺傳學 分子族群遺傳學 保育遺傳學  自然种群中的表型和遗传变异 Hardy-Weinberg原理及其延伸\r 遗传漂变、自然选择和迁移 定量遗传学 分子族群遗传学 保育遗传学", "required_readings": "Hartl DL & Clark AG, 2007. Principles of Population Genetics, 4th Edition. Sinauer Associates: Sunderland, Massachusetts.\r Hartl DL, 2000. A Primer of Population Genetics 3rd Edition. Sinauer Associates: Sunderland, Massachusetts.\r  Reference reading\r Frankham R, Ballou JD & Briscoe DA, 2010. Introduction to Conservation Genetics, 2nd Edition. Cambridge University Press.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (8419)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Miss YAM Kwan Mei"], "meetingDates": ["16/3", "23/3"]}}, "2021-22 Term 2": {"--LEC (8330)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [2], "locations": ["Science Centre L3"], "instructors": ["Miss YAM Kwan Mei"], "meetingDates": ["22/3", "29/3"]}}}, "assessments": {"Essay test or exam": "75", "Homework or assignment": "25"}}, {"code": "3012", "title": "Biodiversity Laboratory I", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "LaboratoryInteractive Tutorial", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Co-requisite: BIOL3560 and 3610.", "description": "This experimental course introduces the diversity, forms and functions of fungi, algae, bryophytes and invertebrates.\r", "outcome": "1. Basic techniques in the study of plants and fungi, including aseptic techniques, \r 2. Culture, isolation and identification of plants and fungi,\r 3. A firm grasp of the characteristics of algae, lower plants and fungi through examination of whole organisms and slide sections of representative species,\r 4. An appreciation of invertebrate diversity with an understanding of the general body plan of the major phyla groups of invertebrates (including the ability to identify an invertebrate of the major phyla to the class level),\r 5. Ability to observe and identify specimens (including using the microscope), draw annotated diagrams to illustrate the structure, and relate structure to function.\r  1. 研究植物和真菌的基本技術，包括無菌技術；\r 2. 培養﹑分離和鑑定植物和真菌；\r 3. 通過觀察具代表性物種的個體和切片，充分掌握藻類﹑低等植物和真菌的特點；\r 4. 了解無脊椎動物的生物多樣性及各主要無脊椎動物門動物的一般身體架構〔包括能鑒別各主要無脊椎動物門的動物至綱的層面〕；\r 5. 具備觀察和識別標本的能力（包括使用顯微鏡），並能繪畫註釋圖來說明結構，以及指出結構和功能之間的關聯。", "syllabus": "Use of microscope and examination of unicellular organisms\r Slime Moulds & Lower Fungi\r Higher Fungi \r Lichens\r Algae\r Bryophytes\r Cnidaria and flatworm\r Annelid diversity and earthworm dissection\r Mollusk diversity and squid dissection\r Arthropod diversity\r Echinoderm & Review\r  顯微鏡的使用和單細胞生物的檢測 黏菌及低等真菌 高等真菌 地衣 藻類 苔蘚植物 刺胞動物及扁蟲 環節動物的生物多樣性及蚯蚓的解剖 軟體動物的生物多樣性及烏賊的解剖 節肢動物的生物多樣性 棘皮動物及課程復習", "required_readings": "", "recommended_readings": "(1)Slonczewski, J.L. and Foster, J.W. (2009). Microbiology: An Evolving Science. W.W. Norton & Company, Ltd., New York.\r (2) But, P.P-H.; Cheng, L.; Chan, P.K.; Lau, D.T-W. and But, J.W-H. (2002) Nostoc flagelliforme and faked items retailed in Hong Kong. Journal of Applied Phycology 14: 143–145.\r (3) Fleming, A. (1945) Penicillin. Nobel Lecture, December 11, 1945.\r (4) Krstic, S., Duma, A., Janevska, B., Levkov, Z., Nikolova, K. and Noveska, M. (2002) Diatoms in forensic expertise of drowning—a Macedonian experience. Forensic Science International 127: 198–203.\r (5) Miller, C.H., Ladd, C., Palmbach, T. and Lee, H.C. (2001) The Green Revolution: Botanical Contributions to Forensics and Drug Enforcement. Croatian Medical Journal 42: 340-345.\r (6) Cleveland, P.H., Jr. (2007) Animal Diversity, McGraw Hill, Boston.\r (7) Wischnitzer, S. (2006) Atlas and dissection guide for comparative anatomy. 6th edition. W. H. Freeman and Co.\r (8) Lytle, C.F. (1996) General zoology laboratory guide. Dubuque, IA: Wm. C. Brown Publishers.\r (9) Miller, S.A. (1994) General zoology: laboratory manual. (3rd edition) Dubuque, Iowa: Wm. C. Brown Publishers.", "terms": {"2020-21 Term 1": {"AL01-LAB (7572)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Science Centre 295"], "instructors": ["Dr. CHOW Cheung Ming, \n\rMiss YAM Kwan Mei"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}, "BL01-LAB (4901)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Science Centre 295"], "instructors": ["Dr. CHOW Cheung Ming, \n\rMiss YAM Kwan Mei"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2021-22 Term 1": {"AL01-LAB (6969)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Science Centre 295"], "instructors": ["Dr. CHOW Cheung Ming, \n\rMiss YAM Kwan Mei"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}, "BL01-LAB (6905)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Science Centre 295"], "instructors": ["Dr. CHOW Cheung Ming, \n\rMiss YAM Kwan Mei"], "meetingDates": ["8/9", "15/9"]}}}, "assessments": {"Lab reports": "44", "Others": "20", "Short answer test or exam": "36"}}, {"code": "3022", "title": "Biodiversity Laboratory II", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "LaboratoryInteractive Tutorial", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Co-requisite: BIOL3570 and 3620.", "description": "This experimental course introduces the diversity of higher plants and vertebrate animals through an examination of a wide variety of specimens and comparison of their body forms and structures.\r", "outcome": "1. A firm grasp of the characteristics of vascular plants (ferns, fern allies, gymnosperms and angiosperms) through examination of the whole organisms and slide sections of representative species; 2. Integration of such characteristics through problem-solving approaches to real situations.\r 3. Able to understand the diversity and evolutionary relationships of vertebrate animals and to identify vertebrates to major class phyla; 4. Understand the general body plan of vertebrate animals; 5. Able to perform dissection of major vertebrate animals and identify major organ systems; 6. Able to relate function to structure of vertebrate animals; 7. Able to demonstrate a clear understanding of major aspects of vertebrate anatomy through drawing biological diagrams; 8. Able to observe, recognize, draw annotated diagrams and label fine vertebrate animal structures using the microscope.\r  1. 通過考察代表性物種的個體和切片，深入理解維管束植物(擬蕨植物﹑蕨類植物﹑裸子植物和被子植物)的特點；\r 2. 透過解決問題的學習方式，聯繫這些特點和真實情況；\r 3. 能夠認識脊椎動物的生物多樣性及進化關係，並能別脊椎動物中主要的綱別；\r 4. 認識脊椎動物的一般身體架構：\r 5. 能夠解剖主要的脊椎動物及鑒別其主要器官系统；\r 6. 能夠理解脊椎動物在功能與結構上的關係；\r 7. 能夠通過繪製生物學繪圖以表達其對脊椎動物解剖學主要概念的深度認識；\r 8. 能夠利用顯微鏡對脊椎動物的細微結構作觀察、鑒認、及繪製和標示註解圖。", "syllabus": "Diversity of protochordates, agnathans and fishes\r Dissection of shark\r Dissection of frog\r Diversity of amphibians and reptiles \r Dissection of soft-shelled turtle\r Diversity of Aves and Mammalia\r Tissues and organization of vascular plants \r Fern allies\r Ferns\r Gymnosperms\r Angiosperms\r  原索動物、無頜類、及魚類的生物多樣性 鲨鱼的解剖 青蛙的解剖 兩棲動物及爬行動物的生物多樣性 鱉的解剖 鳥類及哺乳動物的生物多樣性 維管束植物的組織及系統 擬蕨植物 蕨類植物 裸子植物 被子植物", "required_readings": "", "recommended_readings": "1. Raven P.H., R.F. Evert and S.E. Eichhorn (2005) Biology of Plants (7th Edition), Freeman & CO.\r 2. Flora of Hong Kong (Volumes 1-3). Hong Kong Herbarium, Agriculture, Fisheries and Conservation Department & South China Botanical Garden, Chinese Academy of Sciences (Ed.). Agriculture, Fisheries and Consevation Department.\r 3. A fern that hyperaccumulates arsenic. Nature 409:579 (2001). (http://www.nature.com/nature/journal/v409/n6820/full/409579a0.html)\r 4. Bracken fern poisoning of cattle. Agriculture Notes, State of Victoria, Australia, AGO107:1-2 (1998). (http://www.dse.vic.gov.au/dpi/nreninf.nsf/v/2F6B3A5D50919D25CA2574180014125F/$file/Bracken_Fern_Poisoning_of_Cattle.pdf)\r 5. Adrian Bell and Alan Bryan (2008) Plant Form: An Illustrated Guide to Flowering Plant Morphology. Oxford University Press, 6th ed.\r 6. Fishbeck, D. W. and Sebastiani, A. (2001) Comparative anatomy: manual of vertebrate dissection. Morton Publishing.\r 7. Wischnitzer, S. (2006) Atlas and dissection guide for comparative anatomy. 6th edition. W. H. Freeman and Co.\r 8. Holmberger, D. G., and Walker, W. F. (2004) Vertebrate dissection. 9th edition, Thomas Brooks/Cole.\r 9. Walker, W.F. (1998) Dissection of the frog (2nd edition). New York: W.H. Freeman.\r 10. Lytle, C.F. (1996) General zoology laboratory guide. Dubuque, IA: Wm. C. Brown Publishers.\r 11. Miller, S.A. (1994) General zoology: laboratory manual. (3rd edition) Dubuque, Iowa: Wm. C. Brown Publishers.", "terms": {"2020-21 Term 2": {"AL01-LAB (8404)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Science Centre 392"], "instructors": ["Dr CHUNG Kwok Cheong, \n\rDr. CHOW Cheung Ming"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}, "BL01-LAB (8405)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Science Centre 392"], "instructors": ["Dr CHUNG Kwok Cheong, \n\rDr. CHOW Cheung Ming"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 2": {"AL01-LAB (6431)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Science Centre 392"], "instructors": ["Dr. CHOW Cheung Ming"], "meetingDates": ["12/1", "19/1", "26/1"]}, "BL01-LAB (6432)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Science Centre 392"], "instructors": ["Dr. CHOW Cheung Ming"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Lab reports": "50", "Others": "10", "Short answer test or exam": "40"}}, {"code": "3310", "title": "Human Biology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Pre-requisite: LSCI1002 (Not applicable to Old Curriculum students).", "description": "This course introduces the study of man as a zoological species, through the examination of the extant primates and fossils, biochemical microevolution of mankind and embryonic development. The concept that humans, like other biological species, exhibit variations will be dealt with. The importance of these variations in adapting to environmental stresses will be discussed. Much of this course, therefore, will outline the wide range of adaptive power that humans possess with particular emphasis on the plasticity of human adaptability as a factor contributing to the success of mankind. The final part will treat man as a social animal and discuss the possible future of man in the light of his present activities.", "outcome": "Knowledge outcomes:\r  1. Acquire ability to comprehend the implication of how humans evolve and why is so different from other organisms;  2. Acquire core knowledge on how humans varies; 3. Acquire an educated understanding on how humans adapts to different environments and hence lead to variations between different populations. \r  Skills outcomes:\r  1. Acquire skills in literature survey using various sources including effective usage of information technologies and web-based searches; 2. Acquire good analytical and oral communication skills via class project presentation; 3. Acquire good problem solving skill via course assessment.\r  Values and attribute outcomes:\r  1. Acquire a positive attitude toward humans as one of the member of all living organisms but is unique; 2. Acquire an educated mind and responsible attitude and appreciation of humans is part of the nature. \r  知识成果： 掌握对人类如何演化及为何与其它生命这样的不同上的意义; 获取有关人类不同种族的差异的核心知识; 明白人类如何适应不同的环境和由此而引致人种上的差异。  技能成果： 掌握文献调查技能，包括使用信息技术和有效利从互联网中搜索中得到的各种来源; 通过班上研习课题获得良好的分析和沟通技巧; 通过课程评估建立良好的解决问题的技巧。  价值观和属性的成果： 对人类作为所有生物的其中而又独特的一员建立积极的态度 通过思想教育对人类是自然界的一部份建立正确的态度。.", "syllabus": "1. Human Evolution: An Introduction \r 2. Primates\r 3. Evolution of Primates\r 4. Apes and Human\r 5. Human Characteristics\r 6. Major Steps in Human History\r 7. Driving Forces in Human Evolution and Origin of Modern Humans\r 8. Molecular Basis of Human Origin\r 9. Human variation – models of classification / Biological variations\r 10. Population genetics\r 11. Molecular basis of variation – SNPs \r 12. Concept of adaptation \r 13. Skin color\r 14. Beta-globin and G6PDH \r 15. ABO blood group \r 16. High altitude - hypoxia. \r   1. 人类进化：简介\r 2. 灵长目\r 3. 灵长类的演化\r 4. 类人猿与人类\r 5. 人的特征\r 6. 人类历史上的主要步骤\r 7. 在人类进化与现代人类起源的驱动力\r 8. 人类起源的分子基础\r 9. 人类变异 -分类/生物变化模型\r 10 群体遗传学\r 11. 变异的分子基础-单核苷酸多态性\r 12. 适应的概念\r 13. 肤色\r 14. β-球蛋白和G6PDH的\r 15. ABO血型\r 16. 高海拔-缺氧", "required_readings": "", "recommended_readings": "Reference Books:\r B.G. Campbell and J.D. Loy (2000) Humankind emerging 8th ed., Boston : Allyn and Bacon, ISBN 0321022742. \r  R. Lewin (1999) Human evolution : an illustrated introduction 4th ed., Malden, Mass.: Blackwell Science, ISBN 0632043091. \r  G.A. Harrison, J.M. Tanner, D.R. Pilbeam, and P.T. Baker (1990) Human Biology - An Introduction to human evolution, variation, growth and adaptability 3rd Ed. ELBS/Oxford University Press. ISBN 0194424340\r  G.A. Harrison (1993) Human Adaptation. Oxford University Press Stephen Molnar (1992) Human variation : races, types, and ethnic groups 3rd Ed. Prentice Hall. ISBN 0134461622\r  Stephen Molnar (1992) Human variation : races, types, and ethnic groups 3rd Ed. Prentice Hall. ISBN 0134461622", "terms": {"2020-21 Term 2": {"--LEC (7367)": {"startTimes": ["9:30", "9:30"], "endTimes": ["10:15", "11:15"], "days": [1, 5], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Dr. SIOW Lam", "Dr. SIOW Lam"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2", "15/1", "22/1", "29/1", "5/2"]}}, "2021-22 Term 2": {"--LEC (6902)": {"startTimes": ["9:30", "9:30"], "endTimes": ["11:15", "10:15"], "days": [5, 1], "locations": ["Mong Man Wai Bldg 707", "Science Centre L3"], "instructors": ["Dr. SIOW Lam", "Dr. SIOW Lam"], "meetingDates": ["14/1", "21/1", "28/1", "10/1", "17/1", "24/1"]}}}, "assessments": {"Short answer test or exam": "70", "Selected response test or exam": "30"}}, {"code": "3410", "title": "General Microbiology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Pre-requisite: BCHE2030 and BIOL2120.", "description": "This course includes the history and scope of microbiology, the importance of microorganisms, structures and functions of microorganisms, microbial physiology, microbial growth and application, control of microorganisms and antibiotics, environmental and industrial microbiology, genetic engineering, virology, immunology and microbial diseases, metabolic diversity of microorganisms. The basic concepts and application values of microbiology learnt in this course provide students with fundamental knowledge which is required by some advanced courses.\r", "outcome": "Students would be able to\r  1. recall the basic knowledge and techniques about microbiology;  2. recognize the nature and impacts of microorganisms; 3. compare and contrast the characteristics of microorganisms to multicellular organisms;  4. relate the structural or physiological adaptations of microorganisms to their success in occupying niches; 5. apply some basic principles and knowledge of microbiology to real life situations; 6. explain how the strategies employed by pathogens can avoid the host defenses. \r  學生應該能夠 1. 知悉有關微生物學的基本知識和技術；\r 2. 認識微生物的性質和影響；\r 3. 比較和對比微生物和多細胞生物的特點；\r 4. 掌握微生物的結構或生理適應如何使他們能夠成功佔據其生態位；\r 5. 把一些微生物學上的基本原則和知識應用到現實生活的情境中；\r 6. 解釋病原體如何使用各種戰略來迴避宿主的防禦。", "syllabus": "I. Principles of microbiology \r (A) Microbial life: Origin and discovery \r (B) Observing the microbial cell \r (C) Bacteria: Structure and function\r  II. Microbial culture, metabolism, growth and development \r (A) Bacterial culture \r (B) Bacterial growth and development \r (C) Microbial metabolism\r  III. Environmental influences and control of microbial growth \r (A) Environmental influence of microbial growth\r (B) Control of microbial growth \r  IV. Microbial catabolism and biosynthesis \r (A) Catabolism \r (B) Biosynthesis \r  V. Microbial genomics\r (A) Genomic view of microbial life \r  VI. Applied microbiology \r (A) Environmental microbiology \r  VII. Virology\r (A) Viruses: Structure and function", "required_readings": "", "recommended_readings": "1. Textbook: Slonczewski and Foster, 2017. Microbiology: An Evolving Science. 4th Edition (Recommended textbook)\r I. Chapters 1, 2 and 3\r II. Chapters 4 and 14\r III. Chapter 5\r IV. Chapters 13 and 15\r V. Chapters 7 and 9\r VI. Chapters 21 and 22\r VII. Chapter 6\r  2. Madigan, M.Y., Martinko, J.M., Dunlap, P.V. and Clark, D.P. 2009. Brock Biology of Microorganisms. 12 Edition. Benjamin Cummings, New York, USA.\r  3. Wiley, J.M., Sherwood, L.M. and Woolverton, C.J. 2009. Prescott's Principles of Microbiology. McGraw-hill Higher education, New York, USA.", "terms": {"2020-21 Term 1": {"--LEC (7517)": {"startTimes": ["8:30", "8:30"], "endTimes": ["10:15", "9:15"], "days": [3, 1], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor LUO Haiwei, \n\rProfessor WONG Po Keung", "Professor LUO Haiwei, \n\rProfessor WONG Po Keung"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12", "7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}, "2021-22 Term 1": {"--LEC (4810)": {"startTimes": ["8:30", "8:30"], "endTimes": ["9:15", "10:15"], "days": [1, 3], "locations": ["William M W Mong Eng Bldg LT", "Science Centre L1"], "instructors": ["Professor LUO Haiwei, \n\rProfessor WONG Po Keung", "Professor LUO Haiwei, \n\rProfessor WONG Po Keung"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11", "8/9", "15/9"]}}}, "assessments": {"Short answer test or exam": "20", "Selected response test or exam": "80"}}, {"code": "3413", "title": "Microbiology Laboratory", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Corequisite: BIOL3410.", "description": "This experimental course introduces fundamental concepts and techniques used in microbiology, including microbial techniques, bacterial growth characteristics, biochemical activities of bacteria and identification of unknown bacteria.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3420", "title": "Advanced Genetics and Epigenetics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Pre-requisite: BIOL2410", "description": "If each cell in our body contains identical DNA sequence, how can they selectively activate or repress distinct sets of genes, leading to different morphology, behaviour and phenotype? To address this fundamental question in biology, one would need to examine not just the genome but also the epigenome. Here, the term epigenetics refers to heritable changes that can regulate genes expression without altering the DNA sequence. This course will cover different aspects of transcriptional regulation, modification and organization of the chromatin, RNA and DNA modification, non-coding RNA, biological network and nuclei organization, as well as the computation challenges associated with deciphering genomic and epigenetic data. It will focus on different cutting edge genomic approaches and technologies, with the aim to let students develop critical thinking skills to solve biological problems using these molecular tools and methods.", "outcome": "Learning Outcome   Knowledge1. Understand key concepts in genome, epigenome and functional genomics2. Acquire the ability to comprehend transcription regulations at multiple levels.3. Understand and evaluate the research methods for studying epigenetic modifications, chromatin modifications, chromatin structure, non-coding RNA Skill1. Acquire skills in molecular biology, genetic, genomics and bioinformatics.2. Acquire analytical and oral communication skills.3. Acquire problem solving skill. Value1. Acquire responsible attitude to the pros and cons of various aspects of advanced genetic, epigenetics and genomics.2. Appreciate their impact on society and environment.      知識基因組，轉錄調控，表觀遺傳修飾，染色質修飾，染色質結構，非編碼RNA 技能分子生物學方法，DNA測序，序列比較，計算生物學 價值了解先進遺傳和基因組學技術各個方面的優缺點及其對社會和環境的影響。了解科學家如何使用現代基因組技術研究科學問題       知识基因组，转录调控，表观遗传修饰，染色质修饰，染色质结构，非编码RNA 技能分子生物学方法，DNA测序，序列比较，计算生物学 价值了解先进遗传和基因组学技术各个方面的优缺点及其对社会和环境的影响。了解科学家如何使用现代基因组技术研究科学问题   ", "syllabus": "The purpose of this course is to get an in-depth understanding in genetics with a special focus on epigenetic regulation. The course integrates advance genomics, functional genomics and bioinformatics. It also provides an overview of the relevant methods that are used in research to analyse DNA, gene expression and gene function. It provides a knowledge base that enables the student to successfully move on and master advanced topics in genomics.本課程的目的是使學生深入了解遺傳學以及表觀遺傳調控。該課程整合了基因組學，功能基因組學和生物信息學。學生將學習如何使用基因組學數據，研究基因表達的調控，和從基因組層面研究基因功能的方法。本课程的目的是使学生深入了解遗传学以及表观遗传调控。该课程整合了基因组学，功能基因组学和生物信息学。学生将学习如何使用基因组学数据，研究基因表达的调控，和从基因组层面研究基因功能的方法。 ", "required_readings": "NA", "recommended_readings": "Lewin’s GENES XII, Jones & Bartlett Learning.Human Epigenetics How Science Works, Springer.The Developing Genome, Oxford University Press.", "terms": {"2021-22 Term 1": {"--LEC (5260)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Mong Man Wai Bldg 702"], "instructors": ["Professor ZHONG Silin"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Essay test or exam": "50", "Presentation": "25", "Selected response test or exam": "25"}}, {"code": "3530", "title": "Plant Physiology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Pre-requisite: BCHE2030.", "description": "This course provides students with a basic understanding of the various processes involved in growth and development of plants. Topics include plant-water relations, mineral nutrition, transport, photosynthesis, respiration, nitrogen metabolism and signalling, seed germination and dormancy, embryogenesis and organogenesis, reproduction and senescence, secondary metabolites and chemical defense, plant-microbe interactions, hormonal and environmental control of plant growth and development.\r", "outcome": "To give students the foundation knowledge in plant physiology that will enable them to have better understanding to plants and appreciate other related courses within the biology programme and the plant biotechnology programme.", "syllabus": "1. Course overview\r  2. Plant, water and minerals \r 2.1 Plant and water relations\r 2.2 Water balance of the whole plant\r 2.3 Mineral nutrients\r 2.4 Water and mineral transport\r  3. Metabolic physiology\r 3.1 Photosynthesis \r 3.2 C3 and C4 photosynthesis\r 3.3 Primary respiration pathway\r 3.4 Alternative respiration pathways\r 3.5 Nitrogen metabolism, transport and signaling\r 3.6 Secondary metabolites and plant defense\r  4. Growth and development\r 4.1 Photoreceptors and light control of plant development\r 4.2 Light signaling\r 4.3 Photoperiodism and control of flowering\r 4.4 Seed germination and dormancy\r 4.5 Embryogenesis and organogenesis\r 4.6 Reproduction and senescence\r 4.7 Hormonal control of plant growth and development\r 4.8 Hormone signaling\r  5. Plant-environment interactions\r  5.1 Plant responses to abiotic stress\r  5.2 Plant responses to biotic stress\r  课程提纲： 1. 課程概覽\r  2. 植物、水與礦物質 \r 2.1 植物與水的關係\r 2.2 植物的水平衡\r 2.3植物的礦物營養\r 2.4水與礦物質运输\r  3. 代謝生理\r 3.1 光合作用\r 3.2 C3與C4光合作用\r 3.3植物呼吸作用--主路呼吸途徑\r 3.4交替呼吸途径\r 3.5 氮代谢， 运输及信號傳遞\r 3.6次級代謝物與植物化學防禦\r  4. 生長與發育\r 4.1光受體與光對植物生長的調控\r 4.2 光信號傳遞\r 4.3 光週期與開花調控\r 4.4 種子萌發與休眠\r 4.5 胚胎發生與器官發生\r 4.6 生殖與衰老\r 4.7激素對植物生長和發育的調控\r 4.8 激素信號傳遞\r  5. 植物--環境相互作用\r 5.1 植物對非生物脅迫的響應\r 5.2植物對生物脅迫的響應", "required_readings": "", "recommended_readings": "1. Taiz L and Zeiger E (2010). Plant Physiology (5th Ed.), Sinauer Associates Inc., USA\r 2. Hopkins WG and Huner NP (2009). Introduction to Plant Physiology (4th Ed.), John-Wiley, N.Y.\r 3. Buchanan BB, Gruissem W and Jones RL (2000). Biochemistry and Molecular Biology of Plants, American Society of Plant Physiologists\r 4. Selected journal papers", "terms": {"2020-21 Term 2": {"--LEC (7231)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "11:15"], "days": [1, 4], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor HE Junxian, \n\rProfessor ZHUANG Xiaohong", "Professor HE Junxian, \n\rProfessor ZHUANG Xiaohong"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2", "14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 2": {"--LEC (5549)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "11:15"], "days": [1, 4], "locations": ["Mong Man Wai Bldg 707", "Mong Man Wai Bldg 707"], "instructors": ["Professor HE Junxian, \n\rProfessor ZHUANG Xiaohong", "Professor HE Junxian, \n\rProfessor ZHUANG Xiaohong"], "meetingDates": ["10/1", "17/1", "24/1", "13/1", "20/1", "27/1"]}}}, "assessments": {"Essay test or exam": "50", "Short answer test or exam": "50"}}, {"code": "3560", "title": "Biology of Fungi and Non-Vascular Plants", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Pre-requisite: LSCI1002.", "description": "This course studies the diversity of fungi and non-vascular plants (algae and bryophytes) in terms of morphology, development and biochemistry. Their survival strategies in different ecological habitats and human exploitation of these organisms will also be discussed.\r", "outcome": "The students will know:\r 1. the diversity of fungi and non-vascular plants (algae and bryophytes); 2. the adaptive features of these organisms to their habitats; 3. the survival features of these organisms to propagate the species; 4. the significance of some of these organisms in causing damages to habitats, human health and properties; 5. the benefits of some of these organisms in improving health, supplying food and providing fuel as well as other resources.\r  學生會認識： 1。真菌和非維管束植物（藻類和苔蘚植物）的多樣性; 2。這些生物及其生境的適應特徵; 3。這些生物繁衍後代的生存策略; 4。某些真菌和非維管束植物能損害生境，人類健康和財物; 5。某些真菌和非維管束植物能改善人類健康，供應食物和提供燃料等資源。\r  学生会认识： 1 真菌和非维管束植物（藻类和苔藓植物）的多样性; 2 这些生物及其生境的适应特征; 3 这些生物繁衍后代的生存策略; 4 某些真菌和非维管束植物能损害生境，人类健康和财物; 5 某些真菌和非维管束植物能改善人类健康，供应食物和提供燃料等资源。", "syllabus": "1. Basic Concepts about Biodiversity\r 2. Introduction to Fungi, and Fungal-like Organisms (Water Molds & Slime Molds) \r 3. True Fungi: Chytrids & Zygomycetes\r 4. True Fungi: Ascomycetes\r 5. True Fungi: Basidiomycetes\r 6. Spore Dispersal of Fungi\r 7. Case Studies and Class Activity\r 8. Introduction to the Green World– Plastids and Algae\r 9. Algal Diversity\r 10. Impact of Algae – Treasure and Trouble from the Sea\r 11. Introduction to Land Plants \r 12. Bryophytes – Diversity, Survival strategies and Application values\r 13. Group Presentation on a Specific Topic on Fungi, Algae or Bryophytes\r  1. 生物多樣性的基本概念\r 2. 真菌與類真菌生物（黏菌及卵菌）的簡介\r 3. 真正的真菌: 壺菌和接合菌\r 4. 真正的真菌: 子囊菌\r 5. 真正的真菌: 擔子菌\r 6. 真菌孢子的傳播\r 7. 案例研究和課堂活動\r 8. 綠色世界的簡介- 質體和藻類\r 9. 藻類多樣性\r 10. 藻類的影響 - 海中的寶藏和麻煩\r 11. 陸生植物的介紹\r 12. 苔蘚植物 - 多樣性，生存策略和應用價值\r 13. 分組報告: 有關真菌，藻類或苔蘚植物的特定主題", "required_readings": "Reference books:\r • Watkinson, S.C., Money, N. and Boddy, L. (2015). The Fungi (3rd Edition). Waltham, MA : Academic Press is an imprint of Elsevier. http://library.cuhk.edu.hk/record=b6070663~S15\r • Evert, R.F. and Eichhorn, S.E. (2013). Raven Biology of Plants (8th Edition). Freeman & Co. \r • Meredith, B., Vilgalys, R., James, T.Y. and Taylor, J.W. 2012. Fungi. Eumycota: mushrooms, sac fungi, yeast, molds, rusts, smuts, etc.. Version 30 January 2012. http://tolweb.org/Fungi/2377/2012.01.30 in The Tree of Life Web Project, http://tolweb.org/ \r • Lepp, H. Centre for Australian National Biodiversity Research and Australian National Herbarium. 2012. Information about Australia’s Flora: Australian Fungi. [ONLINE] Available at: https://www.anbg.gov.au/fungi/two-groups.html.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (4536)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Dr. CHOW Cheung Ming, \n\rProfessor ZHUANG Xiaohong"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2021-22 Term 1": {"--LEC (6486)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Y.C. Liang Hall 104"], "instructors": ["Dr. CHOW Cheung Ming, \n\rProfessor ZHUANG Xiaohong"], "meetingDates": ["8/9", "15/9"]}}}, "assessments": {"Essay test or exam": "40", "Others": "5", "Presentation": "15", "Short answer test or exam": "40"}}, {"code": "3570", "title": "Biology of Vascular Plants", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Pre-requisite: BIOL3560.", "description": "A study of pteridophytes, gymnosperms and angiosperms with emphasis on their functional morphology, life cycle, evolutionary features and ecological adaptations. This course includes anatomical study on structure and development of selected vascular plants. The economic importance of vascular plants will also be discussed.\r", "outcome": "The students should understand:\r 1. Classification of vascular plants; 2. Major adaptations of land plants to meeting the demands for living on land; 3. Plant forms and life cycles of ferns and fern allies; 4. Plant forms and life cycles of gymnosperms and angiosperms, particularly the evolution of pollen grains, seeds, flowers and fruits, and the evolutionary relationship of major groups; 5. Adaptation syndromes and evolutionary ecology principles for success in the seed model: pollination, dispersal and germination; 6. Selective illustrations on plant strategies and adaptations\r  學生應能理解： 1. 維管植物的分類; 2. 陸生植物在陸地生長的主要適應作用; 3. 蕨類植物的形態和生活史; 4. 裸子及被子植物的形態和生活史，特別著重花粉、種子、花和果實的進化，以及各主要類别在進化上的關係; 5. 達至種子模式的成功的適應徵狀和進化生態原理，包括授粉作用、種子散播和萌發; 6. 植物的策略和適應的個别例子。\r  学生应能理解： 1. 维管植物的分类; 2. 陆生植物在陆地生长的主要适应作用; 3. 蕨类植物的形态和生活史; 4. 裸子及被子植物的形态和生活史，特别着重花粉、种子、花和果实的进化，以及各主要类别在进化上的关系; 5. 达至种子模式的成功的适应征状和进化生态原理，包括授粉作用、种子散播和萌发; 6. 植物的策略和适应的个别例子。", "syllabus": "1. Tracheophytes: Introduction & Organization of the Plant Body\r 2. Seedless Vascular Plants: Lycophytes and Monilophytes\r 3. Seed Plants: Gymnosperms\r 4. Seed Plants: Angiosperms\r 5. Pollination, Dispersal and Seed Dormancy\r 6. Economic Uses of Plants\r 7. Field Trip/ Visit and Class Activity\r  1. 維管植物的介紹和組織\r 2. 無種子維管植物: 蕨類植物\r 3. 種子植物: 裸子植物\r 4. 種子植物: 被子植物\r 5. 授粉作用、傳播作用與種子休眠\r 6. 植物的經濟利用\r 7. 實地考察/參觀和課堂活動\r  1. 维管植物的介绍和组织\r 2. 无种子维管植物: 蕨类植物\r 3. 种子植物: 裸子植物\r 4. 种子植物: 被子植物\r 5. 授粉作用、传播作用与种子休眠\r 6. 植物的经济利用\r 7. 实地考察/参观和课堂活动", "required_readings": "1. Evert, R.F. and Eichhorn, S.E. (2013). Raven Biology of Plants (8th Edition). Freeman & Co. \r 2. Ingrouille M.J. and Eddie, B. (2006). Plants: Diversity and Evolution. Cambridge University Press.\r 3. Selected articles", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (5317)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. CHOW Cheung Ming"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 2": {"--LEC (7323)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Science Centre L5"], "instructors": ["Dr. CHOW Cheung Ming"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Essay test or exam": "45", "Others": "15", "Short answer test or exam": "40"}}, {"code": "3610", "title": "Invertebrate Form and Function", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Pre-requisite: LSCI1002 or permission of instructor (Not applicable to Old Curriculum students).", "description": "The morphology, ecology, reproduction, development, life history and phylogeny of major groups of invertebrates will be examined. The function of organ systems will be discussed with reference to the adaptations to the mode of life of the animals.\r", "outcome": "The course is one of the “biodiversity” courses for Biology major students, which as a whole introduce students to the diversity and general biology of different groups of living organisms. The learning outcomes of this course on invertebrates are:\r To understand the form and function of major groups of invertebrates, with emphasis on adaptations, reproduction and development.\r To familiarise the classification and phylogenetic relationships of the invertebrates.\r To develop independent reading ability through weekly reading assignment of scientific papers in invertebrate biology.\r  本科是為主修生物學同學而設的“生物多樣性”課程的其中一個課程。本科為同學介紹生物多樣性和各類主要無脊椎動物的基本生物學。本科對無脊椎動物的學習果效為﹕ • 了解主要無脊椎動物的型態及功能，並着重其適應、生殖及發育。 • 熟識無脊椎動物之分類和種源關係。 • 透過每星期有關於無脊椎動物學文獻的閱讀作業，培養學生獨立閱讀能力。", "syllabus": "The morphology, ecology, reproduction, development, life history and phylogeny of major groups of invertebrates will be examined. The function of organ systems will be discussed with reference to the adaptations to the mode of life of the animals.\r  本科探討各類主要無脊椎動物之型態、生態、生殖及發育、生活史及其種族發生之關係，各器官功能及其生活方式之相互適應。", "required_readings": "", "recommended_readings": "Brusca, R.C., Moore, W. and Shuster, S.M. (2016) Invertebrates. 3rd edition. Sinauer Associates, Sunderland, MA. \r Hickman, C.P., Jr., L.S. Roberts, S.L. Keen, A. Larson and D.J. Eisenhour (2015) Animal Diversity. 7th edition. McGraw-Hill, New York. \r Holland, P. (2011) The Animal Kingdom: A Very Short Introduction. Oxford University Press, Oxford. \r Moore, J. (2006) An Introduction to the Invertebrates. 2nd edition. Cambridge University Press, Cambridge. \r Pechenik, J.A. (2015) Biology of the Invertebrates. 7th edition, McGraw-Hill, Boston. \r Ruppert, E.E., R.S. Fox and R.D. Barnes (2004) Invertebrate Zoology: A Functional Evolutionary Approach. 7th edition. Thomson-Brooks/Cole, Belmont, CA.", "terms": {"2020-21 Term 1": {"--LEC (7518)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor CHU Ka Hou"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}}, "2021-22 Term 1": {"--LEC (6516)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Science Centre L2"], "instructors": ["Professor CHU Ka Hou"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}, "assessments": {"Essay test or exam": "40", "Short answer test or exam": "30", "Selected response test or exam": "30"}}, {"code": "3620", "title": "Vertebrate Life", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Pre-requisite: LSCI1002 and BIOL2210 or permission of instructor (Not applicable to Old Curriculum students).", "description": "Vertebrate Life is a course that deals with the evolution and phylogenetic relationships of vertebrates. This course will explore the morphological, anatomical, physiological, biochemical and behavioural characteristics of vertebrates, and discuss how these characteristics enable vertebrate animals to adapt to the environment and to maintain homeostasis. The life of vertebrates is a reflection of the adaptive strategies employed by vertebrate animals to secure success in the environment.\r", "outcome": "1. To recognize the major groups of vertebrates and to understand their evolutionary history and phylogenetic relationships \r 2. To appreciate the diversity of morphological, anatomical, physiological and biochemical adaptations of vertebrates \r 3. To appreciate that vertebrate life is a reflection of the adaptive strategies employed by vertebrates for survival\r 4. Develop critical thinking skills in appreciating problems in vertebrate biology\r 5. Able to collect and critically analyze information from the primary literature\r 6. Develop critical reading and writing skills \r  1 認別主要脊椎動物組和明瞭其進化史和種系發育關係\r 2 領會脊椎動物在形態、解剖、生理和生化的適應多樣性\r 3 領會脊椎動物的生存是反映其適應策略\r 4 發展評論性思考以領會脊椎生物學的問題\r 5 能收集和評論性的分析初級文獻\r 6 發展評論性的閱讀和書寫技巧", "syllabus": "(1) Protochordates (2) Agnathans, development of jaws and fins, Gnathostomata (3) Evolution of the Chondrichthyes, Sarocopterygii and Actinopterygii (4) Evolution of air-breathing, swimbladder and aortic arches (5) Amphibia: origin and evolution, reproduction and development (6) Urodeles, anurans and caecilians (7) Origin of amniotic vertebrates, conquest of dry land: Reptilia (8) Extant reptiles: chelonians, squamates, crocodilians; Phylogeny of extinct reptiles: dinosaurs, pterosaurs (9) Aves; Archaeopteryx, birds as descendants of Archosaurs (10) Principles of bird flight, structural, physiological and biochemical considerations (11) Adaptive radiation in extant birds (12) Mammalian life, Prototheria and Metatheria (13) Adaptive radiation of extant eutherian mammals, Evolution of Primates\r  (1) 原索動物；(2) 無頜類、有頜類、頜和鮱的演化；(3) 軟骨魚類、肉鮱魚網和輻鰭魚網的演化；(4) 魚鰾呼吸空氣和主動脉弓的演化關係；(5) 兩棲類的起源、演化、繁殖和發育 (6) 有尾目、無尾目和無足目；(7) 羊膜脊椎動物的起源、爬行類與征服乾陸；(8) 現存爬行動物多樣性、恐龍和翼龍的演化；(9) 鳥類為祖龍的後代、始祖鳥；(10) 鳥類的飛行原理、結構、生理和生化特徵；(11) 鳥類的適應輻射；(12) 原獸、後獸和真獸的適應輻射；(13) 靈長類的演化。", "required_readings": "", "recommended_readings": "1. Pough, F. H., Janis, C. M. and Heiser, J. B. (2009) Vertebrate Life. 8th Edition, Benjamin Cummings, San Francisco.\r 2. Kardong, K. V. (2009) Vertebrates: Comparative Anatomy, Function, Evolution. 5th Edition, McGraw Hill, New York. \r 3. Kent, G. C., Carr, R. K. (2001) Comparative Anatomy of the Vertebrates. 9th Edition, McGraw Hill. \r 4. Linzey, D. (2001) Vertebrate Biology. McGraw Hill, Boston. \r 5. Young, J. Z. (1981) The Life of Vertebrates. 3rd Edition. Oxford University Press, Oxford.", "terms": {"2020-21 Term 2": {"--LEC (7850)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor TSANG Ling Ming"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (7013)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Y.C. Liang Hall 103"], "instructors": ["Professor TSANG Ling Ming"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Essays": "15", "Essay test or exam": "50", "Short answer test or exam": "20", "Selected response test or exam": "15"}}, {"code": "3630", "title": "Animal Physiology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Not for students who have taken FNSC4101. Prerequisite: BIOL2120 and BCHE2030.", "description": "Physiology is the study of body functions. Using both integrative and comparative approaches, this course covers different functions of animals such as neural conduction and integration, endocrine communication, muscle contraction, circulation, respiration, excretion, reproduction, etc., and the maintenance of a stable internal environment. The adaptive and evolutionary changes in different groups of animals are also discussed and compared.\r", "outcome": "The students are expected to develop a good understanding of the basic physiological concepts and principles underlying the functions of each major organ system as well as the body as a whole. After completion of the course, the students are supposed to have learnt and understand the following key issues and principles of animal physiology, which will be essential for them to pursue a career in teaching, research in the areas of animal biology and biomedical sciences, as well as biotech and biomedical industry.\r  修读本科目的学生应掌握动物生理学的基本概念和原理，全面了解动物体各主要器官系统以及整体的功能。这些知识将有助于未来从事生物学教学、与动物学和生物医学有关的研究、以及生物及生物医学产品研发等。", "syllabus": "Introduction\r -Scope of physiology\r -Some history on animal physiology\r -Scaling, homeostasis, cellular communication\r -Membrane potential\r  Neuronal Physiology\r -Graded potentials\r -Action potentials\r -Electrical and chemical synapses\r -Neural signaling\r  Nervous System \r -Classes of neurons\r -Sympathetic and parasympathetic nervous system\r -Blood-brain barrier\r -Structure and functions of brain\r -Short-term and long-term memory\r -Short-term and long-term memory (Cont)\r -Sleep\r  Sensory Physiology I\r -Somatosensory pathway\r -Mechanoreception (touch and hearing)\r -Chemoreception (taste and smell)\r -Photoreception (sight)\r  Endocrinology\r -Classes of hormones\r -Hypothalamic-hypophyseal portal system\r -Thyroid glands and thyroid hormones\r -Endocrine control of fuel metabolism, stress responses and calcium metabolism\r  Muscle Physiology\r -Categorisation of muscles\r -Structural organisation of a sarcomere\r -Molecular basis of skeletal muscle contraction\r -Control of skeletal muscle contraction (force and frequency)\r -Skeletal muscle metabolism and fibre types\r -Smooth and cardiac muscles\r  Cardiovascular System\r -The heart and the cardiac cycle (electrical and mechanical events)\r -Cardiac output and its control\r -Open and closed circulatory systems\r -Blood vessels and blood pressure\r -Distribution of blood and its regulation\r -The blood and its functions\r -Haemopoiesis \r -Clotting and platelet plug formation\r  Respiratory System\r -Respiratory processes\r -Air and water respirers\r -Respiratory mechanics\r -Circulatory transport and gaseous exchange\r -Oxygen-haemoglobin dissociation curve\r -Control of respiration\r  Excretory System\r -Selective retention and excretion of materials\r -Excretory organs\r -Nephron structure and functions-Glomerular filtration, tubular reabsorption, tubular secretion and osmoconcentration\r -Bladder storage and micturition\r  Digestive System\r -Sensors and effectors of the digestive system\r -Mastication and salivary secretion\r -Gastric storage, mixing and emptying\r -Control of gastric secretions\r -Digestive accessory organs and their secretions\r -Structure of a villus\r -Segmentation and migrating motility complex\r -Small intestine, digestion and absorption of nutrients\r -Haustral & peristaltic contractions and mass movements\r -Coprophagy in some animals\r  Reproductive System\r -Asexual and sexual reproduction\r -Oviparity, ovoviviparity and viviparity\r -Male and female reproductive physiology\r -Parturition and lactation", "required_readings": "", "recommended_readings": "1. Animal Physiology: From Genes to Organisms (1st Ed., Sherwood, L. et al., Thomson Brooks/Cole, Belmont, CA)\r 2. Principles of Animal Physiology (Schulte, Pearson)\r 3. Human Physiology An Integrated Approach (6th edition, Silverthron)", "terms": {"2020-21 Term 1": {"--LEC (7519)": {"startTimes": ["10:30", "10:30"], "endTimes": ["11:15", "12:15"], "days": [5, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Miss YAM Kwan Mei", "Miss YAM Kwan Mei"], "meetingDates": ["11/9", "18/9", "25/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2021-22 Term 1": {"--LEC (7910)": {"startTimes": ["10:30", "10:30"], "endTimes": ["11:15", "12:15"], "days": [5, 3], "locations": ["Lee Shau Kee Building LT2", "Y.C. Liang Hall 103"], "instructors": ["Miss YAM Kwan Mei", "Miss YAM Kwan Mei"], "meetingDates": ["10/9", "17/9", "24/9", "8/9", "15/9"]}}}, "assessments": {"Essay test or exam": "70", "Selected response test or exam": "30"}}, {"code": "3710", "title": "Marine Biology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Pre-requisite: BIOL2210", "description": "This course gives an introduction to the physical and chemical aspects of the marine environment, and to life in the oceans and coastal waters. The major groups of marine organisms will be treated, with a consideration of the factors influencing their distribution and abundance. Productivity of the marine environment and its present and future utilization by man will also be discussed.\r", "outcome": "Knowledge:\r - An understanding of fundamental concepts in marine ecology, marine animal and plant physiology and biology, including those of algae, seagrass, mangroves, plankton, corals, fish, turtles, sea birds, mammals and other intertidal and subtidal organisms.\r - Adaptations of marine planktonic and benthic organisms to their environment.\r  Skill: \r - An introduction to approaches to analysis of data, search for online information, interpretation of results and experimental designs to carry out marine biological research. \r  Value:\r - An appreciation of the diversity and wonders of the marine environment, especially the biology of the organisms that live in it and how they interact with the environment. \r - An understanding of how the marine environment is closely related to our lives.\r  學習成果： 知識： - 理解海洋生態、海洋動、植物生理學和生物學的基本概念，包括藻類、海草、紅樹林、浮游生物、珊瑚、魚類、海龜、海鳥、哺乳動物和其他潮間帶和潮下帶生物。\r -海洋浮游和底棲生物對他們的環境的適應。\r  技巧： -探討進行海洋生物研究的方法，包括數據分析、解釋，網上搜索資料與實驗設計。\r  價值： -欣賞海洋生物的多樣性和其奧妙，尤其是各種生物如何與環境互動。\r -了解海洋環境如何跟我們的生活息息相關。", "syllabus": "Topics: Contents/ fundamental concepts\r  1. Introduction to the Marine Environment: Physical and chemical forces that shape the marine environment.\r  2. Plankton Biology: Ecology and adaptations of plankton organisms.\r  3. Benthic Communities: Fundamental processes in the marine benthic environment, interactions between marine organisms and their physical and chemical environment in different marine habitats.\r  4. Estuaries: Meeting of freshwater and marine environments, fundamental adaptation of organisms in this unique habitat.\r  5. Marine fish, marine mammal and seabird: Behaviour, adaptation and physiological ecology of marine fish, mammals and seabirds\r  １．海洋環境簡介: 塑造了海洋環境的物理和化學力量。\r  ２．浮游生物: 浮游生物的生態與其適應方式。\r  ３．底棲生物群落: 海洋底棲環境的基本變化過程，海洋生物之間的相互作用及不同的海洋生境的物理和化學環境。\r  ４．河口: 淡水和海洋之相 匯，在這個獨特棲息地的生物對環境之基本適應。\r  ５．海洋魚類、海洋哺乳動物和海鳥: 海洋魚類、海洋哺乳動物和海鳥的行為、適應性和生理生態。", "required_readings": "", "recommended_readings": "Main Reference\r  Nybakken, James W. and Bertness, Mark D. 2005. Marine Biology. An Ecological Approach. 6th Edition. Pearson/Benjamin Cummings, San Francisico. 579 pp. [QH91 N9 2004]\r  General Readings:\r  Castro, Peter. Huber Michael E. 2005. Marine Biology. McGraw-Hill, Higher Education, Boston. [QH91 .C37 2005]\r  Karleskint, George Jr.; Turner, Richard; Small, James W. Jr. 2006. Introduction to Marine Biology (Second Edition). Thompson Higher Education. ISBN: 0-534-42072-9\r  Sumich, James L., Morrissey, John F. 2004. Introduction to the Biology of Marine Life. Jones and Bartlett Pub., Boston. [QH91 .S75 2004]\r  Journal and Web Materials:\r  Other journal articles and web materials to be given from time to time for additional references and source materials.", "terms": {"2020-21 Term 1": {"--LEC (5880)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "11:15"], "days": [1, 4], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor CHUI Pui Yi, \n\rProfessor LEE Shing Yip, \n\rProfessor Laura Jane FALKENBERG", "Professor CHUI Pui Yi, \n\rProfessor LEE Shing Yip, \n\rProfessor Laura Jane FALKENBERG"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "10/9", "17/9", "24/9"]}}, "2021-22 Term 1": {"--LEC (6517)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "11:15"], "days": [1, 4], "locations": ["Y.C. Liang Hall 104", "Y.C. Liang Hall 103"], "instructors": ["Professor CHUI Pui Yi, \n\rProfessor LEE Shing Yip, \n\rProfessor Laura Jane FALKENBERG", "Professor CHUI Pui Yi, \n\rProfessor LEE Shing Yip, \n\rProfessor Laura Jane FALKENBERG"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11", "9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Essays": "10", "Essay test or exam": "30", "Short answer test or exam": "30", "Selected response test or exam": "30"}}, {"code": "4010", "title": "Evolutionary Biology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Prerequisite: BIOL2210 or BIOL2310 or BIOL2410.", "description": "This course introduces students to the pattern and processes of evolution. The course begins with an introduction of the history and philosophy of evolutionary ideas, followed by the genetics of adaptation, natural selection and speciation, and then on to the geological record and the fossil record of origination and extinction, and finishes with a discussion of the principle and practice of phylogenetic analyses and the molecular basis of evolution. Case studies on the use of molecular data in the study of evolutionary processes, biogeography and the history of life (including human evolution) will be included. This course is specially designed for advanced level of undergraduates, not only because of the course content, but it requires the students to think and integrate knowledge learnt from different courses in biology, molecular biology, cell biology, biotechnology, genetics, ecology, etc. In addition, a problem will be initiated by students and to be solved via searching for knowledge and information from diverse channels not only limited to scientific journal articles. Furthermore, a voluntary/optional field trip is organized for the students to define the problem of their own interests. These will help students to understand and analyse the problems from various aspects and multiple angles. Feedbacks will be provided throughout the course at different checkpoints.\r", "outcome": "Knowledge\r • understand the key concepts in evolutionary biology\r • understand and evaluate the research methods in evolutionary biology\r • understand the principle and practice of phylogenetic analysis and its relationships to biological classification\r • understand the molecular basis of evolution and the use of molecular data in studies on evolutionary processes, biogeography, and the history of life\r • understand the linkage between the modern theory of evolution and other biological disciplines such as zoology, botany, genetics, ecology and molecular biology\r  Skill\r • understand and communicate ideas in biological evolution to individuals with or without scientific background\r  Value\r • Appreciate the importance of evolutionary analysis in areas including medicine, conservation biology and arthropology\r • Familiar with important questions and key issues in evolutionary biology\r  知識 o 明白演化生物學的關鍵概念\r o 理解及評價演化生物學的研究方法\r o 理解系統分析的原理及其與生物分類學的關係，並加以實踐\r o 明白演化論的分子基礎及理解分子數據在研究演化進程、生物地理學與生命歷史中的應用\r o 理解現代演化學理論與其他生物學科 (如動物學、植物學、基因學、生態學和分子生物學) 的關聯\r  技巧 • 能和其他有或者沒有科學學術背景的人討論及交流生物演化論的見解  價值 • 領會演化論在醫學、環保科學及人類學中的重要性 • 熟悉演化生物學內的關鍵問題及焦點", "syllabus": "1. History of evolutionary theory \r 2. Variation/Adaptation/Natural selection\r 3. Population genetics\r 4. Species concepts\r 5. Reproductive isolation mechanisms\r 6. Speciation\r 7. Classification and phylogeny \r 8. Molecular evolution and phylogenetics\r 9. Introduction\r 10. Molecular tools and data interpretation \r 11. History of the use of molecular data in evolutionary studies \r 12. Genetic variations in natural populations and gene flow\r 13. Species phylogeny and macroevolution \r 14. Fossil record\r 15. History of biodiversity\r 16. Rates of evolution\r 17. Extinction & mass extinction\r  1. 演化論的歷史\r 2. 變種/適應/天擇\r 3. 族群基因學\r 4. 種族的概念\r 5. 生殖隔離機制\r 6. 物種形成\r 7. 生物分類及種系發生\r 8. 分子演化論及種系發生學\r 9. 簡介\r 10. 分子技術及資料分析\r 11. 分子分析數據在演化研究的使用及歷史\r 12. 自然族群的基因變種及基因流\r 13. 物種的種系發生及宏觀演化\r 14. 化石紀錄\r 15. 生物多樣性的歷史\r 16. 演化的速度\r 17. 滅絕和大滅絕\r  Students are expected to revise the teaching materials after every single lecture, as the concepts keep building on each other as the course proceeds. Students are also expected to keep reading different scientific research papers throughout the course for preparation and hand-in the essay of any topics related to evolutionary biology. At the end of September, students are required to hand in the title and 3 key references of his/her own chosen topic based on interests. At the end of October, the students are required to hand in an abstract of the essay. And at the end of November, students will be handing the final essay of their own chosen topics. Students will appreciate the importance of evolutionary analysis in other disciplines such as medicine, conservation biology and arthropology; and also get familiar with important questions and key issues in evolutionary biology.", "required_readings": "", "recommended_readings": "1. Ridley, M. 2004. Evolution. 3rd edition, Blackwell, London. \r 2. Avise, J.C. 2004. Molecular Markers, Natural History and Evolution. 2nd edition Sinauer, Saunderland, MA.\r 3. Herron, J.C. & S. Freeman. 2013. Evolutionary Analysis. 5th edition. Pearson, London.", "terms": {"2020-21 Term 1": {"--LEC (7225)": {"startTimes": ["14:30", "13:30"], "endTimes": ["16:15", "14:15"], "days": [1, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor HUI Jerome Ho Lam, \n\rProfessor LUO Haiwei", "Professor HUI Jerome Ho Lam, \n\rProfessor LUO Haiwei"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2021-22 Term 1": {"--LEC (6612)": {"startTimes": ["14:30", "13:30"], "endTimes": ["16:15", "14:15"], "days": [1, 3], "locations": ["Mong Man Wai Bldg 703", "Mong Man Wai Bldg 703"], "instructors": ["Professor HUI Jerome Ho Lam, \n\rProfessor LUO Haiwei", "Professor HUI Jerome Ho Lam, \n\rProfessor LUO Haiwei"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11", "8/9", "15/9"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "70", "Others": "10"}}, {"code": "4012", "title": "Field and Environmental Biology", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "LaboratoryInteractive Tutorial", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Co-requisite: BIOL2210 and 3710.", "description": "This course provides an opportunity for students to conduct field related exercises in the aquatic and terrestrial environments. Students will develop the practical skills in ecological and environmental evaluation of different habitats as well as learn the techniques used in data analysis. Field trips to different habitats will normally be conducted during Saturdays.\r", "outcome": "Knowledge:\r Integration of theory and practice in environmental biology through field exercises.\r  Skills: \r An understanding of basic methods in field and environmental research, data analysis and project coordination and presentation skills.\r  Values:\r - An appreciation of the wonder of the environment through fieldtrips and site visits.\r - An understanding of how our environment is closely related to our lives.\r  學習成果： 知識： 透過野外考察，實踐環境生物學的理論。  技巧： 理解野外及環境研究的基本方法，培養數據分析、項目協調和資訊通報表達的能力。  價值觀： - 透過實地考察，體會及鑒賞大自然的奧妙。\r - 了解自然環境如何跟我們的生活息息相關。", "syllabus": "Topics: Contents/ fundamental concepts\r  1. Introduction to the Marine Planktonic Environment. \r - Physical and chemical dynamics in the marine environment\r - Ecology and adaptations of plankton organisms\r  2. Marine Benthic Communities \r - Interactions, community and population processes in marine benthic environment, including the coral reef and rocky shores\r - Biodiversity of marine benthic community and its conservation\r  3. Freshwater System and Estuaries\r - Fundamental adaptation of organisms in the freshwater and estuarine habitats\r  4. Terrestrial Vegetation of Hong Kong\r - Distribution, diversity and adaptation of terrestrial in a subtropical environment like Hong Kong\r - Conservation of Hong Kong terrestrial habitats\r  １．介紹海洋浮游環境 －海洋環境中的物理和化學動態 －浮游生物的生態及對環境的適應  ２．海洋底棲生物群落 －海洋底棲環境，包括珊瑚礁和岩石海岸的相互作用、其包含的群落和群體  －海洋底棲生物群落的生物多樣性及其保護  ３．淡水系統和河口 －淡水棲息地和河口的生物及其對基本環境的適應  ４．香港陸地植被 －在亞熱帶地區的香港之陸地植被分佈、其多樣性和適應陸地環境的方法 －香港陸地棲息地之保育", "required_readings": "", "recommended_readings": "Main Reference\r  Laboratory Manual prepared by the Biology Department.\r  Journal and Web Materials:\r  Other journal articles and web materials to be given from time to time for additional references and source materials.", "terms": {"2020-21 Term 1": {"-L01-LAB (7323)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Science Ctr East Block E108"], "instructors": ["Professor CHUI Pui Yi"], "meetingDates": ["10/9", "17/9", "24/9"]}}, "2021-22 Term 1": {"-L01-LAB (6970)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Science Ctr East Block E108"], "instructors": ["Staff"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Lab reports": "45", "Others": "10", "Presentation": "15", "Short answer test or exam": "30"}}, {"code": "4032", "title": "Physiological Investigations", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "LaboratoryInteractive Tutorial", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Co-requisite: BIOL3530 or 3630.", "description": "This course let students learn some key physiological phenomena in both plants and animals through experiments. Students will learn and practice experimental skills in physiology including experimental design and data analysis. Prior completion or concurrent registration of BIOL3530 Plant Physiology and/or BIOL3630 Animal Physiology is highly recommended.\r", "outcome": "After this course, students should be able to:\r 1. Understand and master some basic skills in conducting research in plant and animal physiology, which include hydroponics, callus culture, biochemical tests, handling of rats and frogs, drug injection, blood sampling, animal dissection and PowerLab set up for data requisition.\r 2. Design proper experiments for physiological investigations.\r 3. Analyse and present experimental data logically.\r 4. Work in a research team.\r  修畢此課後，學生應能： 1. 理解並掌握一些從事植物和動物生理學研究的基本技能，其中包括：水耕栽培、癒傷組織的培養、生化檢測、大鼠和青蛙的處理、藥物注射、血液取樣、動物解剖、PowerLab實驗計錄設備的裝配以擷取實驗數據等。\r 2. 設計適當的實驗來探索生理學的奧秘。\r 3. 分析並有邏輯地展示實驗數據。\r 4. 在研究團隊中工作。", "syllabus": "Major experiments include: mineral nutrition, control of germination, growth and morphogenesis in plants by hormones and other plant growth regulators; and control of energy metabolism, glucose homeostasis, skeletal muscle contraction and cardiac functions by internal and external factors (e.g. hormones, drugs, temperature, etc.) in animals.\r  主要實驗內容包括植物的礦物營養、激素和其他生長調節劑對植物的萌發、生長和形態發育的調控；激素、藥物、温度等內在及外在因素對動物的能量代謝、葡萄糖平衡、肌肉收縮和心臟功能的調控等。", "required_readings": "Laboratory manuals.", "recommended_readings": "To be given during class.", "terms": {"2021-22 Term 2": {"-L01-LAB (6392)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Science Centre 392"], "instructors": ["Miss YAM Kwan Mei"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Lab reports": "40", "Others": "12", "Short answer test or exam": "40", "Selected response test or exam": "8"}}, {"code": "4120", "title": "Developmental Biology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Pre-requisite: BIOL2120.", "description": "This course deals with the principles and concepts of developmental biology. Topics include analysis of fundamental embryological process and consideration of major developmental biological problems such as cell fate determination, cell differentiation, pattern formation, morphogenesis, organogenesis, hormonal and environmental control of development in model organisms. Selected current topics and technology in developmental biology will also be discussed.\r", "outcome": "1. Students will acquire fundamental concepts and knowledge of developmental biology including cell fate determination, cell differentiation, body pattern formation, morphogenesis, organ formation, the molecular regulatory mechanisms of different developmental processes in different model organisms.\r 2. Students will acquire ability to comprehend the implication and application of developmental biology in the medical and biotechnology field. \r 3. Students will be introduced to the critical experimental evidence and current technology that has led to the formulation of the central concepts and novel findings in developmental biology. Thus, the students can learn how a biological question can be solved through experimental design and process.\r 4. Students will acquire skills in literature survey from various sources, analytical and problem solving skills through the course assessment.\r 5. This course equips students with the essential knowledge for studying the more advanced degree in biological science.\r 6. Students will acquire an educated mind and responsible attitude to judge on the application of latest developmental biological technique and findings in medical and biotechnology field for the good of human society and natural environment.\r  1. 學生將會習得發育生物學的基本概念及知識，包括模式生物的發育過程中的細胞命運決定、細胞分化、模式形成、形態發生、器官形成及分子控制機制。\r 2. 學生將能夠理解發育生物學在醫學及生物技術領域中的功能與應用。\r 3. 學生將會學到對建構發育生物學的核心概念及新發現有重大影響的實驗和當前技術。由此，學生能學習透過設計和進行實驗去解決生物學問題。\r 4. 學生將透過本科的評核，學習搜集資料進行文獻研究、分析及解決問題的技巧。\r 5. 本科教授學生修讀生物科學高級學位的必要知識。\r 6. 學生將會獲得足夠知識及負責任的態度，以社會及自然環境的利益為依歸，評核發育生物學應用於醫學及生物技術領域的最新技術和發現。", "syllabus": "The course will include the following topics:\r Introduction: The questions of Developmental Biology\r Gametogenesis: Oogenesis and Spermatogenesis\r Fertilization, Cleavage and Gastrulation\r Cell-fate specification and Lineage tracing\r Morphogenesis\r Model organisms in Developmental Biology\r Early Development, Gastrulation and Neurulation in Amphibians\r Development of Amniote\r Early Development and Gastrulation in Birds\r Early Development of Mammals\r Manipulating Mouse embryos\r Recent and Advanced Techniques in Developmental Biology: Stem Cell Technology\r Development of Ectodermal derivatives\r Development of Endodermal derivatives\r Development of Mesodermal derivatives \r Development of Drosophila and Patterning of Drosophila embryo\r Developmental Regulatory Networks : Patterning genes in Drosophila and Vertebrates\r The Roles of Hox genes in Vertebrate Development\r Regulatory mechanisms in Limb Development\r Current Topics in Developmental Biology\r  課程包括以下課題:\r 導論：發育生物學領域的課題 配子生成：卵子生成及精子生成 受精作用, 卵裂及原腸形成\r 細胞命運規範和細胞譜系追蹤 形態發生 發育生物學中的模式生物 兩棲類的早期發育, 原腸形成和神經胚形成\r 羊膜動物的發育 鳥類的早期發育和原腸形成 哺乳類的早期發育 小鼠胚胎的運用 發育生物學的最新和先進技術: 幹細胞技術\r 外胚層衍生物發育 內胚層衍生物發育 中胚層衍生物發育 果蠅的發育及胚胎的模式形成 發育的控制網絡：果蠅及脊椎動物的模式形成基因 Hox 基因在脊椎動物發育的角色\r 肢體發育的控制機制 發育生物學領域的熱門課題", "required_readings": "", "recommended_readings": "1. Fred H. Wilt and Sarah Hake (2004) Principles of Developmental Biology, 1st Edition, W.W. Norton& Company, New York and London\r 2. Scott F. Gilbert (2006) Developmental Biology, 8th Edition, Sinauer Associates, Inc. USA\r 3. Lewis Wolpert (2007) Principles of Development, 3rd Edition, Oxford University Press", "terms": {"2020-21 Term 1": {"--LEC (7520)": {"startTimes": ["9:30", "8:30"], "endTimes": ["10:15", "10:15"], "days": [1, 5], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor KWAN Kin Ming", "Professor KWAN Kin Ming"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "11/9", "18/9", "25/9"]}}, "2021-22 Term 1": {"--LEC (7911)": {"startTimes": ["9:30", "8:30"], "endTimes": ["10:15", "10:15"], "days": [1, 5], "locations": ["Mong Man Wai Bldg 707", "William M W Mong Eng Bldg 404"], "instructors": ["Professor KWAN Kin Ming", "Professor KWAN Kin Ming"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11", "10/9", "17/9", "24/9"]}}}, "assessments": {"Essays": "12", "Essay test or exam": "25", "Others": "3", "Short answer test or exam": "30", "Selected response test or exam": "30"}}, {"code": "4220", "title": "Environmental Biotechnology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Pre-requisite: BCHE2030 and BIOL2120.", "description": "This course deals with biotechnological principles and techniques, and their applications to resolve environmental problems. Underlying principles of biodegradation and biotransformation, and basic techniques such as culture collection and cell immobilization are introduced. Case studies emphasize on insect control, waste and wastewater treatment, energy production and cleanup of contaminated soils.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4230", "title": "Global Change Biology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Pre-requisite: BIOL2210.", "description": "This course will discuss the impact of global environmental changes on biological systems and their ecosystem services. We will focus on how global warming, and associated changes such as altered rainfall, sea level rise, and ocean acidification, have changed the biological communities of the Earth’s various ecosystems, from forests to coral reefs. The impact at biological levels from molecules to cells, organisms, populations, and communities will be explored. Models for projecting future changes in Earth systems, biological communities and ecosystem services under climate change will be introduced. While the major focus is on climate change, other aspects of global environmental change, such as habitat deterioration, will also be considered. Students are required to present case studies of global change biology based on latest research findings.\r", "outcome": "Knowledge\r • An understanding of fundamental topics in global change biology, including: the Earth system; changes in the physiology of organisms under altered environmental conditions; community and ecosystem responses; the human aspect; multiple stressors\r • A recognition of the links between impacts on different levels of biological organization; from molecules to cells, organisms, populations, and communities\r  Skill\r • Development of generic skills necessary in Life Science fields including the ability to research a topic independently, find and synthesize information from literature, ask critical questions\r • An introduction to approaches used to project future climates and organism/ecosystem responses\r  Value\r • An appreciation of current environmental changes that are unique relative to other periods in Earth history, and how these changes may impact ecosystem services that humans rely upon\r • Recognition that local human actions may mitigate largely-unmanageable effects of global change\r  知識  • 對全球變化生物學有基礎的認知，包括：地球系統、環境條件改變帶來的生物生理機能變化、群落與生態系統對環境變化的響應、全球變化對人類的影響和多重應激源。 • 理解全球變化對不同生物水平：分子、細胞、個體、種群、群落的影響以及不同層面之間的聯系。  技能 • 培養生命科學領域的基本技能，包括：獨立從事科研的能力、閱讀文獻並總結運用的能力和批判性思考的能力。 • 了解生命科學技術方法，用於預測未來氣候變化及生物體或生態系統對其的響應。  價值 • 認知目前地球史上前所未有的環境變化及其對人類所依附的生態系統造成的影響。 • 領會到即使是局部地區的人類在行為上做出改變也可以有效地緩解棘手的全球變化。  知识  • 对全球变化生物学有基础的认知，包括：地球系统、环境条件改变带来的生物生理机能变化、群落与生态系统对环境变化的响应、全球变化对人类的影响和多重应激源。 • 理解全球变化对不同生物水平：分子、细胞、个体、种群、群落的影响以及不同层面之间的联系。  技能 • 培养生命科学领域的基本技能，包括：独立从事科研的能力、阅读文献并总结运用的能力和批判性思考的能力。 • 了解生命科学技术方法，用于预测未来气候变化及生物体或生态系统对其的响应。  价值 • 认知目前地球史上前所未有的环境变化及其对人类所依附的生态系统造成的影响。 • 领会到即使是局部地区的人类在行为上做出改变也可以有效地缓解棘手的全球变化。", "syllabus": "I. Introduction – understanding the Earth system\r 1. The Earth system and natural/historical drivers and patterns of change (both in terms of climate, and biological responses)\r 2. Major features of present/future climate, including human-driven change (scenarios, models, validation, projections)\r 3. Approaches to monitor current and anticipate future biological change \r  II. Changes in organism physiology under altered conditions\r 1. Photosynthesis\r 2. Nutrient- and water-use efficiencies\r 3. Growth and reproduction\r 4. Phenology\r 5. Plant/algal quality and defenses\r  III. Community and ecosystem impacts of human-driven change\r 1. Population responses – e.g. range shifts\r 2. Community responses – e.g. alteration of species interactions; composition and diversity; parasites and pathogens \r 3. Ecosystem change – e.g. regime shifts; changes in net primary productivity, respiration, net ecosystem productivity, and nutrient cycling \r  IV. The human aspect\r 1. Anticipated impacts on humans – ecosystem services\r 2. Implications for conservation (adaptation of strategies, connectivity and landscape management, species management)\r 3. International policy (international climate policy, mitigation, carbon sinks and sources, assessing risks and designing solutions)\r  V. Additional considerations – multiple stressors\r 1. Non-climate change – e.g. habitat deterioration, pollution, over-fishing, species introductions, development\r 2. Interactive effects and feedbacks\r 3. Implications for management (rehabilitation and recovery)\r  I. 引言 – 了解地球系統\r 1. 地球系統、自然與由來已久的驅動力以及變化趨勢（在氣候和生物反應兩方面）\r 2. 現時和未來氣候的主要的特征，包括人為驅動的變化（前景、模型、驗證、推測）\r 3. 記錄當前和預測未來生物變化的方法\r  II. 生物生理機能隨環境條件變化的轉變\r 1. 光合作用\r 2. 吸收養分和水的性能\r 3. 成長與繁殖\r 4. 生物氣候學\r 5. 植物和藻類的性質與防禦機制\r  III. 人為驅動變化對生物群落和生態系統的影響\r 1. 種群反應（例：區域變動）\r 2. 群落反應（例：種間關系的改變 、結構與多樣性、寄生物與病原體）\r 3. 生態系統的變化（例：生態系統穩態轉換以及凈初級生產力、呼吸作用、凈生態系統生產力和養分循環的變化）\r  IV. 對人類的影響\r 1. 預期對人類的影響——生態系統服務功能\r 2. 對於環保的意義（策略的采用、不同生境之間的連通性與景觀管理、物種管理）\r 3. 國際政策（國際氣候政策、局勢緩解、碳匯與碳源、風險評估、解決措施）\r  V. 其他考量——多重應激源\r 1. 非氣候變化（例：生境惡化、汙染、過度捕撈、外來物種入侵、城市發展）\r 2. 交互作用和反饋\r 3. 對於管理的意義（重建和修復）\r  课程大纲 I. 引言 – 了解地球系统\r 1. 地球系统、自然与由来已久的驱动力以及变化趋势（在气候和生物反应两方面）\r 2. 现时和未来气候的主要的特征，包括人为驱动的变化（前景、模型、验证、推测）\r 3. 记录当前和预测未来生物变化的方法\r  II. 生物生理机能随环境条件变化的转变\r 1. 光合作用\r 2. 吸收养分和水的性能\r 3. 成长与繁殖\r 4. 生物气候学\r 5. 植物和藻类的性质与防御机制\r  III. 人为驱动变化对生物群落和生态系统的影响\r 1. 种群反应（例：区域变动）\r 2. 群落反应（例：种间关系的改变 、结构与多样性、寄生物与病原体）\r 3. 生态系统的变化（例：生态系统稳态转换以及凈初级生产力、呼吸作用、凈生态系统生产力和养分循环的变化）\r  IV. 对人类的影响\r 1. 预期对人类的影响——生态系统服务功能\r 2. 对于环保的意义（策略的采用、不同生境之间的连通性与景观管理、物种管理）\r 3. 国际政策（国际气候政策、局势缓解、碳汇与碳源、风险评估、解决措施）\r  V. 其他考虑——多重应激源\r 1. 非气候变化（例：生境恶化、污染、过度捕捞、外来物种入侵、城市发展）\r 2. 交互作用和反馈\r 3. 对于管理的意义（重建和修复）", "required_readings": "", "recommended_readings": "Hannah L. 2015. Climate Change Biology, 2nd edition, Academic Press, London UK, San Diego USA, Waltham USA, Oxford, UK \r Newman J.A., Anand M., Henry H.A.L., Hunt S., Gedalof Z. 2011. Climate Change Biology, CABI, Oxfordshire UK and Cambridge, USA", "terms": {"2020-21 Term 1": {"--LEC (7067)": {"startTimes": ["8:30", "12:30"], "endTimes": ["10:15", "13:15"], "days": [2, 4], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor LEE Shing Yip, \n\rProfessor Laura Jane FALKENBERG", "Professor LEE Shing Yip, \n\rProfessor Laura Jane FALKENBERG"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12", "10/9", "17/9", "24/9"]}}, "2021-22 Term 1": {"--LEC (6394)": {"startTimes": ["8:30", "12:30"], "endTimes": ["10:15", "13:15"], "days": [2, 4], "locations": ["Science Centre LG23", "Basic Med Sci Bldg LT"], "instructors": ["Professor LEE Shing Yip, \n\rProfessor Laura Jane FALKENBERG", "Professor LEE Shing Yip, \n\rProfessor Laura Jane FALKENBERG"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11", "9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Essay test or exam": "60", "Short answer test or exam": "40"}}, {"code": "4260", "title": "Conservation Biology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Not for students who have taken ENSC4260. Pre-requisite: BIOL2210.", "description": "This course aims to provide an in-depth discussion of problems and solutions of environmental and biodiversity conservation, including student presentations on endangered species around the globe. Students taking this course need to have fundamental knowledge of biology and ecology. Major topics include conservation genetics, techniques in assessing biodiversity, global biodiversity loss, design and role of reserves and protected areas, wildlife conservation, habitat restoration and conservation policy and laws. Emphasis will be given to problems of critical importance to Hong Kong and the world today.\r", "outcome": "Students are expected to appreciate the importance of biodiversity and realize the current biodiversity loss as a major global environmental issue. They will understand the ecological principles in management of biodiversity, threats to biodiversity and values of biodiversity. In the management aspects, students will know the assessment method for deciding the endangered status of a species and thus formulate the proper conservation plan for a species. Students will know the principles of conservation practices in situ and ex situ for terrestrial and aquatic organisms and habitats. Also, students have to learn the basic principles of restoration ecology for conserving lives. Besides, students are required to make a group presentation on an endangered species in the IUCN Red List.\r  Learning outcomes to be achieved:\r  Examinations: All the learning outcomes listed above on the basic concepts of biodiversity and environmental conservation, including the I&D component (10%) such as design of conservation planning of endangered species, including protected areas, as well as GC&SE component (30%) such as biodiversity loss as a major global environmental issue and the responsibility of mankind in conservation.\r  Presentation: Presentation usually focuses on an endangered species on the IUCN Red List, where the students review the basic biology of the species, and understand how it becomes endangered and what has been and could be done to protect the species, all of which involve I&D (10%) and GC&SE components (40%).\r  More focus on the global issue of biodiversity loss; with the use of examples of conservation management from different parts of the world. The design of conservation planning of endangered species, including protected areas, is the component of the course related to I&D. Through presentations on endangered species on the IUCN Red List, students will comprehend the policy and social issues of biodiversity conservation in different parts of the world, thus implementing GC&SE.\r  10% on Innovation & Design and 35% on Global Citizenship & Social Enterprisingness", "syllabus": "Introduction to conservation biology\r What is biodiversity and how to measure it?\r Impact on biodiversity: habitat destruction & fragmentation, overexploitation, biological invasion, climate change\r What are the endangered statuses of a species?\r How to assess the endangered status?\r Conservation of population and species\r What is conservation genetics?\r How to assess genetic diversity?\r Conservation of habitat and landscape\r Restoration ecology", "required_readings": "Primack, R.B. (2014) Essentials of Conservation Biology. 6th edition. Sinauer\r Van Dyke, F. 2009. Conservation Biology. Foundations, Concepts & Applications. 2nd edition. Springer\r Environment Bureau (2016) Hong Kong Biodiversity Strategy Action Plan 2016-2021. Hong Kong, the Government of the Hong Kong Special Administrative Region. Retrieved from: http://www.afcd.gov.hk/english/conservation/Con_hkbsap/files/HKBSAP_ENG_2.pdf", "recommended_readings": "Sodhi, N. S. & P. R. Ehrlich (2010) Conservation Biology for All. Oxford University Press. https://conbio.org/images/content_publications/ConservationBiologyforAll_reducedsize.pdf\r Frankham, R., J. D. Ballou & D. A. Briscoe (2010) Introduction to Conservation Genetics. Cambridge University Press.\r Carroll, S. P. & C. W. Fox (2008) Conservation Biology: Evolution in Action. Oxford University Press.\r Macdonald, D. W. & K. Service (2007) Key Topics in Conservation Biology. Blackwell Publishing.\r Macdonald, D. W. & K. J. Willis (2013) Key Topics in Conservation Biology 2. Wiley-Blackwell.\r 郭忠玲, 趙秀海 (2003) 保護生物學概論. 第1版. 中國林業出版社.", "terms": {"2020-21 Term 2": {"--LEC (6065)": {"startTimes": ["13:30", "14:30"], "endTimes": ["14:15", "16:15"], "days": [1, 3], "locations": ["Basic Med Sci Bldg G18", "Basic Med Sci Bldg G18"], "instructors": ["Professor CHU Ka Hou, \n\rProfessor CHU Lee Man, \n\rProfessor CHUI Pui Yi, \n\rProfessor TSANG Ling Ming", "Professor CHU Ka Hou, \n\rProfessor CHU Lee Man, \n\rProfessor CHUI Pui Yi, \n\rProfessor TSANG Ling Ming"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2", "13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (5642)": {"startTimes": ["13:30", "14:30"], "endTimes": ["14:15", "16:15"], "days": [1, 3], "locations": ["Basic Med Sci Bldg LT", "Basic Med Sci Bldg LT"], "instructors": ["Professor CHU Ka Hou, \n\rProfessor Laura Jane FALKENBERG, \n\rProfessor TSANG Ling Ming", "Professor CHU Ka Hou, \n\rProfessor Laura Jane FALKENBERG, \n\rProfessor TSANG Ling Ming"], "meetingDates": ["10/1", "17/1", "24/1", "12/1", "19/1", "26/1"]}}}, "assessments": {"Essay test or exam": "85", "Presentation": "15"}}, {"code": "4310", "title": "Human Genetics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Pre-requisite: BIOL2310 or BIOL2410.", "description": "This course is designed for students who are interested in human genetics. Students enrolled in this course will study the principles of inheritance which concern with the most interesting organism – the human being. Topics include the structure of the human genome (chromosomes), different modes of inheritance, epigenetics, variations and their uses in human genetics studies, aberrations and diseases, and genetics of various biological processes or diseases. The future outlook of human genetics and practical applications will also be discussed.", "outcome": "Knowledge outcomes:1. Acquire a core knowledge on the human genome (maintenance of genetic information), inheritance (transfer of genetic information), and genetic defects (misbehaviors in the above processes);2. Acquire the ability to comprehend and apply genetic concepts in understanding human genetic diseases and related researches;3. Acquire an educated understanding on the clinical applications of knowledge in human genome.Skills outcomes:1. Acquire skills in literature survey using various sources including effective usage of information technologies and web-based searches;2. Acquire good analytical and oral communication skills via class presentation;3. Acquire good problem solving skill via course assessment.Values and attribute outcomes:1. Acquire an informed attitude to people suffering from genetic diseases, and on application of current technologies in diagnosis and treatment of genetic diseases;2. Acquire an enthusiastic attitude towards human genetics research.知識成果：1. 獲取有關人類基因組，遺傳學，和遺傳缺陷的核心知識;2. 掌握對人類遺傳疾病和有關研究的基礎概念和知識應用的能力; 3. 明白人類基因組知識在臨床醫學上的應用。技能成果：1. 掌握文獻調查技能，包括使用信息技術和有效利從互聯網中搜索中得到的各種來源;2. 通過班上研習課題獲得良好的分析和溝通技巧;3. 通過課程評估建立良好的解决問題的技巧。價值觀和屬性的成果：1. 對患有遺傳疾病的人以及目前在檢查及治療遺傳疾病中最新的應用技術建立一套認知的態度; 2. 對人類遺傳學研究建立積極的態度。知识成果：1. 获取有关人类基因组，遗传学，和遗传缺陷的核心知识;2. 掌握对人类遗传疾病和有关研究的基础概念和知识应用的能力; 3. 明白人类基因组知识在临床医学上的应用。技能成果：1. 掌握文献调查技能，包括使用信息技术和有效利从互联网中搜索中得到的各种来源;2. 通过班上研习课题获得良好的分析和沟通技巧;3. 通过课程评估建立良好的解决问题的技巧。价值观和属性的成果：1. 对患有遗传疾病的人以及目前在检查及治疗遗传疾病中最新的应用技术建立一套认知的态度; 2. 对人类遗传学研究建立积极的态度。", "syllabus": "1 Introduction to human genetics / How dynamic is our genome?2 Human chromosomes and the Human Genome project3 Repetitive sequences and Telomeres4 Mendelian inheritance and extensions and exceptions to Mendel's Laws5 Epigenetics6 Complex genetic traits7 Polymorphisms (variations) and aberrations8 Mutation and genetic diseases9 Genetics of the mind (behavior)10 Genetics of immunity11 Genetics of cancer12 Genetic testing, genetic counselling, and beyond1. 人類遺傳學概論/基因組的動態特質2. 人類染色體及人類基因組計劃3. 核酸的重複序列和端粒4. 孟德爾遺傳定律，其引申, 及例外5. 表觀遺傳學6. 複雜(多種因素)的遺傳特徵7. 多態性及異常8. 突變與遺傳性疾病9. 行為遺傳學10. 免疫遺傳學11. 癌症遺傳學12. 基因檢測，諮詢，和以後1. 人类遗传学概论/基因组的动态特质2. 人类染色体及人类基因组计划3. 核酸的重复序列和端粒4. 门德尔遗传定律，其引申, 及例外5. 表观遗传学6. 复杂(多种因素)的遗传特征7. 多态性及异常8. 突变与遗传性疾病9. 行为遗传学10. 免疫遗传学11. 癌症遗传学12. 基因检测，咨询，和以后", "required_readings": "Nil", "recommended_readings": "Text Book:Human Genetics: Concepts and Applications, Ricky Lewis, 12th edition 2017 McGraw-Hill Higher Education (ISBN 1259700933)References:1. Human Molecular Genetics, Tom Strachan and Andrew Read,  5th edition 2018 Garland Science (ISBN 0815345895)2. Thompson & Thompson Genetics in Medicine, Robert L. Nussbaum, Roderick R. McInnes, and Huntington F. Willard, 8th Edition, 2015 Elsevier (ISBN 1437706907)Recommended:The Gene: An Intimate History, Siddhartha Mukherjee, 2016 (ISBN 0670087149)She Has Her Mother’s Laugh: The Power, Perversions, and Potential of Heredity, Carl Zimmer, 2018 (ISBN 1101984598)", "terms": {"2020-21 Term 2": {"--LEC (6234)": {"startTimes": ["13:30", "10:30"], "endTimes": ["14:15", "12:15"], "days": [2, 4], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor CHAN Ho Yin Edwin, \n\rProfessor CHAN Ting Fung Philos, \n\rProfessor CHOW Hei Man", "Professor CHAN Ho Yin Edwin, \n\rProfessor CHAN Ting Fung Philos, \n\rProfessor CHOW Hei Man"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2", "14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 2": {"--LEC (5776)": {"startTimes": ["13:30", "10:30"], "endTimes": ["14:15", "12:15"], "days": [2, 4], "locations": ["William M W Mong Eng Bldg 804", "Y.C. Liang Hall 106"], "instructors": ["Professor CHAN Ho Yin Edwin, \n\rProfessor CHAN Ting Fung Philos, \n\rProfessor CHOW Hei Man", "Professor CHAN Ho Yin Edwin, \n\rProfessor CHAN Ting Fung Philos, \n\rProfessor CHOW Hei Man"], "meetingDates": ["11/1", "18/1", "25/1", "13/1", "20/1", "27/1"]}}}, "assessments": {"Homework or assignment": "30", "Presentation": "20", "Short answer test or exam": "50"}}, {"code": "4420", "title": "Marine Microbial Ecology", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Pre-requisite: BIOL3410.", "description": "This course brings the students to the marine microbial biosphere. Microbes are the engines that drive carbon and nutrient cycles in the ocean, and influence the health of marine plants and animals. In this course, we will discuss major concepts in ecological studies of microbes in the ocean, the way microbes function in their natural environments, and how their activities influence ecosystem functioning, global climate and the Earth as human habitat.\r", "outcome": "Knowledge • Understand key concepts in marine microbial ecology • Know the power of modern biotechnology in driving marine microbial ecology • Comprehend important questions and key issues in marine microbial ecology  Skill • Application of scientific method to marine microbial ecology • Search for information from primary literature • Critical analysis of information from primary literature • Presentation and communication of ideas in marine microbial ecology using charts, graphs, diagrams and tables  Value • Appreciate marine microbial roles in climate change and regulation • Understand microbial roles in marine animal and plant conservation • Recognize marine microbes as a source of novel metabolites for industrial application  知識  • 理解行為海洋微生物生態學中的重要概念 • 理解現代生物技術對海洋微生物生態學的驅動作用 • 熟悉現代生態學中的重要問題和重點  技能 • 把科學方法應用到海洋微生物生態學 • 查找和搜集文獻 • 客觀分析文獻 • 運用圖表描述和表達海洋微生物生態學的觀點  價值 • 理解海洋微生物在調節氣候變化中的作用 • 瞭解微生物在海洋動植物保育中的作用 • 認識海洋微生物是新型代謝產物的重要來源   知识  • 理解行为海洋微生物生态学中的重要概念 • 理解现代生物技术对海洋微生物生态学的驱动作用 • 熟悉现代生态学中的重要问题和重点  技能 • 把科学方法应用到海洋微生物生态学 • 查找和搜集文献 • 客观分析文献 • 运用图表描述和表达海洋微生物生态学的观点  价值 • 理解海洋微生物在调节气候变化中的作用 • 了解微生物在海洋动植物保育中的作用 • 认识海洋微生物是新型代谢产物的重要來源", "syllabus": "I. Marine microbial diversity and food web Dominant microbial groups Microbial food web Microbial interactions II. Marine microbial communities  Community structure and control factors Temporal and spatial patterns III. Marine microbial metabolism and biogeochemistry Energy acquisition Microbial-organic matter interaction Nitrogen, phosphorus, and sulfur transformations IV. Marine microbial genomics Cultivation-dependent genomics Cultivation-independent genomics Microbial genomic diversity V. Marine microbial symbionts Microbe-animal association Microbe-plant association  I. 海洋微生物多樣性和微食物網 高豐度微生物類群 微食物網 微生物相互作用 II. 海洋微生物群落  群落結構及其影響因素 時空變化模式 III. 海洋微生物代謝和生物地球化學 能量獲得 微生物-有機物相互作用 氮、磷、硫的轉化 IV. 海洋微生物基因組學 基於培養的基因組學 獨立於培養的基因組學 微生物基因組水平上的多樣性 V. 海洋共生微生物 微生物-動物共生 微生物-植物共生   I. 海洋微生物多样性和微食物网 高丰度微生物类群 微食物网 微生物相互作用 II. 海洋微生物群落  群落结构及其影响因素 時空变化模式 III. 海洋微生物代谢和生物地球化学 能量获得 微生物-有机物相互作用 氮、磷、硫的转化 IV. 海洋微生物基因組学 基于培养的基因組学 独立于培养的基因組学 微生物基因組水平上的多样性 V. 海洋共生微生物 微生物-动物共生 微生物-植物共生", "required_readings": "Kirchman DL (ed). 2008. Microbial Ecology of the Oceans (2nd Ed). John Wiley & Sons, Inc., Hoboken, New Jersey.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (6460)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor LUO Haiwei"], "meetingDates": ["15/1", "22/1", "29/1", "5/2"]}}, "2021-22 Term 2": {"--LEC (7085)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [5], "locations": ["William M W Mong Eng Bldg 401"], "instructors": ["Professor LUO Haiwei"], "meetingDates": ["14/1", "21/1", "28/1"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "30", "Presentation": "20", "Short answer test or exam": "30"}}, {"code": "4510", "title": "Hong Kong Flora and Vegetation", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Pre-requisite: LSCI1002.", "description": "This course is aimed to train students with capacity in various aspects of local plants, including knowledge of plant taxonomy, skills of field studies, knowledge transfer of botany and career development. This course consists of lectures, field trips and independent projects.Every enrolled student is required to work on an independent project which includes essay and presentation. Marking scheme of the project essay include five scopes: 1. Definition / history / background; 2. Reviews on the current problem; 3. Suggested solutions or methodology; 4. Conclusion and prospective; 5. References. Each chapter should be supplemented with photographs, figures and tables. At the course end, each student is also required to present his / her project with PowerPoint.\r", "outcome": "Students will learn how to:\r - Identify common plant species in Hong Kong\r - Identify the local vegetation types\r - Understand the concept of plant nomenclature and the e-learning platforms of botanical database\r - Acquire the identification skills of plants\r - Understand and integrate botanical knowledge in career development\r  學生從本課程可學習:\r - 鑒定香港常見的植物\r - 鑒定本地植被\r - 植物命名法規和網上學習平台\r - 植物鑒定的方法和技巧\r - 轉化植物知識為職業發展\r  学生从本课程可学习:\r - 鉴定香港常见的植物\r - 鉴定本地植被\r - 植物命名法规和网上学习平台\r - 植物鉴定的方法和技巧\r - 转化植物知识为职业发展", "syllabus": "1. Taxonomy and e-learning platforms\r 2. Vegetation and habitats in HK\r 3. Identification skills\r 4. Field lectures / studies\r 5. Algae to angiosperm\r 6. Taxonomic applications and career\r 7. Project presentation and discussion\r  1. 植物分類和網上學習平台\r 2. 香港植被及生境\r 3. 植物鑒別技巧\r 4. 野外授課和實習\r 5. 藻類至被子植物\r 6. 植物分類學應用與職業\r 7. 項目匯報和討論\r  1. 植物分类和网上学习平台\r 2. 香港植被及生境\r 3. 植物鉴别技巧\r 4. 野外授课和实习\r 5. 藻类至被子植物\r 6. 植物分类学应用与职业\r 7. 项目汇报和讨论", "required_readings": "", "recommended_readings": "International code of nomenclature for algae, fungi, and plants\r http://www.iapt-taxon.org/nomen/main.php\r  Flora of Hong Kong\r http://www.herbarium.gov.hk/Search_Form.aspx\r  Flora of China\r http://www.efloras.org/flora_page.aspx?flora_id=2\r  Catalogue of Life: Higher Plants in China\r http://www.etaxonomy.ac.cn/\r  Flora Reipublicae Popularis Sinicae\r http://frps.eflora.cn/\r  Plants of Taiwan\r http://tai2.ntu.edu.tw/\r  The New York Botanical Garden’s glossary for vascular plants\r http://sweetgum.nybg.org/science/glossary/\r  Index Herbariorum\r http://sweetgum.nybg.org/science/ih/\r  Chinese Virtue Botanical Garden\r http://www.cvbg.cn/garden/garden_more.aspx", "terms": {"2020-21 Term 2": {"--LEC (8000)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Mong Man Wai Bldg 710"], "instructors": ["Dr. LAU Tai Wai David"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 2": {"--LEC (8370)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["William M W Mong Eng Bldg 703"], "instructors": ["Dr. LAU Tai Wai David"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Essay test or exam": "50", "Presentation": "25", "Short answer test or exam": "25"}}, {"code": "4520", "title": "Plant Metabolism and Metabolic Engineering", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Pre-requisite: BCHE2030 and BIOL2120.", "description": "This course covers the main groups of secondary metabolites of plants from a biochemical and biosynthetic perspective, with references to how genetic engineering can be used to manipulate the levels of secondary metabolites with economic value, as well as those of importance to human health and diet. The course defines the major classes of secondary metabolites, their biosynthetic pathways, the biological functions of secondary metabolites in defense against biotic and abiotic stresses, and finally the main approaches for metabolic engineering to achieve a targeted production of high-value secondary metabolites.", "outcome": "Knowledge• Understand the definition of secondary metabolism and the major metabolic pathways, metabolic interconnections, and activation of secondary metabolism.• Understand the definition of secondary metabolites, their ecological function and pharmacological action on mammals and insects.• Learn the biosynthesis and ecological functions of representative secondary metabolites produced in plants, including terpenoids, alkaloids, phenylpropanoids, flavonoids and polyketides etc.• Obtain first-hand knowledge of metabolic engineering and related technology and genetic resources. Understand the secondary metabolites and metabolic engineering in major foods.Skill• Gain presentation skills and scientific writing skills relevant to plant secondary metabolism and metabolic engineeringValue1. Acquire an informed attitude to plant secondary metabolism and its application;2. Acquire an enthusiastic attitude towards plant secondary metabolism research.知識• 了解次級代謝的定義以及主要的代謝途徑，代謝互連和次級代謝的激活。 • 了解次生代謝產物的定義，其生態功能以及對哺乳動物和昆蟲的藥理作用。• 了解植物中產生的代表性次生代謝產物的生物合成和生態功能，包括萜類化合物，生物堿，苯基丙烷，類黃酮和聚酮化合物等。• 獲得有關代謝工程及相關技術和遺傳資源的第壹手知識。 了解主要食品中的次生代謝產物和代謝工程。技能1. 掌握文獻調查技能，包括使用信息技術和有效利從互聯網中搜索中得到的各種來源;2. 通過班上研習課題獲得良好的分析和溝通技巧;3. 通過課程評估建立良好的解決問題的技巧價值1. 對植物代谢工程中最新的應用技術建立一套認知的態度;2. 對植物代谢及代谢工程研究建立積極的態度。知识• 了解次级代谢的定义以及主要的代谢途径，代谢互连和次级代谢的激活。 • 了解次生代谢产物的定义，其生态功能以及对哺乳动物和昆虫的药理作用。• 了解植物中产生的代表性次生代谢产物的生物合成和生态功能，包括萜类化合物，生物碱，苯基丙烷，类黄酮和聚酮化合物等。• 获得有关代谢工程及相关技术和遗传资源的第壹手知识。 了解主要食品中的次生代谢产物和代谢工程。技能1. 掌握文献调查技能，包括使用信息技术和有效利从互联网中搜索中得到的各种来源;2. 通过班上研习课题获得良好的分析和沟通技巧;3. 通过课程评估建立良好的解决问题的技巧价值1. 对植物代谢工程中最新的应用技术建立一套认知的态度;2. 对植物代谢及代谢工程研究建立积极的态度。", "syllabus": "1. Review of the major plant metabolic pathways, metabolic interconnections, and activation of secondary metabolism. 2. Definition and systematic of plant secondary metabolites. Ecological function of secondary metabolites and pharmacological action on mammals and insects. 3. Terpenoids: synthesis of IPP (isopentenyl pyrophosphate) in the cytosol and the plastid, role of terpenoids in the plant defense. Biotechnological applications. 4. Alkaloids: biosynthesis, functional groups and biological activity, definition of the main metabolic pathways. Biotechnological applications. 5. Phenylpropanoids: biosynthesis and ecological functions. Biosynthesis of lignins. Biotechnological applications. 6. Flavonoids: biosynthesis, localization, ecological significance. Synthesis and modification of the color of flowers for commercial purposes. Biotechnological applications. 7. Metabolic engineering: chloroplast transformation (plants and algae) and importance of this technique in the expression of secondary metabolites. 8. Secondary metabolites and metabolic engineering in major foods.1. 綜述主要的植物代謝途徑，代謝的內在聯系以及次生代謝的激活。2. 植物次生代謝產物的定義和系統。次生代謝產物的生態功能和對哺乳動物和昆蟲的藥理作用。3. 萜類化合物：IPP（異戊烯基焦磷酸酯）在細胞質和質體中的合成，萜類化合物在植物防禦中的作用。生物技術應用。4. 生物碱：生物合成，官能團和生物活性，主要代謝途徑的定義。生物技術應用。5. 苯丙烷：生物合成和生態功能。木質素的生物合成。生物技術應用。6. 類黃酮：生物合成，定位，生態意義。花卉的合成和修飾，用於商業目的。生物技術應用。7. 代謝工程：葉綠體轉化（植物和藻類）及其在次生代謝產物表達中的重要性。8. 主要食品中的次生代謝產物和代謝工程。1. 综述主要的植物代谢途径，代谢的内在联系以及次生代谢的激活。2. 植物次生代谢产物的定义和系统。次生代谢产物的生态功能和对哺乳动物和昆虫的药理作用。3. 萜类化合物：IPP（异戊烯基焦磷酸酯）在细胞质和质体中的合成，萜类化合物在植物防御中的作用。生物技术应用。4. 生物碱：生物合成，官能团和生物活性，主要代谢途径的定义。生物技术应用。5. 苯丙烷：生物合成和生态功能。木质素的生物合成。生物技术应用。6. 类黄酮：生物合成，定位，生态意义。花卉的合成和修饰，用于商业目的。生物技术应用。7. 代谢工程：叶绿体转化（植物和藻类）及其在次生代谢产物表达中的重要性。8. 主要食品中的次生代谢产物和代谢工程。", "required_readings": "To be advised", "recommended_readings": "", "terms": {"2021-22 Term 1": {"--LEC (8285)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Mong Man Wai Bldg 706"], "instructors": ["Professor GUO Dianjing"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Essay test or exam": "60", "Short answer test or exam": "40"}}, {"code": "4710", "title": "Fish Biology and Mariculture", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Pre-requisite: LSCI1002 or consent of instructors.", "description": "This course deals with the application of biological principles to the culture of marine fishes, crustaceans, molluscs and algae. Emphasis will be placed on the environmental, nutritional, reproductive and endocrine aspects in relation to current maricultural practice.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4901", "title": "Senior Experimental Project I", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "-", "description": "In this course, students are required to carry out an independent research project. The project topic will be decided by the supervisor(s) or jointly by both the supervisor(s) and the student. To fulfill the course requirement, students are required to discuss their progress with their supervisors regularly and submit a research proposal at the end of the term.The students should take the initiative to discuss with their supervisors and come up with a topic for the research project. Students should first conduct a literature survey of their research project and identify the scientific questions they want to address, then design and perform the experiments for this project under the guidance of the supervisors and submit a research proposal at the end of the term.\r", "outcome": "On successful completion of this course, students should be able to:\r 1) Integrate the knowledge and skills learnt previously in other courses\r 2) Survey scientific literature relevant to their research project\r 3) Read scientific literature critically to identify the scientific questions or problems\r 4) Design independent research project to address the scientific questions \r 5) Acquire hands-on research techniques in conducting experiments\r 6) Improve their problem-solving abilities\r 7) Improve their skills in writing scientific proposal\r 8) Improve their sense of responsibility and team spirit\r  成功修畢此課程後，學生應可： 1) 應用在課堂中獲得的知識及技能\r 2) 搜尋文獻\r 3) 批判地閱讀及分析文獻的內容，並認知及思考當中的科學問題\r 4) 就自己的專題研究題目，設計實驗去解說科學問題\r 5) 操作各式的實驗\r 6) 提升其解決問題的能力\r 7) 提升其書寫研究計劃報告的能力\r 8) 提升其責任感及團體精神", "syllabus": "Students should take the initiative to discuss with their supervisor(s) and come up with a topic for the independent research project. The students should first conduct a literature survey of their research project and identify the scientific questions they want to address. Students then design and perform the experiments for this project under the guidance of the supervisor(s) and submit a research proposal at the end of the term.\r  學生須於學期開始前主動聯絡教授，並訂出研究課題。學生須就該研究課題搜尋相關文獻，並確定研究方向。學生須設計實驗及進行研究，並於學期結束前遞交一份研究計劃。", "required_readings": "Reference materials relevant to the selected project will be provided by the supervisor", "recommended_readings": "Reference materials relevant to the selected project will be provided by the supervisor", "terms": {"2020-21 Summer Session": {"-J01-PRJ (1174)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor NGAI Sai Ming"], "meetingDates": ["18/05/2021 - 29/06/2021"]}}}, "assessments": {"Essays": "50", "Others": "50"}}, {"code": "4902", "title": "Senior Experimental Project II", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "-", "description": "Students are required to discuss their progress with their supervisor(s) regularly and submit a progress report at the end of the term. Students who will not be enrolled in BIOL4903 are required to submit a final report in the form of a manuscript and give an oral presentation.The students should continue to work on the research project from BIOL4901. Students should discuss the progress with their supervisors and submit a progress report in the end of the term. Students who do not continue to work on the research project in BIOL4903 should submit a final report and give an oral presentation.\r", "outcome": "On successful completion of this course, students should be able to:\r 1) Integrate the knowledge and skills learnt previously in other courses\r 2) Survey scientific literature relevant to their research project\r 3) Read scientific literature critically to identify the scientific questions or problems\r 4) Design independent research project to address the scientific questions \r 5) Acquire hands-on research techniques in conducting experiments\r 6) Improve their problem-solving abilities\r 7) Analyze and interpret data in a logical and scientific way\r 8) Improve their skills in scientific writing and oral presentation\r 9) Improve their sense of responsibility and team spirit\r  成功修畢此課程後，學生應可： 1) 應用在課堂中獲得的知識及技能\r 2) 搜尋相關的文獻\r 3) 批判地閱讀及分析文獻的內容，並認知及思考當中的科學問題\r 4) 就自己的專題研究題目，設計實驗去解說科學問題\r 5) 操作各式的實驗\r 6) 提升其解決問題的能力\r 7) 分析及以邏輯和科學的角度表述數據\r 8) 書寫符合標準科技論文格式的書面報告及作口頭報告\r 9) 提升其責任感及團體精神", "syllabus": "Students should continue to work on the research project from BIOL4901. Students should discuss the progress with their supervisor(s) and submit a progress report in the end of the term. Students who do not continue to work on the research project in BIOL4903 should submit a final report and give an oral presentation.\r  學生就BIOL4901的研究課題繼續進行研究，並定期向教授匯報及討論研究所得的數據。於學期結束前遞交一份研究進展報告。不繼續選修BIOL4903的學生須遞交一份書面報告及作口頭報告。", "required_readings": "Reference materials relevant to the selected project will be provided by the supervisor", "recommended_readings": "Reference materials relevant to the selected project will be provided by the supervisor", "terms": {"2020-21 Term 1": {"-J01-PRJ (4825)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor HUI Jerome Ho Lam, \n\rProfessor KWAN Kin Ming, \n\rProfessor LEE Shing Yip, \n\rProfessor Laura Jane FALKENBERG, \n\rProfessor NGAI Sai Ming, \n\rProfessor TSANG Ling Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2021-22 Term 1": {"-J01-PRJ (8666)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN Ho Yin Edwin, \n\rProfessor CHUI Pui Yi, \n\rProfessor HUI Jerome Ho Lam, \n\rProfessor LEE Shing Yip, \n\rProfessor Laura Jane FALKENBERG, \n\rProfessor NGAI Sai Ming, \n\rProfessor TSANG Ling Ming, \n\rProfessor TSUI Tsz Ki Martin"], "meetingDates": ["09/09/2021 - 02/12/2021"]}}}, "assessments": {"Essays": "50", "Others": "50"}}, {"code": "4903", "title": "Senior Experimental Project III", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "Pre-requisite: BIOL4902.", "description": "In this course, students continue to work on and complete the research project from BIOL4902. Student should discuss with their supervisor(s) and analyze relevant data, formulate conclusion. Students should submit a final report in the form of a manuscript and give an oral presentation at the end of the term.The students should continue to work on the research project from BIOL4901. Students should discuss the progress with their supervisors and submit a progress report in the end of the term.\r", "outcome": "On successful completion of this course, students should be able to:\r 1) Integrate the knowledge and skills learnt previously in other courses\r 2) Survey scientific literature relevant to their research project\r 3) Read scientific literature critically to identify the scientific questions or problems\r 4) Design independent research project to address the scientific questions \r 5) Acquire hands-on research techniques in conducting experiments\r 6) Improve their problem-solving abilities\r 7) Analyze and interpret data in a logical and scientific way\r 8) Improve their skills in scientific writing and oral presentation\r 9) Improve their sense of responsibility and team spirit\r  成功修畢此課程後，學生應可： 1) 應用在課堂中獲得的知識及技能\r 2) 搜尋相關的文獻\r 3) 批判地閱讀及分析文獻的內容，並認知及思考當中的科學問題\r 4) 就自己的專題研究題目，設計實驗去解說科學問題\r 5) 操作各式的實驗\r 6) 提升其解決問題的能力\r 7) 分析及以邏輯和科學的角度表述數據\r 8) 書寫符合標準科技論文格式的書面報告及作口頭報告\r 9) 提升其責任感及團體精神", "syllabus": "Students should continue to work on the research project from BIOL4902. Students should discuss the progress with their supervisor(s) and submit a final report in the form of manuscript and give an oral presentation at the end of the term.\r  本科學生須就BIOL4902的研究課題繼續進行研究，並定期向教授匯報及討論研究所得的數據。於學期結束前遞交一份科技論文並作口頭報告。", "required_readings": "Reference materials relevant to the selected project will be provided by the supervisor", "recommended_readings": "Reference materials relevant to the selected project will be provided by the supervisor", "terms": {"2020-21 Term 2": {"-J01-PRJ (5715)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor HUI Jerome Ho Lam, \n\rProfessor KWAN Kin Ming, \n\rProfessor LEE Shing Yip, \n\rProfessor Laura Jane FALKENBERG, \n\rProfessor NGAI Sai Ming, \n\rProfessor TSANG Ling Ming"], "meetingDates": ["15/01/2021 - 23/04/2021"]}}, "2021-22 Term 2": {"-J01-PRJ (8527)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN Ho Yin Edwin, \n\rProfessor CHUI Pui Yi, \n\rProfessor HE Junxian, \n\rProfessor HUI Jerome Ho Lam, \n\rProfessor LEE Shing Yip, \n\rProfessor Laura Jane FALKENBERG, \n\rProfessor NGAI Sai Ming, \n\rProfessor TSANG Ling Ming, \n\rProfessor TSUI Tsz Ki Martin"], "meetingDates": ["12/01/2022 - 20/04/2022"]}}}, "assessments": {"Essays": "40", "Others": "30", "Presentation": "30"}}, {"code": "4906", "title": "Internship", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "", "description": "In this course, students have the opportunity to gain practical experience working in the government, private companies or non-governmental organizations. Internship projects can be held either locally or overseas, but must be approved by the Programme. Students are required to serve at least 160 hours and submit a written report for assessment.\r", "outcome": "On successful completion of this course, students should be able to:\r 1) Integrate the knowledge and skills learnt previously in other courses\r 2) Design, organize, schedule and execute individual or group projects\r 3) Acquire hands-on techniques in conducting experiments or special projects provided by the company where the interns join\r 4) Improve their problem-solving abilities\r 5) Improve their sense of responsibility and team spirit\r 6) Obtain empirical and out-of classroom experiences for career development\r 7) Improve their skills in writing reports \r  成功修畢此課程後，學生應可： 1) 應用在課堂中獲得的知識及技能\r 2) 設計、安排、計劃及執行指定的個人或團體項目\r 3) 操作實驗或專題項目\r 4) 提升其解決問題的能力\r 5) 提升其責任感及團體合作精神\r 6) 累積課堂以外的工作經驗\r 7) 提升其書寫報告的能力", "syllabus": "Students should search for their own internship position and submit relevant documents to the Programme for approval. Each intern is required to work in the approved company or laboratory on a scientific project for at least 5 weeks (160 hours) in summer. The progress of each student will be monitored by a supervisor from the Programme. At the end of the internship, students should give an oral presentation and submit a written report.\r  學生須自行尋找本地或海外的專題實習機會，並提交相關資料以取得學系認可。實習生須在暑期時到認可之公司或機構工作或參與研究項目，為期最少五星期(160小時)。學生進度由學系導師監察。實習完結後，學生須作口頭報告並提交書面報告。\r  There is no syllabus for this internship course. We will stress our emphasis on the I&D and GC&SE and regularly talk to our internship providers on their implementation. I suppose most internship projects will have SE, while overseas internship project will intrinsically have very strong GC component. \r  40% Innovation &Design and 40% Global Citizenship &Social Enterprisingness", "required_readings": "Reference materials relevant to the selected project will be provided by the supervisor", "recommended_readings": "Reference materials relevant to the selected project will be provided by the supervisor", "terms": {"2020-21 Term 1": {"-J01-PRJ (8684)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Dr. CHIU Chi Ming Lawrence"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2021-22 Term 1": {"-J01-PRJ (8085)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. CHIU Chi Ming Lawrence"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}}, "assessments": {"Others": "40", "Presentation": "30", "Report": "30"}}, {"code": "4907", "title": "Field Study", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Biology Pgm Comm", "requirements": "", "description": "This course gives students an opportunity to supplement what they have learnt from biology courses in the format of a local or overseas field trip during summer. Students are required to submit a proposal, participate actively in all activities throughout the field trip, submit an individual report and present a seminar for assessment. The field trip must be approved by the Programme.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5101", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Biology", "description": "Students will survey the literature in their chosen field of research and present a critical seminar on the topic. Presentation topics can also be chosen from an area that is relevant to their research.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in biology and in-depth knowledge in a particular field of biological sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (2421)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2443)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "5201", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Biology", "description": "Students will survey the literature in their chosen field of research and present a critical seminar on the topic. Presentation topics can also be chosen from an area that is relevant to their research.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in biology and in-depth knowledge in a particular field of biological sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (2386)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2414)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "5301", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Biology", "description": "It is a progress seminar and shall be based on the research results already obtained.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in biology and in-depth knowledge in a particular field of biological sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (2387)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2415)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7101", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in PhD Biology or MPhil-PhD Biology", "description": "Students will survey the literature in their chosen field of research and present a critical seminar on the topic. Presentation topics can also be chosen from an area that is relevant to their research.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in biology and in-depth knowledge in a particular field of biological sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (2388)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2442)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7201", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in PhD Biology or MPhil-PhD Biology", "description": "Students will survey the literature in their chosen field of research and present a critical seminar on the topic. Presentation topics can also be chosen from an area that is relevant to their research.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in biology and in-depth knowledge in a particular field of biological sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (2383)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2411)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7301", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in PhD Biology or MPhil-PhD Biology", "description": "Students will survey the literature in their chosen field of research and present a critical seminar on the topic. Presentation topics can also be chosen from an area that is relevant to their research.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in biology and in-depth knowledge in a particular field of biological sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors. ", "terms": {"2020-21 Term 1": {"-S01-SEM (2384)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2412)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-S01-SEM (2633)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-S01-SEM (2704)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7401", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in PhD Biology or MPhil-PhD Biology", "description": "Students will survey the literature in their chosen field of research and present a critical seminar on the topic. Presentation topics can also be chosen from an area that is relevant to their research.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in biology and in-depth knowledge in a particular field of biological sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors. ", "terms": {"2020-21 Term 1": {"-S01-SEM (2385)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2413)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-S01-SEM (2634)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-S01-SEM (2705)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7501", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in PhD Biology or MPhil-PhD Biology", "description": "Students will survey the literature in their chosen field of research and present a critical seminar on the topic. Presentation topics can also be chosen from an area that is relevant to their research. For final year students, it is normally a progress seminar and shall be based on the research results already obtained.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in biology and in-depth knowledge in a particular field of biological sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (2380)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2408)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-S01-SEM (2635)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-S01-SEM (2706)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7601", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in PhD Biology or MPhil-PhD Biology", "description": "Students will survey the literature in their chosen field of research and present a critical seminar on the topic. Presentation topics can also be chosen from an area that is relevant to their research.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in biology and in-depth knowledge in a particular field of biological sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (2381)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2409)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-S01-SEM (2636)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-S01-SEM (2707)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7701", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in PhD Biology or MPhil-PhD Biology", "description": "It is a progress seminar and shall be based on the research results already obtained.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in biology and in-depth knowledge in a particular field of biological sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (2382)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2410)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-S01-SEM (2637)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-S01-SEM (2708)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "8003", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Biology", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student's academic progress.", "outcome": "Development of research skills, including field and/or laboratory studies and data analysis as related to the students' thesis research.", "syllabus": "-    Identify a research topic-    Develop a research hypothesis-    Prepare a research proposal-    Develop research methodology and experimental design-    Conduct an original research with impact in a specific field or subject-    Analyze experimental results and make appropriate data interpretation-    Prepare a research dissertation/thesis and related manuscripts for publication", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-M01-TMC (3305)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHU Ka Hou, \n\rProfessor GUO Dianjing, \n\rProfessor JIANG Liwen, \n\rProfessor KANG Byung Ho, \n\rProfessor LAU Wilson Chun Yu, \n\rProfessor LEUNG Lai Kwok, \n\rProfessor LUO Haiwei, \n\rProfessor TSANG Ling Ming, \n\rProfessor ZHONG Silin"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-M01-TMC (2406)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEUNG Chi Keung Peter, \n\rProfessor CHU Ka Hou, \n\rProfessor GUO Dianjing, \n\rProfessor JIANG Liwen, \n\rProfessor KANG Byung Ho, \n\rProfessor LAU Wilson Chun Yu, \n\rProfessor LEUNG Lai Kwok, \n\rProfessor LUO Haiwei, \n\rProfessor TSANG Ling Ming, \n\rProfessor ZHONG Silin"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-M01-TMC (2093)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHU Ka Hou, \n\rProfessor GUO Dianjing, \n\rProfessor HUI Jerome Ho Lam, \n\rProfessor JIANG Liwen, \n\rProfessor KANG Byung Ho, \n\rProfessor LAU Wilson Chun Yu, \n\rProfessor LEE Shing Yip, \n\rProfessor LUO Haiwei, \n\rProfessor TSANG Ling Ming, \n\rProfessor ZHONG Silin, \n\rProfessor ZHUANG Xiaohong"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-M01-TMC (2063)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHU Ka Hou, \n\rProfessor GUO Dianjing, \n\rProfessor HUI Jerome Ho Lam, \n\rProfessor JIANG Liwen, \n\rProfessor KANG Byung Ho, \n\rProfessor LAU Wilson Chun Yu, \n\rProfessor LEE Shing Yip, \n\rProfessor LUO Haiwei, \n\rProfessor TSANG Ling Ming, \n\rProfessor ZHONG Silin, \n\rProfessor ZHUANG Xiaohong"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}}, {"code": "8006", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "6.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Biology", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student's academic progress.", "outcome": "Development of research skills, including field and/or laboratory studies and data analysis as related to the students' thesis research.", "syllabus": "-    Identify a research topic-    Develop a research hypothesis-    Prepare a research proposal-    Develop research methodology and experimental design-    Conduct an original research with impact in a specific field or subject-    Analyze experimental results and make appropriate data interpretation-    Prepare a research dissertation/thesis and related manuscripts for publication", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-M01-TMC (3306)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHU Ka Hou, \n\rProfessor GUO Dianjing, \n\rProfessor HE Junxian, \n\rProfessor HUI Jerome Ho Lam, \n\rProfessor JIANG Liwen, \n\rProfessor KWAN Kin Ming, \n\rProfessor LEE Shing Yip, \n\rProfessor LUO Haiwei, \n\rProfessor Laura Jane FALKENBERG, \n\rProfessor TSANG Ling Ming, \n\rProfessor WONG Po Keung, \n\rProfessor ZHUANG Xiaohong"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-M01-TMC (3396)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHU Ka Hou, \n\rProfessor GUO Dianjing, \n\rProfessor HE Junxian, \n\rProfessor HUI Jerome Ho Lam, \n\rProfessor JIANG Liwen, \n\rProfessor KANG Byung Ho, \n\rProfessor KWAN Kin Ming, \n\rProfessor LEE Shing Yip, \n\rProfessor LUO Haiwei, \n\rProfessor Laura Jane FALKENBERG, \n\rProfessor TSANG Ling Ming, \n\rProfessor WONG Po Keung, \n\rProfessor ZHUANG Xiaohong"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-M01-TMC (2094)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-M01-TMC (2155)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}}, {"code": "8012", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "12.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Biology", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student's academic progress.", "outcome": "Development of research skills, including field and/or laboratory studies and data analysis as related to the students' thesis research.", "syllabus": "-    Identify a research topic-    Develop a research hypothesis-    Prepare a research proposal-    Develop research methodology and experimental design-    Conduct an original research with impact in a specific field or subject-    Analyze experimental results and make appropriate data interpretation-    Prepare a research dissertation/thesis and related manuscripts for publication", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-M01-TMC (3307)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHU Ka Hou, \n\rProfessor GUO Dianjing, \n\rProfessor HUI Jerome Ho Lam, \n\rProfessor JIANG Liwen, \n\rProfessor KANG Byung Ho, \n\rProfessor LEE Shing Yip, \n\rProfessor LEUNG Lai Kwok, \n\rProfessor LUO Haiwei, \n\rProfessor ZHONG Silin"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-M01-TMC (2894)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHU Ka Hou, \n\rProfessor GUO Dianjing, \n\rProfessor HUI Jerome Ho Lam, \n\rProfessor KANG Byung Ho, \n\rProfessor LEE Shing Yip, \n\rProfessor LEUNG Lai Kwok, \n\rProfessor LUO Haiwei, \n\rProfessor ZHONG Silin"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-M01-TMC (2095)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHU Ka Hou, \n\rProfessor HE Junxian, \n\rProfessor HUI Jerome Ho Lam, \n\rProfessor LEE Shing Yip, \n\rProfessor LUO Haiwei, \n\rProfessor Laura Jane FALKENBERG, \n\rProfessor TSANG Ling Ming"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-M01-TMC (2186)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHU Ka Hou, \n\rProfessor HE Junxian, \n\rProfessor HUI Jerome Ho Lam, \n\rProfessor LEE Shing Yip, \n\rProfessor LUO Haiwei, \n\rProfessor Laura Jane FALKENBERG, \n\rProfessor TSANG Ling Ming"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}}]