[{"code": "5001", "title": "Introduction to Biostatistics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in MSc/PgD in Epidemiology and Biostatistics, MPhil in Public Health, PhD in Public Health, Master of Public Health, MSc/PgD in Health Services Management, MSc/PgD in Health Promotion and Behavioural Health", "description": "This course introduces basic statistical concepts and methods. The emphasis of the course is on practical applications: choosing the correct method for particular datasets and correct interpretation of the analysis results. Examples from different disciplines of public health including chronic and infectious disease epidemiology, environmental health, and health policy will be used to illustrate the use of biostatistical methods in answering important public health questions.", "outcome": "Student should be able to:\r 1. understand the importance of biostatistics in public health and medical research. \r 2. develop a conceptual understanding of basic biostatistics, \r 3. critically read and understand the statistical methodology and results sections of medical and public health research papers. \r 4. be capable of carrying out basic statistical analyses using SPSS statistical software.\r  學生應該能夠:\r 1. 瞭解生物統計學在公共衛生和醫學研究的重要性，\r 2. 形成一個對基礎生物統計學的概念性理解，\r 3. 批判性閱讀和理解醫療和公共衛生的研究論文的統計方法和結果部分， \r 4. 能夠運用SPSS統計軟體來實現基本的統計分析。", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (2004)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["Prince of Wales Hospital"], "instructors": ["Mr LAU Yuk Fai, \n\rProfessor CHONG Ka Chun, \n\rProfessor William Bernard GOGGINS III"]}}}}, {"code": "5002", "title": "Intermediate Biostatistics - Linear Models", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in ;MSc in Epidemiology & Biostatistics;Pg Dip in Epidemiology & Biostatistics;Master of Public Health", "description": "This course will provide a foundation for the practical analysis of data for which the primary outcome is a continuous variable. The course will begin with an introduction to ‘real-world’ data analysis with a motivating example looking at predictors of infant birthweight in Hong Kong. Methods for analysis of variance and regression analysis for continuous outcomes will then be discussed in detail with an emphasis on correct use of these methods in practice.", "outcome": "Student should be able to:\r 1. understand and evaluate the use of linear models in the medical literature in an intelligent manner. \r 2. develop skills in analyzing epidemiological data with continuous outcomes using linear models and to understand the basic principles that underlie research designs and statistical inference. \r 3. perform fundamental statistical procedures for research projects involving continuous outcomes and interpret results.\r  學生應該能夠:\r 1. 理解和明智地評估在醫學文獻中使用的線性模型。 \r 2. 掌握用線性模型來分析具有連續性變數的流行病資料的技巧，並理解實驗設計和統計推斷背後的基本原則。 \r 3. 對涉及連續性變數的研究專案，類比實現基本的統計過程並解釋其結果。", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (3333)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Prince of Wales Hospital"], "instructors": ["Mr LAU Yuk Fai, \n\rProfessor WANG Haitian, \n\rProfessor William Bernard GOGGINS III"]}}}}, {"code": "5003", "title": "Intermediate Biostatistics - Categorical Survival Data Analysis", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in ;Pg Dip in Epidemiology & Biostatistics;MSc in Epidemiology & Biostatistics;Master of Public Health", "description": "This course will provide a foundation for the practical analyses of categorical and time to event (survival) data. The course will cover the use of logistic regression models for use with binary outcomes and Cox proportional hazards regression models for time to event outcomes. Practical application of these models will be emphasized and model building and the checking of model assumptions will be covered in detail.", "outcome": "Student should be able to: \r 1. understand the concepts, assumptions and logic involved in statistical methods commonly used in medical research including categorical data analysis and time-to-event data analysis. \r 2. develop appropriate statistical models for the data and correctly interpret the results.\r  學生應該能夠: \r 1. 理解在醫學研究中常用的統計方法的基本概念、假設以及邏輯，這些方法包括分類資料分析、時間與事件資料的分析。\r 2. 針對資料建立適當的統計模型並能夠正確地解釋結果。", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (2848)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [1], "locations": ["Prince of Wales Hospital"], "instructors": ["Mr LAU Yuk Fai, \n\rProfessor WANG Haitian"]}}, "2020-21 Term 3": {"--LEC (1103)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [1], "locations": ["Prince of Wales Hospital"], "instructors": ["Mr LAU Yuk Fai, \n\rProfessor SUN Rui, \n\rProfessor William Bernard GOGGINS III"]}}}}, {"code": "5004", "title": "ICH – GCP Standard of Clinical Research", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in MSc/ PgD in Epidemiology and Biostatistics, MPhil in Public Health, PhD in Public Health, Master of Public Health, PgD in Public Health, MSc/PgD in Health Services Management, MSc/PgD in Health Promotion and Behavioural Health", "description": "The objective of this course is to provide background of regulation of drugs, devices and biological development. We will apply the principles of ICH-Good Clinical Practice in clinical research and discuss the role and responsibilities of key parties described in the document. We will describe the requirements of essential documentation and adverse event reporting.  Scenarios will be given to the students to strengthen their understanding of practical application of ICH-GCP to the clinical trial process.", "outcome": "1. Understand the background of international standards and technical requirement of ICH-GCP\r 2. Describe the principles and structures of ICH-GCP\r 3. Understand the role of responsibilities of key parties of conducting clinical research\r 4. Demonstrate Informed Consent Process at workplace\r 5. Apply relevant knowledge for the process of Adverse Event Reporting\r 6. Familiar with the Essential Documents required by ICH-GCP", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 3": {"--LEC (1003)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["Prince of Wales Hospital"], "instructors": ["Ms LAI Ming Po, \n\rProfessor ZEE Chung Ying Benny"]}}}}, {"code": "5005", "title": "Clinical Trials", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in MSc/PgD in Epidemiology and Biostatistics, MPhil in Public Health, PhD in Public Health, Master of Public Health, MSc/PgD in Health Services Management, MSc/PgD in Health Promotion and Behavioural Health", "description": "The objective of this course is to provide students with a theoretical and practical knowledge of the issues involved in the design, conduct, analysis and interpretation of randomized clinical trials. We will discuss the basic principle of randomization and its importance, proper randomization and blinding procedures, choice of control arm, the importance of clear definition of endpoints, methods to calculate sample size, other statistical considerations and ethical issues in clinical trials. Attention will be given to the problems of conducting clinical trials in both single center and multi-center, and covers trials initiated by industry as well as trials in academic setting. Students will be trained to develop skills to properly design clinical trial, critically analyze and carry out research and to communicate effectively.", "outcome": "Student should be able to:\r 1. understand the advantages and disadvantages of various designs in clinical research.\r 2. understand the concepts of randomization in controlled clinical trials.\r 3. develop a protocol for a clinical trial to address the research questions.\r 4. have a general knowledge of the statistical issues commonly encountered in clinical trials.\r 5. be aware of the ethical issues in clinical trials.\r 6. have an appreciation of the Good Clinical Practice (GCP) requirements in the operation of clinical trials.\r 7. learn some basic elements of data management and quality assurance in multi-center clinical trial set up.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (1553)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor CHONG Ka Chun, \n\rProfessor ZEE Chung Ying Benny"]}}}}, {"code": "5007", "title": "Pharmaceutical Statistics Computing in SAS", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For Student in MSc/PgD in Epidemiology and Biostatistics, MPhil/Phd/PgD in Public Health, Master of Public Health, MSc/PgD in Health Services Management, MSc/PgD in Health Promotion and Behavioural Health;Prequisite: BIOS5001", "description": "The objective of this course is to familiarize students with the SAS software for pharmaceutical application. The course starts with the introduction of basic SAS skills followed by using SAS to draw tables, figures, and listings (TFL) and to analyze medical data. Practical scenarios will be given to students to understand the needs of SAS in pharmaceutical industry.", "outcome": "Student should be able to:\r 1. manipulate data; 2. draw the tables, figures, and listings (TFL); 3. conduct data analysis to solve medical problems \r by using SAS. \r Students will also get familiarize to \r 1. the role of SAS programming in pharmaceutical industry\r 2. industry Regulations and Standards to SAS", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (1863)": {"startTimes": ["18:30"], "endTimes": ["20:00"], "days": [5], "locations": ["TBA"], "instructors": ["Professor CHONG Ka Chun"]}, "-L01-LAB (1862)": {"startTimes": ["20:00"], "endTimes": ["21:30"], "days": [5], "locations": ["TBA"], "instructors": ["Professor CHONG Ka Chun"]}}, "2020-21 Term 3": {"--LEC (1078)": {"startTimes": ["18:30"], "endTimes": ["20:00"], "days": [5], "locations": ["TBA"], "instructors": ["Professor CHONG Ka Chun"]}, "-L01-LAB (1079)": {"startTimes": ["20:00"], "endTimes": ["21:30"], "days": [5], "locations": ["TBA"], "instructors": ["Professor CHONG Ka Chun"]}}}}, {"code": "6001", "title": "Topics in Linear Models", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in MSc/PgD in Epidemiology and Biostatistics, MPhil in Public Health, PhD in Public Health, Master of Public Health, MSc/PgD in Health Services Management, MSc/PgD in Health Promotion and Behavioural Health", "description": "This course will cover advanced statistical modeling techniques for use with complex datasets. Topics will include Poisson and Negative Binomial regression for count outcomes, repeated measures ANOVA, GEE models and multilevel models for longitudinal data, multilevel models for clustered data.", "outcome": "Upon completion of this course students will understand the reasons that more complex statistical models need to be used for datasets for which the assumptions of linear or logistic regression are not valid, such as datasets with ordinal or count outcomes, longitudinal or clustered data, and data with non-linear associations between variables. They will understand which models should be used for each of these situations, how to fit and interpret these models, and how to check the assumptions of these models. \r  課程結束後，學生們將理解在處理不滿足線性或logistic回歸前提假設的資料時，使用更多複雜的統計模型的必要性。這類資料包括二分類或分類變數、縱向資料或聚類資料，以及包含非線性相關變數的資料。學生將會懂得如何針對不同資料類型選擇不同的模型，如何對模型進行解釋及擬合度檢測，及怎樣對模型前提假設進行檢驗。", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 3": {"--LEC (1115)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Prince of Wales Hospital"], "instructors": ["Dr LEE Jock Wai, \n\rProfessor WANG Haitian"]}}}}, {"code": "6002", "title": "Topics in Multivariate Analysis", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in MSc/PgD in Epidemiology and Biostatistics, MPhil in Public Health, PhD in Public Health, Master of Public Health, MSc/PgD in Health Services Management, MSc/PgD in Health Promotion and Behavioural Health", "description": "This course will cover methods importance in the analysis of data collected from questionnaires. Methods for translation and validation of questionnaires will be covered. Both exploratory and confirmatory factor analysis (under the framework of Structural Equation Models) will be discussed.", "outcome": "After taking this course the students will understand the uses of exploratory factor analysis, discriminant analysis and SEM methods including confirmatory factor analysis and path analysis in the exploration and hypothesis testing for data collected from questionnaires.\r  課程結束後，學生能夠正確使用探索性因素分析、判別分析和結構方程模型，包括驗證性因素分析、探索中的通徑分析及問卷調查中資料收集的假設檢驗。", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 3": {"--LEC (1116)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor WANG Haitian"]}}}}, {"code": "6005", "title": "Pharmaceutical Bioinformatics", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "Pre-requisites: BIOS5001, BIOS5002 ;For students in MSc/PgD in Epidemiology and Biostatistics, MPhil/PhD/PgD in Public Health, Master of Public Heath, MSc/PgD in Health Services Management, MSc/PgD in Health Promotion and Behavioural Health", "description": "The course will provide a broad overview and introduction to bioinformatics and its applications in pharmaceutical industry. Topics will cover (1) basic bioinformatics methods: hierarchical clustering, lasso, random forest, LDA, PCA, boosting, bootstrapping, etc. (2) data sequencing and management: microarray data, GWAS data, the raw data treatment and analysis method, batch effect and normalization, parallel programming in R; (3) phylogenic analysis; (4) Chemobioinformatics modeling, 3D structure, chemical - protein relation leading to drug discovery.", "outcome": "1. Understand the basic bioinformatics methods \r 2. Know how to use the software of conducting bioinformatics analysis\r 3. Know when to apply the methods under different scenarios and conduct exploratory research\r 4. Interpret data analysis output, and use graphical representations", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 3": {"--LEC (1123)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor WANG Haitian"]}}}}, {"code": "6006", "title": "Artificial Intelligence Methods for Medical Research and Pharmaceutical Science", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "-For students of Master of Public Health Programme\n-For students of Master of Science in Epidemiology and Biostatistics Programme", "description": "This course is an advanced module for students who are interested to understand how various artificial intelligence approaches including machine-learning and deep-learning can be used on top of traditional biostatistics methods. It emphasizes on practical knowledge and skills needed for doing this kind of research leveraging on our experience and proprietary development of the Automatic Retinal Image Analysis (ARIA) and the Bioinformatics and Genomic research with significant machine-learning and deep-learning components. On top of sharing of the real life experience other important research areas in medical and pharmaceutical science would also be discussed.", "outcome": "By the end of this module, student are expected to be able to: 1. Understand the strengths and weaknesses of artificial intelligence (AI) related methods including machine-learning and deep-learning approaches 2. Able to formulate problems with advantages when using AI approaches in addition to traditional biostatistics methods 3. Able to have hands-on experience using a cloud-based platform such as Azure to carry out some of the standard AI methods 4. Students will be equipped with knowledge to critically appraise literature that apply AI methods in their analysis", "syllabus": "1. Machine-learning applications in clinical trials and pharmaceutical science2. Genetic and bioinformatics application using deep-learning approach3. Deep-learning methods versus statistical methods for image processing in health research4. Artificial intelligence approach for the analysis of hospital administration and quality control data5. Infectious disease modeling using machine-learning approaches6. Climate change and health outcome analysis based on machine-learning methods ", "required_readings": "·      Artificial Intelligence in Medicine (English) 2001, by Silvana Quaglini (Editor), Pedro Barahona (Editor), Steen Andreassen (Editor)·      Machine Learning in Medicine - a Complete Overview (English) 2015th·      Deep Medicine: How Artificial Intelligence Can Make Healthcare Human Again Kindle Edition", "recommended_readings": "·      Artificial Intelligence in Medicine (English) 2001, by Silvana Quaglini (Editor), Pedro Barahona (Editor), Steen Andreassen (Editor)·      Machine Learning in Medicine - a Complete Overview (English) 2015th·      Deep Medicine: How Artificial Intelligence Can Make Healthcare Human Again Kindle Edition", "terms": {"2020-21 Term 3": {"--LEC (1015)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [5], "locations": ["Prince of Wales Hospital"], "instructors": ["Dr LAI Xin, \n\rDr LEE Jock Wai, \n\rProfessor CHONG Ka Chun, \n\rProfessor WANG Haitian, \n\rProfessor William Bernard GOGGINS III, \n\rProfessor ZEE Chung Ying Benny"]}}}, "assessments": {"Homework or assignment": "40", "Presentation": "60"}}]