[{"code": "1001", "title": "Introduction to Sign Language and Bimodal Bilingualism", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Not for students who have taken LING2303", "description": "This course introduces the history of sign language research and how the findings gradually transform our understanding of sign language in human cognition, as well as human interaction in different sociolinguistic contexts. Key concepts to be introduced include sign language and gesture, natural sign language versus manually coded spoken language, sign language and spoken language grammars, deafness and sign language, sign language acquisition, unimodal bilingualism and bimodal bilingualism.", "outcome": "Students completing this course will achieve a basic understanding that: 1. Sign language enjoys the same linguistic status as spoken language in human interaction;  2. There is a continuum of signing varieties adopted by hearing and deaf individuals in society in relative degrees;  3. Sign language transmission through generations is necessitated by a Deaf Community with members who take sign language as a means of communication;  4. Sign language is acquirable by children, deaf or hearing, and supports their language, cognitive and emotional development.", "syllabus": "   Topic Contents/fundamental concepts   Sign Language   A visual-spatial language adopted by members of the Deaf Community in daily interactions. It consists of a grammatical system which reflects universal principles of linguistic organization but which shows differences when compared with the grammar of the society’s spoken language.     Deafness and hearing loss  Deafness is a pathological terminology referring to loss of hearing in measurable degrees and types.  It has a strong speech or spoken language undertone, interpreted usually in the context of medical intervention.   Signing varieties  Signing is a cover term for a wide array of varieties which reflects at the one end of the continuum the grammar of spoken languages and at the other end the grammar of natural sign languages. Examples of signing varieties include  natural sign languages, manually coded spoken languages, fingerspelling, cued speech, tactile signing, etc.   Sign Language Acquisition  It covers different types of acquisition processes involving sign languages, which may be L1 acquisition of sign languages by deaf or hearing individuals in a monolingual fashion, or bimodal bilingual acquisition of both a sign language and a spoken language in early childhood  or entering adulthood.    ", "required_readings": "There will be: 1. Handouts and reading materials to enhance understanding of the fundamental concepts about sign language research 2. Micromodules on various topics to clarify issues surrounding deafness and sign language to stimulate students’ critical analysis of the social situations involving sign language.  A. Journals 1. Journal of Sign Language Studies (http://gupress.gallaudet.edu/SLS.html) 2. Journal of Sign Language and Linguistics (https://benjamins.com/#catalog/journals/sll/main) 3. Journal of Deaf Studies and Deaf Education (http://jdsde.oxfordjournals.org) 4. Journal of Speech, Language and Hearing Research (http://jslhr.pubs.asha.org) 5. Journal of Bilingual Education and Bilingualism (http://www.tandfonline.com/toc/rbeb20/current#.Usn5tqVmsWY)  B. Textbooks Baker, A., van den Bogaerde, B., Pfau, R, & Schermer, T. (Eds). (2016). The linguistics of sign languages: An introduction. Amsterdam, Netherlands: John Benjamins Publishing. Johnston, T., & Schembri, A. (2007). Australian Sign Language: An introduction to sign language linguistics. Cambridge, UK: Cambridge University Press.  Sutton-Spence, R., & Woll, B. (1998). The linguistics of British Sign Language: An introduction. Cambridge, UK: Cambridge University Press.  C. Papers Adam, B. (2012). Language Contact and borrowing. In Pfau, R., Steinbach, M., & Woll, B. (Eds.) Sign language: An international handbook (pp. 841-861). Berlin, Germany: Mouton de Gruyter.  Archbold, S, & Mayer, C. (2012). Deaf education: The impact of cochlear implantation? Deafness and Education Research, 14(1), 2-15. Bauman, H-D. L. (Ed). (2008). Open you eyes, Deaf studies talking. Minneapolis, Minn: University of Minnesota Press. Benitez-Burraco, A. (2015) A biolinguistic approach to sign language. In Marschark, M. & Spencer, P. (Eds.), The Oxford handbook of Deaf studies in language (pp. 256-272). Oxford, UK: Oxford University Press. Brentari, D. (2006). Sign language: Phonology. In Brown, K. (Ed.), Encyclopedia of language & linguistics (2nd ed., pp. 338-343). New York, NY: Elsevier. Campbell, R, MacSweeney, M., Waters, D. (2007). Sign language and the brain: A review. Journal of Deaf Studies and Deaf Education, 13(1), 3-20.  Castro-Caldas, A. (2015). What the illiterate brain tells the Deaf Brain. In Marschark, M., & Spencer, P. (Eds.), The Oxford handbook of deaf studies in language (pp. 288-296). Oxford, UK: Oxford University Press. Crasborn, O. (2012). Phonetics. In Pfau, R., Steinbach, M., & Woll, B. (Eds.) Sign language: An international handbook (pp. 4-20). Berlin, Germany: Mouton de Gruyter. Corina, D. (2015). Neurolingusitic studies on sign language bilingualism. In Marschark, M. & Spencer, P. (Eds.). The Oxford Handbook of Deaf Studies in Language (pp. 276 -287). Oxford, UK: Oxford University Press. Chen Pichler, D. (2012). Acquisition. In Pfau, R., Steinbach, M. & Woll, B. (Eds.) Sign Language: An International Handbook, 647-686. Berlin/Boston: Walter de Gruyter. Emmorey, K. (1999). Do signers gesture? In Messing, L., & Campbell, R. (Eds.), Gesture, speech, and sign (pp. 133-159). Oxford, UK: Oxford University Press. Engberg-Pedersen, T. (2010). Factors that form classifier signs. In Brentari, D. (Ed.), Sign languages (pp. 252-283). Cambridge, UK: Cambridge University Press. Goldin-Meadow, S. (2012). Homesign: Gesture to language. In Pfau, R., Steinbach, M., & Woll, B. (Eds.) Sign language: An international handbook (pp. 601-625). Berlin, Germany: Mouton de Gruyter. Johnston, T. (2006). Sign language: morphology. In Brown, K. (Ed.), Encyclopedia of Language & linguistics (2nd ed., pp. 324-328). New York, NY: Elsevier. Leeson, L., Saeed, J. (2012). Word order. In Pfau, R., Steinbach, M., & Woll, B. (Eds.), Sign language: An international handbook (pp. 246-265). Berlin, Germany: Mouton de Gruyter. Lillo-Martin, D. (2006). Sign language: Syntax. In Brown, K. (Ed.), Encyclopedia of language & linguistics (2nd ed., pp.351-353). New York, NY: Elsevier.  Mathur, G., & Rathmann, C. (2010). Verb agreement in sign language morphology. In Brentari, D. (Ed.), Sign languages (pp. 173-196). Cambridge, UK: Cambridge University Press. Marschark, M. (2010). Raising and educating a Deaf child. New York, NY: Oxford University Press. (Chapter 3 \"Communication With Deaf Children\", pp. 63-91). Marschark, M., Tang, G., & Knoors, H. (Eds.). (2014). Bilingualism and bilingual education. Oxford, UK: Oxford University Press.  Mayberry, R., & Squires, B. (2006). Sign language acquisition. In Lieven, E. (Ed.), Encyclopedia of language and linguistics (2nd ed., pp. 291-295). New York, NY: Elsevier. Padden, C. (1998). The ASL lexicon. Sign Language and Linguistics, 1(1), 39-64. Pfau, R., & Quer, J. (2010). Nonmanuals: Their grammatical and prosodic roles. In Brentari, D. (Ed.), Sign Languages (pp. 381-402). Cambridge, UK: Cambridge University Press.  Pfau, R. (2012). Manual communication system: Evolution and variation. In Pfau, R., Steinbach, M., & Woll, B. (Eds.), Sign language: An international handbook (pp. 513-551). Berlin, Germany: Mouton de Gruyter.  Pfau, R., Steinbach, M., & Woll, B. (Eds.). (2012). Sign language: An international handbook, Berlin, Germany: Mouton de Gruyter. Sutton-Spence, R., & Day, L. (2001). Mouthings and mouth gestures in British Sign Language. In Boyes Braem, P., & Sutton-Spence, R. (Ed.), The hands are the head of the mouth: The mouth as articulator in sign languages (pp. 69-85). Hamburg, Germany: Signum. Supalla, T. (1986). The classifier system in American Sign Language. In Craig, C. (Ed.), Noun classes and categorization: Typological studies in language (Vol. 7, pp. 181-214). Amsterdam, Netherlands: John Benjamins. Wilcox, S. (2007). Routes from gestures to language. In Pizzuto, E., Pietrandrea, P., & Simone, R. (Eds.), Verbal and signed languages: Comparing structures, constructs and methodologies (pp.107-132). Berlin, Germany: Mouton de Gruyter. Woll, B., Ladd, P. (2003). Deaf Communities. In Handbook of Deaf studies and Deaf education (Vol. 1, pp. 151-163). Oxford, UK: Oxford University Press.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (8383)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Y.C. Liang Hall 103"], "instructors": ["Professor TANG Wai Lan Gladys"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}, "-T01-TUT (9049)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Y.C. Liang Hall 103"], "instructors": ["Professor TANG Wai Lan Gladys"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2021-22 Term 1": {"--LEC (8308)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 408"], "instructors": ["Professor TANG Wai Lan Gladys"], "meetingDates": ["8/9", "15/9"]}, "-T01-TUT (8309)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 408"], "instructors": ["Professor TANG Wai Lan Gladys"], "meetingDates": ["8/9", "15/9"]}}}, "assessments": {"Essay test or exam": "20", "Homework or assignment": "20", "Presentation": "20", "Project": "30", "Participation": "10"}}, {"code": "2001", "title": "Sign Linguistics I: Phonetics and Phonology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course presents an overview of the major research findings related to phonetics and phonology in sign language in the past few decades. Topics to be covered include the transcription systems for the formational parameters of individual signs, perceptual and physiological systems underlying the production of signs, markedness in sign language phonology, phonological processes that result in historical changes and lexical variations, as well as different theoretical frameworks that have been put forward to account for the major parameters and syllable structures in sign language phonology.", "outcome": "Students completing this course will be able to do the followings:  1. Identify and transcribe the basic parameters using the Stokoe Notation system 2. Point out the similarities and differences between the Stokoe Notation System and other systems such as Hamburg Notation System and Sign Language Phonetic Annotation system 3. Identify, describe and explain phonological processes that lead to lexical variations and historical changes 4. Articulate the differences and similarities between spoken language and sign language phonology in relation to the two modalities. 5. Discuss the types of linguistic evidence with respect to three basic phonological parameters (i.e. handshape, movement and location) that have been used to motivate sign phonology models, and apply this knowledge in the phonological analysis of other individual sign languages.  6. Apply the concept of “syllable” as it relates to sign language data 7. Acquire basic knowledge of the current issues of sign language phonology and be able to read further literature independently.", "syllabus": "   Topic Contents/fundamental concepts   Notation Systems for Sign Languages  This unit introduces three notation systems for sign language data: the Stokoe Notation System, the Hamburg Notation System (HamNoSys), and SignWriting. Students will practice transcribing some signs using the Stokoe System.   Sign Language Phonetics Some major findings of articulatory phonetics in sign languages will be discussed.   Common Phonological Processes in Sign Languages  This unit presents common phonological processes and changes that have been found in the world’s sign languages. Students will practice how to identify processes that result in historical changes and sociolinguistic variations.   Sequentiality vs simultaneity in sign language phonology This unit presents the evidence that motivates a model of phonology that takes into account the sequential and simultaneous properties of signs.   Handshape as a phonological parameter This unit presents the generalizations that have been made about how handshapes are configured and constrained in sign languages and how phonological models have attempted to account for these patterns.   Location as a phonological parameter This unit looks into the subcategories of locations, their respective characteristics and how they can be represented in phonological models.   Movement as a phonological parameter This unit presents the different types of movements and their characteristics. It also reviews the controversies surrounding the phonological status of movement as an independent category.   Sign language syllables This unit discusses whether syllable-like structures can be found in sign languages and what are the supporting evidence.   Issues in acquisition This unit provides an overview of the major findings in the acquisition of sign language phonology  ", "required_readings": "There will be: 1. Handouts and reading materials to enhance understanding of the fundamental concepts about sign language phonology 2. Online video resources will be provided.  Journals 1. Journal of Sign Language Studies (http://gupress.gallaudet.edu/SLS.html) 2. Journal of Sign Language and Linguistics (https://benjamins.com/#catalog/journals/sll/main) 3. Journal of Deaf Studies and Deaf Education (http://jdsde.oxfordjournals.org) 4. Journal of Speech, Language and Hearing Research (http://jslhr.pubs.asha.org) 5. Journal of Bilingual Education and Bilingualism (http://www.tandfonline.com/toc/rbeb20/current#.Usn5tqVmsWY)  Mandatory Reading Ann, J. (1993). A linguistic investigation of the relationship between physiology and handshape. Ph.D dissertation, The University of Arizona, United States.  Baus, C., Gutierrez, E. & Carreiras, M. (2014). The role of syllables in sign language production. Frontiers in Psychology, 5, article 1254. DOI: 10.3389/fpsyg.2014.01254 Brentari, D. (2002). Modality differences in sign language phonology and morphophonemics. In Meier, R. P., Cormier, K., Quinto-Pozos, D. (Eds.), Modality and structure in signed and spoken languages (pp. 35-64). Cambridge, UK: Cambridge University Press.  Brentari, D., Falk, J., & Wolford, G. (2015). The acquisition prosody in American Sign Language. Language, 91(3), 144-168.  Conlin, K., Mirus, G, & Mauk, C. (2000). The acquisition of first signs: place, handshape, and movement. In Chamberlain, C., Morford, J., & Mayberry, R. (Eds,), Language acquisition by eye (pp. 51-69). Mahwah, NJ: Lawrence Erlbaum Associates. Crasborn, O., Van der Hulst, H., & Van der Kooij, E. (2000). Phonetic and phonological distinctions in sign languages. Presented at the Intersign: Workshop 2, Leiden, December 1998. Retrieved from www.sign-lang.uni-hamburg.de/intersign/Workshop2/ CrashbornHulstKooij/crasbor_hulst-Kooij.html. Dachkovsky, S. & Sandler, W. (2009). Visual intonation in the prosody of a sign language. Language and Speech, 52(2/3), 287-314.  Garcia, B., & Sallandre, M.-A. (2013). Transcription systems for sign languages: A sketch of the different graphical representations of sign language and their characteristics. In Müller, C., Cienki, A., Fricke, E., Ladewig, S., McNeill, D., & Tessendorf, S. (eds.), Handbook of Body-Language-Communication (pp. 1125-1338). Berlin, Germany: Mouton De Gruyter. Hanke, T. (2004). HamNoSys - representing sign language data in language resources and language processing contexts. In Streiter, O., & Vettori, C. (Eds): LREC 2004, Workshop Proceedings: Representation and processing of sign languages (pp. 1-6). Paris, France: ELRA. Johnson, R. E., & Liddell, S. K. (2010). Toward a phonetic representation of signs: Sequentiality and contrast. Sign Language Studies, 11(2), 271-274. Johnson, R. E., & Liddell, S. K. (2011a). A segmental framework for representing signs phonetically. Sign Language Studies, 11(3), 408-463. Johnson, R. E., & Liddell, S. K. (2011b). Toward a phonetic representation: The fingers. Sign Language Studies, 12(1), 4-45. Johnson, R. E., & Liddell, S. K. (2012). Toward a phonetic representation of hand configuration: The thumb. Sign Language Studies, 12(2), 316-333. Karnopp, L. B. (2002). Phonology acquisition in Brazilian Sign Language. In Morgan, G., & Woll, B. (Eds.), Directions in sign language acquisition (pp. 29-53). Amsterdam, The Netherlands; Philadelphia, PA: John Benjamins Publishing.  Marentette, P., & Mayberry, R. (2000). Principles for an emerging phonological system: a case study of early asl acquisition. In Chamberlain, C., Morford, J., & Mayberry, R. (Eds.), Language acquisition by eye (pp. 71–90). Mahwah, N.J.: Lawrence Erlbaum Associates. Nespor, M., & Sandler, W. (1999). Prosody in Israeli Sign Language. Language and Speech, 42 (2/3), 143-176. Pfau R., Steinbach, M., & Woll, B. (2012). Sign language: An international handbook. Berlin, Germany: De Gruyter Mouton. Sandler, W. (2012). The phonological organization of sign languages. Language and Linguistic Compass, 6(3), 162-182.  Sandler, W. (2017). The challenge of sign language phonology. Annual Review of Linguistics, 3, 43-63.  Tkachman, O., Hall, K., Xavier, A., & Gick, B. (2016). Sign language phonetic annotation meets Phonological CorpusTools: Towards a sign language toolset for phonetic notation and phonological analysis. Annual Meetings on Phonology: Proceedings. DOI: http://dx.doi.org/10.3765/amp.v3i0.3667", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (6477)": {"startTimes": ["12:30"], "endTimes": ["14:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor David Philip THIERFELDER"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}, "-T01-TUT (6496)": {"startTimes": ["14:30"], "endTimes": ["15:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor David Philip THIERFELDER"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 2": {"--LEC (6146)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [6], "locations": ["Wu Ho Man Yuen Bldg 301"], "instructors": ["Professor David Philip THIERFELDER"], "meetingDates": ["15/1", "22/1", "29/1"]}, "-T01-TUT (6147)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [6], "locations": ["Wu Ho Man Yuen Bldg 301"], "instructors": ["Professor David Philip THIERFELDER"], "meetingDates": ["15/1", "22/1", "29/1"]}}}, "assessments": {"Essays": "25", "Essay test or exam": "20", "Homework or assignment": "10", "Participation": "10", "Short answer test or exam": "35"}}, {"code": "2002", "title": "Sign Linguistics II: Morphology, Syntax and Semantics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course provides an overview of the major linguistic issues related to morphology, syntax and semantics in sign linguistics, with particular focus on how sign languages resemble and differ from spoken languages in these grammatical aspects. Areas to be covered include word class and word formation strategies, agreement, tense, aspect and modality, classifier constructions, word order and sentence types, negation, constructed actions, metaphors, use of space, lexical semantics and information structure.", "outcome": "Students completing this course will achieve a basic understanding of the followings: 1. Sign languages are natural human languages having striking grammatical parallels with spoken languages in terms of morphology, syntax and semantics.  2. The simultaneous and sequential nature of different morphological processes in sign languages. 3. The different types of sentence types and how their syntactic structures can be analysed 4. Fundamental semantic and pragmatic concepts in sign languages", "syllabus": "   Topic Contents/fundamental concepts   Morphology How words and constituents are defined, word formation rules, derivation, inflection, compounding, agreement, morphological markers for tense, aspect and modality, classifier constructions   Syntax Different sentence types and syntactic structures, word order patterns, interrogation and negation, constructed actions   Semantics and pragmatics Role of iconicity in semantics, metaphorical use of language, different types of signing space, lexicon, lexical semantics and information structure  ", "required_readings": "There will be: 1. Handouts and reading materials to enhance understanding of the fundamental concepts about sign language research 2. Micromodules on various topics to clarify issues surrounding deafness and sign language to stimulate students’ critical analysis of the social situations involving sign language.  A. Journals 1. Journal of Sign Language Studies (http://gupress.gallaudet.edu/SLS.html) 2. Journal of Sign Language and Linguistics (https://benjamins.com/#catalog/journals/sll/main) 3. Journal of Deaf Studies and Deaf Education (http://jdsde.oxfordjournals.org) 4. Journal of Speech, Language and Hearing Research (http://jslhr.pubs.asha.org) 5. Journal of Bilingual Education and Bilingualism (http://www.tandfonline.com/toc/rbeb20/current#.Usn5tqVmsWY)  B. Books Baker, A., van den Bogaerde, B., Pfau, R., & Schermer, T. (2016). The linguistics of sign languages: An introduction. London, UK: John Benjamins Publishing.  Pfau, R., Steinbach, M. & Woll, B. (2012). Sign language: An international handbook. Berlin: Germany: De Gruyter Mouton.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (7177)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor SZE Yim Binh"], "meetingDates": ["10/9", "17/9", "24/9"]}, "-T01-TUT (9053)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor SZE Yim Binh"], "meetingDates": ["10/9", "17/9", "24/9"]}}, "2021-22 Term 1": {"--LEC (8310)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Lee Shau Kee Building 201"], "instructors": ["Professor SZE Yim Binh"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}, "-T01-TUT (8311)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Lee Shau Kee Building 201"], "instructors": ["Professor SZE Yim Binh"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Essays": "25", "Essay test or exam": "35", "Homework or assignment": "10", "Participation": "10", "Short answer test or exam": "20"}}, {"code": "3001", "title": "Sign Language in Education", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course explores the impact of sign linguistics research on the shaping of new directions in education, in particular, the issue of language in education and the benefits of sign language in educating students with diverse abilities. Factors to be covered include society’s perception about minority languages in bilingual education, attitudes towards and use of oral, written as well as the various modes of signing in different educational settings, code choice, code switching and code blending in bimodal bilingual communication, as well as effects of sign language on children’s literacy, cognitive and sociopsychological development.", "outcome": "Students completing this course will achieve a basic understanding about: 1. History of sign language in educating deaf students, especially the rise of sign bilingualism as a consequence of sign linguistics research 2. Controversy between oralism and manualism in deaf education  3. Different modes of bilingual education especially the issues surrounding the deployment of two languages in classroom teaching, 4. Latest developments of educating typical and atypical children using a sign bilingual approach  5. Incorporation of specific sign language and gesture in teaching content areas like mathematics, general science, etc.", "syllabus": "   Topic Contents/fundamental concepts   Sign Language  A visual-spatial language adopted by members of the Deaf Community in daily interactions. It consists of a grammatical system which reflects universal principles of linguistic organization but which shows differences when compared with the grammar of the society’s spoken language.     Sign bilingual education An approach which supports the use of natural sign language in educating deaf students as first language, and the written mode of spoken language as second language.     Diverse abilities Usually referring to individuals in society or educational settings that demonstrate different hearing, intellectual, and sociopsychological abilities    Code choice  It refers to the choice of a language code by individuals in communication; it’s a reflection of the instinctive abilities of bilinguals/multilinguals due to their multiple competences   ", "required_readings": "There will be: 1. Handouts and reading materials to enhance understanding of the fundamental concepts about sign language research 2. Micromodules on various topics to clarify issues surrounding deafness and sign language to stimulate students’ critical analysis of the social situations involving sign language.  A. Journals 1. Journal of Sign Language Studies (http://gupress.gallaudet.edu/SLS.html) 2. Journal of Sign Language and Linguistics (https://benjamins.com/#catalog/journals/sll/main) 3. Journal of Deaf Studies and Deaf Education (http://jdsde.oxfordjournals.org) 4. Journal of Speech, Language and Hearing Research (http://jslhr.pubs.asha.org) 5. Journal of Bilingual Education and Bilingualism (http://www.tandfonline.com/toc/rbeb20/current#.Usn5tqVmsWY)  B. Books Marschark, M., Knoors, H., & Antia, S. (Eds). (2019). Co-enrollment education for deaf and hard-of-hearing learners. Oxford, UK: Oxford University Press.  Marschark, M., Tang, G., & Knoors H. (Eds). (2014). Bilingualism and bilingual education. Oxford, UK: Oxford University Press.  Pickersgill, M., & Gregory, S. (1998) Sign bilingualism: A model. Wembley: LASER.  Plaza-Putz, C., & Morals-López, E. (Eds). (2008). Sign bilingualism. Amsterdam, The Netherlands: John Benjamins.  Swanwick, R. (2016). Languages and languaging in deaf education: A framework for pedagogy. New York, NY: Oxford University Press.   C. Papers Adam, B. (2012). Language contact and borrowing. In Pfau, R., Steinbach, M., & Woll, B. (Eds.) Sign language: An international handbook (pp. 841-861). Berlin, Germany: Mouton de Gruyter.  Archbold, S, & Mayer, C. (2012). Deaf education: The impact of cochlear implantation?   Deafness and Education Research, 14(1), 2-15. Baker, C. (2001). Foundations of bilingual education and bilingualism. Clevedon England,   Buffalo: Multilingual Matters. Bauman, H-D. L. (Ed). (2008). Open you eyes, Deaf studies talking. Minneapolis, Minn:   University of Minnesota Press. Benitez-Burraco, A. (2015). A biolinguistic approach to sign language. In Marschark, M. & Spencer, P. (Eds.), The Oxford handbook of Deaf studies in language (pp. 256-272). Oxford, UK: Oxford University Press. Bonvillian, J. D., Nelson, K. E., & Milnes Rhyne, J. (1981). Sign language and autism. Journal of Autism and Developmental Disorders, 11(1), 125-137.  Campbell, R, MacSweeney, M., & Waters, D. (2007). Sign language and the brain: A review. Journal of Deaf Studies and Deaf Education, 13(1), 3-20.  Capirci, O., Cattani, A., Rossini, P., & Volterra, V. (1998). Teaching sign language to hearing children as a possible factor in cognitive enhancement. Journal of Deaf Studies and Deaf Education, 3(2), 135-142. Corina, D. (2015). Neurolingusitic studies on sign language bilingualism. In Marschark, M. & Spencer, P. (Eds.). The Oxford handbook of Deaf studies in language (pp. 276 -287). Oxford, UK: Oxford University Press. Goldin-Meadow, S. (2012). Homesign: Gesture to language. In Pfau, R., Steinbach, M., & Woll, B. (Eds.) Sign language: An international handbook (pp. 601-625). Berlin, Germany: Mouton de Gruyter. Knoors, H., & Marschark, M. (2015). Cognitive profiles of Deaf children. In Teaching Deaf   learners (pp. 107-131) Oxford, UK: Oxford University Press. Mayer, C., & Leigh, G. (2010). The changing context for sign bilingual education programs: issues in language and the development of literacy. International Journal of Bilingual Education and Bilingualism, 13(2), 175-186. Retrieved from http://www/tanfonline.com/loi/rbeb20.  Marschark, M. (2010). Communication with Deaf children. In Raising and educating a Deaf child (pp. 63-91). New York, NY: Oxford University Press.  Marschark, M., Tang, G., & Knoors, H. (Eds.). (2014). Bilingualism and bilingual education.  Oxford, UK: Oxford University Press.  Murray, J.J., Snoddon, K., De Meulder, M., & Underwood, K. (2018). Intersectional inclusion for deaf learners: moving beyond General Comment #4 on Article 24 of the United Nations Convention on the Rights of Persons with Disabilities. International Journal of Inclusive Education, DOI: 10.1080/13603116.2018.1482013 Shield, A., Meier, R. P., & Tager-Flusberg, H. (2015).The use of sign language pronouns by native-signing children with autism. Journal of Autism and Developmental Disorders, 45(7), 2128-2145. Spencer, P. E., & Marschark, M. (2010). Evidence-based practice in educating Deaf and Hard-  of-Hearing students. New York, NY: Oxford University Press.  Tang, G. (2015). Hong Kong Sign Language. In Wang, S-Y. & Sun, C.F. (Eds.), The Oxford handbook of Chinese linguistics (pp. 710-728). New York, NY: Oxford University Press. Tang, G. & Yiu, C. K-M. (2016). Developing sign bilingualism in a co-enrollment school environment: A Hong Kong case study. In Marschark, M., & Spencer, P. (Eds), The Oxford handbook of Deaf studies in language (pp.197-217). New York, NY: Oxford University Press. Tincani, M. (2004). Comparing the picture exchange communication system and sign language training for children with autism. Focus on Autism and Other Developmental Disabilities, 19(3), 152-163. Woll, B., & Ladd, P. (2003). Deaf Communities. In Handbook of Deaf studies and Deaf   education (Vol. 1, pp. 151-163). Oxford, UK: Oxford University Press. Yiu, K-M., & Tang, G. (2014). Social integration of deaf and hard-of-hearing students in a sign bilingual and co-enrollment environment. In Marschark, M., Knoors, H., & Tang, G. (Eds), Bilingualism and bilingual deaf education (pp. 342-367). New York, NY: Oxford University Press.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (5762)": {"startTimes": ["13:30"], "endTimes": ["15:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. WONG Fat"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}, "-T01-TUT (9051)": {"startTimes": ["15:30"], "endTimes": ["16:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. WONG Fat"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}}, "2021-22 Term 1": {"--LEC (8313)": {"startTimes": ["13:30"], "endTimes": ["15:15"], "days": [3], "locations": ["Lee Shau Kee Building 201"], "instructors": ["Staff"], "meetingDates": ["8/9", "15/9"]}, "-T01-TUT (8314)": {"startTimes": ["15:30"], "endTimes": ["16:15"], "days": [3], "locations": ["Lee Shau Kee Building 201"], "instructors": ["Staff"], "meetingDates": ["8/9", "15/9"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "20", "Presentation": "20", "Project": "30", "Participation": "10"}}, {"code": "3002", "title": "Introduction to Sign Language Interpreting", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Prerequisite: HKSL2000,2001,2050,3000,3001,3002 or 3050", "description": "This course aims to provide a first introduction to sign interpreting to students with no prior training of the subject. Different modes of interpreting (e.g. sight translation, consecutive interpreting, simultaneous interpreting) and different models of sign language interpreting will be discussed. Discourses commonly found in local sign interpretation will be introduced (e.g. health, education, legal, social work, business and government, etc.). As an international development, the roles of Deaf interpreters to serve a broader purpose of communication are highlighted. Students are expected to be able to compare the development of local sign interpreting to that of Mainland China, Macau, and other countries.", "outcome": "Students completing this course will achieve a basic understanding that: 1. Different modes of interpreting (e.g., sight translation, consecutive interpreting, and simultaneous interpreting) serve different purpose in communication access; 2. Due to the minority status of the Deaf community and development of their service demand, different models of sign language interpreting are developed; 3. Sign language interpreters have to equip themselves with and respond to different demands in the discourse setting; 4. The roles of Deaf interpreters have been serving a broader purpose of language communication and it is also a form of human rights empowerment.", "syllabus": "   Topic Contents/fundamental concepts   Modes of Interpreting Sight translation, consecutive interpreting, and simultaneous interpreting serve different purpose in communication access. Sight translation provides instant access of written text to signers. Apart from competing in their time duration of interpreting, consecutive and simultaneous interpreting also differ in terms of its translation production clarity and appropriate use in different discourse.   Models of Sign Language Interpreting Answering the needs of service consumers, sign language interpreting models develop from helper model, machine model, communication facilitator model, bilingual-bicultural model, to nowadays ally model.   Discourses and Demands Different discourses call for different demands and qualifications of interpreters. They have to equip themselves with different knowledge, both encyclopedic and specialized, in order to relay the messages between their service consumers. Interpreters have to be alert to the register choice, as well as the intended and extended meaning implied in different discourses. On top of our everyday languages Hong Kong Sign Language and Cantonese, other languages, like English and Mandarin, might also be a different demand due to the post-colonial status of our city.   Deaf Interpreters Deaf interpreters have been introduced as unimodal interpreters in international conferences and as language expert in regional setting. The widely use of deaf interpreters has become an international trend and providing better access to the service consumers, especially for those who are Deaf-Blind, elderly Deaf, Deaf-plus, Deaf children, and Deaf foreigners. In terms of human rights empowerment, their roles also serve the purpose of Deaf individuals as language models.  ", "required_readings": "There will be: 1. Handouts and reading materials to enhance understanding of the fundamental concepts about sign language research; 2. Micromodules on various topics to clarify issues surrounding deafness and sign language to stimulate students’ critical analysis of the social situations involving sign language.  A. Textbooks Napier, J., McKee, R., & Goswell, D. (2010). Sign language interpreting: Theory and practice in Australia and New Zealand (2nd ed.). Sydney, AU: Federation Press. Holcomb, T. K., & Smith, D. H. (Eds.). (2018). Deaf eyes on interpreting. Washington, DC: Gallaudet University Press.   B. Books and Articles Agrifoglio, M. (2004). Sight translation and interpreting: A comparative analysis of constraints and failures. Interpreting, 6(1), 43-67. Baker-Shenk, C. (n.d.) The interpreter: Machine, advocate, or ally? National Consortium of Interpreter Education Centers (NCIEC). Retrieved at http://www.interpretereducation.org/ wp-content/uploads/2014/04/The-Interpreter-Machine.pdf  Dean, R. K., & Pollard, R. Q. Jr. (2005). Consumers and service effectiveness in interpreting work: A practice profession perspective. In Marschark, M., Peterson, R., & Winston, E. A. (Eds.), Sign language interpreting and interpreter education: Directions for research and practice (pp. 259-282). New York, NY: Oxford University Press. Dickinson, J., & Turner, G. H. (2008). Sign language interpreters and role conflict in the workplace. In Valero-Garcés, C., & Martin, A. (Eds.), Crossing borders in community interpreting: Definitions and dilemmas (pp. 231-244). Amsterdam, Netherlands; Philadelphia: John Benjamins.  Forestal, E. (2004). The emerging professionals: Deaf interpreters and their views and experiences on training. In Marschark, M., Peterson, R., & Winston, E. A. (Eds.), Sign language interpreting and interpreter education: Directions for research and practice (pp. 235-258). New York, NY: Oxford University Press. Hale, S. B. (2007). Community interpreting. Hampshire, UK: Palgrave Macmillan. Kurz, K. B., & Langer, E. C. (2004). Student perspectives on educational interpreting: Twenty Deaf and Hard of Hearing students offer insights and suggestions. In Winston, E. (Ed.), Educational interpreting: How it can succeed (pp. 9-47). Washington, DC: Gallaudet University. McIntire, M. L., & Sanderson, G. R. (2015[1995]). Who’s in charge here? Perceptions of empowerment and role in the interpreting setting. In Roy, C. B., & Napier, J. (eds.), The sign language interpreting studies reader (pp. 327-337). Amsterdam, Netherlands; Philadelphia, PA: John Benjamins. Morgan, E. F. (2008). Interpreters, conversational style, and gender at work. In Hauser, P. C., Finch, K. L., & Hauser, A. B. (Eds.), Deaf professionals and designated interpreters: A new paradigm (pp. 66-80). Washington, DC: Gallaudet University Press. Morgan, P., & Adam, R. (2012). Deaf interpreters in mental health settings: Some reflections on and thoughts about Deaf interpreter education. In Swabey, L., & Malcolm, K. (eds.), In our hands: educating healthcare interpreters (pp. 190-208). Washington, DC: Gallaudet University. Oatman, D. (2008). Designated interpreter-Deaf chief executive officer: Professional interdependence. In Hauser, P. C., Finch, K. L., & Hauser, A. B. (Eds.), Deaf professionals and designated interpreters: A new paradigm (pp. 165-179). Washington, DC: Gallaudet University Press. Patel, N. (2010). Speaking with the silent: Addressing issues of disempowerment when working with refugee people. In Tribe, R., & Raval, H. (eds.) Working with interpreters in mental health (pp. 219-237). East Sussex, UK; New York, NY: Routledge. Perez, I. A., & Wilson, C. W. L. (2004). Interpreter-mediated police interviews: Working as a professional team. In Wadensjö, C., Dimitrova, B. E., & Nilsson, A.-L. (eds.), The Critical Link 4 (pp. 79-94). Amsterdam, Netherlands; Philadelphia, PA: John Benjamis. Roy, C.B. (2002[1993]) The problem with definitions, descriptions, and the role metaphors of interpreters. In Pöchhacker, F., & Shlesinger, M. (eds.), The interpreting studies reader (pp. 344-353). New York, NY: Routledge. [Journal of Interpretation, 6(1), 127-154.] Schick, B. (2004). How might learning through an educational interpreter influence cognitive development? In Winston, E. (Ed.), Educational interpreting: How it can succeed (pp. 73-88). Washington, DC: Gallaudet University. Stewart, D. A., Schein, J. D., & Cartwright, B. E. (2004). Sign language interpreting: Exploring its art and science (2nd ed.). Boston, MA: Allyn and Bacon. Stone, C. (2009). Toward a Deaf translation norm. Washington, DC: Gallaudet University. Stone, C. (2013). The UNCRPD and “professional” sign language interpreter provision. In Schӓffner, C., Kredens, K., & Fowler, Y. (Eds.), Interpreting in a changing landscape: Selected papers from Critical Link 6 (pp. 83-100). Amsterdam, Netherlands; Philadelphia, PA: John Benjamins Publishing. Shunsuke, I. (2015[1968]). Interpreting to ensure the rights of deaf people: Interpreting Theory. In Roy, C. B., & Napier, J. (eds.), The sign language interpreting studies reader (pp. 17-21). Amsterdam, Netherlands; Philadelphia, PA: John Benjamins. [Japanese Newspaper for the Deaf, July 1, 1968] Swabey, L. & Nicodemus, B. (2011). Bimodal bilingual interpreting in the U.S. healthcare system: A critical linguistic activity in need of investigation. In Nicodemus, B., & Swabey, L. (ed.), Advances in interpreting research (pp. 241-260). Amsterdam, Netherlands; Philadelphia, PA: John Benjamins. Swabey, L., Nicodemus, B., & Moreland, C. (2014). An Examination of Medical Interview Questions Rendered in American Sign Language by Deaf Physicians and Interpreters. In Nicodemus B., & Metzger, M. (eds.), Investigations in healthcare interpreting (pp. 104-127). Washington, DC: Gallaudet University Press. Tate, G., & Turner, G. H. (2002[1997]). The code and the culture: Sign language interpreting - In search of the new breed’s ethics. In Pöchhacker, F., & Shlesinger, M. (eds.), The interpreting studies reader (pp. 372-384). New York, NY: Routledge. [Deaf Worlds, 13(3)] Tribe, R., & Morrissey, J. (2010). The refugee context and the role of interpreters. In Tribe, R., & Raval, H. (eds.) Working with interpreters in mental health (pp. 198-218). East Sussex, UK; New York, NY: Routledge. United Nations. (n.d.) Convention on the Rights of Persons with Disabilities. Retrieved at https://www.ohchr.org/en/hrbodies/crpd/pages/conventionrightspersonswithdisabilities.aspx  van den Bogaerde, B., & de Lange, R. (2014). Healthcare Accessibility and the Role of Sign Language Interpreters. In Nicodemus B., & Metzger, M. (eds.), Investigations in healthcare interpreting (pp. 326-358). Washington, DC: Gallaudet University Press. Winston, E. A. (2004). Interpretability and accessibility of mainstream classrooms. In Winston, E. (Ed.), Educational interpreting: How it can succeed (pp. 132-168). Washington, DC: Gallaudet University.", "recommended_readings": "C. Additional Reading Alcon, B. J., & Humphrey, J. H. (2007). So you want to be an interpreter? An introduction to sign language interpreting (4th ed.). Clearwater, FL: H&H Publishing. Baker, M. (2011). In other words: A coursebook on translation (2nd ed). London, UK; New York, NY: Routledge.", "terms": {"2020-21 Term 2": {"--LEC (7746)": {"startTimes": ["13:30"], "endTimes": ["15:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor Beppie VAN DEN BOGAERDE"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}, "-T01-TUT (7747)": {"startTimes": ["15:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor Beppie VAN DEN BOGAERDE"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}}, "2021-22 Term 2": {"--LEC (6148)": {"startTimes": ["13:30"], "endTimes": ["15:15"], "days": [4], "locations": ["Y.C. Liang Hall 106"], "instructors": ["Staff"], "meetingDates": ["13/1", "20/1", "27/1"]}, "-T01-TUT (6149)": {"startTimes": ["15:30"], "endTimes": ["16:15"], "days": [4], "locations": ["Y.C. Liang Hall 106"], "instructors": ["Staff"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "20", "Presentation": "20", "Project": "30", "Participation": "10"}}, {"code": "4001", "title": "Language Acquisition of Deaf Children", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Not for students who have taken LING3205", "description": "This course examines how deaf children acquire sign and spoken languages in either a monolingual or a bimodal bilingual fashion. In the Hong Kong context, emphasis is on how deaf children acquire the sound segments, tones, as well as grammar of Cantonese and Mandarin Chinese on the one hand, and the acquisition of Hong Kong Sign Language in the areas of sign phonology, morphology, word order, and classifier constructions on the other. Acquisition studies of other sign languages as reported in the literature will also be covered, to support the premise that the processes of language acquisition as revealed by deaf children are universal.", "outcome": "Students will achieve a basic understanding of: 1. How deaf children access the grammar of natural languages through the auditory/oral and visual-spatial modalities;  2. The complex situations in which deaf children acquire spoken and sign language; 3. Factors surrounding deaf children’s language acquisition such as linguistic input and critical period effects; 4. The acquisition processes of sign or spoken language by deaf children; and  5. Research skills required for investigating deaf children’s language acquisition.", "syllabus": "   Topics Contents/fundamental concepts   Spoken language acquisition Levels of description:  Speech perception Grammatical knowledge Literacy     Sign language acquisition Levels of description:  Phonological knowledge Morphological knowledge Syntactic knowledge Non-manuals     Critical Period It refers to the period during which children are said to be sensitive to linguistic data for language acquisition. Language acquisition beyond this period displays diversity in ultimate attainment.   Impoverished Input Linguistic data that is supposedly sensitive enough to trigger language acquisition is neither perceived nor processed efficiently due to hearing loss. Alternatively, the so-called language data that deaf children are exposed to show intrinsic characteristics that mar sensitive linguistic input.   Sign bilingualism vs bimodal bilingualism Sign Bilingualism refers to a form of education philosophy for the deaf that promotes use of sign language in education to nurture the ‘L1’ acquisition of deaf and hard-of-hearing children. Subsequent inclusion of spoken language in the education process is taken to be supporting L2 acquisition. Bimodal bilingualism has a much stronger linguistic orientation developed within the framework of linguistic and acquisition theories.   ", "required_readings": "Some useful references:  Journals 1. Journal of Sign Language Studies (http://gupress.gallaudet.edu/SLS.html) 2. Journal of Sign Language and Linguistics (https://benjamins.com/#catalog/journals/sll/main) 3. Journal of Deaf Studies and Deaf Education (http://jdsde.oxfordjournals.org) 4. Journal of Speech, Language and Hearing Research (http://jslhr.pubs.asha.org) 5. Journal of Bilingual Education and Bilingualism (http://www.tandfonline.com/toc/rbeb20/current#.Usn5tqVmsWY)  Readings: Berent, G. (2009). The Interlanguage development of Deaf and hearing learners of L2 English: parallelism via minimalism. In Ritchie, W. C., & Bhatia, T. K. (Eds.), The new handbook of second language acquisition (pp. 523-543). Bingley, UK: Emerald Group Publishing.  Berent, G., Kelly, R. R., Albertini, J. A., & Toscano, R. M. (2013). Deaf students’ knowledge of subtle lexical properties of transitive and intransitive english verbs. American Annals of the Deaf, 158(3), 344-362. Berent, G., Kelly, R., Porter, J., & Fonzi, J. (2008). Deaf learners’ knowledge of English universal quantifiers, Language Learning, 58(2), 401–437.  Brentari, D., Coppola, M., Jung, A., & Goldin-Meadow, S. (2013). Acquiring word class distinctions in american sign language: evidence from handshape. Language Learning and Development, 9(2), 130-150. DOI: 10.1080/15475441.2012.679540 Corina, D., Hafer, S., & Welch, K. (2014). Phonological awareness for American Sign Language. Journal of Deaf Studies and Deaf Education, doi:10.1093/deafed/enu023. Cormier, K., Schembri, A., Vinson, D., & Orfanidou, E. (2012). First language acquisition differs from second language acquisition in prelingually deaf signers: Evidence from sensitivity to grammaticality judgment in British Sign Language. Cognition, 124, 50-65. Crain, S., & Lillo-Martin, D. (1999). An introduction to linguistic theory and language acquisition. Oxford: Blackwell.  de Quadros, R. M., & Lillo-Martin, D. (2008). Gesture and the acquisition of verb agreement in Sign Language. Manuscript. Goldin-Meadow, S., Mylander, C., & Franklin, A. (2007). How children make language out of gesture: morphological structure in gesture systems developed by American and Chinese deaf children. Cognitive Psychology, 55(2), https://doi.org/10.1016/j.cogpsych.2006.08.001 Guasti, M. T. (2002). Language Acquisition: The Growth of Grammar. Cambridge, Mass: MIT Press. Humphries, T., Kushalnagar, P., Mathur, G., Napoli, D. J., Padden, C., Rathmann, C., & Smith, S. R. (2012). Language Acquisition for deaf children: reducing the harms of zero tolerance to the use of alternative approaches. Harm Reduction Journal, 9(16), https://doi.org/10.1186/1477-7517-9-16. Humphries, T., Kushalnagar, P., Mathur, G., Napoli, D. J., Padden, C., & Rathmann, C. (2014). Ensuring language acquisition for deaf children: What linguists can do? Manuscript, Swarthmore College. Retrieved from https://works.swarthmore.edu/fac-linguistics/187/.  Karnopp, L-B. (2008) Sign Phonology Acquisition in Brazilian Sign Language. In de Quadros, R. M. (ed.), Sign languages: Spinning and unraveling the past, present, and future (pp. 204-218). Petropolis, Brazil: Editorar Arara Azul. Liberman, A. M., Hatrk, M., & Mayberry, R. I. (2011). The development of eye gaze control for linguistic input in deaf children. In Danis, N., Mesh, K., & Sung, H. (Eds.), Proceedings of the 35th Annual Boston University Conference on Language Development (pp. 391-404). Somerville, MA: Cascadilla Press. Lillo-Martin, D., & de Quadros, R.M. (2010). Acquisition of the syntax–discourse interface: The expression of point of view. Lingua, 121(4), 623-636. Lillo-Martin, D. & Chen Pichler, D. (2006). Acquisition of syntax in signed languages. In Schick, B., Marschark, M., & Spencer, P. E. (Eds.), Advances in the Sign Language Development of Deaf Children (pp.262-290). Oxford, UK: Oxford University Press. Mann, W., Marschall, C. R., Mason, K., & Morgan, G. (2010) The acquisition of sign language: The impact of phonetic complexity on phonology. Language Learning and Development, 6(1), http://dx.doi.org/10.1080/15475440903245951.  Mayberry, R. I. (2007). When timing is everything. Applied Psycholinguistics, 28, 537–549.  Mayberry, R. (2010). Early language acquisition and adult language ability: What sign language reveals about the critical period for Language. In Spencer, P., & Marschark, M. (eds.) The Oxford Handbook of deaf studies, language and education (Vol.2, pp.281-291). Oxford, UK: Oxford University Press. Morgan, G. (2014). On language acquisition in speech and sign: Development of combinational structure in both modalities. Frontiers in Psychology, doi: 10.3389/fpsycyg.2014.01217. Petitto, L. (1998). The transition from gesture to symbol in ASL. In Volterra, V., & Erting, C-J. (eds.) From gesture to language in hearing and deaf children (pp. 153-162). Washington, DC: Gallaudet University Press Petitto, L. (2005). How the brain begets language. In McGilvray, J. (ed.) The Cambridge companion to Chomsky (pp. 84-101). Cambridge, UK: Cambridge University Press. Schick, B., Marschark, M., & Spencer, P. E. (Eds.). (2006). Advances in the sign language development of deaf children. New York, NY: Oxford University Press. Schick, B. (2011). The development of ASL and manually coded systems. In Marschark, M., & Spencer, P. (eds.) The Oxford handbook of Deaf studies, language and education (Vol. 1, pp. 229-240). Oxford, UK: Oxford University Press. de Villiers, J. G., de Villiers, P.A., Hoban, E. (1994). The central problem of functional categories in the English syntax of oral deaf children. In Tager-Flusberg, H. (Ed.), Constraints on language acquisition: Studies of atypical children (pp. 9-45). Mahwah, NJ: Lawrence Erlbaum Associates.  Volterra, V., Iverson, J., & Castrataro, M. (2006). The development of gesture in hearing and deaf children. In Marschark, M., Schick, B., & Spencer, P. (eds.) Advances in sign language development of deaf children (pp. 46-70). Oxford, UK: Oxford University Press. Wood, S. (2007). Degrees of resiliency in acquisition of language. Nanzan Linguistics: Special Issue, 3(1), 315-330.  Others Cheung, K.Y. (2013). Reading strategies of Chinese students with severe to profound hearing loss. Journal of Deaf Studies and Deaf Education, 18(3), 312-328.  Clark, M. D., Gilbert, G., & Anderson, M. L. (2011). Morphological knowledge and decoding skills of deaf readers. Psychology, 2(2), 109-116. Emmorey, K., & Petrich, J. A. F. (2011). Processing orthographic structure: association between print and fingerspelling. Journal of Deaf Studies and Deaf Education, 14(3), 371-385. doi:10.1093/deafed/enr051. Law, Z. W. Y., & So, L. K. H. (2006). Phonological abilities of hearing-impaired Cantonese-speaking children. Journal of Speech, Language, and Hearing Research, 49(6), 671-679. Lederberg, A., Schick, B., & Spencer, P. (2013). Language and literacy development of Deaf and Hard-of-Hearing children: Successes and challenges. Developmental Psychology, 40(1), 15-30. Marschark, M., & Spencer, P. E. (2006). Advances in the spoken language development of deaf and hard of hearing children. New York, NY: Oxford University Press.  Han, D., Zhou, N., Li, Y., Chen, X., Zhao, X., & Li, X. (2007). Tone production of Mandarin Chinese speaking children with cochlear implants. International Journal of Pediatric Otorhinolaryngology, 71, 875-880. Peng, S.C., Tomblin, J. B., Cheung, H., & Wang, L. S. (2004). Perception and Production of Mandarin tones by prelingually deaf children with CIs. Ear and Hearing, 25, 251-264.  Singleton, J., & Newport, E. (2004). When learners surpass their models: The acquisition of American Sign Language from inconsistent input. Cognitive Psychology, 49, 370-407.  Spencer, P., & Harris, M. (2006). Patterns and effects of language input to deaf infants and toddlers from deaf and hearing mothers. In Marschark, M., Schick, B., Spencer, P. (eds.) Advances in sign language development of deaf children (pp. 71-101). Oxford, UK: Oxford University Press. Spencer, P., Marschark, M. (2010). Acquisition and development of literacy skills. Evidence-based practice in educating deaf and hard-of-hearing students (pp. 81-109). Oxford, UK: Oxford University Press.  Xu, L., Chen, X., Lu, H., Zhou, N., Wang, S., Liu, Q., Li, Y., Zhao, X., & Han, D. (2011). Tone perception and production in pediatric CI users. Acta Oto-Laryngologica, 131, 395–398.  Zhou, N. Huang, J., Chen X-W., & Xu, L. (2013). Relationship between tone perception and tone production in prelingually deafened children with CI. Octology and Neurotology, 34, 499-506.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (8837)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor TANG Wai Lan Gladys"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}, "-T01-TUT (8838)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor TANG Wai Lan Gladys"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (6171)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Y.C. Liang Hall 101"], "instructors": ["Professor TANG Wai Lan Gladys"], "meetingDates": ["12/1", "19/1", "26/1"]}, "-T01-TUT (6172)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Y.C. Liang Hall 101"], "instructors": ["Professor TANG Wai Lan Gladys"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Presentation": "10", "Project": "50", "Participation": "10", "Report": "30"}}, {"code": "4101", "title": "Research Project I", "career": "Undergraduate", "units": "0.00", "grading": "Multi-Term Course Grades", "components": "Project", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "Students prepare for a research project that tackles an issue in sign linguistics. Depending on the nature of research, the phenomenon can be investigated either individually or in pairs, and, in the latter situation, students need to seek permission from the research supervisor and generate their own report for assessment. Assessment of this course is based on a concrete research report, inclusive of identification of a topic, justifications for choosing the topic especially how it potentially addresses theoretical issues in sign linguistics, or resolves certain social problems and creates an impact in society, a detailed summary of previous literature, a list of research questions and hypotheses, research design and methodology, and, if possible, some preliminary data description.", "outcome": "Students completing this course will have acquired the following skills: 1. How to identify a research topic and defend it to the effect of generating findings that constitute significant insight for resolving a problem in society; 2. How to survey the literature and critically evaluate the observations reported therein for their strengths and limitations;  3. How to develop a bibliography pertaining to the topic, and compile one that complies with certain publication standards; 4. How to generate research questions based on the review of literature; and 5. How to develop an appropriate methodology to tackle the research topic.", "syllabus": "   Topic Contents/fundamental concepts   Linguistic and applied linguistic research   A scientific attempt to examine sign language using theories of phonetics, phonology, morphology, syntax, semantics, pragmatics, language acquisition, sociolinguistics, bilingualism and code mixing, etc., as well as other applied areas in which sign language plays a central role.   Scientific report It is a reporting format documenting the entire process of an objective investigation into a phenomenon that leads to new understandings.  ", "required_readings": "There will be reading materials to enhance understanding of the fundamental concepts about sign language research.   A. Journals Deaf Studies 1. Journal of Deaf Studies and Deaf Education (http://jdsde.oxfordjournals.org) 2. Deafness and Education International (https://www.tandfonline.com/toc/ydei20/current)  Education 3. Journal of Early Childhood Research (https://journals.sagepub.com/home/ecr) 4. The Journal of Special Education (https://journals.sagepub.com/home/sed) 5. Journal of Adult and Continuing Education (http://www.ingentaconnect.com/content/manup/jace)  Human Rights 6. Journal of Human Rights (https://www.tandfonline.com/loi/cjhr20) 7. Journal of Human Rights Practice (https://academic.oup.com/jhrp)  Interpretation 8. Journal of Interpretation (https://digitalcommons.unf.edu/joi/) 9. International Journal of Interpreter Education (https://www.cit-asl.org/new/ijie/)  Languages 10. Journal of Speech, Language and Hearing Research (http://jslhr.pubs.asha.org) 11. Journal of Bilingual Education and Bilingualism (http://www.tandfonline.com/toc/rbeb20/current#.Usn5tqVmsWY)  Sign Language  12. Journal of Sign Language Studies (http://gupress.gallaudet.edu/SLS.html) 13. Journal of Sign Language and Linguistics (https://benjamins.com/#catalog/journals/sll/main)  Social Work 14. International Social Work (https://journals.sagepub.com/home/isw) 15. Social Work (https://academic.oup.com/sw) 16. Hong Kong Journal of Social Work (https://www.worldscientific.com/worldscinet/hkjsw)  B. Reference Books and Articles  Ethics Baker-Shenk, C., & Kyle, J. G. (2007). Research with Deaf people: Issues and conflicts. Disability, Handicap & Society, 5(1), 65-75. DOI: 10.1080/02674649066780051 Eckert, P. (2013). Ethics in linguistic research. In Podesva, R. J., & Sharma, D. (eds), Research methods in linguistics (pp. 11-26). New York, NY: Cambridge University Press. Shamoo, A. E., Khin-Maung-Gyi, F. A. (2002). Ethics of the use of human subjects in research: Practical guide. New York : Garland Science.  General Research Birley, G., & Moreland, N. (1998). A practical guide to academic research. New York, NY: Routledge. Bowern, C. (2015). Linguistic fieldwork: A practical guide (2nd new ed). London: Palgrave Macmillan. Engel, R. J. (2017). The practice of research in social work (4th ed). Los Angeles, CA: SAGE. Engel, R. J. (2014). Fundamentals of social work research (2nd ed). Thousand Oaks, CA: SAGE. Goodwin, C. J. (2010). Research in psychology: Methods and designs. Somerset, NJ: Wiley. Wray, A., Trott, K., Bloomer, A., Reay, S., & Butler, C. (2001). Projects in linguistics: A practical guide to researching language. London: Arnold.  Methodology Christensen, L. B. (1997). Experimental methodology (7th ed). Boston, Mass: Allyn and Bacon. Czaja, R., & Blair, J. (2014). Designing surveys: A guide to decisions and procedures (3rd ed). Thousand Oaks, CA: SAGE. Hancock, D. R., & Algozzine, B. (2017). Doing case study research: A practical guide for beginner researchers (3rd ed). New York, NY: Teachers College Press. Hatch, E., & Lazaraton. (1982). The research design and statistics for applied linguistics. Rowley, Mass: Newbury House. Hewson, C., Yule, P., Laurent, D., & Vogel, C. (2003). Internet research methods: A practical guide for the social and behavioural sciences. London, UK; Thousand Oaks, CA: SAGE. Holmes, J., & Hazen, K. (2014). Research methods in sociolinguistics: A practical guide. Chichester, West Sussex, UK; Malden, MA: Wiley Blackwell. Isaac, S., & Michael, W. B. (1995). Handbook in research and evaluation: A collection of principles, methods, and strategies useful in the planning, design, and evaluation of studies in education and the behavioral sciences (3rd ed). San Diego, CA: EDITS Publishers. Nunan, D. (1992). Research methods in language learning. Cambridge, UK: Cambridge University Press. Orfanidou, E., Woll, B., & Morgan, G. (2014). Research methods in sign language studies: A practical guide. Somerset, NJ: Wiley. Penke, M., & Rosenbach, A. (Eds). (2007). What Counts as Evidence in Linguistics. Amsterdam, the Netherlands: John Benjamins. Rasinger, S. M. (2013). Quantitative research in linguistics: An introduction (2nd ed). London, UK: Bloomsbury Academic.  Statistics Argyrous, G. (2011). Statistics for research: With a guide to SPSS (3rd ed). London, UK; SAGE. Butler, C. (1985). Statistics in linguistics. New York, NY: Basil Blackwell. Woods, A., Fletcher, P., & Hughes, A. (1986). Statistics in language studies. Cambridge, UK: Cambridge University Press.  Writing Becker, H. S., & Richards, P. (1986). Writing for social scientists: How to start and finish your thesis, book, or article. Chicago, IL: University of Chicago Press. MacArthur, C. A., Graham, & Fitzgerald, J. (2016). Handbook of writing research (2nd ed). New York, NY: Guilford Press. Weissberg, R., & Buker, S. (1990). Writing up research experimental research report writing for students of English. Englewood Cliffs, NJ: Prentice Hall Regents.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"-J01-PRJ (9055)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor David Philip THIERFELDER, \n\rProfessor SZE Yim Binh, \n\rProfessor TANG Wai Lan Gladys"], "meetingDates": ["13/09/2020 - 06/12/2020"]}}, "2020-21 Term 2": {"-J01-PRJ (9180)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SZE Yim Binh"], "meetingDates": ["13/01/2021 - 21/04/2021"]}}, "2021-22 Term 1": {"-J01-PRJ (7822)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor David Philip THIERFELDER, \n\rProfessor SZE Yim Binh, \n\rProfessor TANG Wai Lan Gladys"], "meetingDates": ["09/09/2021 - 02/12/2021"]}}}, "assessments": {"Presentation": "20", "Participation": "10", "Report": "70"}}, {"code": "4102", "title": "Research Project II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Prerequisite(s): BMBL4101", "description": "This course is a continuation of Research Project I. Students are expected to produce a detailed research report based on the topic identified for Research Project I. The research report should be a substantial expansion of the piece of work compiled for Research Project I, added to it at this stage of report writing are data presentation and description with sufficient details, a critical analysis and interpretation of data, insightful discussions with strong argumentation, as well as some suggested solutions to the problem. There should be a section detailing the social impact of the research especially how the findings can be translated into certain practices leading to advancement in the social conditions of sign language and the population of deaf people.", "outcome": "Students completing this course will have acquired the following skills: 1. How to present data in a clear and succinct format; 2. How to transcribe and present sign language data, and if necessary, spoken language data, for publication; 3. How to conduct statistics for testing of significance of the hypotheses generated; 4. How to write a formal research report and compile a stylized PPT for oral presentation; and 5. More importantly, how to critically evaluate to what extent the results are applicable to resolving relevant problems in society.", "syllabus": "   Topic Contents/fundamental concepts   Linguistic and applied linguistic research   A scientific attempt to examine sign language using theories of phonetics, phonology, morphology, syntax, semantics, pragmatics, language acquisition, sociolinguistics, bilingualism and code mixing, etc., as well as other applied areas in which sign language plays a central role.   Scientific report It is a reporting format documenting the entire process of an objective investigation into a phenomenon that leads to new understandings.  ", "required_readings": "There will be reading materials to enhance understanding of the fundamental concepts about sign language research.  A. Journals Deaf Studies 1. Journal of Deaf Studies and Deaf Education (http://jdsde.oxfordjournals.org) 2. Deafness and Education International (https://www.tandfonline.com/toc/ydei20/current)  Education 3. Journal of Early Childhood Research (https://journals.sagepub.com/home/ecr) 4. The Journal of Special Education (https://journals.sagepub.com/home/sed) 5. Journal of Adult and Continuing Education (http://www.ingentaconnect.com/content/manup/jace)  Human Rights 6. Journal of Human Rights (https://www.tandfonline.com/loi/cjhr20) 7. Journal of Human Rights Practice (https://academic.oup.com/jhrp)  Interpretation 8. Journal of Interpretation (https://digitalcommons.unf.edu/joi/) 9. International Journal of Interpreter Education (https://www.cit-asl.org/new/ijie/)  Languages 10. Journal of Speech, Language and Hearing Research (http://jslhr.pubs.asha.org) 11. Journal of Bilingual Education and Bilingualism (http://www.tandfonline.com/toc/rbeb20/current#.Usn5tqVmsWY)  Sign Language  12. Journal of Sign Language Studies (http://gupress.gallaudet.edu/SLS.html) 13. Journal of Sign Language and Linguistics (https://benjamins.com/#catalog/journals/sll/main)  Social Work 14. International Social Work (https://journals.sagepub.com/home/isw) 15. Social Work (https://academic.oup.com/sw) 16. Hong Kong Journal of Social Work (https://www.worldscientific.com/worldscinet/hkjsw)  B. Reference Books and Articles  Ethics Baker-Shenk, C., & Kyle, J. G. (2007). Research with Deaf people: Issues and conflicts. Disability, Handicap & Society, 5(1), 65-75. DOI: 10.1080/02674649066780051 Eckert, P. (2013). Ethics in linguistic research. In Podesva, R. J., & Sharma, D. (eds), Research methods in linguistics (pp. 11-26). New York, NY: Cambridge University Press. Shamoo, A. E., Khin-Maung-Gyi, F. A. (2002). Ethics of the use of human subjects in research: Practical guide. New York : Garland Science.  General Research Birley, G., & Moreland, N. (1998). A practical guide to academic research. New York, NY: Routledge. Bowern, C. (2015). Linguistic fieldwork: A practical guide (2nd new ed). London: Palgrave Macmillan. Engel, R. J. (2017). The practice of research in social work (4th ed). Los Angeles, CA: SAGE. Engel, R. J. (2014). Fundamentals of social work research (2nd ed). Thousand Oaks, CA: SAGE. Goodwin, C. J. (2010). Research in psychology: Methods and designs. Somerset, NJ: Wiley. Wray, A., Trott, K., Bloomer, A., Reay, S., & Butler, C. (2001). Projects in linguistics: A practical guide to researching language. London: Arnold.  Methodology Christensen, L. B. (1997). Experimental methodology (7th ed). Boston, Mass: Allyn and Bacon. Czaja, R., & Blair, J. (2014). Designing surveys: A guide to decisions and procedures (3rd ed). Thousand Oaks, CA: SAGE. Hancock, D. R., & Algozzine, B. (2017). Doing case study research: A practical guide for beginner researchers (3rd ed). New York, NY: Teachers College Press. Hatch, E., & Lazaraton. (1982). The research design and statistics for applied linguistics. Rowley, Mass: Newbury House. Hewson, C., Yule, P., Laurent, D., & Vogel, C. (2003). Internet research methods: A practical guide for the social and behavioural sciences. London, UK; Thousand Oaks, CA: SAGE. Holmes, J., & Hazen, K. (2014). Research methods in sociolinguistics: A practical guide. Chichester, West Sussex, UK; Malden, MA: Wiley Blackwell. Isaac, S., & Michael, W. B. (1995). Handbook in research and evaluation: A collection of principles, methods, and strategies useful in the planning, design, and evaluation of studies in education and the behavioral sciences (3rd ed). San Diego, CA: EDITS Publishers. Nunan, D. (1992). Research methods in language learning. Cambridge, UK: Cambridge University Press. Orfanidou, E., Woll, B., & Morgan, G. (2014). Research methods in sign language studies: A practical guide. Somerset, NJ: Wiley. Penke, M., & Rosenbach, A. (Eds). (2007). What Counts as Evidence in Linguistics. Amsterdam, the Netherlands: John Benjamins. Rasinger, S. M. (2013). Quantitative research in linguistics: An introduction (2nd ed). London, UK: Bloomsbury Academic.  Statistics Argyrous, G. (2011). Statistics for research: With a guide to SPSS (3rd ed). London, UK; SAGE. Butler, C. (1985). Statistics in linguistics. New York, NY: Basil Blackwell. Woods, A., Fletcher, P., & Hughes, A. (1986). Statistics in language studies. Cambridge, UK: Cambridge University Press.  Writing Becker, H. S., & Richards, P. (1986). Writing for social scientists: How to start and finish your thesis, book, or article. Chicago, IL: University of Chicago Press. MacArthur, C. A., Graham, & Fitzgerald, J. (2016). Handbook of writing research (2nd ed). New York, NY: Guilford Press. Weissberg, R., & Buker, S. (1990). Writing up research experimental research report writing for students of English. Englewood Cliffs, NJ: Prentice Hall Regents.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"-J01-PRJ (7757)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor David Philip THIERFELDER, \n\rProfessor SZE Yim Binh, \n\rProfessor TANG Wai Lan Gladys"], "meetingDates": ["17/01/2021 - 25/04/2021"]}}, "2021-22 Term 1": {"-J01-PRJ (8028)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SZE Yim Binh"], "meetingDates": ["07/09/2021 - 30/11/2021"]}}, "2021-22 Term 2": {"-J01-PRJ (7173)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor David Philip THIERFELDER, \n\rProfessor SZE Yim Binh, \n\rProfessor TANG Wai Lan Gladys"], "meetingDates": ["11/01/2022 - 19/04/2022"]}}}, "assessments": {"Presentation": "20", "Participation": "10", "Report": "70"}}, {"code": "4201", "title": "Service Learning I", "career": "Undergraduate", "units": "0.00", "grading": "Multi-Term Course Grades", "components": "Practicum", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Prerequisites: HKSL3000,3001,3002 or 3050", "description": "This course requires students to serve as a volunteer worker in an organization that involves use and promotion of sign language or bimodal bilingualism, and to gain the experiences and know-how they might need in their future career. Such an organization may be a social enterprise, a service provider, an NGO or any organization that supports sign language users as their service consumers or staff members. The organization must have a close relationship with the Deaf community. Students are required to justify why their professional interest can be further enlightened by the service-learning experiences. There will be a service-learning supervisor to guide students in the preparation of the service-learning programme.", "outcome": "Students completing this course will achieve a basic understanding about: 1. A professional interest must be socially and empirically driven, supported by ongoing research to inform the practice; 2. The backgrounds and missions of different organizations that pursue bimodal bilingualism in their services; 3. How to prepare an application for internship programmes; 4. The necessary process of self-reflection along the development of one’s career path", "syllabus": "   Topic Contents/fundamental concepts   Bimodal Bilingualism Bimodal bilingual population comprised of mostly deaf and hard-of-hearing, as well as some hearing individuals who know and use a sign language and a spoken language in daily communication.    Cultural Awareness and Oppression Deaf and hard-of-hearing individuals assume a different culture germinated by communication through the visual-gestural modality. Given their socio-economic status and the seemingly solutions built upon the medical model, these peoples often face oppression in society.   Personal Growth Learning about oneself by realizing one’s own strength and weakness, developing critical analysis skills and applying them to dissect social situations with self reflection.   Professionalism Professionalism in businesses differ in nature. Service providers for business serving the deaf and hard-of-hearing people often adhere to the principles of ethics and morals, confidentiality, and advocacy.  ", "required_readings": "There will be: Reading materials to enhance understanding of the fundamental concepts about personal development, cultural awareness, professionalism, and personal growth; E-learning system (e.g., Blackboard) will provide materials related to service provision and learning through experience.  A. Textbooks Mindness, A. (2006). Reading between the signs: Intercultural communication for sign language interpreters (2nd ed). Boston, NY; London, UK: Intercultural Press. ## De Clerck, G. A. M., & Paul, P. V. (Eds.). (2016). Sign language, sustainable development, and equal opportunities: Envisioning the future for Deaf students. Washington, DC: Gallaudet University Press. ##  Service Learning Cress, C. M., Collier, P. J., Reitenauer, V. L., & Associates. (2005). Learning through serving: A student guidebook for service-learning across the disciplines. Sterling, VA: Stylus Publishing.  Kaye, C. B. (2004). The complete guide to service learning: Proven, practical ways to engage students in civic responsibility, academic curriculum, & social action. Minneapolis, MN: Free Spirit Publishing.  Supplementary Reading Bellos, D. (2012). Is that a fish in your ear?: Translation and the meaning of everything (Reprint ed). New York, NY: Faber and Faber. ## Grobman, L. M. (Ed.). (2011). Days in the lives of social workers: 58 Professionals tell real-life stories from social work practice (4th ed). Harrisburg, Penn: White Hat Communications. ## Gruwell, E., & Freedom Writers. (1999). The freedom writers diary. New York, NY: Penguin Random House LLC. ##  B. Books and Articles Deaf Culture Lane, H. L. (1996). A journey into the deaf-world. San Diego, CA: DawnSignPress. ## Moore, M. S., & Levitan, L. (2016). For hearing people only: Answers to some of the most commonly asked questions about the deaf community, its culture, and the “Deaf Reality” (4th ed). Rochester, NY: Deaf Life Press. ##  Ethical Decision-Making Barden, N., & Boden, J. (2015). Fitness to practise. In Tribe, R., & Morrissey, J. (Eds.), Handbook of professional and ethical practice for psychologists, counsellors and psychotherapists (2nd ed., pp. 123-134). East Sussex, UK; New York, NY: Routledge. Cross, M., & Wood, J. (2015). The person in ethical decision-making: Living with our choices. In Tribe, R., & Morrissey, J. (Eds.), Handbook of professional and ethical practice for psychologists, counsellors and psychotherapists (2nd ed, pp. 32-44). East Sussex, UK; New York, NY: Routledge.  Confidentiality Jenkins, P. (2015). Client confidentiality and data protection. In Tribe, R., & Morrissey, J. (Eds.), Handbook of professional and ethical practice for psychologists, counsellors and psychotherapists (2nd ed., pp. 47-57). East Sussex, UK; New York, NY: Routledge. Purves, D. (2015). The ethics and responsibilities of record keeping and note taking. In Tribe, R., & Morrissey, J. (Eds.), Handbook of professional and ethical practice for psychologists, counsellors and psychotherapists (2nd ed., pp. 82-92). East Sussex, UK; New York, NY: Routledge.  Service Consumers Huq, A., Mcintosh, M. (2015). Professional and ethical issues in working with older adults. In Tribe, R., & Morrissey, J. (Eds.), Handbook of professional and ethical practice for psychologists, counsellors and psychotherapists (2nd ed., pp. 32-44). East Sussex, UK; New York, NY: Routledge. Newland, J., Patel, N., & Senapati. M. (2015). Professional and ethical practice in a multi-ethnic society. In Tribe, R., & Morrissey, J. (Eds.), Handbook of professional and ethical practice for psychologists, counsellors and psychotherapists (2nd ed., pp. 173-183). East Sussex, UK; New York, NY: Routledge. O’Donnell, G. M., & Gersch, I. S. (2015). Professional and ethical issues when working with children and adolescents: An educational psychology perspective. In Tribe, R., & Morrissey, J. (Eds.), Handbook of professional and ethical practice for psychologists, counsellors and psychotherapists (2nd ed., pp. 184-196). East Sussex, UK; New York, NY: Routledge. Rees, N. (2015). Working with lesbian, gay, bisexual and transgender people. In Tribe, R., & Morrissey, J. (Eds.), Handbook of professional and ethical practice for psychologists, counsellors and psychotherapists (2nd ed., pp. 208-219). East Sussex, UK; New York, NY: Routledge.  Oppression Audism Unveiled. (2006). United States. Baker-Shenk, C. (1986) Characteristics of oppressed and oppressor peoples: Their effect on the interpreting context. National Consortium of Interpreter Education Centers (NCIEC). Retrieved at http://www.interpretereducation.org/wp-content/uploads/2014/04/ Characteristics-of-the-Opressed_110314.pdf. Freire, P. (1993[1968]). Pedagogy of the oppressed (New Rev. 20th-Anniversary ed.). New York, NY: Continuum. ## Sacks, O. (1989). Seeing Voices. Berkeley, CA: University of California Press. ## Young, S. (2014). I’m not your inspiration, thank you very much. Presented at TEDxSydney, April, 2014. Retrieved from https://www.ted.com/talks/stella_young_i_m_not_your_inspiration _thank_you_very_much.      Human Rights Heumann, J. (2016). Our fight for disability rights - and why we’re not done yet. Presented at TEDxMidAtlantic, October 2016. Retrieved from https://www.ted.com/talks/judith_ heumann_our_fight_for_disability_rights_and_why_we_re_not_done_yet.  United Nations. (2016). The Convention on the Rights of Persons with Disabilities (CRPD). Retrieved from https://www.ohchr.org/en/hrbodies/crpd/pages/ conventionrightspersonswithdisabilities.aspx.   Personal Growth Adams, M (2009). Change your questions, change your life: 10 powerful tools for life and work (2nd ed). San Francisco, CA: Berrett-Koehler Publishers. ## Covey, S. (1989). The seven habits of highly effective people. New York, NY: Free Press. ## Schawbel, D. (2010). Me 2.0, Revised and updated edition: 4 steps to building your future. Manchester, UK: Kaplan Publishing. ## Seelig, T. (2009). What I wish I knew when I was 20: A crash course on making your place in the world. New York, NY: HarperCollins. ##  Communication at Work Padavic, I., & Reskin, B. (2002). Women and men at work (2nd ed). Thousand Oaks, CA: Pine Forge Press. ## Tannen, D. (1996). Talking from 9 to 5: Women and Men at Work: Language, sex and power. Lancaster Place, England: Virago Press. ##  C. Preparation for Service Provision Bright Side. (2018). 12 Things That Ruin a First Impression Immediately. Retrieved from https://youtu.be/JrbnTZPjg0k.  Bright Side. (2017). 11 Secrets to Memorize Things Quicker Than Others. Retrieved from https://youtu.be/mHdy1xS59xA.  Cuddy, A. (2012). Your body language may shape who you are. Presented at TEDGlobal 2012, June 2012. Retrieved from https://www.ted.com/talks/amy_cuddy_your_body_language_shapes_ who_you_are.  Dweck, C. (Nov). The power of believing that you can improve. Presented at TEDxNorrkoping, Nov 2014. Retreived from https://www.ted.com/talks/carol_dweck_the_power_of_believing _that_you_can_improve. Healy, K., & Mulholland, J. (2012). Writing skills for social workers (Social work in action series) (2n ed). Thousand Oaks, CA: SAGE Publications. Higgins, J. (2018). 10 Skills for effective business communication: Practical strategies from the world's greatest leaders. Emeryville, CA: Tycho Press.  Intern Queen Inc. (2018). Internship Tips + What’s in My Internship Bag. Retrieved from https://youtu.be/Fr2Gf4x-k2I. Intern Queen Inc. (2016). 5 Things You Should Not Do at Your Internship! Retrieved from https://youtu.be/i2str4aoxsc.  Intern Queen Inc. (2016). Tips for Writing Cover Letters! Retrieved from https://youtu.be/-Hn2O2TYI8k.  Intern Queen Inc. (2016). Reasons You’re Not Getting Hired! Retrieved from https://youtu.be/0rLEvy_0vLM.  Janzer, A. (2018). Writing to be understood. Mountain View, CA: Cuesta Park Consulting. Jay, M. (2013). Why 30 is not the new 20. Presented at TED2013, February, 2013. Retrieved from https://www.ted.com/talks/meg_jay_why_30_is_not_the_new_20.  Learning to Give. (2017). Philanthropy and service-learning: Why do they matter? Retrieved from https://youtu.be/MIf-Em7dmvw.  Learning to Give. (2017). Stages of service learning. Retrieved from https://youtu.be/kFd-yiAfrmE.  McGrath, A. (2018). Service learning. Presented at TEDx Talks. Retrieved from https://youtu.be/a5kcPvDuQpE. Sprouts. (2016, Apr 15). Growth Mindset vs. Fixed Mindset. Retrieved from https://youtu.be/KUWn_TJTrnU.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"-P01-PRA (4546)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Mr LEE Yin Fai, \n\rMr YIU Kun Man"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2021-22 Term 1": {"-P01-PRA (7823)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Mr LEE Yin Fai, \n\rMr YIU Kun Man"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}}, "assessments": {"Essays": "20", "Homework or assignment": "10", "Presentation": "30", "Report": "40"}}, {"code": "4202", "title": "Service Learning II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Prerequisite: BMBL4201;Appropriate placement must be arranged by the student with the assistance and support of the Service Learning Coordinator, the Centre for Sign Linguistics and Deaf Studies, and other appropriate resources.", "description": "This course expects students to render at least 90 hours of voluntary service to an organization that uses and promotes sign language and bimodal bilingualism. Such an organization may be a social enterprise, a service provider, an NGO or any organization that supports sign language users as their service consumers or staff members. The organization must have a close relationship with the Deaf community. Students wishing to identify an organization on their own for their voluntary service must seek approval from the service learning supervisor beforehand. The programme may offer a certain number of service learning slots each year but interviews are necessary. There will be a service-learning supervisor to guide students in the preparation of the service-learning programme and a manager from the organization to support their involvement during the service learning period. Students are expected to share their experiences with their classmates at the end of the course.", "outcome": "Students completing this course will have the opportunity to: Gain practical experience within the bimodal bilingual environment; Acquire knowledge of the industry in which the service provision is done; Apply knowledge and skills learned in the classroom in a work setting; Develop a greater understanding about career options while more clearly defining personal career goals; Experience the activities and functions of business, welfare, and educational professionals; Develop and refine oral, signed and written communication skills; Identify areas for future knowledge and skill development.", "syllabus": "Students are expected to work for at least 80 hours in the placement organization and set-up meetings with their supervisors. The total meeting hours with their academic supervisor and their organization manager should be added up to approximately 10 hours. Students are responsible for all materials and announcements related to the course. All assignments should be completed and turned in by the deadline. Meetings with the academic supervisor at Chinese University of Hong Kong (CUHK) and the organization manager at your own organization should be arranged regularly. You are expected to present yourself in a professional manner at all times. Additionally, you are representing yourself, the Bimodal Bilingual Studies, the School of Arts and CUHK as an CUHK intern at the organization. Please keep in mind that you are expected to: 1. Arrive at work as scheduled, ready to work, and stay for the agreed upon time; 2. Present yourself in a professional manner at all times, including being appropriately dressed for your workplace; 3. Communicate any concerns with your supervisor and the internship supervisor in a timely manner and respectfully; 4. Demonstrate enthusiasm and interest in what you are doing; ask questions and take initiative as appropriate; 5. Complete and submit assigned tasks by designated timelines. Meet all deadlines; 6. Participate in assigned meetings at work and with the internship coordinator at CUHK; 7. Keep track of and accurately report internship hours worked.", "required_readings": "There will be: Reading materials to enhance understanding of the fundamental concepts about cultural awareness, professionalism, and personal growth; E-learning system (e.g., Blackboard) will guide students through different milestones of service learning period from a remotely accessible electronic device.   A. Textbooks Mindness, A. (2006). Reading between the signs: Intercultural communication for sign language interpreters (2nd ed). Boston, NY; London, UK: Intercultural Press.  De Clerck, G. A. M., & Paul, P. V. (Eds.). (2016). Sign language, sustainable development, and equal opportunities: Envisioning the future for Deaf students. Washington, DC: Gallaudet University Press.   Service Learning Cress, C. M., Collier, P. J., Reitenauer, V. L., & Associates. (2005). Learning through serving: A student guidebook for service-learning across the disciplines. Sterling, VA: Stylus Publishing.  Kaye, C. B. (2004). The complete guide to service learning: Proven, practical ways to engage students in civic responsibility, academic curriculum, & social action. Minneapolis, MN: Free Spirit Publishing.  Supplementary Reading Bellos, D. (2012). Is that a fish in your ear?: Translation and the meaning of everything (Reprint ed). New York, NY: Faber and Faber.  Grobman, L. M. (Ed.). (2011). Days in the lives of social workers: 58 Professionals tell real-life stories from social work practice (4th ed). Harrisburg, Penn: White Hat Communications.  Gruwell, E., & Freedom Writers. (1999). The freedom writers diary. New York, NY: Penguin Random House LLC.   B. Books and Articles Deaf culture Lane, H. L. (1996). A journey into the deaf-world. San Diego, CA: DawnSignPress.  Moore, M. S., & Levitan, L. (2016). For hearing people only: Answers to some of the most commonly asked questions about the deaf community, its culture, and the “Deaf Reality” (4th ed). Rochester, NY: Deaf Life Press.   Ethical decision-making Barden, N., & Boden, J. (2015). Fitness to practise. In Tribe, R., & Morrissey, J. (Eds.), Handbook of professional and ethical practice for psychologists, counsellors and psychotherapists (2nd ed., pp. 123-134). East Sussex, UK; New York, NY: Routledge. Cross, M., & Wood, J. (2015). The person in ethical decision-making: Living with our choices. In Tribe, R., & Morrissey, J. (Eds.), Handbook of professional and ethical practice for psychologists, counsellors and psychotherapists (2nd ed., pp. 32-44). East Sussex, UK; New York, NY: Routledge.  Confidentiality Jenkins, P. (2015). Client confidentiality and data protection. In Tribe, R., & Morrissey, J. (Eds.), Handbook of professional and ethical practice for psychologists, counsellors and psychotherapists (2nd ed., pp. 47-57). East Sussex, UK; New York, NY: Routledge. Purves, D. (2015). The ethics and responsibilities of record keeping and note taking. In Tribe, R., & Morrissey, J. (Eds.), Handbook of professional and ethical practice for psychologists, counsellors and psychotherapists (2nd ed., pp. 82-92). East Sussex, UK; New York, NY: Routledge.  Service consumers Huq, A., Mcintosh, M. (2015). Professional and ethical issues in working with older adults. In Tribe, R., & Morrissey, J. (Eds.), Handbook of professional and ethical practice for psychologists, counsellors and psychotherapists (2nd ed., pp. 32-44). East Sussex, UK; New York, NY: Routledge. Newland, J., Patel, N., & Senapati. M. (2015). Professional and ethical practice in a multi-ethnic society. In Tribe, R., & Morrissey, J. (Eds.), Handbook of professional and ethical practice for psychologists, counsellors and psychotherapists (2nd ed., pp. 173-183). East Sussex, UK; New York, NY: Routledge. O’Donnell, G. M., & Gersch, I. S. (2015). Professional and ethical issues when working with children and adolescents: An educational psychology perspective. In Tribe, R., & Morrissey, J. (Eds.), Handbook of professional and ethical practice for psychologists, counsellors and psychotherapists (2nd ed., pp. 184-196). East Sussex, UK; New York, NY: Routledge. Rees, N. (2015). Working with lesbian, gay, bisexual and transgender people. In Tribe, R., & Morrissey, J. (Eds.), Handbook of professional and ethical practice for psychologists, counsellors and psychotherapists (2nd ed., pp. 208-219). East Sussex, UK; New York, NY: Routledge.  Oppression Audism Unveiled. (2006). United States. Baker-Shenk, C. (1986) Characteristics of oppressed and oppressor peoples: Their effect on the interpreting context. National Consortium of Interpreter Education Centers (NCIEC). Retrieved at http://www.interpretereducation.org/wp-content/uploads/2014/04/ Characteristics-of-the-Opressed_110314.pdf. Freire, P. (1993[1968]). Pedagogy of the oppressed (New Rev. 20th-Anniversary ed.). New York, NY: Continuum.  Sacks, O. (1989). Seeing Voices. Berkeley, CA: University of California Press.  Young, S. (2014). I’m not your inspiration, thank you very much. Presented at TEDxSydney, April, 2014. Retrieved from https://www.ted.com/talks/stella_young_i_m_not_your_inspiration _thank_you_very_much.   Human Rights Heumann, J. (2016). Our fight for disability rights - and why we’re not done yet. Presented at TEDxMidAtlantic, October 2016. Retrieved from https://www.ted.com/talks/judith_ heumann_our_fight_for_disability_rights_and_why_we_re_not_done_yet.  United Nations. (2016). The Convention on the Rights of Persons with Disabilities (CRPD). Retrieved from https://www.ohchr.org/en/hrbodies/crpd/pages/ conventionrightspersonswithdisabilities.aspx.   Personal growth Adams, M (2009). Change your questions, change your life: 10 powerful tools for life and work (2nd ed). San Francisco, CA: Berrett-Koehler Publishers.  Covey, S. (1989). The seven habits of highly effective people. New York, NY: Free Press.  Schawbel, D. (2010). Me 2.0, Revised and updated edition: 4 steps to building your future. Manchester, UK: Kaplan Publishing.  Seelig, T. (2009). What I wish I knew when I was 20: A crash course on making your place in the world. New York, NY: HarperCollins.   Communication at Work Padavic, I., & Reskin, B. (2002). Women and men at work (2nd ed). Thousand Oaks, CA: Pine Forge Press.  Tannen, D. (1996). Talking from 9 to 5: Women and Men at Work: Language, sex and power. Lancaster Place, England: Virago Press.   C. Preparation for Service Learning Bright Side. (2018). 12 Things That Ruin a First Impression Immediately. Retrieved from https://youtu.be/JrbnTZPjg0k.  Bright Side. (2017). 11 Secrets to Memorize Things Quicker Than Others. Retrieved from https://youtu.be/mHdy1xS59xA.  Cuddy, A. (2012). Your body language may shape who you are. Presented at TEDGlobal 2012, June 2012. Retrieved from https://www.ted.com/talks/amy_cuddy_your_body_language_shapes_ who_you_are.  Dweck, C. (Nov). The power of believing that you can improve. Presented at TEDxNorrkoping, Nov 2014. Retreived from https://www.ted.com/talks/carol_dweck_the_power_of_believing _that_you_can_improve. Healy, K., & Mulholland, J. (2012). Writing skills for social workers (Social work in action series) (2n ed). Thousand Oaks, CA: SAGE Publications. Higgins, J. (2018). 10 Skills for effective business communication: Practical strategies from the world's greatest leaders. Emeryville, CA: Tycho Press.  Intern Queen Inc. (2018). Internship Tips + What’s in My Internship Bag. Retrieved from https://youtu.be/Fr2Gf4x-k2I. Intern Queen Inc. (2016). 5 Things You Should Not Do at Your Internship! Retrieved from https://youtu.be/i2str4aoxsc.  Intern Queen Inc. (2016). Tips for Writing Cover Letters! Retrieved from https://youtu.be/-Hn2O2TYI8k.  Intern Queen Inc. (2016). Reasons You’re Not Getting Hired! Retrieved from https://youtu.be/0rLEvy_0vLM.  Janzer, A. (2018). Writing to be understood. Mountain View, CA: Cuesta Park Consulting. Jay, M. (2013). Why 30 is not the new 20. Presented at TED2013, February, 2013. Retrieved from https://www.ted.com/talks/meg_jay_why_30_is_not_the_new_20.  Learning to Give. (2017). Philanthropy and service-learning: Why do they matter? Retrieved from https://youtu.be/MIf-Em7dmvw.  Learning to Give. (2017). Stages of service learning. Retrieved from https://youtu.be/kFd-yiAfrmE.  McGrath, A. (2018). Service learning. Presented at TEDx Talks. Retrieved from https://youtu.be/a5kcPvDuQpE. Sprouts. (2016, Apr 15). Growth Mindset vs. Fixed Mindset. Retrieved from https://youtu.be/KUWn_TJTrnU.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"-P01-PRA (7642)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Mr LEE Yin Fai, \n\rMr YIU Kun Man"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 2": {"-P01-PRA (8259)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Mr LEE Yin Fai, \n\rMr YIU Kun Man"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Discussion": "5", "Essays": "10", "Homework or assignment": "5", "Lab reports": "10", "Others": "10", "Presentation": "20", "Report": "40"}}]