[{"code": "3010", "title": "Mathematics Curriculum and Teaching: Basic Theory and Practice", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Maths & Maths Education PC", "requirements": "", "description": "Major topics of discussion include: aims and objectives of mathematics education; the evolution of mathematics curricula in the current educational reform; theories of mathematics learning and instruction; models of mathematics teaching; preparation of mathematics lessons and classroom techniques through micro-teaching; use of instructional aids and manipulatives; catering for learning diversities; and evaluation of learning effectiveness.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3011", "title": "Mathematics Curriculum and Teaching: Basic Theory and Practice", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLectureOthersWorkshop", "campus": "Main Campus", "academic_group": "Maths & Maths Education PC", "requirements": "", "description": "This is the first of a series of two related courses on curriculum and teaching methods in mathematics, with a focus on Hong Kong school context. These two courses aim to help students to be familiar with the current curricular issues and develop essential pedagogical skills and strategies in mathematics. Throughout these two courses, the students will have hands-on practice opportunities which aim to help students to reflect on their own teaching beliefs and teaching styles in mathematics. The first course focuses on developing the general knowledge and skills a teacher needs for organizing an effective mathematics lesson. A wide range of general topics of mathematics pedagogy will be covered, including: aims and objectives of mathematics education; the evolution of mathematics curricula in the current educational reform; theories of mathematics learning and instruction; models of mathematics teaching; preparation of mathematics lessons and classroom techniques through microteaching; use of instructional aids and manipulatives; catering for learning diversities; and evaluation of learning effectiveness.", "outcome": "By the end of this course, students will be able to:\r 1. understand the content and the rationale behind the Hong Kong secondary school mathematics curriculum; 2. construct lesson plans by selecting and sequencing \"big ideas\" to teach in school mathematics; 3. determine prerequisite knowledge and skills for learning different mathematics topics; 4. use effective teaching methods and instructional aids such as experiments and models to teach mathematics concepts; 5. identify the common difficulties in mathematics learning among secondary school students; 6. construct tests and other diagnosis to evaluate the effectiveness of mathematics learning and teaching\r  學生修畢本科後，能夠： 1. 了解香港中學數學課程背後之理念及其所涵蓋內容\r 2. 學會透過撰擇及鋪排一些重要數學思想來設計教案\r 3. 掌握不同數學課題所需的基本知識及技能\r 4. 運用不同的有效教學法如實驗及模型去教授數學概念\r 5. 明晰中學生常見的數學學習困難\r 6. 透過測試及分析去評估數學教與學之效能", "syllabus": "For reference only, please refer to the course outline of respective instructor for details\r 1. The goal of mathematics education in secondary school\r 2. The curriculum of secondary school mathematics\r 3. Theories of learning mathematics\r 4. Models of mathematics learning\r 5. Planning mathematics lessons\r 6. Micro-teaching\r 7. Mathematics assessment\r 8. Group presentation\r 9. Conclusion\r  課題可因應個別導師的科目設計而作調校 1. 中學數學教育的目的\r 2. 中學數學課程\r 3. 數學學習理論\r 4. 數學學習模式\r 5. 數學課堂規劃\r 6. 微格教學\r 7. 數學評估\r 8. 小組匯報\r 9. 總結", "required_readings": "Required readings (if any) would depend on individual instructors\r  1. The Curriculum Development Council (2017). Mathematics Education Key Learning Area Curriculum Guide (Primary 1 – Secondary 6). Hong Kong: Education Bureau. / 課程發展議會（2017）。《數學教育學習領域課程指引（小一至中六）》。香港：教育局。\r 2. The Curriculum Development Council (2017). Supplement to Mathematics Education Key Learning Area Curriculum Guide: Learning Content of Junior Secondary Mathematics. Hong Kong: Education Bureau. / 課程發展議會（2017）。《數學教育學習領域課程指引補充文件：初中數學科學習內容》。香港：教育局。\r 3. The Curriculum Development Council (2017). Supplement to Mathematics Education Key Learning Area Curriculum Guide: Learning Content of Senior Secondary Mathematics. Hong Kong: Education Bureau. / 課程發展議會（2017）。《數學教育學習領域課程指引補充文件：高中數學科學習內容》。香港：教育局。", "recommended_readings": "Recommended readings would depend on individual instructors\r  1. Bell, F. H. (1978). Teaching and learning mathematics (in secondary schools). Dubuque, Iowa, U.S.A.: Wm. C. Brown Co.\r 2. Chambers, P. (Ed.) (2008). Teaching mathematics: Developing as a reflective secondary teacher. Los Angeles, California, U.S.A.: SAGE.\r 3. Haggarty, L. (Ed.) (2006). Teaching mathematics in secondary schools: A reader. New York, U.S.A.: Routledge Falmer.\r 4. Pólya, G. (1945). How to solve it. Princeton, U.S.A.: Princeton University Press.\r 5. Skemp, R. R. (1987). The psychology of mathematics learning. Hillsdale, New Jersey, U.S.A.: Lawrence Erlbaum Associates. 中譯：陳澤民（1995）。《數學學習心理學》。臺北：九章出版社。\r 6. 羅浩源（1997）。《生活的數學》。香港：香港教育圖書公司。\r 7. *羅浩源（2015）。《想‧教 想‧學 ─ 13 課數學教育的實錄與反思》。香港：香港數學教育學會。\r 8. 黃毅英、羅浩源（2009）。數學教學對話：反思課堂從哪兒觀察。香港：香港數學教育學會。\r 9. 任維勇（2009）。《如何學好中學數學》。臺北：天下遠見出版股份有限公司。\r 10. 蕭文強（1978）。《為甚麼要學習數學》。香港：學生時代出版社。第二版（1992），香港新一代文化協會。增訂本（1995），台灣：九章出版社。\r 11. 蕭文強（1990）。《1，2，3，…以外》。廣東：廣東教育出版社。（1992）香港：三聯書店。（1994）台灣：書林出版有限公司。", "terms": {"2020-21 Term 1": {"--LEC (6480)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor LAW Huk Yuen"], "meetingDates": ["11/9", "18/9", "25/9"]}}, "2021-22 Term 1": {"--LEC (7650)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Esther Lee Bldg 306"], "instructors": ["Professor LAW Huk Yuen"], "meetingDates": ["10/9", "17/9", "24/9"]}}}, "assessments": {"Essays": "20", "Others": "10", "Presentation": "20", "Project": "50"}}, {"code": "3020", "title": "Mathematics Curriculum and Teaching: Instructional Technology and Design of Teaching Activities", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLectureOthersWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Maths & Maths Education PC", "requirements": "Prerequisite: BMED3010", "description": "This course aims to help students become familiar with the current curricular issues and develop essential pedagogical knowledge and skills in mathematics. Throughout the course, students will gain hands-on practice opportunities, while applying specific pedagogical knowledge and skills in mathematics. In particular, emphasis will be put on designing tool-based mathematical rich learning tasks and activities. Tools refer to mathematical embedded teaching and learning aids which can be physical or digital. Mathematics specific instructional technology (such as dynamic geometry software) will be one of the major focuses. The discussion will extend from activities inside mathematics classroom to mathematics-related extra-curricular activities, including STEM learning activities. A wide range of general topics of mathematics pedagogy will be covered, including: preparation of mathematics lessons and classroom techniques through micro-teaching; use of information and communication technology; tool-based mathematics tasks and activities; cross-disciplinary mathematics-related activities; and professional development of mathematics teachers.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3021", "title": "Mathematics Curriculum and Teaching: Instructional Technology and Design of STEM Learning Activities", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Maths & Maths Education PC", "requirements": "Prerequisite: BMED3010 or BMED3011.", "description": "This is the second of a series of two related courses on curriculum and teaching methods in mathematics, with a focus on Hong Kong school context. These two courses aim to help students become familiar with the current curricular issues and develop essential pedagogical skills and techniques in mathematics. Throughout these two courses, the students will have hands-on practice opportunitieswhich aim to help students to reflect on their own teaching beliefs and teaching styles in mathematics. The second course focuses on specific pedagogical knowledge and skills in mathematics. In particular, emphasis will be put on designing tool-based mathematical rich learning tasks and activities. Tools refer to mathematical embedded teaching and learning aids which can be physical or digital. The use of instructional technologies (such as dynamic geometry software, 3d printing, and coding) for designing mathematics and/or STEM learning tasks and projects will be some of the major focuses of this course. The discussion will extend from activities inside mathematics classroom to extra-curricular and cross-disciplinary mathematics learning activities, including STEM learning activities. A wide range of general topics of mathematics pedagogy will be covered, including: preparation of mathematics lessons and classroom techniques through micro-teaching; use of information and communication technology; tool-based mathematics tasks and activities; cross-disciplinary mathematics-related activities; and professional development of mathematics teachers.", "outcome": "By the end of this course, students will be able to:\r 1. use information and communication technology to teach mathematics effectively; 2. design mathematical rich pedagogical tasks by using mathematics tools; 3. use mathematics games and other mathematics-related activities to support mathematics learning; 4. develop awareness of and potential for life-long professional growth.\r  學生修完本科後，能夠： 1. 運用有效的資訊與傳意科技教授數學；\r 2. 運用教學工具設計數學教學任務；\r 3. 運用數學遊戲及其他數學活動輔助數學學習\r 4. 具備終身學習及專業成長的意識", "syllabus": "For reference only, please refer to the course of respective instructor for details\r 1. Use of mathematics specific ICT\r 2. Tool-based task design in mathematics pedagogy\r 3. Micro-teaching\r 4. Games and mathematics related activities\r 5. Cross-disciplinary activities in mathematics.\r 6 Professional development of mathematics teachers\r  課題可因應個別導師的科目設計而作調校 1. 資訊與傳意科技的運用\r 2. 基於教學工具的數學教學任務設計\r 3. 微格教學\r 4. 數學遊戲及相關活動\r 5. 跨科目的數學活動\r 6. 數學教師之專業成長", "required_readings": "Required readings (if any) would depend on individual instructors\r 1. Davis, P.J., Hersh, R. (1980). The mathematical experience. Boston: Birkhäuser, 1980; study edition (with E.A. Marchisotto), 1995.\r 2. Fauvel, J., & Maanen J.V. (2000). History in mathematics education (The ICMI Study). Dordrecht: Kluwer Academic Publishers.\r 3. Pólya, G. (1945). Howtosolveit. Princeton, U.S.A.: Princeton University Press.\r 4. Swetz, F.J. (Ed.) (1994). From five fingers to infinity: A journey through the history of mathematics. Chicago: Open Court Publishing Company", "recommended_readings": "1. Bell, E. T. (1937). Men of mathematics. New York, U.S.A.: Simon & Schuster. 中譯本：井竹君等（1998）。《大數學家》。臺北：九章出版社。\r 2. Bekken, O., Fauvel, J., Johansson B., Swetz F. (Ed.) (1992). Learn from the masters! – Proceedings of the Kristiansand Conference on the History of Mathematics and Its Place in Teaching. Norway, August, 1988. Harrisburg, PA: Pennsylvania State University.\r 3. Bolts, B. & Hobbs, D. (1989). 101 mathematical projects. Cambridge, U.K.: Cambridge University Press. 中譯：蔡信行（1996）。《數學樂園─ 觸類旁通》。臺北：牛頓出版社。\r 4. Bolts, B. (1982). Mathematical activities. Cambridge, U.K.: Cambridge University Press. 中譯：林傑斌（1995）。《數學樂園 ─ 茅塞頓開》。臺北：牛頓出版社。\r 5. Bolts, B. (1985). More mathematical activities. Cambridge, U.K.: Cambridge University Press. 中譯：黃啟明（1995）。《數學樂園 ─ 老謀深算》。臺北：牛頓出版社。\r 6. Bolts, B. (1987). Even more mathematical activities. Cambridge, U.K.: Cambridge University Press. 中譯：林傑斌（1996）。《數學樂園 ─ 趣味盎然》。臺北：牛頓出版社。\r 7. Bu, L. & Schoen, R. (Eds.) (2011). Model-Centered Learning: Pathways to Mathematical Understanding Using GeoGebra. Rotterdam : Sense Publishers.\r 8. Brown, J. S., Collins, A., & Duguid, P. (1989). Situated cognition and the culture of learning. Educational Researcher, 18(1), 32–42.\r 9. Cundy, H. M., &Rollett, A. P. (1961). Mathematical models. Oxford, U.K.: Oxford University Press.\r 10. Curriculum Development Council. (2015). Promotion of STEM Education – Unleashing Potential in Innovation (Overview). Education of Bureau of Hong Kong.\r  11. English, L.D. (2016). STEM education K-12: perspectives on integration. International Journal of STEM Education, 3(3), 1–8. \r 12. English, L. D., & Gainsburg, J. (2016). Problem solving in a 21st-century mathematics curriculum. In L. D. English & D. Kirshner (Eds.), Handbook of international research in mathematics education (3rd ed., pp. 313–335). New York: Taylor & Francis.\r 13. English, L. D., & King, D. T. (2015). STEM learning through engineering design: fourth-grade students’ investigations in aerospace. International Journal of STEM Education, 2 (14). DOI: 10.1186/s40594-015-0027-7.\r 14. Fleming, L. (2015). Worlds of making: Best practices for establishing a makerspace for your school. Thousand Oaks: Corwin.\r 15. Halverson, E., & Gadanidis, G. (2010). The maker movement in education. Harvard Education Review, 84(4), 495-505.\r 16. Huges, J., & Gadanidis, G. (2010). Learning as community service: Thinking with new media. Journal of Educational Multimedia and Hypermedia, 19(3), 287-306.\r 17. Kelley, T., & Kowles, J.G. (2016). A conceptual framework for integrated STEM education. International journal of STEM Education, 3, 11. doi: 10.1186/s40594-016-0046-z\r 18. Kline, M. (1972). Mathematical thought from ancient to modern times. New York: Oxford University Press. 中譯：北京大學數學系數學史翻譯組（1980）。《古今數學思想》。上海：科學技術出版社。\r 19. Oldknow, A., &Taylo, R. (Eds.) (2003). Teaching mathematics: Using information and communications technology. London, U.K.: Continuum.\r 20. Papert, S. (1980). Mindstorms: Children, computers, and powerful ideas. NY: Basic Books.\r 21. Papert, S. (1991). Situating constructionism. In S. Papert & I. Harel (Eds.), Constructionism (pp.1-11). Norwood: Alex. \r  22. Pólya, G. (1954). Mathematics and plausible reasoning. Princeton, U.S.A.: Princeton University Press.\r 23. Roth, W.-M. (2014). Uncertainty and Graphing in Discovery Work: Implications for and Applications in STEM Education. Dordrecht: Springer-Verlag.\r 24. Smith, R.C., Iversen, O.S., & Hjorth, M. (2015). Design thinking for digital fabrication in education. International Journal of Child-Computer Interaction, 5, 20-28\r 25. Swetz, F.J. (1994). Learning Activities for the History of Mathematics. Portland, Maine: J. Weston Walch.\r 26. Venema, G. A. (2013). Exploring advanced Euclidean geometry with GeoGebra. Washington: Mathematical association of America.\r 27. Wilder, R.L. (1952). An introduction to the foundations of mathematics. New York: John Wiley & Sons.\r 28. 王元等（編）（1984）。《華羅庚科普著作選集》。上海：上海教育出版社。\r 29. 列志佳、簡珮華、黃家鳴（編）（2000）。《數學的故事》。台北：九章出版社。\r  30. 黃毅英（2010）。《香港數學教育實地觀察》。香港：香港數學教育學會。\r 31. 黃毅英、羅浩源（2009）。數學教學對話：反思課堂從哪兒觀察。香港：香港數學教育學會。\r 32. 鄭肇楨（1980）。《數學遊戲》。香港：商務印書館。\r 33. 黎耀志、吳銳堅、黃德華（2001）。《e教學攻略手冊（\r  Periodicals\r 1. College Mathematics Journal\r 2. Journal for Research in Mathematics Education\r 3. The Mathematical Gazette\r 4. Mathematics Magazine\r 5. Mathematics Teacher\r 6. Mathematics Teaching in the Middle School\r 7. 《數學教育》(EduMath)\r 8. 《數學教學》\r 9. 《數學傳播》\r 10. 《數學教育學報》\r  Some Websites for Mathematics Teachers\r 1. Hong Kong Association for Mathematics Education (HKAME): http://www.hkame.org.hk\r 2. HKUST Education Development Program – Mathematics: http://www.edp.ust.hk/previous/math/\r 3. EDB (Mathematics Education): http://www.edb.gov.hk/index.aspx?langno=1&nodeID=2403\r 4. Curriculum documents: http://www.edb.gov.hk/index.aspx?langno=1&nodeID=2899\r 5. Curriculum addenda series: http://www.edb.gov.hk/index.aspx?nodeid=5586&langno=2\r 6. Hong Kong Education City: http://www.hkedcity.net\r (Hyperlinks to many other websites in mathematics education are available at these sites.)", "terms": {"2020-21 Term 1": {"--LEC (6379)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [2], "locations": ["Chen Kou Bun Bldg UG03"], "instructors": ["Professor NG Oi Lam"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}}, "2021-22 Term 1": {"--LEC (7547)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Cheng Yu Tung Building 214"], "instructors": ["Professor NG Oi Lam"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}, "assessments": {"Others": "80", "Presentation": "20"}}, {"code": "3030", "title": "Mathematical Literacy and Problem Solving", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLecture", "campus": "Main Campus", "academic_group": "Maths & Maths Education PC", "requirements": "Prerequisite: BMED3010", "description": "Major topics include development of mathematical literacy for all, including approaches of mathematical exploration, understanding, reasoning, and communication; an understanding of mathematical problem solving through analysis of misconception and cognitive difficulties encountered in the development of mathematical skills and ability.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3031", "title": "Mathematical Literacy and Problem Solving", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Maths & Maths Education PC", "requirements": "Prerequisite: BMED3010 or BMED3011.", "description": "Mathematical literacy is the knowledge and application of basic mathematics in daily life. Problem solving is one of the competencies needed for mathematics literacy. It is the centre of mathematics activities. One of the major aims of school mathematics education is to equip the next generations to be mathematically literate and have mathematical problem solving competency. This course aims to help develop students’ knowledge on mathematical literacy and theories about mathematical problem solving. It covers a wide range of topics related to this area, including: development of mathematical literacy for all through approaches of mathematical exploration, understanding, reasoning, and communication; development of mathematical problem solving abilities; and analysis of misconception and cognitive difficulties encountered in the development of mathematical skills and ability in students.", "outcome": "By the end of this course, students will be able to:\r 1. articulate knowledge of the development of mathematical sense, algebraic thinking and geometric thinking; 2. use various problem-solving and critical-thinking techniques to set up and solve real-world applications; 3. communicate accurate mathematical terminology and notation in written and/or oral form in order to explain mathematical ideas for pedagogical purpose; 4. demonstrate understanding on the learning of mathematics from cognitive and affective aspects.\r   學生修完本科後，能夠: \r 1. 獲得關於數感，代數思維以及幾何思維發展方面的知識；\r 2. 運用不同解難及批判思維技巧來建立應付現實問題的方法; 3. 能有效地以書面及或口頭形式闡釋數學專門用語及符號，藉以在教學中表達數學思想；\r 4. 能從認知層面和情感層面增進對數學學習的理解", "syllabus": "For reference only, please refer to the course outline of respective instructor for details\r 1. Development of mathematical sense \r 2. Development of algebraic thinking\r 3. Development of spatial sense and geometric concepts\r 4. Student’s misconceptions in learning mathematics\r 5. The acquisition of cognitive skills in mathematics\r 6. Representations in the teaching and learning of mathematics\r 7. Problem solving in mathematics\r 8. Students’ views of mathematics\r 9. Implications for teaching mathematics\r  課題可因應個別導師的科目設計而作調校 1. 數感的發展\r 2. 代數思維的發展\r 3. 空間感及幾何概念的發展\r 4. 學生學習數學的謬誤\r 5. 數學認知技巧\r 6. 數學教與學的表徵\r 7. 數學解難\r 8. 學生對數學的見解\r 9. 數學教學的應用", "required_readings": "Required readings (if any) would depend on individual instructors\r 1. Danesi , M. (2008). Problem-solving in mathematics: A semiotic perspective for educators and teachers.New York : Peter Lang Pub.\r 2. Davis, R.B. (1984). Learning mathematics: The cognitive science approach to mathematics education. London: Croom Helm.\r 3. Devlin, K. (2000). The math gene: How mathematical thinking evolved and why numbers are like gossip. New York: Basic Books.\r 4. Kaur, B., Har,Y. B. & Kapur, M. (Eds.) (2009). Mathematical problem solving:Yearbook 2009, Association of Mathematics Educators.Singapore : World Scientific Publishing.\r 5. Polya, G. (1971).How to solve it:A new aspect of mathematical method (2nd edition). Princeton, N.J. : Princeton University Press. England: Penguin. 蔡坤憲 (譯)(2006)。《怎樣解題》。台北市 : 天下遠見出版股份有限公司。\r 6. Thompson, D. R. (2008). Mathematical literacy: Helping students make meaning in the middle grades .Portsmouth, N.H.: Heinemann.", "recommended_readings": "1. Ashlock, R.B. (2010). Error patterns in computation: Using error patterns to help each student learn (10th edition). Boston: Allyn & Bacon.\r 2. Borasi, R. (1996). Reconceiving mathematics instruction: A focus on errors. Norwood, NJ: Ablex.\r 3. Butterworth, B. (1999). The mathematical brain. London: Macmillan.\r 4. Carpenter, T. P., Franke, M.L. & Levi, L. (2003). Thinking mathematically: Integrating arithmetic and algebra in elementary school. Portsmouth, NH : Heinemann.\r 5. Chan, K. K., & Leung, S. W. (2014). Dynamic geometry software improves mathematical achievement: Systematic review and meta-analysis. Journal of educational computing research, 51(3), 311 – 325.\r 6. Cragg, L., & Gilmore, C. (2014). Skills underlying mathematics: The role of executive function skills in the development of mathematics proficiency. Trends in Neuroscience and Education, 3, 63–68.\r 7. Dehaene, S. (1997). The number sense: How the mind creates mathematics. New York: Oxford University Press.\r 8. Erickson, M. (2009). Aha! Solutions. Washington, D.C.: Mathematical Association of America.\r 9. Erickson. M. J. & Flowers, J. (1999). Principles of mathematical problem solving. Upper Saddle River, N.J.: Prentice Hall.\r 10. Geary, D.C. (1994). Children’s mathematical development: Research and practical applications. Washington, DV: American Psychological Association.\r 11. Haider, H., Eichler, A., Hansen, S., Vaterrodt, B., Gaschler, R., & Frensch, P. (2014). How we use what we learn in Math: An integrative account of the development of commutativity. Frontline Learning Research, 2(1), 1–21.\r 12. Herr, T., & Johnson, K. (2001). Problem solving strategies: Crossing the river with dogs and other mathematical adventures. Emeryville, CA: Key Curriculum Press.\r 13. Johnson, D.C. (Ed.) (1989). Children’s mathematical frameworks 8-13: A study of classroom teaching. Windsor, UK: NFER-Nelson.\r 14. Katz, J. D. (2014). Developing mathematical thinking: A guide to rethinking the mathematics classroom. Lanham : Rowman & Littlefield.\r 15. Krantz, S. G. (2010). An episodic history of mathematics: Mathematical culture through problem solving. Washington, D.C. : Mathematical Association of America.\r 16. Krulik, S. & Rudnick, J. A. (1996). The New Sourcebook for Teaching Reasoning and Problem Solving in Junior and Senior High School.Boston : Allyn & Bacon.馬秀蘭、吳德邦(譯) (2009)。《中學數學教學資源手册 : 推理與解題導向》。台北市 : 心理出版社股份有限公司。\r 17. Mason, J. (2010). Thinking Mathematically (2nd edition). Harlow: Pearson.\r 18. Orton, A. (1992). Learning mathematics: Issues, theory and classroom practice (2ns edition). London: Cassell.\r 19. Orton, A. (Ed.) (1999). Pattern in the teaching and learning of mathematics. London: Cassell.\r 20. Orton, A., & Frobisher, L. (1996). Insights into teaching mathematics. London: Cassell.\r 21. Owens, D.T. (Ed.). (1993). Research ideas for the classroom: Middle grades mathematics. New York: Macmillan Publishing Company.\r 22. Pimm, D. (Ed.) (1988). Mathematics, teachers and children A reader. London: Hodder and Stoughton.\r 23. Polya, G. (1981). Mathematical discovery: On understanding, learning, and teaching problem solving (Combined Edition). New York: Wiley. 九章出版社編輯部（譯) （1995)。《數學發現》。臺北市 : 九章出版社。\r 24. Polya, G. (1954). Mathematics and plausible reasoning. Princeton, N.J.: Princeton University Press. 李心煽、王日爽、李志堯（譯)（1992)。《數學與猜想》。臺北市 : 九章出版社。\r 25. Post, T.R. (Ed.) (1992). Teaching mathematics in grades K-8: Research-based methods (Second edition). Boston: Allyn and Bacon.\r 26. Resnick, L.B., & Ford, W.W. (1981). The psychology of mathematics for instruction. Hillsdale, NJ: Lawrence Erlbaum Associates.\r 27. Riccomini, P. J., & Smith, G. W. (2011). Introduction of response to intervention in mathematics. In R. Gersten & R. Newman-Gonchar (Eds.), Understanding RTI in Mathematics: Proven methods and applications (pp. 1–16). Baltimore, ML: Brookes.\r 28. Schackow, J. B. & O'Connell, S. (2008). Introduction to problem solving: Grades 6-8. Portsmouth, N.H.: Heinemann.\r 29. Schoenfeld, A.G. (Ed.) (1987). Cognitive science and mathematics education. Hillsdale, NJ: Lawrence Erlbaum Associates.\r 30. Schoenfeld, A.G. (Ed.) (1994). Mathematical thinking and problem solving. Hillsdale, NJ: Lawrence Erlbaum Associates.\r 31. Schommer‐Aikins, M., Duell, O., & Hutter, R. (2005). Epistemological beliefs, mathematical problem‐solving beliefs, and academic performance of middle school students. The Elementary School Journal, 105(3), 289–304.\r 32. Skemp, R.R. (1987). The psychology of learning mathematics (Expanded American edition). Hillsdale, NJ: Lawrence Erlbaum Associates.\r 陳澤文(譯) (1995)。《數學學習心理學》。台北市︰九章出版社。\r 33. Stacey, K. & Turner, R. (2015). Assessing mathematical literacy: The PISA experience. New York: Springer.\r 34. Steen, L.A. (Ed.) (1990). On the shoulders of giants: New approaches to numeracy. Washington, DVL National Academy Press.\r 35. Steen, L.A. (Ed.) (1997). Why numbers count: Quantitative literacy for tomorrow’s America. New York: College Entrance Examination Board.\r 36. Stein, S.K. (1996). Strength in numbers: Discovering the joy and power of mathematics in everyday life. New York: John Wiley & Sons, Inc.\r 37. Stickels, T. (2009). Math puzzles and brainteasers, grades 6-8: Over 300 puzzles that teach math and problem solving skills. San Francisco, Calif. :Jossey-Bass. \r 38. Tall, D. (Ed.) (1991). Advanced mathematical thinking. Dordrecht: Kluwer Academic Publishers.\r 39. Thomas, M. O., Yoon, C., & Dreyfus, T. (2009). Multimodal use of semiotic resources in the construction of antiderivative. In R. Hunter, B. Bicknell, & T. Burgess (Eds.), Crossing divides. Proceedings of the 32nd Annual Conference of the Mathematics Education Research Group of Australasia, Vol. 2. Palmerston North: MERGA.\r 40. Vamvakoussi, X., & Vosniadou, S. (2010). How many decimals are there between two fractions? Aspects of secondary school students' understanding of rational numbers and their notation. Cognition and Instruction, 28(2), 181-209.\r 41. Wilson, P.S. (Ed.) (1993). Research ideas for the classroom: High school mathematics. New York: Macmillan Publishing Company.\r 42. 戴再平 (2000）。《初中數學開放題集》。上海：上海教育出版社。\r 43. 戴再平 (2000）。《高中數學開放題集》。上海：上海教育出版社。\r 44. 戴再平(2002)：《開放題──數學教學的新模式》，上海，上海教育出版社。\r 45. 戴再平 (2007)。《中學數學開放題精選》。香港 : 香港教育圖書公司。\r 46. 課程發展處數學教育組(2003)：《促進學習的評估(中學數學科)開放式問題》，香港，政府印務局。\r 47. 劉雲章、趙雄輝 (1992)。《數學解難思維策略 -- 波利亞著作選講》。湖南：湖南教育出版社。\r  Periodicals\r 1. College Mathematics Journal\r 2. Journal for Research in Mathematics Education\r 3. The Mathematical Gazette\r 4. Mathematics Magazine\r 5. Mathematics Teacher\r 6. Mathematics Teaching in the Middle School\r 7. 《數學教育》(EduMath)\r 8. 《數學教學》\r 9. 《數學傳播》\r 10. 《數學教育學報》\r  Some Websites for Mathematics Teachers\r 1. Algebra Net: http://resources.edb.gov.hk/algebra/\r 2. Dave's Math Tables: http://math2.org/\r 3. Geogebra wiki: http://www.geogebra.org/wiki\r 4. Manipula Math with JAVA: http://www.ies.co.jp/math/java/index.html\r 5. PowerPoint Presentation Packages（CUHK）: http://www2.fed.cuhk.edu.hk/ITED/PowerPoint/Mathematics/\r 6. Sketchpad SketchExchange: http://sketchexchange.keypress.com/\r 7. Wolfram MathWorld: http://mathworld.wolfram.com/\r 8. 教育局 (數學教育組): http://www.edb.gov.hk/index.aspx?langno=1&nodeID=2403\r 9. 教育局初中數學教育教學資源: http://www.edb.gov.hk/index.aspx?nodeid=8527&langno=2\r 10. 教育局高中數學教育教學資源: http://www.edb.gov.hk/index.aspx?nodeid=8528&langno=2\r 11. 教育局中學數學教學資源套: http://www.edb.gov.hk/index.aspx?nodeid=5586&langno=2\r 12. 香港數學課程文件: http://www.edb.gov.hk/index.aspx?langno=1&nodeID=2899\r 13. 新高中數學課程綱要: http://www.edb.gov.hk/FileManager/TC/Content_5185/maths_c.pdf\r 14. 新高中數學科課程詮釋:\r http://www.edb.gov.hk/FileManager/TC/Content_4687/compulsory_uandi.pdf\r 15. 香港教育城: http://www.hkedcity.net/\r 16. 教師電視: http://www.hkedcity.net/teacher/teachertv/\r 17. 數學科「網上學與教支援」: http://wlts.edb.hkedcity.net/tc/mathematics/index.html\r 18. 數學科「網上學與教支援」試用課業: http://edblog.hkedcity.net/math-wlts/\r 19. 香港數學教育學會(HKAME): http://www.hkame.org.hk\r 20. 香港科技大學教育發展計劃 (數學科): http://www.edp.ust.hk/previous/math/\r 21. 數學教學參考資料: http://maths-teaching.com/\r 22. 有趣的計算機: http://www.alpertron.com.ar/CALTORS.HTM", "terms": {"2020-21 Term 1": {"--LEC (5686)": {"startTimes": ["8:30", "8:30"], "endTimes": ["11:15", "11:15"], "days": [4, 2], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor LAU Wing Fat", "Professor LAU Wing Fat"], "meetingDates": ["10/9", "17/9", "24/9", "8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10"]}}, "2021-22 Term 1": {"--LEC (7649)": {"startTimes": ["10:30", "10:30"], "endTimes": ["13:15", "13:15"], "days": [4, 2], "locations": ["Wong Foo Yuan Bldg UG01", "Esther Lee Bldg 303"], "instructors": ["Professor LAW Huk Yuen", "Professor LAW Huk Yuen"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10"]}}}, "assessments": {"Essays": "80", "Presentation": "20"}}, {"code": "3050", "title": "The Teaching of Algebra and Calculus", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLecture", "campus": "Main Campus", "academic_group": "Maths & Maths Education PC", "requirements": "Prerequisite: BMED3010", "description": "This course focuses on the teaching of algebra and calculus in school mathematics. Ranging from the basic concept of introducing unknowns and designation of numbers by symbols at primary school level to systems of algebraic equations or equations of higher degrees at upper secondary level, algebraic methods permeate through the whole school mathematics curriculum. In this course, topics of algebra and calculus in the mathematics curriculum are analyzed from multiple perspectives in terms of the mathematics content knowledge, psychology of learning, pedagogical approaches, and epistemological relationships between mathematical concepts involved. Emphasis is placed on how students can develop their algebraic and calculus ways of thinking gradually through the curriculum. Through different learning activities that include the use of information technology resources, student teachers will develop their conceptual understanding and frameworks for effective instructional design in these curriculum topics.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3051", "title": "The Teaching of Number and Algebra", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkDiscussionLectureOthers", "campus": "Main Campus", "academic_group": "Maths & Maths Education PC", "requirements": "Pre-requisite: BMED3011.", "description": "This course focuses on the teaching of number and algebra in secondary school mathematics. It is concerned about the basic concept of introducing unknowns and designation of numbers by symbols, systems of algebraic equations or equations of higher degrees, and algebraic methods permeate through the whole school mathematics curriculum. In this course, topics in number and algebra in the mathematics curriculum at secondary school level are analyzed from multiple perspectives, that is, in terms of the mathematics content knowledge, psychology of learning, pedagogical approaches, and epistemological relationships between mathematical concepts involved. Emphasis is on how school students can develop their algebraic ways of thinking gradually through the curriculum. Through different learning activities which include the implementation of available information technology resources, student teachers will develop their conceptual skills and frameworks for effective instructional design in these curriculum topics.", "outcome": "Upon completion of this course, students are expected to be able to: 1. Demonstrate knowledge for teaching of the fundamental concepts and theories from the topics as included in this Course.\r 2. Utilize various problem-solving and critical-thinking techniques to set up and solve real-world applications \r 3. Communicate accurate mathematical terminology and notation in written and/or oral form in order to explain strategies for the purpose of teaching as related to the topics as included in this Course.\r  學生修畢本科後，能夠:\r 1. 透過課程內容掌握基礎概念和理論的教學\r 2. 運用不同解難及批判思維技巧來建立應付現實問題的方法; 3. 能有效地以書面及或口頭形式闡釋數學專門用語及符號，藉以明晰本課程之相關教學策略及目的", "syllabus": "For reference only, please refer to the course of respective instructor for details:\r 1. Bridging between number and algebra from epistemological perspective \r 2. Pedagogical method of number and algebra\r 3. Algebraic way of thinking in problem solving\r  課題可因應個別導師的科目設計而作調校 1. 從認識論角度看數與代數之關係\r 2. 數與代數之教學方法\r 3. 以代數思維解決問題", "required_readings": "Required readings (if any) would depend on individual instructors\r  1.  Ashlock, R. B. (2010). Error patterns in computation: Using error patterns to help each student learn (10th edition). Boston: Allyn & Bacon.\r 2.  Blanton, M. L. (2008). Algebra and the Elementary classroom: Transforming thinking, transforming practice. Portsmouth, N.H.: Heinemann.\r 3.  Holton D., Clarke D. (Eds.) (2014). Algebra teaching around the world. Rotterdam: Springer. https://doi.org/10.1007/978-94-6209-707-0", "recommended_readings": "Recommended readings would depend on individual instructors\r  1. Chaiklin, S. (1989). Cognitive studies of algebra problem solving and learning. In S. Wagner, & C. Kieran (Eds.). Research issues in the learning and teaching of algebra (pp.93-114). Reston, VA: NCTM.\r 2. Chazan, D. (2000). Beyond formulas in mathematics and teaching: dynamics of the high school algebra classroom. New York : Teachers College Press. \r 3. Driscoll, M. (1999). Fostering algebraic thinking: A guide for teachers (Grades 6–10). Portsmouth, NH: Heinemann.\r 4. Filloy, E., & Sutherland, R. (1996). Design curricula for teaching and learning algebra. In A.J. Bishop et al. (Eds). International handbook of mathematics education (pp.139-160). Netherlands: Kluwer Academic Publishers.\r 5. Fosnot, C. T. & Bill Jacob, B. (2010). Young mathematicians at work. Constructing algebra. Reston, VA : NCTM, National Council of Teachers of Mathematics.\r 6. French, D. (2002). Teaching and Learning Algebra. London : Continuum. \r 7. Graham, K., Cuoco, A. & G. Zimmermann (2010). Focus in high school mathematic : Reasoning and sense making in algebra. Reston, VA : National Council of Teachers of Mathematics\r 8. Greenes, C. & Rubenstein, R. (Eds.) (2008). Algebra and algebraic thinking in school mathematics (NCTM 2008 Yearbook). Reston, VA.: National Council of Teachers of Mathematics. \r 9. Kaput, J. J., Carraher, D. W. & Blanton, M. L. (2008). Algebra in the early grades. New York : Lawrence Erlbaum Associates. \r 10. Kieran, C. (1992). The learning and teaching of school algebra. In D.A. Grouws (Ed). Handbook of research on mathematics teaching and learning, pp.390-419. New York: Macmillan publishing company.\r 11. Lee, L., & Wheeler, D. (1989). The arithmetic connection. Education Studies in Mathematics, 20, 41-54.\r 12. Leung, K. T. & Cheung, P. H. (1988). Fundamental concepts of mathematics. Hong Kong: Hong Kong University Press.\r 13. Leung, K. T., Mok, I. C. & Suen, S. N. (1994). Polynomials and equations. Hong Kong: Hong Kong University Press.\r 14. Litwiller, B. H. (ed.) (2002). Making sense of fractions, ratios, and proportions (NCTM 2002 Yearbook). Reston, VA.: National Council of Teachers of Mathematics.\r 15. Mason, J., Graham. A. & Johnston-Wilder, S. (2005). Developing thinking in algebra. London: Open University. \r 16. Mok, I. (2009). Learning of algebra: Inspiration from students' understanding of the distributive law. Hong Kong: Hong Kong Association for Mathematics Education..\r 17. Peressini, A., Usiskin, Z., Marchisotto, E.A. & Standley, D. (2003). Mathematics for high school teachers: An advanced perspective. Upper Saddle River, N.J.: Pearson Education.\r 18. Posamentier, A. S. (2003). Math wonders to inspire teachers and students. Alexandria, Virginia: Association for Supervision and Curriculum Development.\r 19. Posamentier, A. S. & Hauptman, H. A. (2006). 101+ great ideas for introducing key concepts in mathematics (2nd edition). Thousand Oaks, California: Corwin Press.\r 20. Schliemann, A. D. , Carraher, D. W. & Brizuela, B. M. (2007). Bringing out the algebraic character of arithmetic: From children's ideas to classroom practice. Mahwah, N.J. : Lawrence Erlbaum. \r 21. Stacey, K., Chick, H., & Kendal, M. (2004). The future of the teaching and learning of Algebra: The 12th ICMI Study . Boston, Mass. : Kluwer Academic Publishers.\r 22. Tall, D. (Ed.) (1991). Advanced mathematical thinking. Dordrecht: Kluwer Academic Publishers.\r 23. 林壽福（2006）。《數學樂園 ─ 從胚騰（pattern）學好數學》。台北：如何出版社\r 24. 香港教育署數學組（2002）。《中一至中五數學科教學資源套（四）：數與代數範疇》。香港：教育署。\r 25. 張家麟、黃毅英、韓藝詩（2009）。《漫談數學學與教：新高中數學課程必修部分》。香港：課程發展處數學教育組。\r 26. 蔡凌志（編）（2002）。《數學大師講數學》系列（共十八冊）。香港：智能教育。\r 27. 曹亮吉（1997）。《阿草的葫蘆：文化活動中的數學》。台北：發行所財團法人遠哲科學敎育基金會。\r 28. 羅浩源（1997）。《生活的數學》。香港：香港教育圖書公司。\r 29. 黃毅英（1997）。《邁向大眾數學的數學教育》。臺北：九章出版社。黃毅英、張家麟、韓藝詩（2009）。《漫談數學學與教：新高中數學課程延伸部分（單元二）》。香港：課程發展處數學教育組。", "terms": {"2020-21 Term 1": {"--LEC (4950)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. SUM Sze Wan Emily"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}, "2021-22 Term 1": {"--LEC (7578)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Hui Yeung Shing Bldg G06"], "instructors": ["Dr. CHENG Wing Kin"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Homework or assignment": "60", "Others": "20", "Presentation": "20"}}, {"code": "3060", "title": "The Teaching of Number and Number Sense", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Maths & Maths Education PC", "requirements": "Prerequisite: BMED3010", "description": "This course focuses on an important aspect in mathematics education, namely, the understanding and cultivation of number and number sense, which is a major aim in primary school mathematics education. It is concerned about school children’s learning of basic quantitative skills, from counting objects to the four rules of arithmetic, both in exact calculations and in estimation. In this course, related topics in the mathematics curriculum are analysed from multiple perspectives, that is, in terms of the mathematics content knowledge, psychology of learning, pedagogical approaches, and epistemological relationships between mathematical concepts involved. Through different learning activities which include the implementation of available information technology resources, student teachers will develop their conceptual skills and frameworks for effective instructional design in curriculum topics related to number and number sense.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3061", "title": "Elementary Mathematics from an Advanced Standpoint", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Maths & Maths Education PC", "requirements": "Prerequisite: BMED3011.", "description": "The famous mathematician Felix Klein pointed out that there is a disconnection between university mathematics education and elementary mathematics education. He called this phenomenon “double discontinuity”. As a student of B.Ed. in Mathematics and Mathematics Education and a pre-service secondary mathematics teacher, there is a need to break through this phenomenon. This is precisely the focus of this course. In this course, the connection between university mathematics and secondary school mathematics are analyzed from multiple perspectives, that is, in terms of the mathematics content knowledge, psychology of learning, pedagogical approaches, and epistemological relationships between mathematical concepts involved. Through different learning activities, student teachers will review different dimensions of secondary school mathematics curriculum, including algebra, geometry, statistics and calculus, from an advanced standpoint. Their pedagogical content knowledge in mathematics will be developed.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3070", "title": "The Teaching of Probability and Statistics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureOthersWorkshop", "campus": "Main Campus", "academic_group": "Maths & Maths Education PC", "requirements": "Prerequisite: BMED3010", "description": "This course focuses on the teaching of probability and statistics in school mathematics. At primary school level, statistics is introduced in relation to real life applications. At higher grade levels, statistics is taught with more computational elements and their interpretations, and real-world experiences in probabilistic events are basis for developing a formal understanding of probability in mathematics. In this course, topics in probability and statistics in the mathematics curriculum are analysed from multiple perspectives, that is, in terms of the mathematics content knowledge, pedagogical approaches, and epistemological relationships between mathematical concepts involved. Emphasis is on the development of stochastic thinking among school students. Through different learning activities which include the implementation of available information technology resources, student teachers will develop their conceptual skills and frameworks for effective instructional design in these curriculum topics.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3071", "title": "The Teaching of Probability and Statistics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureOthersWorkshop", "campus": "Main Campus", "academic_group": "Maths & Maths Education PC", "requirements": "Prerequisite: BMED3010 or BMED3011.", "description": "This course focuses on the teaching of probability and statistics in secondary school mathematics. At junior secondary school level, statistics is introduced in relation to real life applications. At higher grade levels, statistics is taught with more computational elements and their interpretations, and real-world experiences in probabilistic events are basis for developing a formal understanding of probability in mathematics. In this course, topics in probability and statistics in secondary school mathematics curriculum are analyzed from multiple perspectives, that is, in terms of the mathematics content knowledge, pedagogical approaches, and epistemological relationships between mathematical concepts involved. Emphasis is on the development of stochastic thinking among school students. Through different learning activities which include the implementation of available information technology resources, student teachers will develop their conceptual skills and frameworks for effective instructional design in these curriculum topics.", "outcome": "By the end of this course, students will be able to: 1. articulate knowledge required for teaching the concepts and procedures in the dimension of data handling; 2. devise teaching strategies to develop students’ awareness in the misuse of statistics; 3. explain the essential concepts in probability and statistics.  學生修完本科後，能夠：.  1. 獲得講授數據處理學習領域相關概念和方法所必需的知識； 2. 設計針對發展學生對統計誤用的意識的有效教學策略; 3. 闡釋概率與統計學習領域的核心概念", "syllabus": "For reference only, please refer to the course outline of respective instructor for details. 1. Teaching of statistics 2. Teaching of probability 3. Bridging between statistics and probability from the pedagogical standpoint 4. Conclusion  課題可因應個別導師的科目設計而作調校 1. 統計的教學 2. 概率的教學 3. 從教育角度看統計與概率之關係 4. 總結", "required_readings": "Required readings (if any) would depend on individual instructors  1. Batanero, C., Burrill, G. & Reading, C. (Eds.) (2011). Teaching Statistics in School Mathematics - Challenges for Teaching and Teacher Education. New York: Springer Verlag. (eBook at CU) 2. Ben-Zvi, D., & Garfield, J. B. (2004). The challenge of developing statistical literacy, reasoning, and thinking. Dordrecht: Kluwer Academic Publishers. 3. Graham, A. (2006). Developing Thinking in Statistics. London: Open University. 4. Watson, A., Jones, K., & Pratt, D. (2013). Key ideas in teaching mathematics: Research-based guidance for ages 9-19. Oxford: Oxford University Press. (Chapter 6)", "recommended_readings": "1. Batanero, C., Burrill, G. & Reading, C. (Eds.) (2011). Teaching Statistics in School Mathematics - Challenges for Teaching and Teacher Education. New York: Springer Verlag. (eBook at CU) 2. Ben-Zvi, D., & Garfield, J. B. (2004). The challenge of developing statistical literacy, reasoning, and thinking. Dordrecht: Kluwer Academic Publishers. 3. Burrill, G. (2006). Thinking and Reasoning with Data and Chance (NCTM 2006 Yearbook). Reston, VA.: National Council of Teachers of Mathematics 4. Burrill, G., Scheaffer, R., & Rowe, K.B. (Eds.). (1994). Teaching statistics: Guidelines for elementary through high school. Palo Alto, CA: Dale Seymour Publications. 5. Gelman, A. & Nolan, D. (2002). Teaching Statistics: a Bag of Tricks. Oxford: Oxford University Press. 6. Graham, A. (2006). Developing Thinking in Statistics. London: Open University. 7. Green, D. (Ed.) (1994). Teaching Statistics at its Best: A Series of Articles for Teachers. Sheffield: University of Sheffield. 8. Huff, D. (1973). How to lie with statistics. Harmondsworth: Penguin Books. 鄭惟厚（譯）（2005）。《別讓統計數字騙了你》。台北：天下文化。 9. Hulsizer, M. R. & Woolf, L. M. (2009). A Guide to Teaching Statistics : Innovations and Best Practices. Malden, MA ; Oxford : Wiley-Blackwell Pub. 10. Jones, G. E. (2000). How to lie with charts. San Jose: Authers Choice Press. 葉偉文（譯）（2005）。《別讓統計圖表唬弄你》。台北：天下文化。 11. Jones, G.A., (Ed.) (2005). Exploring probability in school: challenges for teaching and learning. New York : Springer. 12. Lajoie, S.P. (Ed.). (1998). Reflections on statistics: Learning, teaching, and assessment in Grades K-12. Mahwah, NJ: Lawrence Erlbaum Associates. 13. Moore, D.S. (1992). Statistics: Decisions through data. Lexington, MA: COMAP. [Student’s book + Teacher’s guide + a set of five 1-hour videotapes] 14. Moore, D. S. (2000). The basic practice of statistics (3rd edition). New York: W.H. Freeman and Co. 15. Niven, I. M. (1965). Mathematics of choice: Or, how to count without counting (New Mathematical Library). Washington, D.C.: Mathematical Association of America. 16. Piaget, J., & Inhelder, B. (1975). The origin of the idea of chance in children. London: Routledge Kegan Paul. 17. Rao, C., & Radhakrishna (1997). Statistics and truth: Putting chance to work (2nd enl. ed.). Singapore: World Scientific. 18. Reichmann, W. J. (1975). Use and abuse of statistics. London: Chapman & Hall. 19. Ross, S. (2006). A first course in probability (7th edition). Upper Saddle River, New Jersey: Pearson Prentice Hall. 20. Scheaffer, L. R. (1996). Activity-based statistics: Instructor resources. New York: Springer-Verlag. 21. Shaughnessy, J.M. (1992). Research in probability and statistics: Reflections and directions. In D. Grouws (Ed.). Handbook of research on mathematics teaching and learning, pp. 465-494. New York：Macmillan. 22. Shaughnessy, J. M. (2005). Statistical questions from the classroom. Reston, Virginia: National Council of Teachers of Mathematics. 23. Shulte, A.P. & Smart, J.R. (Eds.). (1981). Teaching statistics and probability (NCTM 1981 Yearbook). Reston, VA: National Council of Teachers of Mathematics. 24. Smith, G. (1998). Introduction to statistical reasoning. Boston, Massachusetts: WCB/McGraw-Hill. 25. Tal, J. (2000). Reading between the numbers: Statistical thinking in everyday life. New York: McGraw-Hill. 26. Watson, A., Jones, K., & Pratt, D. (2013). Key ideas in teaching mathematics: Research-based guidance for ages 9-19. Oxford: Oxford University Press. (Chapter 6) 27. 香港教育署數學組（2002）。《中一至中五數學科教學資源套（六）：數據處理範疇》。香港：教育署。 28. 香港統計處（2002）。《統計與生活─活動指引》。香港：作者。 29. 香港統計處（2002）。《統計與生活─教學指引》。香港：作者。 30. 孫榮恆（2004）。《趣味隨機問題》。北京：科學出版社。 31. 張家麟、黃毅英、韓藝詩（2009）。《漫談數學學與教：新高中數學課程必修部分》。香港：課程發展處數學教育組。 32. 黃毅英、張家麟、韓藝詩（2009）。《漫談數學學與教：新高中數學課程延伸部分（單元二）》。香港：課程發展處數學教育組。 33. 鄭惟厚（2007）。《你不能不懂的統計常識》。台北：天下文化。 34. 蕭文強、林建（1982）。《槪率萬花筒》。香港：廣角鏡出版社。2010: 香港教育局課程發展處數學教育組 35. 韓藝詩、黃毅英、張家麟（2009）。《漫談數學學與教：新高中數學課程延伸部分（單元一）》。香港：課程發展處數學教育組。  Periodicals 36. 《數學教育》(EduMath) 37. 《數學教育學報》 38. 《數學教學》 39. 《數學傳播》 40. 《台灣數學教師(電子)期刊》(Taiwan Journal of Mathematics Teachers) 41. 《數學傳播》(MATHMEDIA) 台灣中央研究院數學研究所 42. 《數學教學》 華東師範大學 43. 《數學通報》 北京師範大學 44. 《數學教育學報》 天津師範大學 45. College Mathematics Journal 46. Journal for Research in Mathematics Education 47. Journal of statistics education.  48. Mathematics Teacher 49. Mathematics Teaching in the Middle School 50. Teaching statistics.   Some Websites for Mathematics Teachers 51. Hong Kong Association for Mathematics Education (HKAME): http://www.hkame.org.hk 52. EDB (Mathematics Education): https://www.edb.gov.hk/tc/curriculum-development/kla/ma/index.html 53. Curriculum documents: https://www.edb.gov.hk/tc/curriculum-development/kla/ma/curr/index2.html 54. 教育局數學教學資源套 https://www.edb.gov.hk/tc/curriculum-development/kla/ma/res/index.html 55. Hong Kong Education City:  http://www.hkedcity.net 56. 統計學的用處 http://episte.math.ntu.edu.tw/articles/mm/mm_03_3_07/index.html (Hyperlinks to many other websites in mathematics education are available at these sites.)", "terms": {"2020-21 Term 2": {"--LEC (6470)": {"startTimes": ["14:30", "14:30"], "endTimes": ["17:15", "17:15"], "days": [2, 4], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Mr. LEE Kin Sum", "Mr. LEE Kin Sum"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2", "14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 2": {"--LEC (5238)": {"startTimes": ["14:30", "14:30"], "endTimes": ["17:15", "17:15"], "days": [4, 2], "locations": ["Lee Shau Kee Archi Bldg G04", "Chen Kou Bun Bldg UG05"], "instructors": ["Mr. LEE Kin Sum", "Mr. LEE Kin Sum"], "meetingDates": ["13/1", "20/1", "27/1", "11/1", "18/1", "25/1"]}}}, "assessments": {"Essays": "80", "Presentation": "20"}}, {"code": "3080", "title": "The Teaching of Spatial Sense and Geometry", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Maths & Maths Education PC", "requirements": "Prerequisite: BMED3010", "description": "This course focuses on the teaching of geometry in school mathematics. At junior primary school level, spatial sense is to be cultivated through concrete activities with shapes and solid forms. At higher grade levels, there is a gradual shift from synthetic or empirical geometry to deductive geometry. In this course, topics in geometry in the mathematics curriculum are analysed from multiple perspectives, that is, in terms of the mathematics content knowledge, psychology of learning, pedagogical approaches, and epistemological relationships between mathematical concepts involved. Emphasis is on the development of spatial sense and geometrical thinking among school students. Through different learning activities which include the implementation of available information technology resources, student teachers will develop their conceptual skills and frameworks for effective instructional design in these curriculum topics.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3081", "title": "The Teaching of Spatial Sense and Geometry", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkDiscussionLectureWorkshop", "campus": "Main Campus", "academic_group": "Maths & Maths Education PC", "requirements": "Prerequisite: BMED3010 or BMED3011.", "description": "This course focuses on the teaching of geometry in school mathematics. At junior primary school level, spatial sense is to be cultivated through concrete activities with shapes and solid forms. At higher grade levels, there is a gradual shift from synthetic or empirical geometry to deductive geometry. In this course, topics in geometry in the mathematics curriculum are analyzed from multiple perspectives, that is, in terms of the mathematics content knowledge, psychology of learning, pedagogical approaches, and epistemological relationships between mathematical concepts involved. Emphasis is on the development of spatial sense and geometrical thinking among school students. Through different learning activities which include the implementation of available information technology resources, and history of mathematics, student teachers will develop their conceptual skills and understandings, the frameworks for effective instructional design in these curriculum topics.", "outcome": "Upon completion of this course, students are expected to be able to: 1. articulate knowledge required for teaching the concepts and procedures in the dimension of shape and space; 2. devise effective teaching strategies for developing the habit of geometric thinking; 3. analyze different theories on fostering of spatial sense; 4. appreciate the aesthetic of mathematics and geometry shapes.\r  學生修畢本科後，能夠:\r 1. 獲得講授圖形與空間學習領域相關概念和方法所必需的知識；\r 2. 設計針對發展學生幾何思維的有效教學策略；\r 3. 分析培養學生空間感的各種理論；\r 4. 欣賞數學與幾何圖形中的美", "syllabus": "For reference only, please refer to the course of respective instructor for details:\r 1. Geometric thinking\r 2. Fostering of spatial sense\r 3. Teaching strategies of geometry\r  課題可因應個別導師的科目設計而作調校 1. 幾何思維\r 2. 空間感的培養\r 3. 幾何教學的策略", "required_readings": "Required readings (if any) would depend on individual instructors\r  1. Craine, T. (2009). Understanding geometry for a changing World (NCTM 2009 Yearbook). Reston, VA.: National Council of Teachers of Mathematics. \r 2. French, D. (2004). Teaching and learning geometry: Issues and methods in mathematical education. London, UK: Continuum. \r 3. Johnston-Wilder, S. & John Mason, J. (2005). Developing thinking in geometry. London: Open University.", "recommended_readings": "Recommended readings would depend on individual instructors\r  1. Allen, J. (2012). Making geometry: Exploring three-dimensional forms. Edinburgh: Floris Books.\r 2. Clements, D. H. (Ed.) (2003). Learning and teaching measurement (NCTM 2003 Yearbook). Reston, VA.: National Council of Teachers of Mathematics. \r 3. Clements, D. H., & Battista, M. T. (1992). Geometry and spatial reasoning. In D. A. Grouws (Ed.). Handbook of research on mathematics teaching and learning (pp. 420-464). New York: Macmillan publishing company.\r 4. Coxford, A. F. (1993). Geometry from multiple perspectives. Reston, Virginia, U.S.A.: National Council of Teachers of Mathematics.\r 5. Craine, T. (2009). Understanding geometry for a changing World (NCTM 2009 Yearbook). Reston, VA.: National Council of Teachers of Mathematics. \r 6. Cundy, H. M., & Rollett, A. P. (1961). Mathematical models. Oxford: Oxford University Press. \r 7. De Villiers, M. (2003). Rethinking proof with Geometer’s Sketchpad. Emeryville, California, U.S.A.: Key Curriculum Press.\r 8. Driscoll, M. (2008). The fostering geometric thinking toolkit: A guide for staff development. Portsmouth, NH: Heinemann.\r 9. Driscoll, M., DiMatteo, R. W., Nikula, J. E., & Egan, M. (2007). Fostering geometric thinking: A guide for teachers grades 5-10. Portsmouth, NH: Heinemann.\r 10. French, D. (2004). Teaching and learning geometry: Issues and methods in mathematical education. London, UK: Continuum. \r 11. Fuys, D., Geddes, D. & Tishler, R. (1988). The van Hiele model of thinking in geometry among adolescents. Journal for Research in Mathematics Education Monograph No. 3. Reston, VA: NCTM.\r 12. Geddes, D. (1992). Geometry in the middle grades. Reston, Virginia, U.S.A.: National Council of Teachers of Mathematics. \r 13. Hershkowitz, R. (1990). Psychology aspects of learning Geometry. Mathematics and Cognition: a Research Synthesis by the International Group for the psychology of mathematics Education. Cambridge: Cambridge University Press.\r 14. Hoffer, A. (1983). Van Hiele-Base research. In R. Lesh, & M. Landau (Eds.). Acquisition of mathematics concepts and process (pp. 205-228). New York: Academic Press, Inc.\r 15. Johnston-Wilder, S. & John Mason, J. (2005). Developing thinking in geometry. London: Open University. \r 16. Leung, K. T. & Suen, S. N. (1992). Vector, matrix and geometry. Hong Kong: Hong Kong University Press.\r 17. Lockhart, P. (2012). Measurement. Cambridge, MA: Belknap.\r 18. Katz., J. D. (2014). Developing mathematical thinking: A guide to rethinking the mathematics. Lanham: Rowman & Littlefield Publishers.\r 19. King, J. R. & Schattschneider, D. (Eds.). (1997). Geometry turned on! : Dynamic software in learning, teaching, and research. Washington, D.C.: Mathematical Association of America. \r 20. Mammana, C. & Villani, V. (Eds.). (1998). Perspectives on the teaching of geometry for the 21st century. Boston : Kluwer Academic Publishers. \r 21. Moise, E. E. (1974). Elementary geometry from an advanced standpoint. Massachusetts, U.S.A.: Addison – Wesley publishing company, Reading.\r 22. Peressini, A., Usiskin, Z., Marchisotto, E.A. & Standley, D. (2003). Mathematics for high school teachers: An advanced perspective. Upper Saddle River, N.J.: Pearson Education.\r 23. Piaget, J., Inhelder, B., & Szeminska, A. (1960). The Child’s conception of geometry. London: Routledge & Kegan Paul Ltd.\r 24. Pritchard, C. (Ed.) (2003). The changing shape of geometry: Celebrating a century of geometry and geometry teaching. Cambridge: Cambridge University Press.\r 25. Reid, D. A., & Knipping, C. (2010). Proof in mathematics education: Research, learning and teaching. Rotterdam: Sense Publishers.\r 26. Rivera, F. (2013). Teaching and learning patterns in school mathematics: Psychological and pedagogical Considerations. New York: Springer. \r 27. Stylianou, D.A., Blanton, M. L. & Knuth, E. J. (Eds.) (2009). Teaching and learning proof across the grades: A K-16 perspective. New York: Routledge. \r 28. Van den Heuvel-Panhuizen, M. & Buys, K. (2005). Young children learn measurement and geometry: A Learning-teaching trajectory with intermediate attainment targets for the lower grades in primary school. Utrecht: Freudenthal Institute, Utrecht University. \r 29. Van Hiele, P. M. (1986). Structure and insight: A theory of mathematics education. Orlando, Fla.: Academic Press. \r 30. Van Hiele, P. M. (1984). A child’s thought and geometry. In Fuys, D., Geddes, D. & Tischler, R. (Eds.). English translation of selected writings of Dina Van Hiele-Geld of and Pierre M. Van Hiele, pp.243-252. New York: Brooklyn College, C. U. N. Y.\r 31. Venema, G. A. (2006). The foundations of geometry. New Jersey, U.S.A.: Pearson Prentice Hall.\r 32. Wallace, E. C., & West, S. F. (2004). Road to geometry (3rd edition). Upper Saddle River, New Jersey, U.S.A.: Prentice Hall. \r 33. Watson, A, Jones, K, & Pratt, D. (2013). Key ideas in teaching mathematics: Research-based guidance for ages 9–19. Oxford, UK. Oxford University Press.\r 34. Wu, H. (2011). Understanding numbers in elementary school mathematics. Providence, RI: American Mathematical Society. \r 35. Wu, H. (2013). Teaching geometry in Grade 8 and high school according to the Common Core Standards. Retrieved from https://math.berkeley.edu/~wu/CCSS-Geometry_1.pdf\r  36. 林壽福（2006）。《數學樂園 ─ 從胚騰（pattern）學好數學》。台北：如何出版社。\r 37. 香港教育署數學組（2000）。《學校課程發展示例：空間探索（第一及第二學習階段）》。香港：教育署。\r 38. 香港教育署數學組（2002）。《三角形的面積》。香港：教育署。\r 39. 香港教育署數學組（2002）。《平面圖形多面體》。香港：教育署。\r 40. 香港教育署數學組（2002）。《中一至中五數學科教學資源套（五）：度量、圖形與空間範疇》。香港：教育署。\r 41. 張景中（1995）。平面幾何新路。臺北：九章出版社。\r 42. 項武義（1994）。幾何學的源起與發展。臺北：九章出版社。\r 43. 羅浩源（1997）。《生活的數學》。香港：香港教育圖書公司。\r 44. 蕭文強（1993）。《1, 2, 3, …以外：數學奇趣錄》。香港：三聯書店(香港)有限公司。\r 45. 黃毅英、張僑平、許世紅、蘇洪雨、陳鎮民、張家麟、黃麗珍、謝明初、蔡勁航（2013）。《數學教師不怕給學生難倒了！——中小學數學教師所需的數學知識》。香港：課程發展處數學教育組。", "terms": {"2020-21 Term 2": {"--LEC (5402)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Chen Kou Bun Bldg UG03"], "instructors": ["Professor LAW Huk Yuen"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}}, "2021-22 Term 2": {"--LEC (5108)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Chen Kou Bun Bldg 706B"], "instructors": ["Professor LAW Huk Yuen"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Homework or assignment": "60", "Others": "20", "Presentation": "20"}}, {"code": "3091", "title": "Contemporary Issues in Mathematics Education", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Maths & Maths Education PC", "requirements": "Prerequisite:BMED3011", "description": "The context of mathematics education has evolved rapidly, giving rise to advances in theories and practices among the community of mathematics educators and researchers. This course surveys selected current topics and trends affecting mathematics education. It aims to expand students’ horizons in frontier research and contemporary issues in mathematics education. The specific topics of this course vary from year to year, as chosen by the instructor. Topics and issues may include, but are not limited to: mathematics assessment, historical and cultural aspects of mathematics, cognitive and affective aspects of mathematics, mathematics teaching for disadvantaged groups and language issues in mathematics education. The goal of examining these selected topics is to empower students to become potential agents and leaders of curricular change in their future practice.", "outcome": " Upon completion of this course, students are expected to be able to1.       Demonstrate understanding of relevant ideas and knowledge on a particular topic or issue in mathematics education2.       Reflect and apply relevant ideas and knowledge on a particular topic or issue to mathematics learning and teaching.  完成這科後，學生期望能夠：1.  展示對某特定數學教育的課題或議題的認識2. 反思及運用某特定數學教育的課題或議題的知識於數學的學與教  ", "syllabus": "For reference only, please refer to the course of respective instructor for detailsThe specific topics of this course vary from year to year, as chosen by the instructor. 課題可因應個別導師的科目設計而作調校具體的課題將依據任教老師的專長有所不同", "required_readings": "Required readings (if any) would depend on individual instructors ", "recommended_readings": "1. Barlow, A. T., Huang, R., Law, H. Y., Chan, Y. C., Zhang, Q., Baxter, W. A., & Gaddy, A. K. (2016). Hong Kong and U.S. teachers’ perceptions of mathematical disagreements and their resolution processes. International Journal of Education in Mathematics, Science and Technology, 4(4), 299-318. doi:10.18404/ijemst.976502. Barwell, R., Moschkovich, J. N., & Phakeng, M. S.(2017). Language Diversity and Mathematics: Second Language, Bilingual, and Multilingual Learners. In J. Cai (Eds.), Compendium for Research in Mathematics Education (pp. 583 -606). National Council of Teachers of Mathematics.3. Chan , Y. C., Leung, A., & Ong, D. M. Y. (2016). Feedback and discrepancies of a physical toolkit and a digital toolkit: Opportunities and pitfalls for mediating the concept of rotational symmetry. In A. Leung & A. Baccaglini-Frank (eds.), Digital technologies in designing mathematics education tasks: Potential and pitfalls (pp 259-283). Switzerland: Springer International Publishing. doi: 10.1007/978-3-319-43423-0_134. Chan, Y. C., Wong, N. Y. (2019). Methodological issues in the investigation of values in mathematics. In P. Clarkson, W.T. Seah, & J. S. Pang (Eds.), Values and valuing in mathematics education: Scanning and scoping the territory (ICME-13 Monographs) (pp. 197-208). Cham, Switzerland: Springer Nature Switzerland AG. doi:10.1007/978-3-030-16892-6_145. Doig, B., Williams, J., Swanson, D., Ferri, R. B., Drake, P. (Eds.) (2019). Interdisciplinary mathematics education: The state of the art and beyond. Cham, Switzerland: Springer Nature Switzerland AG. doi: 10.1007/978-3-030-11066-66. Herbel-Eisenmann, B., Meaney, T., Bishop, J.P., & Heyd-Metzuyanim, E. (2017). Highlighting Heritages and Building Tasks: A Critical Analysis of Mathematics Classroom Discourse Literature. In J. Cai (Eds.), Compendium for Research in Mathematics Education (pp. 722 -765). National Council of Teachers of Mathematics.7. Huang, R. & Li, Y. (Eds.) (2017). Teaching and learning mathematics through variation: Confucian heritage meets Western theories. Rotterdam/Boston/Taipei: Sense Publishers. 8. Kieran, C., Krainer, K., & Shaughnessy, J. M. (2012). Linking Research to Practice: Teachers as Key Stakeholders in Mathematics Education Research. In A. Bishop, M.A.K. Clements, C. Keitel-Kreidt, J. Kilpatrick, C. Laborde (Eds.). Third International Handbook of Mathematics Education (pp. 361–392). doi: 10.1007/978-1-4614-4684-2_129. Lei, H., Chan, Y. C., & Leung, A. (2018). Implementation of tool-based mathematics lesson: A duo of material and digital tools. In L. Deng, W. W. K. Ma, & C. W. R. Fong (eds.) New media for educational change: Selected papers from HKAECT2018 international conference (pp. 125-139). Singapore: Springer Nature Singapore Pte Ltd. doi:10.1007/978-981-10-8896-4_1110. Liljedahl, P. & Santos-Trigo (Eds.) (2019). Mathematical problem solving: Current themes, trends and research. Cham, Switzerland: Springer Nature Switzerland AG. doi: 10.1007/978-3-030-10472-611. Lloyd, G. M.,  Cai, J., & Tarr, J. E. (2017). Issues in Curriculum Studies: Evidence-Based Insights and Future Directions. In J. Cai (Eds.), Compendium for Research in Mathematics Education (pp. 824-852). National Council of Teachers of Mathematics.12. Middleton, J., Jansen, A., & Goldin, G. A. (2017). The Complexities of Mathematical Engagement: Motivation, Affect, and Social Interactions. In J. Cai (Eds.), Compendium for Research in Mathematics Education (pp. 667 -699). National Council of Teachers of Mathematics.13. Novotná, J., Margolinas, C., & Sarrazy, B. (2012). Developing Mathematics Educators. In A. Bishop, M.A.K. Clements, C. Keitel-Kreidt, J. Kilpatrick, C. Laborde (Eds.). Third International Handbook of Mathematics Education (pp. 431–457). doi: 10.1007/978-1-4614-4684-2_1414. Pateman, N. A., & Lim, C. S. (2012). The Politics of Equity and Access in Teaching and Learning Mathematics. In A. Bishop, M.A.K. Clements, C. Keitel-Kreidt, J. Kilpatrick, C. Laborde (Eds.). Third International Handbook of Mathematics Education (pp. 243–263). doi: 10.1007/978-1-4614-4684-2_815. Radford, L., Arzarello, F., Edwards, L., & Sabena, C. (2017). The Multimodal Material Mind: Embodiment in Mathematics Education. In J. Cai (Eds.), Compendium for Research in Mathematics Education (pp. 700-721). National Council of Teachers of Mathematics.16. Roschelle, J., Noss, R., Blikstein, P., & Jackiw, N. (2017). Technology for Learning Mathematics. In J. Cai (Eds.), Compendium for Research in Mathematics Education (pp. 853-878). National Council of Teachers of Mathematics.Shimizu, Y., & Williams, G. (2012). Studying Learners in Intercultural Contexts. In A. Bishop, M.A.K. Clements, C. Keitel-Kreidt, J. Kilpatrick, C. Laborde (Eds.). Third International Handbook of Mathematics Education (pp. 145–167). doi: 10.1007/978-1-4614-4684-2_517. Sriraman, B., & Haavold, P. (2017). Creativity and giftedness in mathematics education: A pragmatic view. In J. Cai (Eds.), Compendium for Research in Mathematics Education (pp. 908-916). National Council of Teachers of Mathematics.Sriraman, B., & Nardi, E. (2012). Theories in Mathematics Education: Some Developments and Ways Forward. In A. Bishop, M.A.K. Clements, C. Keitel-Kreidt, J. Kilpatrick, C. Laborde (Eds.). Third International Handbook of Mathematics Education (pp. 303–325). doi: 10.1007/978-1-4614-4684-2_1018. Stacey, K., & Wiliam, D. (2012). Technology and Assessment in Mathematics. In A. Bishop, M.A.K. Clements, C. Keitel-Kreidt, J. Kilpatrick, C. Laborde (Eds.). Third International Handbook of Mathematics Education (pp. 721–751). doi: 10.1007/978-1-4614-4684-2_2319. Stillman, G. A, & Brown, J. P. (Eds.) (2019). Lines of inquiry in mathematical modelling research in education. Cham, Switzerland: Springer Nature Switzerland AG. doi: 10.1007/978-3-030-14931-420. Sztajn, P., Borko, H. & Smith, T. M. (2017). Research on Mathematics Professional Development. In J. Cai (Eds.), Compendium for Research in Mathematics Education (pp. 793-823). National Council of Teachers of Mathematics.Trouche, L., Drijvers, P., Gueudet, G., & Sacristán, A. I. (2012). Technology-Driven Developments and Policy Implications for Mathematics Education. In A. Bishop, M.A.K. Clements, C. Keitel-Kreidt, J. Kilpatrick, C. Laborde (Eds.). Third International Handbook of Mathematics Education (pp. 753–789). doi: 10.1007/978-1-4614-4684-2_2421. White, A. L., Jaworski, B., Agudelo-Valderrama, C., & Gooya, Z. (2012). Teachers Learning from Teachers. In A. Bishop, M.A.K. Clements, C. Keitel-Kreidt, J. Kilpatrick, C. Laborde (Eds.). Third International Handbook of Mathematics Education (pp. 393–430). doi: 10.1007/978-1-4614-4684-2_1322. Williams, J., & Goos, M. (2012). Modelling with Mathematics and Technologies. In A. Bishop, M.A.K. Clements, C. Keitel-Kreidt, J. Kilpatrick, C. Laborde (Eds.). Third International Handbook of Mathematics Education (pp. 549–569). doi: 10.1007/978-1-4614-4684-2_1823. Yu, C. H. & Lee, H. S. (2020). Creating change to improve science and mathematics education: Lessons from Hong Kong. Singapore: Springer Nature Singapore Pte Ltd. doi: 10.1007/978-981-15-3156-9", "terms": {"2020-21 Term 1": {"--LEC (5717)": {"startTimes": ["11:30", "11:30"], "endTimes": ["14:15", "14:15"], "days": [3, 1], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor CHIU Kin Fung", "Professor CHIU Kin Fung"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}, "2021-22 Term 1": {"--LEC (7584)": {"startTimes": ["11:30", "11:30"], "endTimes": ["14:15", "14:15"], "days": [3, 1], "locations": ["Hui Yeung Shing Bldg 501", "Hui Yeung Shing Bldg G06"], "instructors": ["Professor NG Oi Lam", "Professor NG Oi Lam"], "meetingDates": ["8/9", "15/9", "6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10"]}}}, "assessments": {"Essays": "80", "Presentation": "20"}}, {"code": "4510", "title": "Action Research in Mathematics Classroom", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkDiscussionLectureOthers", "campus": "Main Campus", "academic_group": "Maths & Maths Education PC", "requirements": "Prerequisite: BMED3010 or BMED3011.", "description": "This course is designed to familiarize students with the nature of action research in reflective and critical perspectives. This course also aims at familiarizing learners with the theoretical and practical aspects of action research as applied to mathematics education and with different types of data collection and analysis in a classroom setting.", "outcome": "Upon completion of this course, students are expected to be able to: 1. know about action research as a cyclic process of inquiry and its purposes of undertaking in the field of education; 2. improve their ability to read, write, and act reflectively, critically and analytically as drawn from the interpretative perspective; 3. describe the principles of action research; 4. Understand different types of data collection and analysis in a classroom setting.  5. Analyze different types of data collected during an action research project.", "syllabus": "For reference only, please refer to the course of respective instructor for details: 1. Background and characteristics of action research 2. The cyclic nature of action research and framing of problem 3. The issues as related to evidence gathering  4. Action research designs and common mathematics education research methodologies  5. The discipline of noticing", "required_readings": "Required readings (if any) would depend on individual instructors", "recommended_readings": "Recommended readings would depend on individual instructors  1. Ainley, J. (1999). Who are you today? Complementary and conflicting roles in school-based research. For the Learning of Mathematics, 19(1) 39-47  2. Anderson, T. & Shattuck, J. (2012). Design-based research: A decade of progress in education research? Educational Researcher, 41, 16–25.  3. Bencze, L., Hewitt, J., & Pedretti, E. (2009). Personalizing and contextualizing multimedia case methods in university-based teacher education: An important modification for promoting technological design in school science. Research in Science Education, 39(1), 93–109. 4. Borko H., Jacobs J., Seago N., Mangram C. (in press). Facilitating video-based professional development: Planning and orchestrating productive discussions. In Li Y., Silver E. A., Li S. (Eds.), Transforming mathematics instruction: Multiple approaches and practices. Berlin, Germany: Springer. 5. Bourner, T (2003). Assessing Reflective Learning. Education & Training, 45(5), 267-272. 6. Brennan, B., Cook, J., & Pachler, N. (2016). Reconceptualizing design research in the age of mobile learning, Interactive Learning Environments, 24(5), 938-953, doi: 10.1080/10494820.2015.1018911 7. Cai, J., Morris, A., Hohensee, C., Hwang, S. (2018). Building and Structuring Knowledge That Could Actually Improve Instructional Practice. Journal for Research in Mathematics Education, 49(3), 238–246. 8. Carson, T. R., & Sumara, D. J. (Eds.). (1997). Action research as a living practice. New York: Peter Lang. Bruner, J. (1966). Toward a theory of instruction. Cambridge, MA: Harvard University Press. 9. Choy, B.H. (2016). Snapshots of mathematics teacher noticing during task design. Mathematics education research journal, 28, 421-440. 10. Clark-Wilson, A., & Noss, R. (2015). Hiccups within technology mediated lessons: A catalyst for mathematics teachers' epistemological development. Research in Mathematics Education, 17(2). doi: 10.1080/14794802.2015.1046476 11. Creswell, J.W. (2005). Educational research. Upper Saddle River, New Jersey: Pearson. 12. Elliott, J. (2015). Educational action research as the quest for virtue in teaching. Educational Action Research, 23(1), 4-21, DOI: 10.1080/09650792.2014.994017  13. Elliott, J. (2007). Assessing the quality of action research. Research Papers in Education, 22(2), 229-246, DOI: 10.1080/02671520701296205.  14. Feldman, A. (2007). Teachers, responsibility and action research. Educational Action Research, 15(2), 239-252, DOI: 10.1080/09650790701314809 15. Frey, B. (2016). There’s a stat for that! Thousand Oaks: Sage. 16. Floro, B., & Bostic, J. (2017). A Case Study of Middle School Teachers’ Noticing During Modeling with Mathematics Tasks. In E.O. Schack, M.H. Fisher, & J.A. Wilhelm (Eds.). Teacher Noticing: Bridging and Broadening Perspectives, Contexts, and Frameworks (pp 73-89). Cham, Switzerland: Springer. 17. Gee, J.P. (2014). An introduction to discourse analysis: Theory and method. New York: Routledge. 18. Gee, J.P. (2008). A Sociocultural Perspective on Opportunity to Learn. In Assessment, Equity, and Opportunity to Learn (pp. 76-108). Cambridge, UK: Cambridge University Press  19. Gee, J. (2004) Language in the science classroom: academic social languages as the heart of school-based literacy. In E. W. Saul (Ed.) Crossing borders in literacy and science instruction (pp. 13–32) Newark, DE: International Reading Association.  20. Gee, J.P. (2002). Learning in semiotic domains: A social and situated account. In D. Schalert, C. Fairbanks, J. Worthy, B. Maloch, & J. Hoffman, Eds., The 51st yearbook of the National Reading Conference (pp. 23-32). Oak Creek, WI: NRC 21. Gibson, W. J., & Brown, A. (2009). Working with qualitative data. London: Sage. 22. Ginsburg, H.P. (1997). Entering the child’s mind: the clinical interview in psychological research and practice. Cambridge University Press, New York.  23. Grundy, S. (1994). Action research at the school level: possibilities and problems. Educational Action Research, 2(1), 23-37.  24. Hatch, J. A. (2002). Doing qualitative research in education settings. Albany, NY: State University of New York Press. 25. Herbel-Eisenmann, B. & Pimm, D. The one and the many: transcripts and the art of interpretation. For the learning of mathematics, 34(2), 38-40. 26. Hong Kong Curriculum Development Council. (2015). Ongoing Renewal of the school curriculum – Focusing, deepening and sustaining: Updating the mathematics education key learning area curriculum (primary 1 to secondary 6). Hong Kong: The Printing Department. 27. Huillet, D. (2014). Teacher as Researcher in Mathematics Education. In S. Lerman (ed.), Encyclopedia of Mathematics Education, pp.582-583. Dordrecht: Springer. 28. Huillet, D., Adler, J., & Berger, M. (2011). Teachers as researchers: Placing mathematics at the core. Education as Change, 15(1), 17-32. 29. Jacobs, V. R., Lamb, L. L. C., & Philipp, R. A. (2010). Professional noticing of children’s mathematical thinking. Journal for Research in Mathematics Education, 41(2), 169–202. 30. Kieran, C., Krainer, K., & Shaughnessy, J. M. (2013). Linking research to practice: Teachers key stakeholders in mathematics education research. In K. Clements, A. Bishop, C. Keitel, J. Kilpatrick, & F. Leung, (Eds.), Third international handbook of research in mathematics education (pp. 361–392). New York, NY: Springer. 31. Koehler, M., & Mishra, P. (2009). What is technological pedagogical content knowledge (TPACK)? Contemporary Issues in Technology and Teacher Education, 9(1), 60–70. 32. Lave, J., & Wenger, E. (1999). Situated learning: Legitimate peripheral participation. Cambridge: Cambridge University Press. 33. Mason, J. (2002). Researching your own practice: The discipline of noticing. NY: Routledge. 34. Mason, J. (2008). Being mathematical with and in front of learners: attention, awareness and attitude as sources of differences between teacher educators, teachers and learners. International handbook of mathematics teacher education: pp.31-56. 35. Mason, J. (2016). Rising above a cause-and-effect stance in mathematics education research, Journal of Mathematics Teacher Education, 19(4), 297–300 36. Mason, J. (2017). Probing Beneath the Surface of Experience. In E.O. Schack, M.H. Fisher, & J.A. Wilhelm (Eds.). Teacher Noticing: Bridging and Broadening Perspectives, Contexts, and Frameworks (pp 1-17). New York: Springer. 37. Maher, S.A., & Sigley, R. (2014). Task-Based Interviews in Mathematics Education. In S. Lerman (ed.), Encyclopedia of Mathematics Education, pp.579-582. Dordrecht: Springer. 38. McNiff, J. (1991). Action research: Principles and practice. London: Routledge. 39. McNiff, J., & Whitehead, J. (1996). You and your action research project. London: Routledge. 40. Nyanjom, J. (2017). Cycles within cycles: instilling structure into a mentoring self-study action research project, Educational Action Research, DOI: 10.1080/09650792.2017.1386116.  41. Rich, P., & Hannafin, M. J. (2008). Capturing and assessing evidence of student teacher inquiry: A case study. Teaching and Teacher Education, 24(6), 1426–1440. 42. Roche, M. (2011). Creating a dialogical and critical classroom: reflection and action to improve practice. Educational Action Research, 19(3), 327-343, DOI: 10.1080/09650792.2011.600607  43. Roschelle, J. (2006, August). Effective integration of dynamic representations and collaboration to enhance mathematics and science learning. Keynote address at Curriculum Corporation 13th National Conference. Adelaide, Australia. 44. Schack, E.O., Fisher, M.H., & Wilhelm, J.A. Teacher Noticing: Bridging and Broadening Perspectives, Contexts, and Frameworks. New York: Springer. 45. Sherin, M. G., Jacobs, V. R., Philipp, R. A., & Sherin, M. G. (Ed.) (2011). Mathematics teacher noticing: Seeing through teachers' eyes. New York: Taylor and Francies. 46. Star, J. R., & Strickland, S. K. (2008). Learning to observe: using video to improve preservice mathematics teachers’ ability to notice. Journal of Mathematics Teacher Education, 11(2), 107–125. doi:10.1007/s10857-007-9063-7 47. Star, J. R., Lynch, K., & Perova, N. (2011). Using video to improve preservice mathematics teachers’ abilities to attend to classroom features. In M. G. Sherin, V. R. Jacobs, & R. A. Philipp (Eds.), Mathematics teacher noticing: Seeing through teachers’ eyes (pp. 117–133). New York: Routledge. 48. Strauss, A., & Corbin, J. (1990). Basics of qualitative research: Grounded theory procedures and techniques. Thousand Oaks, CA: Sage.  49. Stenhouse, L. (1981). What Counts as Research? British Journal of Educational Studies, 29, 103-114.  50. Tracy, S. (2010). Qualitative Quality: Eight “Big-Tent” Criteria for Excellent Qualitative Research. Qualitative Inquiry, 16(10), 837–851. 51. Tripp, T., & Rich, P. (2012). Using video to analyze Stringer, E.T. (2014). Action Research. Thousand Oaks: Sage. 52. Wilkinson, S., & Kitzinger, C. (2011), ‘Conversation analysis’, in K. Hyland and B. Paltridge (Eds), Continuum Companion to Discourse Analysis (pp. 22–37.). London: Continuum. 53. Zeni, J. (1988). A guide to ethical issues and action research. Educational Action Research, 6(1), 9-19.  54. van Es, E.A., Tunney, J., Goldsmith, L.T., Seago, N. (2014). A Framework for the Facilitation of Teachers’ Analysis of Video. Journal of Teacher Education, 65(4), 340-356.", "terms": {"2020-21 Term 2": {"--LEC (8475)": {"startTimes": ["13:30", "13:30"], "endTimes": ["16:15", "16:15"], "days": [1, 3], "locations": ["Wong Foo Yuan Bldg UG01", "Wong Foo Yuan Bldg UG01"], "instructors": ["Professor CHIU Kin Fung, \n\rProfessor NG Oi Lam", "Professor CHIU Kin Fung, \n\rProfessor NG Oi Lam"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2", "13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (4451)": {"startTimes": ["11:30", "11:30"], "endTimes": ["14:15", "14:15"], "days": [3, 1], "locations": ["Chen Kou Bun Bldg UG04", "Esther Lee Bldg 306"], "instructors": ["Professor CHIU Kin Fung", "Professor CHIU Kin Fung"], "meetingDates": ["12/1", "19/1", "26/1", "10/1", "17/1", "24/1"]}}}, "assessments": {"Homework or assignment": "25", "Others": "50", "Presentation": "25"}}, {"code": "4520", "title": "Mathematics Teaching Project Report", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionField Studies/Field-tripIndependent Study", "campus": "Main Campus", "academic_group": "Maths & Maths Education PC", "requirements": "Prerequisite:(a) Either BMED3010 or BMED3011 AND (b) BMED4510", "description": "This course aims at providing students with guidelines in developing their own research plans in reflecting and critically assessing their professional practices by adopting multiple research perspectives for inquiry in education in general and in mathematics education in particular.", "outcome": "Upon completion of this course, students are expected to be able to: 1. be aware of the importance and relevance of research ethics 2. be able to design and construct their own research plans in accordance with multiple research methodologies.  學生修畢本科後，能夠: 1. 明白準繩及中肯為研究的道德標準 2. 根據多元研究取向，設計及建構自己的研究計劃", "syllabus": "For reference only, please refer to the course of respective instructor for details: Independent study：Meeting and reporting of the progress to the Supervisor  課題可因應個別導師的科目設計而作調校: 與指導老師會面及匯報有關進度", "required_readings": "Required readings (if any) would depend on individual instructors  1. Denscombe M. (2007). The Good Research Guide for Small-scale Social Research Projects. McGraw Hill. Open University Press. 2. Stringer, E. (2004). Action research in education. Upper Saddle River, N.J.: Pearson/Merrill/Prentice Hall. 3. Zeichner, K.M. (2009). Teacher education and the struggle for social justice. New York/ London: Routledge.", "recommended_readings": "Recommended readings would depend on individual instructors  1. Cho, J., & Trent, A. (2006). Validity in qualitative research revisited. Qualitative Research, 6(3), 319-340. 2. Howes, A., Davies, S.M.B., & Fox, S. (2009). Improving context for inclusion: Personalising teacher development through collaborative action research. London/ New York: Routledge. 3. Sayer, A. (2010). Method in social science: A realist approach. (Revised 2nd ed.). London/ New York: Routledge. 4. Slavit, D., Nelson, T.H., & Kennedy, A. (Eds.) (2009). Perspectives on supported collaborative teacher inquiry. New York/ London: Routledge.  Periodicals 1. College Mathematics Journal 2. Journal for Research in Mathematics Education 3. The Mathematical Gazette 4. Mathematics Magazine 5. Mathematics Teacher 6. Mathematics Teaching in the Middle School 7. 《數學教育》(EduMath) 8. 《數學教學》 9. 《數學傳播》 10. 《數學教育學報》 11. 《臺灣數學教育期刊》 12. 《教育學報》", "terms": {"2020-21 Term 1": {"AF01-FLD (6121)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor LAU Wing Fat, \n\rProfessor NG Oi Lam"], "meetingDates": ["13/09/2020 - 01/11/2020"]}}, "2020-21 Term 2": {"-F01-FLD (7622)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHIU Kin Fung, \n\rProfessor NG Oi Lam"], "meetingDates": ["17/01/2021 - 25/04/2021"]}}, "2021-22 Term 2": {"-F01-FLD (7025)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHIU Kin Fung, \n\rProfessor NG Oi Lam"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}}, {"code": "4910", "title": "Independent Study I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Independent Study", "campus": "Main Campus", "academic_group": "Maths & Maths Education PC", "requirements": "Prerequisite: BMED3010 or BMED3011, and BMED4510.", "description": "The Independent Study is an elective course during the final year of our BEd. Programme. It has a course weighting of 3 credit units. The workload and expectations are similar to those of the equivalent number of one course. It aims to develop the student’s ability to conduct independent research in the area of mathematics and mathematics education. The development, undertaking and completion of the Study are the culmination of the BEd. learning experience and the student must take and pass the course of BMED4510 Action Research in Mathematics Classroom (數學教學行動研究) prior to enrolling to this course. It is intended to be a largely independent piece of work, which is aimed at combining and utilizing the research skills and knowledge developed and gained from other relevant previous courses, and using these to complete a piece of original research within the student’s area of interest. The course structure of Independent Study I (BMED4910) is same as Independent Study II (BMED4920) and the latter serves as an extension of the former.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4920", "title": "Independent Study II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Independent Study", "campus": "Main Campus", "academic_group": "Maths & Maths Education PC", "requirements": "Prerequisite: BMED3010 or BMED3011, and BMED4510", "description": "The Independent Study is an elective course during the final year of our BEd. Programme. It has a course weighting of 3 credit units. The workload and expectations are similar to those of the equivalent number of one course. It aims to develop the student’s ability to conduct independent research in the area of mathematics and mathematics education. The development, undertaking and completion of the Study are the culmination of the BEd. learning experience and the student must take and pass the course of BMED4510 Action Research in Mathematics Classroom (數學教學行動研究) prior to enrolling to this course. It is intended to be a largely independent piece of work, which is aimed at combining and utilizing the research skills and knowledge developed and gained from other relevant previous courses, and using these to complete a piece of original research within the student’s area of interest. The course structure of Independent Study II (BMED4920) is same as Independent Study I (BMED4910) and the former serves as an extension of the latter.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]