[{"code": "3111", "title": "Ageing, Health and Society", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkLectureWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this course is to provide students with a basic understanding of population ageing from the bio-physiological and sociological perspectives. It focuses on the development of a multi-dimensional understanding of the factors that affect the health of older adults and the ways that socio-demographic changes shape societal attitudes towards old age. Emphasis is placed on discussions of the impact of population ageing on the social and health care needs of a society.\r", "outcome": "Upon completion of this course, students will be able to: 1. Analyze the global trends of population ageing and their impact on health care, social and economic issues in society. 2. Develop theoretical understandings in the societal changes in ageing. 3. Justify the social construction of \"age\" and \"ageing process\" in individual and social contexts. 4. Synthesize the impact of population ageing on health and social care needs in society.", "syllabus": "Major concepts and topics to be covered: 1. Global trends of population ageing. 2. Ageing theories. 3. Gender issues in old age. 4. Health patterning among older adults. 5. Changing roles and relationships over life course. 6. Social construction of being old. 7. Ageing and medicalization. 8. Ethical and social dilemma in care for older adults. 9. Ageing and health policy. 10. Impact of population ageing on health and social care in society.", "required_readings": "Please refer to course outline. ", "recommended_readings": "Binstock, R. H., & George, L. K. (Eds.). (2011). Handbook of aging and the social sciences. (7th ed.). Boston: Elsevier/Academic Press. Dannefer, D., & Phillipson, C. (2010). The SAGE handbook of social gerontology. London: SAGE. Hooyman, N. R., & Kiyak, H. A. (2011). Social gerontology: A multidisciplinary perspective. Boston, MA: Allyn & Bacon. Gratton, L., & Scott, A. (2016). The 100-year life. London: Bloomsbury. Higgs, P., & Gilleard, C. (2015). Rethinking old age: Theorising the fourth age. London: Palgrave. Hyde, M., & Higgs, P. (2016). Ageing and globalization. Bristol: Policy Press. Hillier, S. M., & Barrow, G. M. (2015). Aging, the individual, and society. Stamford, CT: Cengage Learning. Phillipson, C. (2013). Ageing. Cambridge: Polity Press. Phillips, J. E., Ajrouch, K., & Hillcoat-Nallétamby, S. (Eds.). (2010). Key concepts in social gerontology. Los Angeles: SAGE. Settersten, R.A. Jr., & Angel, J.L. (2011). (Eds.), Handbook of sociology of aging. New York: Springer Verlag.", "terms": {"2020-21 Term 1": {"--LEC (6213)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr CHENG Yeung Hung"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}, "2021-22 Term 1": {"--LEC (7172)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Wu Ho Man Yuen Bldg 502"], "instructors": ["Dr CHENG Yeung Hung"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Homework or assignment": "80", "Presentation": "20"}}, {"code": "3112", "title": "Basic Care in Gerontology", "career": "Undergraduate", "units": "4.00", "grading": "Graded", "components": "Field Studies/Field-tripLaboratoryLectureOthersInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this course is to equip students with foundational knowledge and essential skills to address the basic care needs of older people. Emphasis is placed on promoting an understanding of the basic principles of care to help older people to meet their basic life needs. Fundamental concepts such as nutrition, exercise, oral care, basic hygiene care, foot and nail care, communication, and psychosocial care are also covered.\r", "outcome": "Upon completion of this course, students will be able to:  1. Explain the purposes and content of various geriatric assessment tools. 2. Demonstrate the ability to conduct comprehensive assessment to determine the biopsychosocial needs and conditions of the older people and their families. 3. Formulate individualized care plan and deliver client education for the older people and their families. 4. Describe the principles and demonstrate the ability to perform basic skills for providing care to older people safely and effectively. 5. Discuss the special issues relating to the provision of basic care to older people. The issues include infection control, occupational safety, promotion of independence, advanced and assisted technologies, and interprofessional practice. 6. Develop an awareness of providing current, innovative and evidence-based care through the application of relevant research findings, and lead innovation in aged care.", "syllabus": "Major concepts and topics to be covered: 1. Methods of conducting a comprehensive assessment to identify basic care needs of older people. The content includes vital signs monitoring, blood glucose monitoring, skin inspection, assessment of activities of daily living (ADL) and cognitive and mood assessment, that reflect the body's physiologic status. 2. Risk assessment for common physical and psychosocial problems in older people, such as constipation, fall, depression and social isolation, and the associated preventive measures. 3. Principles and skills commonly adopted in care delivery to address the basic needs of older people, including skin care, oral care, basic hygiene care, foot and nail care, sleep hygiene, nutrition and mobility. 4. Knowledge and skills in supporting healthcare professionals to deliver complex geriatric medical and nursing care. 5. Special issues relating to the provision of basic care to older people. These issues include infection control, occupational safety, promotion of independence, first aid, advanced and assisted technologies.", "required_readings": "Please refer to course outline.", "recommended_readings": "Boltz, M., Ebrary, Inc, ProQuest, & ProQuest CSA. (2016). Evidence-based Geriatric Nursing Protocols for Best Practice [electronic Resource]. Carter, P. J. (2017). Lippincott's essentials for nursing assistants: A humanistic approach to caregiving (4th ed.). Philadelphia: Wolters Kluwe. Keady, J., & Watts, S. (2011). Mental health and later life: Delivering a holistic model for practice. New York, NY: Routledge. Kydd, A., Duffy, T., & Duffy F. J. R. (Eds.) (2009). The care and wellbeing of older people: A textbook for health care students. Exeter, Devon: Reflect Press. Miller, C. A. (2015). Nursing for wellness in older adults (7th ed.). Philadelphia: Wolters Kluwer. Touhy, T.A., & Jett, K.F. (2018). Ebersole and Hess' gerontological nursing and healthy aging (5th ed.). St. Louis, Missouri: Elsevier.", "terms": {"2020-21 Term 1": {"--LEC (7749)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Yasumoto Int'l Acad Park 505"], "instructors": ["Ms. KWOK Ching Man"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}, "-L01-LAB (7748)": {"startTimes": ["13:30"], "endTimes": ["15:15"], "days": [3], "locations": ["TBA"], "instructors": ["Ms. KWOK Ching Man"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}, "-L02-LAB (7747)": {"startTimes": ["15:30"], "endTimes": ["17:15"], "days": [3], "locations": ["TBA"], "instructors": ["Ms. KWOK Ching Man"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2021-22 Term 1": {"--LEC (7670)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Wu Ho Man Yuen Bldg 402"], "instructors": ["Ms. KWOK Ching Man"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}, "-L01-LAB (7834)": {"startTimes": ["13:30"], "endTimes": ["15:15"], "days": [3], "locations": ["TBA"], "instructors": ["Ms. KWOK Ching Man"], "meetingDates": ["8/9", "15/9"]}, "-L02-LAB (7835)": {"startTimes": ["15:30"], "endTimes": ["17:15"], "days": [3], "locations": ["TBA"], "instructors": ["Ms. KWOK Ching Man"], "meetingDates": ["8/9", "15/9"]}}}}, {"code": "3113", "title": "Promoting Successful Ageing: Individual and Societal Perspectives", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive TutorialVisit", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this course is to provide students with a comprehensive overview of the concepts, principles and theories of successful ageing from the health and social perspectives. Emphasis is placed on exploring and discussing the subjective and objective dimensions of successful ageing, the modifiable factors affecting the achievement of successful ageing, and the strategies to promote successful ageing at both individual and societal levels.", "outcome": "Upon completion of this course, students will be able to:  1. Describe the different terminologies and definitions of successful ageing. 2. Describe the concepts and principles of successful ageing from a theoretical perspective and a lay perspective. 3. Discuss the attributes representing successful ageing from both subjective and objective dimensions. 4. Discuss how successful ageing is related to the adaptation of physical, psychosocial and cognitive changes in later life. 5. Discuss how successful ageing is related to social change and the social environment. 6. Discuss the strategies to promote successful ageing at individual, family and societal levels. 7. Discuss the concepts and strategies to build an age-friendly community.", "syllabus": "Major concepts and topics to be covered: 1. Concepts and principles of successful ageing 2. Biographical approaches to care in relation to successful ageing 3. Factors affecting successful ageing 4. Adapting to successful ageing 5. Promoting successful ageing 6. Concepts of age-friendly community", "required_readings": "Please refer to course outline. ", "recommended_readings": "Bülow, M. H., & Söderqvist, T. (2014). Successful ageing: A historical overview and critical analysis of a successful concept. Journal of Aging Studies, 31, 139–149. Cheng, S. T., Chi, I., Fung, H. H., Li, L. W. & Woo, J (Eds.). (2015). Successful Aging: Asian Perspectives. Dordrecht: Springer Netherlands: Imprint: Springer. [eBook] Ferraro, K. F., & Wilmoth, J. M. (2013). Gerontology: Perspectives and Issues (4th ed.). New York: Springer Publishing Company. [eBook] Fillit, H. M., Rockwood, K., & Young, J. (2017). Brocklehurst's textbook of geriatric medicine and gerontology (8th ed.). Philadelphia: Saunders/Elsevier. [eBook] Iecovich, E. (2014). Aging in place: From theory to practice. Anthropological Notebooks, 20(1), 21–33. Janssen, B., Janssen, T., & Van Regenmortel, T. (2011). Identifying sources of strength: Resilience from the perspective of older people receiving long-term community care. European Journal of Ageing, 8(3), 145-156. doi:10.1007/s10433-011-0190-8 Li, C., Lin, C., Lin, W., Liu, C., Chang, C., Meng, N., Lin, C. (2014). Successful aging defined by health- related quality of life and its determinants in community-dwelling elders. BMC Public Health, 14(1), 1013-1013. doi:10.1186/1471-2458-14-1013 Lowry, K., Vallejo, A., & Studenski, S. A. (2012). Successful aging as a continuum of functional independence: Lessons from physical disability models of aging. Aging and Disease, 3(1), 5–15. Moody, H. R., & Sasser, J. R. (2018). Aging: Concepts and controversies (9th ed.). Thousand Oaks, California: SAGE Publications, Inc. Pfeiffer, E. (2013). Winning strategies for successful aging. New Haven Conn.: Yale University Press. Rowe, J. W., & Kahn, R. L. (2015). Successful aging 2.0: conceptual expansions for the 21st century. Journals of Gerontology, Series B: Psychological Sciences and Social Sciences, 70(4), 593–596. Woo, J. (2013). Aging in Hong Kong: A Comparative Perspective. Boston, MA: Springer.", "terms": {"2020-21 Term 1": {"--LEC (5846)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Mr. FUNG Kwong Wing"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}, "-T01-TUT (5847)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Mr. FUNG Kwong Wing"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}, "2021-22 Term 1": {"--LEC (7256)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Wu Ho Man Yuen Bldg 502"], "instructors": ["Mr. HA Kong Nam"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}, "-T01-TUT (7827)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [1], "locations": ["No Room Required"], "instructors": ["Mr. HA Kong Nam"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Homework or assignment": "60", "Presentation": "40"}}, {"code": "3114", "title": "Psychology in Ageing: Theories and Application", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this course is to provide students with a basic understanding of the concepts and theoretical approaches of psychology relevant to ageing and aged care in various care settings. Emphasis is placed on the application of these concepts to understand individual and group behaviour and the health and social care needs of individuals and groups.\r", "outcome": "Upon completion of this course, students will be able to:  1. Discuss the psychological changes throughout the lifespan. 2. Demonstrate understanding of the influence of motivation, emotion, learning, memory and personality on individual and group behaviour of older people in various health and social care settings. 3. Discuss the purposes and approaches of enhancing psychological well-being in older people. 4. Discuss the common major life events and challenges among older people and integrate psychological theories to explain the impact on psychological well-being. 5. Identify interventions to promote psychological adaptation to ageing. 6. Demonstrate effective communication and basic counseling skills in the care of older people.", "syllabus": "Major concepts and topics to be covered: 1. Introduction to theories of psychosocial functions: motivation and emotion, stress and coping. 2. Psychological changes throughout the lifespan, and the common psychological problems and psychological therapies. 3. The effects of learning, memory and personality on the behaviour of older population in various health and social care settings. 4. Methods, approaches and challenges to assess psychological well-being of older people. 5. Understanding the major events in later life and helping older people to cope with grief and loss. 6. Health psychology for older people. 7. Promoting psychosocial well-being in older people. 8. Understanding the psychological aspects of pain. 9. Culture, communication and counseling skills in aged care.", "required_readings": "Stuart-Hamiliton, I. (2012). Psychology of ageing: An introduction (5th ed.). Philadelphia: Jessica Kingsley Publishers.", "recommended_readings": "Schaie, K. W., & Will, S. L. (2015). Handbook of psychology of aging. London: Elsevier.", "terms": {"2020-21 Term 1": {"--LEC (6209)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Dr. TANG Wing Ki"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}, "-T01-TUT (5217)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Dr. TANG Wing Ki"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2021-22 Term 1": {"--LEC (7170)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Cheng Yu Tung Building 215"], "instructors": ["Dr. TANG Wing Ki"], "meetingDates": ["8/9", "15/9"]}, "-T01-TUT (7757)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["No Room Required"], "instructors": ["Dr. TANG Wing Ki"], "meetingDates": ["8/9", "15/9"]}}}, "assessments": {"Examination": "80", "Others": "20"}}, {"code": "3211", "title": "Chronic Disease Management in Ageing", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-tripLaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "This course comprises both theoretical and practical components to enhance students’ understanding of the complexities of caring for older people with major chronic diseases. It takes an interdisciplinary approach to chronic disease management from the health and social perspectives. Emphasis is placed on the care designed to directly address the physical and psychosocial consequences of chronic disease for older people and their caregivers.\r", "outcome": "Upon completion of this course, students will be able to: \r 1. Discuss the physical and psychosocial impacts of chronic diseases on older people.\r 2. Identify the roles of different healthcare disciplines in managing major chronic diseases in older people.\r 3. Identify the issues relating to pharmaceutical care in older people.\r 4. Understand the concepts of multiple morbidity and comorbidity and their implications for long-term care.\r 5. Discuss the self-care models for chronic disease management and strategies to empower older people managing their diseases. \r 6. Discuss the types and roles of community resources in supporting older people living with chronic conditions.\r 7. Define quality of life and justify the interventions for promoting positive adjustment in older people with chronic diseases.\r 8. Apply related principles and utilise research findings in the care of older people with chronic diseases.\r 9. Discuss the role of complementary and alternative medicine in chronic disease management.\r 10. Demonstrate the ability to offer psychosocial support and interventions in caring for older people experiencing chronic diseases and their families.", "syllabus": "Major concepts and topics to be covered:\r 1. Major chronic diseases among older people: prevalence, etiology and clinical manifestations.\r 2. The impacts of major chronic diseases on physical and psychosocial health of older people.\r 3. The roles of different healthcare disciplines in chronic disease management.\r 4. Special considerations for supporting pharmaceutical care in older people.\r 5. The changing patterns of disease and illness.\r 6. Biographical disruption regarding on chronic illness.\r 7. Help-seeking and responses to treatment.\r 8. The concepts of multiple morbidity and comorbidity and their implications for long-term care.\r 9. Conceptual models to explain self-care and patient empowerment strategies.\r 10. Introduction to innovative models of chronic disease management.\r 11. The role and trend towards integrating complementary and alternative medicine in chronic disease management.\r 12. The concept of quality of life and interventions for promoting positive adjustment in older people with chronic diseases.", "required_readings": "", "recommended_readings": "Cash, J. C., & Glass, C. A. (Eds). (2016). Adult-gerontology practice guidelines. New York, NY: Springer Publishing Company.\r Dahlkemper, T. R., & Anderson, M. A. (2016). Caring for older adults holistically (6th ed.). Philadelphia, PA: F.A. Davis Company.\r Farooqui, T., & Farooqui, A. A. (Eds.). (2015). Diet and exercise in cognitive function and neurological diseases. New Jersey: Wiley Blackwell.\r Grassman, E. J., & Whitaker, A. (Eds). (2013). Ageing with disability. A lifecourse perspective. Chicago, IL: Policy Press.\r Haber, D. (2016). Health promotion and aging. Practical applications for health professionals (7th ed.). New York: Springer Publishing Company.\r Hirth, V., Wieland, D., & Dever-Bumba, M. (2011). Case-based geriatrics. A global approach. New York: McGraw Hill Companies, Inc.\r Hooyman, N. R., & Kiyak, H. A. (2011). Social gerontology. A multidisciplinary perspective. (9th ed.). New York: Allyn and Bacon.\r Kogan, M. (Ed.). (2018). Integrative geriatric medicine. New York: Oxford University Press.\r Kane, R. L., Ouslander, J. G., Resnick, B., & Malone, M. L. (Eds.). (2018). Essentials of clinical geriatrics (8th ed.). New York: McGraw-Hill Education.\r Larsen, P. D. (Ed.). (2016). Lubkin's chronic illness: Impact and intervention (9th ed.). Burlington, MA: Jones and Bartlett Learning.\r Malone, M. L., Capezuti, E. A., & Palmer, R. M. (Eds). (2015). Geriatrics models of care: Bringing 'best practice' to an aging America. Cham, Switzerland: Springer International Publishing.\r McEvoy, P. J. (2014). Chronic disease management: A new paradigm for care. New York, N. Y.: Radcliffe Publishing.", "terms": {"2020-21 Term 2": {"--LEC (5660)": {"startTimes": ["10:30", "14:30"], "endTimes": ["12:15", "16:15"], "days": [2, 3], "locations": ["Wu Ho Man Yuen Bldg 505", "Yasumoto Int'l Acad Park LT9"], "instructors": ["Mr. HA Kong Nam", "Mr. HA Kong Nam"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2", "13/1", "20/1", "27/1", "3/2", "10/2"]}, "-L01-LAB (5679)": {"startTimes": ["10:30", "14:30"], "endTimes": ["12:15", "16:15"], "days": [2, 3], "locations": ["TBA", "TBA"], "instructors": ["Mr. HA Kong Nam", "Mr. HA Kong Nam"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2", "13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (7985)": {"startTimes": ["10:30", "14:30"], "endTimes": ["12:15", "16:15"], "days": [2, 3], "locations": ["Wu Ho Man Yuen Bldg 502", "Lee Shau Kee Archi Bldg 211"], "instructors": ["Mr. HA Kong Nam", "Mr. HA Kong Nam"], "meetingDates": ["11/1", "18/1", "25/1", "12/1", "19/1", "26/1"]}, "-L01-LAB (8144)": {"startTimes": ["10:30", "14:30"], "endTimes": ["12:15", "16:15"], "days": [2, 3], "locations": ["TBA", "TBA"], "instructors": ["Mr. HA Kong Nam", "Mr. HA Kong Nam"], "meetingDates": ["11/1", "18/1", "25/1", "12/1", "19/1", "26/1"]}}}, "assessments": {"Essay test or exam": "80", "Short answer test or exam": "20"}}, {"code": "3212", "title": "Death, Dying and End-of-life Care", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "LaboratoryLectureOthersInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "This course aims to provide students with a basic understanding of the concepts and principles of end-of-life care, and to equip them with essential knowledge and skills in the provision of hospice care and advance care planning to older people with terminal illness sufferers and their families.\r", "outcome": "Upon completion of this course, students will be able to:  1. Describe the trend of mortality in recent decades and the development of palliative care. 2. Define the concepts of death, end of life, self-awareness on death and dying, and discuss the stages of grief process and corresponding somatic and psychological symptoms. 3. Identify the influence of personal experience, health and socio-cultural factors on perceptions of death, dying and quality of life. 4. Develop effective communication skills in conversations concerning death and dying issues. 5. Demonstrate the ability to conduct advance care planning and evaluate its outcomes. 6. Discuss appropriate interventions for managing physical symptoms and emotional distress for clients at the end of life. 7. Devise ways for addressing psychosocial and spiritual needs for clients and their families.", "syllabus": "Major concepts and topics to be covered: 1. Development and principles of palliative care  a) Mortality trend in older adults b) Development of palliative care: historical perspectives, philosophies, services and resources c) Principles for delivery of end-of-life care 2. Concepts of death, dying and end-of-life a) Concepts of death, dying and end-of-life b) Grief process and symptoms c) Bereavement care and care for caregivers and relating procedures d) Factors influencing perceptions of death, dying and quality of life: personal experience, health and socio-cultural factors e) Self-awareness on death and dying 3. Communication a) Communication and basic counselling skills, care for the carer, family care and support at end stage 4. End-of-life care model, delivery and management a) End-of-life care models and advance directives b) Quality of life assessment c) Advance care planning programme and evaluation d) Management of older adults with terminal illness (I): Age-related changes, risk factors, common cancers in older adults and impacts on physical and psychological well-being e) Management of older adults with terminal illness (II): Palliative treatments, physical care, symptoms and pain management. f) Community programmes for older persons planning on death and dying g) Dying in place for older adults as a choice", "required_readings": "Please refer to course outline. ", "recommended_readings": "Brinkman-Stoppelenburg, A., Rietjens, J. A., & van der Heide, A. (2014). The effects of advance care planning on end-of-life care: a systematic review. Palliative medicine, 28(8), 1000-1025. Callanan, M. (2009). Final journeys: A practical guide for bringing care and comfort at the end of life. New York: Bantam. Chan, H. Y. L. & Pang, S. M. C. (2010). Let Me Talk – an advance care planning programme for frail nursing home residents. Journal of Clinical Nursing, 19, 3073-3084.  Chan, H. Y., Yu, D. S., Leung, D. Y., Chan, A. W., & Hui, E. (2016). Quality of life and palliative care needs of elderly patients with advanced heart failure. Journal of geriatric cardiology: JGC, 13(5), 420. Corr, C. A., Corr, C., Nabe, C., & Corr, D. (2012). Death and dying life and living (7th ed.). Belmont CA: Wadsworth. Ellershaw, J., & Wilkinson, S. (2011). Care of the dying: A pathway to excellence (2nd ed.). Oxford: Oxford University Press. (E-copy) Keegan, L., & Drick, C.A. (2011). End of life: Nursing solutions for death with dignity. New York: Springer.  Kinzbrunner, B. M., & Policzer, J. S. (2011). End of life care: A practical guide (2nd ed.). New York: McGraw-Hill Medical.  Leming, M. L., & Dickinson, G. E. (2011). Understanding dying, death and bereavement (7th ed.). CA: Cengage.  Lum, H. D., Sudore, R. L., Bekelman, D. B. (2015). Advance care planning in the elderly. Medical Clinic in America, 99, 391-403. Lynn, J. (2008). Improving care for the end of life: A sourcebook for health care managers and clinicians (2nd ed.). Oxford: Oxford University Press.  Scherer, L. S. (Ed.) (2014). Death and dying. Farmington Hills: Greenhaven Press. (E-copy) Thomas, K., & Lobo, B. (Ed.) (2011). Advance care planning in end of life care. Oxford: Oxford University Press. (E-copy) Watts, J. H. (2010). Death, dying and bereavement. Edinburgh: Dunedin Academic. (E-copy)", "terms": {"2020-21 Term 1": {"--LEC (7202)": {"startTimes": ["9:30", "9:30", "9:30", "9:30"], "endTimes": ["17:15", "17:15", "12:15", "17:15"], "days": [1, 2, 3, 4], "locations": ["Online Teaching", "Online Teaching", "Online Teaching", "Online Teaching"], "instructors": ["Ms. KWAN Siu Kuen", "Ms. KWAN Siu Kuen", "Ms. KWAN Siu Kuen", "Ms. KWAN Siu Kuen"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12", "8/10", "15/10", "22/10", "29/10", "5/11", "12/11", "19/11", "26/11", "3/12"]}, "-T01-TUT (7203)": {"startTimes": ["9:30", "9:30", "9:30", "9:30"], "endTimes": ["17:15", "17:15", "17:15", "17:15"], "days": [1, 4, 2, 3], "locations": ["Online Teaching", "Online Teaching", "Online Teaching", "Online Teaching"], "instructors": ["Ms. KWAN Siu Kuen", "Ms. KWAN Siu Kuen", "Ms. KWAN Siu Kuen", "Ms. KWAN Siu Kuen"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "10/9", "17/9", "24/9", "8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2021-22 Term 1": {"--LEC (7260)": {"startTimes": ["9:30", "9:30", "9:30", "9:30"], "endTimes": ["17:15", "17:15", "17:15", "17:15"], "days": [1, 3, 4, 2], "locations": ["Esther Lee Bldg 207", "Esther Lee Bldg 205", "Lee Shau Kee Archi Bldg 211", "Lee Shau Kee Archi Bldg G02"], "instructors": ["Ms. KWAN Siu Kuen", "Ms. KWAN Siu Kuen", "Ms. KWAN Siu Kuen", "Ms. KWAN Siu Kuen"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11", "8/9", "15/9", "9/9", "16/9", "23/9", "30/9", "7/10", "7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}, "-T01-TUT (7789)": {"startTimes": ["9:30", "9:30", "9:30", "9:30"], "endTimes": ["17:15", "17:15", "17:15", "17:15"], "days": [1, 4, 2, 3], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Ms. KWAN Siu Kuen", "Ms. KWAN Siu Kuen", "Ms. KWAN Siu Kuen", "Ms. KWAN Siu Kuen"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11", "9/9", "16/9", "23/9", "30/9", "7/10", "7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11", "8/9", "15/9"]}}}, "assessments": {"Examination": "70", "Others": "30"}}, {"code": "3213", "title": "Dementia: Prevention and Management", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive TutorialVisit", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this course is to provide students with a comprehensive overview of the pathophysiological, behavioural and psychosocial aspects of dementia. Emphasis is placed on equipping students with the knowledge and skills required to prevent, detect and manage dementia in older people. The course also highlights the roles of family caregivers, multidisciplinary care team, and community care services in managing dementia.\r", "outcome": "Upon completion of this course, students will be able to:\r 1. Describe the etiologies, pathophysiologies, risk factors, types, and stages of dementia.\r 2. Describe the comprehensive health and social assessment for dementia.\r 3. Discuss the physical, cognitive, behavioural and psychosocial manifestations of dementia and the patients' care needs.\r 4. Describe the pharmacological and non-pharmacological interventions for dementia.\r 5. Discuss the evidence-based care in managing dementia in community, rehabilitative and long-term care settings.\r 6. Describe the role of assistive technology in dementia care and drive innovation in practice.\r 7. Discuss the interventions to maintain and promote brain health.\r 8. Discuss the role of interprofessional team approach in the care of older people with dementia and their caregivers and families.\r 9. Discuss the role of informal caregivers in the care of older people with dementia.\r 10. Discuss the role of health and social care services in the care of older people with dementia.", "syllabus": "Major concepts and topics to be covered:\r 1. Overview of dementia: Definition, types, pathophysiology, risk factors, diagnosis, staging, pharmacological management and promoting brain health.\r 2. Sociological understanding of dementia.\r 3. Comprehensive health and social assessment for dementia.\r 4. Manifestations of dementia: physical, behavioural and psychosocial perspectives.\r 5. Communication with dementia clients.\r 6. Managing challenging behaviours.\r 7. Non-pharmacological interventions for dementia: Cognitive interventions for people with dementia; Practice sharing by music therapist and horticulture therapist.\r 8. Evidence-based research in dementia: Quantitative and qualitative approach.\r 9. Use of assistive technology in dementia care.\r 10. Interprofessional team approach in the care of older people with dementia and their caregivers and families: Community and social care services.\r 11. Advanced care planning for clients with dementia.\r 12. Tour visit to community care services for dementia.", "required_readings": "", "recommended_readings": "Agronin, M. E. (2014). Alzheimer's disease and other dementias: A practical guide (3rd ed.). New York: Routledge.\r Budson, A. E., & Solomon, P. R. (2016). Memory loss: A practical guide for clinicians (2nd ed.). Edinburgh: Elsevier Saunders.\r De Waal, H. (2013). Designing and delivering dementia services. Chichester, West Sussex: Wiley-Blackwell.\r Devi, G. (2017). The Spectrum of Hope: An Optimistic and New Approach to Alzheimer's Disease and Other Dementias. New York: Workman Publishing Company.\r Downs, M., & Bower, B. (Eds.) (2014). Excellence in dementia care [electronic resource]: Research into practice (2nd ed.). Maidenhead: Open University Press. \r Goode, B., & Booth, G. (2012). Dementia care: A care worker handbook. London: Hodder Education.\r Hayes, J., Povey, S., & McNiff, S. (2011). The Creative Arts in Dementia Care: Practical Person-centred Approaches and Ideas. London: Jessica Kingsley Publishers.\r James, J., Cotton, B., Freyne, R., Gilby, L., Knight, J., Pettit, J., & Tommy Dunne, T. (2017). Excellent Dementia Care in Hospitals: A Guide to Supporting People with Dementia and Their Carers. London: Jessica Kingsley Publishers.\r Jenkins, C., Ginesi, L., & Keenan, B. (2016). Dementia Care at a Glance. England: Wiley-Blackwell.\r Jewell, A. (2011). Spirituality and personhood in dementia. London; Philadelphia: Jessica Kingsley Publishers.\r Killick, J., & Craig, C. (2011). Creativity and Communication in Persons with Dementia. London: Jessica Kingsley Publishers.\r Krishnamoorthy, E. S., Prince, M. J., & Cummings, J. L. (Eds.) (2010). Dementia: A global approach. Cambridge, UK: New York: Cambridge University Press. \r Lee, H., & Adams, T. (2011). Creative approaches in dementia care. New York: Palgrave Macmillan.\r May, H., Edwards, P., & Brooker, D. (2009). Enriched care planning for people with dementia: A good practice guide for delivering person-centred dementia care. London: Jessica Kingsley Publishers.\r Moniz-Cook, E., & Manthorpe, J. (2009). Early psychosocial interventions in dementia: Evidence-based practice. Philadelphia: Jessica Kingsley Publishers.\r Power, G., & Taylor, R. (2014). Dementia beyond disease: Enhancing well-being. Baltimore: Health Professions Press.\r Pulsford, D., & Thompson, R. (2013). Dementia: Support for family and friends. Philadelphia: Jessica Kingsley Publishers.\r Scharre, D. W. (2011). Long-term management of dementia. London: Informa Healthcare.\r Sawatsky, J. (2017). Dancing with elephants: Mindfulness training for those living with dementia, chronic illness or an aging brain. Toronto: Red Canoe Press.\r Waite, J. (Eds.) (2009). Dementia care: A practical manual. Oxford: Oxford University Press. \r World Health Organization (2012). Dementia a public health priority. Geneva: World Health Organization.\r Wu, J. (2011). Early Detection and Rehabilitation Technologies for Dementia. Neuroscience and Biomedical Applications. Hershey, Pa: IGI Global.\r Yu, R. (Eds.) (2010). Dementia trends: Impact of the ageing population and societal implications for Hong Kong. Hong Kong: The Hong Kong Jockey Club. \r 香港中文大學那打素護理學院流金頌培訓計劃. (2013). 腦退化症患者照顧手册. 香港: 香港賽馬會.\r 賴錦玉. (2010). 預防老年痴呆症患者走失及走失後處理. 香港: 香港老年痴呆症協會.\r 香港心理衛生會. (2010). 愛在晚晴時: 失智症照顧者指南. 香港: 零至壹出版有限公司.\r 香港復康會社區網絡. (2009). 誰能明白我─痴呆症早期病患者心聲集 . 香港: 香港復康會社區網絡.", "terms": {"2020-21 Term 2": {"--LEC (7742)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Yasumoto Int'l Acad Park 405"], "instructors": ["Dr. LAW Yee Shui"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}, "-T01-TUT (5099)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["No Room Required"], "instructors": ["Dr. LAW Yee Shui"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (7177)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["William M W Mong Eng Bldg 712"], "instructors": ["Dr. LAW Yee Shui"], "meetingDates": ["12/1", "19/1", "26/1"]}, "-T01-TUT (8188)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["No Room Required"], "instructors": ["Dr. LAW Yee Shui"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Essays": "50", "Presentation": "50"}}, {"code": "3214", "title": "Ethical, Legal and Financial Issues in Ageing", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "DebateLaboratoryLectureInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this course is to enhance students' understanding of the legal and ethical issues relating to aged care. It focuses on the legal principles governing professional practice in Hong Kong, including torts, contracts, confidentiality, informed consent and related ordinances; the basic ethical principles and theories relating to gerontological practice; the ethical issues and dilemmas encountered in practice; the financial planning for older people; and the funding models for aged care services.\r", "outcome": "Upon completion of this course, students will be able to: \r 1. Critically appraise contemporary ethical, legal and financial issues in relation to the care and services for older people.\r 2. Define legal system and basic legal concepts.\r 3. Examine local and overseas ethical guidelines and legislations relevant to the care and services for older people.\r 4. Compare different approaches for ethical decision-making.\r 5. Apply ethical and legal principles in analyzing the care and services for older people.\r 6. Appreciate different viewpoints on the care and services through discussions.\r 7. Describe the financial planning and funding models for different aged care services and discuss the associated implications.", "syllabus": "Major concepts and topics to be covered:\r 1. Ethical and legal considerations in the provision of care and services for older people.\r 2. Major ethical and legal issues including truth telling, privacy and confidentiality, mental capacity, informed consent, best interest, human rights of the older people, euthanasia, assisted death, doctrine of double effect, guardianship, enduring power of attorney, use of restraint, abuse of older people, negligence and malpractice, professional misconduct, vicarious liability, defamation and fraud, false imprisonment, assault and battery.\r 3. Implications of major ethical and legal issues in aged care practice.\r 4. The bioethical principles and theories and code of conduct of health care providers, and the associated implications in aged care delivery.\r 5. The financial planning and funding models for different aged care services and the associated implications in care delivery.", "required_readings": "", "recommended_readings": "British Medical Association. (2009). The ethics of caring for older people (2nd ed.). Chichester, UK: Wiley-Blackwell.\r Rai, G.S. (2014). Medical ethics and the elderly (4th ed.). Oxford: Radcliffe Publishing.\r Wai. A (Ed.) (2016). Medical Law and Ethics in Hong Kong. Hong Kong: Thomson Reuters Hong Kong Ltd.", "terms": {"2020-21 Term 2": {"--LEC (8503)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Wu Ho Man Yuen Bldg 505"], "instructors": ["Dr. LING Cheuk Chi"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}, "-T01-TUT (8505)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Yasumoto Int'l Acad Park LT9"], "instructors": ["Dr. LING Cheuk Chi"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 2": {"--LEC (5950)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Cheng Yu Tung Building 214"], "instructors": ["Dr. LING Cheuk Chi"], "meetingDates": ["13/1", "20/1", "27/1"]}, "-T01-TUT (5951)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Cheng Yu Tung Building 215"], "instructors": ["Dr. LING Cheuk Chi"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Discussion": "40", "Essay test or exam": "60"}}, {"code": "3215", "title": "Family and Informal Care in Ageing", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "ClassworkLectureWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this course is to provide students with a basic understanding of the roles of and the contemporary issues relating to family and informal care in an ageing society. The basic concepts covered include family theories, gender roles and family functions in caregiving, the cost of informal care, caregiver stress, strategies to sustain informal care, and collaboration between formal and informal care. The course also explores the emerging trends of informal care in a changing society.\r", "outcome": "Upon completion of this course, students will be able to: \r 1. Analyze family and health from various theoretical perspectives.\r 2. Suggest issues relating to the role of family in providing care for older adults in society.\r 3. Infer the effects of informal care on individuals and society at large.\r 4. Explore cultural influence on informal caregiving.\r 5. Synthesize the roles of government and service providers in supporting family caregivers.", "syllabus": "Major concepts and topics to be covered:\r 1. Family as a social institution.\r 2. Family theories and health.\r 3. Family as caregivers.\r 4. Women's role in caregiving.\r 5. Costs of informal care.\r 6. Stress and burden of caregiving, positive aspects of caregiving, and methods of assessing those costs.\r 7. Caregiving in social and cultural contexts.\r 8. Efficiency of community care in caring for the older adults.\r 9. Health promotion.\r 10. Long-term care and informal care issues.", "required_readings": "", "recommended_readings": "Chen, S. & Powell, J.L. (2011). (Eds,). Aging in perspective and the case of China: Issues and approaches. New York: Nova Science Publishers. \r Greene, R. R., & Kropf, N. P. (2014). Caregiving and care sharing: A life course perspective. Washington, DC: NASW Press.\r Karantzas, G. C. (2012) Family caregiving. In P. Noller, & G. C. Karantzas (Eds.), The Wiley‐Blackwell handbook of couples and family relationships (pp. 82-96). West Sussex: Blackwell Publishing Ltd.\r Qualls, S. H., & Williams, A. A. (2013). Caregiver family therapy: Empowering families to meet the challenges of aging. Washington, DC: American Psychological Association.\r Qualls, S. H., & Zarit, S. H. (2009). Aging families and caregiving. Hoboken, N.J.: John Wiley and Sons. \r Smith, S. R., & Hamon, R. R. (2012). Exploring family theories. Oxford: Oxford University Press. \r Thurgood, A., Schuldt, K. (2013). Caregivers: Challenges, practices and cultural influences. New York: Nova Science Publishers.\r White, J.M., & Klein, D.M. (2008). Family theories. Thousand Oaks: Sage.", "terms": {"2020-21 Term 1": {"--LEC (6214)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr CHENG Yeung Hung"], "meetingDates": ["10/9", "17/9", "24/9"]}}, "2021-22 Term 1": {"--LEC (7173)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Wu Ho Man Yuen Bldg 502"], "instructors": ["Dr CHENG Yeung Hung"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Essays": "70", "Presentation": "20", "Short answer test or exam": "10"}}, {"code": "3311", "title": "Aged Care Service Planning and Delivery Models", "career": "Undergraduate", "units": "5.00", "grading": "Graded", "components": "Field Studies/Field-tripLectureInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this course is to provide students with a comprehensive understanding of the principles, concepts and skills involved in planning and delivering aged care services in a variety of geriatric settings, including community, rehabilitative and residential care settings. The basic concepts covered with regard to these settings include ageing in place, social involvement and participation, integrated community-based care, home-based care delivery model, discharge planning, interdisciplinary and cross-sectoral service coordination, and the residential care home accreditation system. The course highlights the notion of health and social care partnership, and a multi-dimensional perspective is adopted to facilitate students to examine the service planning and delivery model for the provision of community, rehabilitative and residential care services to older people.\r", "outcome": "Student will be able to:\r 1. Demonstrate an understanding of the principles, philosophies, and concepts of community, rehabilitative, and residential aged care and their relevance to older persons in a society locally and globally.\r 2. Understand the roles and functions of different health care and social welfare organisations in the provision of different levels of aged care services.\r 3. Differentiate the types of aged care services according to older persons’ level of care needs in community, rehabilitative and residential care settings. \r 4. Demonstrate an understanding of the concepts, significance, and methods of optimising multi-sectoral collaboration between health care, social welfare and business organisations in the delivery of community, rehabilitative and residential care. \r 5. Describe innovative care models for delivering community, rehabilitative, and residential care services to older persons. \r 6. Discuss the knowledge and skills in coordinating multi-disciplinary and inter-sectoral aged care in community, rehabilitative and residential care settings.\r 7. Describe innovative strategies to monitor quality and promote excellence in the provision of aged care services in community, rehabilitative and residential care settings.", "syllabus": "Major concepts and topics to be covered:\r 1 Health care and social welfare organisations\r 1.1 Types, roles and functions of community care services\r 1.2 Types, roles and functions of rehabilitative care services in community\r 1.3 Types, roles and functions of rehabilitative care services in hospital\r 1.4 Types, roles and functions of residential care services\r  2 Models of delivering aged care services\r 2.1 Innovative service models in community care setting\r 2.2 Community self-help model\r 2.3 Social involvement and participation\r 2.4 Innovative care models for delivering rehabilitative care services in community\r 2.5 Innovative care models for delivering rehabilitative care services for discharge planning\r 2.6 Innovative service models in residential care setting\r  3 Service planning and delivery\r 3.1 The principles, philosophies, and concepts of community, rehabilitative, and residential aged care: local and global scenarios\r 3.2 Design thinking to promote social innovation in respond to ageing population\r 3.3 Elder abuse: The suffering in silence\r 3.4 Safety planning in elder abuse-role of gerontological professionals\r 3.5 Integrative and innovative practices for delivering residential care services\r 3.6 Adjustment of older people to residential care placements\r  4 Multi-sectoral collaboration in aged care provisions\r 4.1 The concepts and strategies of coordinating multi-disciplinary and inter-sectoral aged care\r 4.2 Landscape of social enterprises and social entrepreneurship in respond to ageing population\r 4.3 Rehabilitative service delivery: physiotherapy perspectives\r 4.4 Rehabilitative service delivery: occupational therapy perspectives\r 4.5 Multi-sectoral collaboration in managing and preventing elder abuse\r  5 Monitoring quality and excellence in aged care services\r 5.1 Principles and strategies to monitor quality and promote excellence in aged care services\r 5.2 Quality of care and accreditation system for residential care services", "required_readings": "", "recommended_readings": "Asthana, S. et al., (2017). Hazzard's Geriatric Medicine and Gerontology, 7e 7th ed., New York, N.Y: McGraw-Hill Education LLC.\r Brody, R., & Nair, M. (2014). Effectively managing and leading human service organizations (4th ed.). Thousand Oaks, California: SAGE Publications.\r Cai, F., Giles, J., O’Keefe, P., & Wong, D. (2011). The elder and old age support in rural China. World Bank Publications.\r Chia, S., Healthcote, J., & Hibberd, J. (2011). Group and individual work with older people: A practical guide to running successful activity-based programmes. London; Philadelphia, PA: Jessica Kingsley.\r Furman, R., & Gibelman, M. (2013). Navigating human service organizations. (3rd ed.). Chicago, Ill.: Lyceum Books.\r Hall, B., & Scragg, T. (2012). Social work with older people: Approaches to person-centred practice. Maidenhead, Berkshire, England: Open University Press.\r Harris, J. L., Roussel, L., Walters, S., & Dearman, C. (2011). Project planning and management: A guide for CNLs, DNPs, and nurse executives. Sudbury, MA: Jones & Bartlett Publishers.\r Lewis, J. P. (2011). Project planning, scheduling & control [electronic resource]: The ultimate hands-on guide to bringing projects in on time and on budget (5th ed.). New York: McGraw-Hill.\r McKenzie, J., Neiger, B., & Thackeray, R. (2013). Planning, implementing, and evaluating health promotion programs: A primer (6th ed.). Boston: Pearson.\r Moyle, W., Parker, D., & Bramble, M. (2014). Care of older adults: A strengths-based approach. Port Melbourne, VIC: Cambridge University Press.", "terms": {"2020-21 Term 2": {"--LEC (4796)": {"startTimes": ["11:30", "14:30"], "endTimes": ["13:15", "17:15"], "days": [4, 2], "locations": ["Esther Lee Bldg 405", "Humanities Building 213"], "instructors": ["Mr. FUNG Kwong Wing", "Mr. FUNG Kwong Wing"], "meetingDates": ["14/1", "21/1", "28/1", "4/2", "12/1", "19/1", "26/1", "2/2", "9/2"]}, "-T01-TUT (4797)": {"startTimes": ["11:30", "14:30"], "endTimes": ["13:15", "17:15"], "days": [4, 2], "locations": ["Wu Ho Man Yuen Bldg 505", "No Room Required"], "instructors": ["Mr. FUNG Kwong Wing", "Mr. FUNG Kwong Wing"], "meetingDates": ["14/1", "21/1", "28/1", "4/2", "12/1", "19/1", "26/1", "2/2", "9/2"]}, "-X01-WBL (8860)": {"startTimes": ["14:30", "11:30"], "endTimes": ["17:15", "13:15"], "days": [2, 4], "locations": ["No Room Required", "Yasumoto Int'l Acad Park LT9"], "instructors": ["Mr. FUNG Kwong Wing", "Mr. FUNG Kwong Wing"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2", "14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 2": {"--LEC (5405)": {"startTimes": ["14:30", "11:30"], "endTimes": ["17:15", "13:15"], "days": [2, 4], "locations": ["Cheng Yu Tung Building 214", "Cheng Yu Tung Building 214"], "instructors": ["Mr. FUNG Kwong Wing", "Mr. FUNG Kwong Wing"], "meetingDates": ["11/1", "18/1", "25/1", "13/1", "20/1", "27/1"]}, "-T01-TUT (5932)": {"startTimes": ["11:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Cheng Yu Tung Building 215"], "instructors": ["Mr. FUNG Kwong Wing"], "meetingDates": ["13/1", "20/1", "27/1"]}, "-X01-WBL (7164)": {"startTimes": ["11:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Wu Ho Man Yuen Bldg 402"], "instructors": ["Mr. FUNG Kwong Wing"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Essay test or exam": "50", "Homework or assignment": "30", "Presentation": "20"}}, {"code": "3312", "title": "Gerontological Practicum", "career": "Undergraduate", "units": "12.00", "grading": "Graded", "components": "DiscussionPracticumSeminar", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this clinical practicum is to provide students with clinical practice opportunities to apply related principles, concepts and theories for planning and delivering aged care services in community, rehabilitative and residential care settings. Students are facilitated to develop their knowledge of and skills in service planning, coordination and delivery in these settings.\r", "outcome": "Student will be able to: 1. Discuss the models for planning and delivering aged care services in community, rehabilitative and residential care settings. 2. Effectively communicate with older clients, their families, and health and social care team members in community, rehabilitative and residential care settings. 3. Apply the knowledge and skills of health and social sciences in ageing to identify the needs of older people and deliver high quality aged care services in community, rehabilitative and residential care settings. 4. Demonstrate an understanding of the principles and skills in coordinating multi-disciplinary care and optimizing inter-sectoral collaboration for the delivery of aged care services in community, rehabilitative and residential care settings. 5. Apply legal and ethical principles in delivering high quality aged care in community, rehabilitative and residential care settings.", "syllabus": "This clinical course facilitates development and application of knowledge and skills of health and social aged care in community, rehabilitative and residential care settings. Students are expected to discuss the service planning and delivery models adopted in these aged care settings, to demonstrate effective communication skills, to develop knowledge and skills for assessing health and social care needs, coordinating multi- disciplinary care and optimizing inter-sectoral collaboration in the delivery of aged care services, and to discuss legal and ethical issues in community aged care services.", "required_readings": "Please refer to course outline. ", "recommended_readings": "Carpenito-Moyet, L. J. (2013). Nursing diagnosis: Application to clinical practice (14th ed.). Philadelphia: Lippincott Williams & Wilkins. Carter, P. J. (2010). Lippincott’s textbook for long-term care nursing assistants: A humanistic approach to caregiving. Philadelphia: Wolters Kluwer/ Lippincott Williams and Wilkins. Chadwick, R., Have, H. T., & Meslin, E. M. (Eds.). (2011). The SAGE Handbook of Health Care Ethics. London: SAGE Publication Ltd. Cox, E. O., Chapin, R., & Kelchner, E. (2014). Gerontological Social Work Practice: Issues, Challenges, and Potential. New York: Routledge. Fillit, H. M., Rockwood, K., & Young, J. (2017). Brocklehurst's textbook of geriatric medicine and gerontology (8th ed.). Philadelphia: Saunders/Elsevier. [eBook] Gopee, N., & Galloway, J. (2013). Leadership and Management in Healthcare (2nd ed.). London: SAGE Publication Ltd. Henwood, S. (Ed.). (2014). Practical Leadership in Nursing and Health Care: A Multi-Professional Approach. Boca Raton, Florida: CRC Press. Innes, A. (2009). Dementia Studies: A Social Science Perspective. London: SAGE Publication Ltd. Jett, K., & Touhy, T. A. (Eds.). (2011). Ebersole and Hess’ Towards Healthy Aging: Human Needs and Nursing Response (8th ed.). New York: Mosby. Lloyd, C. E., & Heller, T. (2012). Long-Term Conditions: Challenges in Health and Social Care. London: SAGE Publication Ltd. Lynch, R. (2014). Social work practice with older people: A positive person-centred approach. London: SAGE. Stuart-Hamilton, I. (Ed.). (2011). An introduction to gerontology. New York: Cambridge University Press. Wold, G. H. (2011). Basic Geriatric Nursing (5th ed.). New York: Mosby.", "terms": {"2020-21 Term 1": {"-P01-PRA (7981)": {"startTimes": ["8:30", "8:30", "8:30", "8:30"], "endTimes": ["18:15", "18:15", "18:15", "18:15"], "days": [1, 2, 4, 3], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Ms. LEE Yuet Ming Isabella", "Ms. LEE Yuet Ming Isabella", "Ms. LEE Yuet Ming Isabella", "Ms. LEE Yuet Ming Isabella"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12", "10/9", "17/9", "24/9", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2021-22 Term 1": {"-P01-PRA (8671)": {"startTimes": ["8:30", "8:30", "8:30", "8:30"], "endTimes": ["18:15", "18:15", "18:15", "18:15"], "days": [1, 2, 3, 4], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Mr. FUNG Kwong Wing", "Mr. FUNG Kwong Wing", "Mr. FUNG Kwong Wing", "Mr. FUNG Kwong Wing"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11", "7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11", "8/9", "15/9", "9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Others": "50", "Presentation": "25", "Report": "25"}}, {"code": "3411", "title": "Health and Social Care Policy in Ageing", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-tripLectureInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this course is to provide students with a comprehensive understanding of policy issues relating to health and social care needs of older people. The course also examines the operation of health care and social care systems to further students' understanding of the planning and delivery of aged care services for older people.\r", "outcome": "The students will be able to:\r 1. Illustrate the social, political and economic issues and changes resulting from the ageing of society.\r 2. Describe the historical and demographic backgrounds to the development of policy on ageing.\r 3. Identify the legislation process relating to health and social care policy on ageing.\r 4. Discuss the influence of policy on the delivery of aged care services in Hong Kong.\r 5. Discuss the application of social and health science evidence in the development and implementation of policy on ageing. \r 6. Discuss the roles of health and social care professionals in the development and implementation of policy on ageing.", "syllabus": "Major concepts and topics to be covered:\r 1 Framework for policy analysis and planning\r 1.1 Introduction to social policy in ageing\r 1.2 Theoretical approaches to the development of ageing policies\r 1.3 Aged care policies: analysis, promotion and implementation\r 1.4 The process of legislation relating to health and social care policies in ageing\r  2 Health and social care policy development\r 2.1 Social, political and economic issues and changes resulting from population ageing\r 2.2 Future direction and policy options for older people\r 2.3 Gerontechnology and health informatics\r  3 Examination of health and social care policies\r 3.1 Healthcare infrastructure for older people: \r 3.1.1 Healthcare organization and healthcare system, healthcare financing and health economics\r 3.1.2 Health policy approaches for improving health outcomes in older people\r 3.2 The healthcare system and service model in response to the population change\r 3.3 A structural analysis on the development of Long-Term Care System\r 3.4 Social welfare and ageing: model, impact and sustainability\r 3.5 Empowerment of older people in political participation\r 3.6 Housing policies in ageing\r 3.7 The challenges and growing trends in housing for older people", "required_readings": "", "recommended_readings": "Alcock, C., Daly, G., & Griggs, E. (2008). Introducing social policy (2nd ed.). Harlow, England ; New York: Prentice Hall. \r Alcock, P., Haux, T., May, M., & Wright, S. (2016). The student's companion to social policy (Fifth ed.). Chichester, UK ; Hoboken\r Baldock, J. (2012). Social policy (4th ed.). Oxford: Oxford University Press. \r Binstock, R. H., George, L. K., Cutler, S. J., Hendricks, J., & Schulz, J. H. (Eds.). (2011). Handbook of aging and the social sciences. United States: Academic Press.\r Chi, I. (2013). Long-term care in the 21st century: perspectives from around the asia-pacific rim. New York: Routledge.\r Chinese, A. O. S. S., Indonesian, A. O. S., & Indian, N. S. A. (2009). Preparing for the challenges of population aging in asia: strengthening the scientific basis of policy development. Washington, US: National Academies Press.\r Hudson, R. (2014). The new politic of old age policy. Baltimore: Johns Hopkins University Press.\r Jordan, B. (2008), Welfare and well-being: socialvalue in public policy. UK: Tue Policy Press. \r Wacker, R. R. & Roberto, K. A. (2011). Aging social policies: an international perspective. Thousand Oaks, CA: SAGE Publications Ltd.\r Walker, A., & Aspalter, C. (Eds.). (2014). Active aging in asia. London: Routledge.\r 歐陽達初、黃和平（2017）。未完成的香港社會保障：批判的導論。香港：中華書局。\r 周永新（2017）。創建公平和關愛社會──香港民生政策的得與失。香港：中華書局。", "terms": {"2020-21 Term 2": {"--LEC (4798)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Humanities Building 213"], "instructors": ["Mr. FUNG Kwong Wing"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}, "-T01-TUT (8789)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [2], "locations": ["No Room Required"], "instructors": ["Mr. FUNG Kwong Wing"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 2": {"--LEC (7221)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Cheng Yu Tung Building 215"], "instructors": ["Mr. FUNG Kwong Wing"], "meetingDates": ["11/1", "18/1", "25/1"]}, "-T01-TUT (7146)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [2], "locations": ["No Room Required"], "instructors": ["Mr. FUNG Kwong Wing"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Presentation": "60", "Report": "40"}}, {"code": "3412", "title": "Innovations and Evidence-based Practice for Aged Care Services", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "This course aims to provide students with an overview of the research methods used in examining health and social care issues, and to equip them with knowledge of evidence-based practice with special reference to gerontology. The course also examines the impacts of the changing health and social care context on the delivery of aged care services, and introduces the evidence-based innovative models of aged care service delivery.\r", "outcome": "Students will be able to:\r 1. Describe the range of theoretical, methodological and ethical issues associated with the development and implementation of evidence-base practice in aged care services.\r 2. Critically appraise the scientific quality and contextual relevance of research evidence, and effectively apply such knowledge to develop innovations in aged care services.\r 3. Demonstrate a critical understanding of the use of specific research methods and techniques to address the knowledge gap in aged care services. \r 4. Describe the frameworks to identify and analyses complex internal and external factors in transferring evidence to inform the development of innovations in aged care services.\r 5. Critically appraise the quality of innovative models in aged care service delivery using a scientific and systematic evidence-based approach.", "syllabus": "The major concepts and topics to be covered:\r 1. An overview of research process and evidence-based practice in knowledge development.\r 2. Formulation of research problems, questions and hypotheses in gerontological care practice.\r 3. Searching and reviewing literature.\r 4. Quantitative research in gerontology: study design, issues of validity, sampling design, data collection methods, data analyses and interpretation.\r 5. Qualitative research in gerontology: sampling design, data collection methods and issues of reliability and validity on data collection, data analysis and interpretation.\r 6. Ethical issues in conducting gerontological research.\r 7. Translating and integrating scientific evidence to aged care services.\r 8. Critical appraisal of evidence-based innovative models of aged care service delivery.", "required_readings": "Saks, M., & Allsop, J. (2013). Researching health: Qualitative, quantitative and mixed methods. Singapore: Sage.", "recommended_readings": "1. Aveyard, H., & Sharp P. (2009). A beginner's guide to evidence based practice in health and social care professions. Berkshire, UK: McGraw-Hill. \r 2. Melnyk, B. M., & Fineout-Overhold, E. (2011). Evidence-based practice in nursing and healthcare: A guide to best practice. (2nd ed.) Hong Kong: Wolter Kluwer / Lippincott Williams and Wilkins.\r 3. Cowan, D. (2009). Research issues in health and social care [electronic resource]. Keswick, Cumbria England: M & K Update Ltd.\r 4. Polit, D., & Beck, C. T. (2014). Essentials of nursing research: Appraising evidence for nursing practice (8th ed.). Philadelphia: Wolters Kluwer Health/Lippincott Williams & Wilkins.\r 5. Nieswiadomy, R. (2012). Foundations of nursing research (6th ed.) [electronic resource]. Boston: Pearson.", "terms": {"2020-21 Term 2": {"--LEC (7743)": {"startTimes": ["13:30"], "endTimes": ["16:15"], "days": [2], "locations": ["Wu Ho Man Yuen Bldg 301"], "instructors": ["Dr. LAW Yee Shui"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}, "-T01-TUT (7752)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Wu Ho Man Yuen Bldg 404"], "instructors": ["Dr. LAW Yee Shui"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}, "-T02-TUT (5300)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Hui Yeung Shing Bldg 501"], "instructors": ["Dr. LAW Yee Shui"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}, "-T03-TUT (6633)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Wu Ho Man Yuen Bldg 301"], "instructors": ["Dr. LAW Yee Shui"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 2": {"--LEC (7997)": {"startTimes": ["13:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Cheng Yu Tung Building 215"], "instructors": ["Dr. LAW Yee Shui"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Essays": "90", "Short answer test or exam": "10"}}, {"code": "3413", "title": "Leadership and Management in Aged Care Services", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "This course enables students to apply the theoretical and skill-based knowledge that they have learnt in coordinating individual client care and organising care groups for clients in various community and long-term care settings. Emphasis is on leadership and management skills, and multi-disciplinary teamwork and collaboration between health and social care sectors.\r", "outcome": "The students will be able to:\r 1. Critically analyse management concepts and tools for effective implementation of such concepts and tools in the gerontological field. \r 2. Identify resources and barriers regarding interprofessional collaboration.\r 3. Understand the importance of organisational and personnel management in order to realise successful teamwork among professionals from different disciplines.\r 4. Develop and implement adequate evaluation measures to ensure quality of service delivery.\r 5. Identify ways to realise innovation management in the care for older people in community and long-term care settings.", "syllabus": "Major concepts and topics to be covered:\r 1. Leadership theory and style\r 2. Management process\r 3. Power dynamic\r 4. Empowerment theory and strategies\r 5. Leading and managing change\r 6. Conflict management\r 7. Organisation culture and performance\r 8. Resource planning in gerontological service delivery \r 9. Developing inter-professional collaboration: issues and challenges\r 10. Building and coordinating a multidisciplinary team\r 11. Continuous quality and service improvement: methods, issues and challenges", "required_readings": "", "recommended_readings": "Armstrong, M., & Taylor, S. (2017). Armstrong's handbook of human resource management practice (13th ed.). London, United Kingdom: Kogan Page Limited.\r Benner, P. E. (2009). Expertise in nursing practice: Caring, clinical judgment and ethics (2nd ed.). New York: Springer Publishing Company.\r Huber, D. L. (2014). Leadership and nursing care management (5th ed.). St. Louis, Missouri: Elsevier Saunders.\r Keyton, J. (2011). Communication & organizational culture : A key to understanding work experiences (2nd ed.). Thousand Oaks, California: SAGE.\r Marquis, B. L., & Huston, C. J. (2017). Leadership roles and management functions in nursing: Theory and application (9th ed.). Philadelphia: Wolters Kluwer Health/ Lippincott Williams & Wilkins.\r Northouse, P. G. (2016). Leadership: Theory and practice (7th ed.). Thousand Oaks, California: SAGE.\r Rigolosi, E. L. M. (2013). Management and leadership in nursing and health care : An experiential approach (3rd ed.). New York: Springer Publishing Company.\r Sullivan, E. J. (2013). Effective leadership and management in nursing (8th ed.). Boston: Pearson.", "terms": {"2020-21 Term 2": {"--LEC (4933)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Yasumoto Int'l Acad Park 405"], "instructors": ["Professor WONG Kit Yee Irene"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}, "-T01-TUT (4986)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [3], "locations": ["No Room Required"], "instructors": ["Professor WONG Kit Yee Irene"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (5343)": {"startTimes": ["13:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Esther Lee Bldg 207"], "instructors": ["Staff"], "meetingDates": ["10/1", "17/1", "24/1"]}, "-T01-TUT (5387)": {"startTimes": ["13:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Lee Shau Kee Archi Bldg G02"], "instructors": ["Staff"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Essay test or exam": "60", "Presentation": "40"}}, {"code": "3414", "title": "Infectious Diseases and Their Control", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive TutorialVisit", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this course is to help students understand infectious diseases and their clinical control. Emphasis is placed on various aspects of clinical practice, including principles of diagnosis and treatment, epidemiology and prevention strategies, methods of surveillance, development of infection control policies, and the clinical impact of infection control teams in hospitals and the community.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3415", "title": "Complementary and Alternative Medicine", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-tripLaboratoryLectureWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "The aim of this course is to introduce students to the efficacy, choice, use and explanatory mechanisms of complementary and alternative medicine using a range of selected therapies. It focuses on the health concepts and common approaches of traditional Chinese medicine, as well as the roles and responsibilities of aged care workers practicing in this field.\r", "outcome": "The students will be able to:\r 1. Demonstrate an understanding of the underlying concepts of complementary and alternative medicine (CAM).\r 2. Recognize the integration of traditional Chinese medicine (TCM) into the health care system in Hong Kong.\r 3. Determine the roles and responsibilities of aged care workers in CAM.\r 4. Interpret the theories of TCM, such as Yin-Yang, the Five Elements, Zang-Fu, Meridians.\r 5. Describe the special features of diagnosis and treatment in TCM.\r 6. Demonstrate an understanding of dietary therapy for older people from the perspectives of TCM.\r 7. Analyze the major concepts, limitations and special precautions of various complementary and alternative therapies for ageing population, including: TCM therapies (e.g. acupuncture, moxibustion, tuina, cupping, guasha, bonesetting), aromatherapy, music therapy, light therapy, hypnotherapy, foot reflexology and chiropractic.\r 8. Develop an awareness of certain exercising therapies in TCM, including: qigong and tai chi.\r 9. Recognize the role of CAM as an integrated treatment approach with orthodox Western medicine for ageing population.", "syllabus": "Major concepts and topics to be covered:\r 1. Introduction of complementary & alternative medicine (CAM)\r 2. The integration of traditional Chinese medicine (TCM) into the health care system in Hong Kong\r 3. Roles & responsibilities of health care professionals in CAM\r 4. Introduction of TCM: health concepts of Chinese medicine, basic theories of five elements, internal organs, functions and meridians, diagnosis and treatment in TCM, and principles of dietary therapy\r 5. Acupuncture, moxibustion, tuina, cupping, guasha, and bonesetting, qigong, tai chi \r 6. Foot reflexology, aromatherapy, hypnotherapy, chiropractic, and music therapy", "required_readings": "Micozzi, M. S. (Ed.) (2018). Fundamentals of complementary, alternative, and integrative medicine (6th ed.). St. Louis, Mo.: Saunders/Elsevier.", "recommended_readings": "Adams, J., Tovey, P., & Easthope, G. (2017). Mainstreaming complementary and alternative medicine: Studies in social context. London & New York: Routledge.\r Fontaine, K. L. (2015). Complementary and alternative therapies for nursing practice (4th ed). Boston: Pearson.\r Lindquist, R. Tracy, FM, Snyder, M. (2018). Complementary & Alternative Therapies in Nursing (8th ed.). New York: Springer Publishing Company\r Maciocia, G. (2015). The foundations of Chinese medicine: A comprehensive text (3rd ed.). Edinburgh: Elsevier. \r  Journal (example): Journal of Alternative and Complementary Medicine", "terms": {"2020-21 Term 2": {"--LEC (6190)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor CHAN Wai Kiu"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}, "-L01-LAB (6189)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor CHAN Wai Kiu"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (5768)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [1], "locations": ["TBA"], "instructors": ["Professor CHAN Wai Kiu"], "meetingDates": ["10/1", "17/1", "24/1"]}, "-L01-LAB (5767)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [1], "locations": ["TBA"], "instructors": ["Professor CHAN Wai Kiu"], "meetingDates": ["10/1", "17/1", "24/1"]}}}}, {"code": "3416", "title": "Student Exchange Programme", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-tripLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Nethersole School of Nursing", "requirements": "", "description": "This course aims to develop students with an international and cultural perspectives on issues arising from an ageing global population. The course provides valuable opportunities for students to learn about the structures and delivery of aged care services in different cultures. Such exposure will also help students develop cross-cultural insights to better understand the core elements of best practices and innovative approaches in aged care.", "outcome": "Upon completion of this course, students will be able to:  1. Compare and contrast the structures and delivery of health and social care services for older people in Hong Kong and in other countries/cultures.  2. Analyse and evaluate different approaches and models of aged care service delivery.  3. Identify the core elements of innovative best practices in aged care.  4. Engage with the wider community in the exchange of knowledge and ideas.  5. Gain a deeper understanding of different ethnicities/cultures and the importance of integrating cultural needs into aged care.  6. Plan culturally appropriate and innovative aged care services to support older people from culturally diverse backgrounds.  7. Critically reflect and analyse own skills in assessing and delivering care for older people from different ethnic groups.", "syllabus": "1. Innovative approaches and models of aged care service delivery in Hong Kong  2. Structures and delivery of health and social care services for older people in overseas countries / local multicultural communities.3. Overseas/ local study trip  4. Service innovation and design:  - Special considerations in planning and delivering culturally appropriate aged care services  - Strategies to integrate other countries' innovative and culturally appropriate practices from foreign countries into the local culturally diverse context. - Mini-conference: presentation of innovative plans for addressing the priority health and social care issues among older persons, taking into consideration their cultural backgrounds. ", "required_readings": "NIL", "recommended_readings": "Cai, F., Giles, J., O’Keefe, P., & Wong, D. (2011). The elder and old age support in rural China. World Bank Publications. Cheng, C. (2016). Caring for older people in Taiwan: The role of community care centers. Lewiston: The Edwin Mellen Press. Chi, I. (2013). Long-Term Care in the 21st Century: Perspectives from Around the Asia-Pacific Rim. Binghamton: Taylor and Francis. Eggleston, K., Tuljapurkar, S., & Walter H. Shorenstein Asia-Pacific Research Center. (2010). Aging Asia: The economic and social implications of rapid demographic change in China, Japan, and South Korea. Stanford, CA: Walter H. Shorenstein Asia-Pacific Research Center. Gardner, F. (2014). Being critically reflective: Engaging in holistic practice. Hampshire, UK: Palgrave Macmillan. Hargreaves, J., & Page, L. (2013). Reflective practice. Cambridge, UK: Polity Press. Irving, P., Beamish, P., & Beamish, Rita. (2014). The Upside of Aging: How Long Life Is Changing the World of Health, Work, Innovation, Policy, and Purpose. Hoboken, New Jersey: Wiley. Obi, T., Auffret, J.P., & Iwasaki, N. (2013). Global E-Governance Series: Aging Society and ICT: Global Silver Innovation. Burke: IOS Press. Reisman, D., & Edward Elgar Publishing. (2009). Social policy in an ageing society: Age and health in Singapore. Cheltenham, UK; Northampton, MA: Edward Elgar. Teo, P., & Ebrary, Inc. (2006). Ageing in Singapore: Service needs and the state. London; New York: Routledge. Woo, J. (2013). Ageing in Hong Kong: A comparative perspective. New York: Springer.  Wu, Y. (2004). The Care of the Elderly in Japan [electronic Resource]. London; New York: Routledge Curzon. Yang, P. S., & Mui, A. C. (2011). Foundations of gerontological social work practice in Taiwan. Taipei: Yeh Yeh Book Gallery.", "terms": {"2021-22 Term 2": {"--LEC (5227)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Esther Lee Bldg 205"], "instructors": ["Dr. LING Cheuk Chi"], "meetingDates": ["10/1", "17/1", "24/1"]}, "-F01-FLD (7668)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [1], "locations": ["No Room Required"], "instructors": ["Dr. LING Cheuk Chi"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Homework or assignment": "40", "Others": "10", "Presentation": "50"}}]