[{"code": "1001", "title": "China’s Cultural Past", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "Not for students who have taken CHES1001", "description": "This course introduces students to various dimensions of China’s cultural past. Topics and issues will be determined from year to year by the teacher(s) delivering the course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1004", "title": "Chinese Society in Transformation", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This introductory course examines basic institutions in traditional Chinese society and their modern transformations. It covers topics of Chinese kinship, lineage, family and marriage, popular religion and rituals, state power and its political control, and rural and urban political economies. The lectures draw particular attention to constant modernizing efforts in the past century, especially the socialist revolution and post-Mao reforms, and their bearings upon Chinese society and culture. The readings, drawn from various disciplines – anthropology, history, literature, sociology and political science, to demonstrate the necessity of a multi-disciplinary approach to the study of Chinese culture and society in general.", "outcome": "By the end of the semester, students should:- be familiar with the nature and dynamics of basic institutions in traditional Chinese society.- be familiar with key concepts and approaches in studying Chinese culture and society.- be able to read and understand interdisciplinary readings on Chinese society.- be able to write a well-organized essay to synthesize lectures and readings.- be prepared with foundation knowledge on China studies.", "syllabus": "1. Introduction2. Family and Kinship3. Lineage and its Constructions4. Marriage and Women5. Popular Religions and Rituals6. State Power and Imperial Culture7. Markets and Merchants 8. Land Tenure and Rural Crises9. Searching for Modernity 10. Mao’s Revolution 11. Post-Mao Reforms 12. Understanding Post-Mao Chinese Society", "required_readings": "1. Introduction    Freedman, Maurice. 1979. \"What Social Science Can Do for Chinese Studies.\" In The Study of Chinese Society, edited by G. William Skinner, 398-406. Stanford, CA: Stanford University.    Spence, Jonathan D. 1990. \"Western Perceptions of China from the Late Sixteenth Century to the Present.\" In Heritage of China: Contemporary Perspectives on Chinese Civilization, edited by Paul. Ropp, 1-14. Berkeley, Los Angeles & Oxford: University of California Press.2. Family and Kinship    Ebrey, Patricia B., and James L. Watson. 1986. \"Introduction.\" In Kinship Organization in Late Imperial China, 1000-1940, edited by Patricia B. Ebrey and James L. Watson, 1-15. Berkeley: University of California Press.    Cohen, Myron L. 1978. \"Developmental Process in the Chinese Domestic Group.\" In Studies in Chinese Society, edited by Arthur P. Wolf, 183-198. Stanford: Stanford University Press.3. Lineage and its Constructions    Cohen, Myron L.  1990. \"Lineage Organization in North China.\" The Journal of Asian Studies no. 49 (3):509-534.    Faure, David  1989. \"The Lineage as a Cultural Invention: The Case of the Pearl River Delta.\" Modern China no. 15 (1):4-36.4. Marriage and Women    Ebrey, Patricia B. 1990. \"Women, Marriage, and the Family in Chinese History.\" In Heritage of China: Contemporary Perspectives on Chinese Civilization, edited by Paul S. Ropp, 197-223. Berkeley, Los Angeles & Oxford: University of California Press.    Watson, Rubie S. 1991. \"Wives, Concubines, and Maids: Servitude and Kinship in the Hong Kong Region, 1900-1940.\" In Marriage and Inequality in Chinese Society, edited by Rubie S. Watson and Patricia B. Ebrey, 231-255. Berkeley: University of California Press5. Popular Religions and Rituals    Wolf, Arthur P. 1974. \"Gods, Ghosts, and Ancestors.\" In Religion and Ritual in Chinese Society, edited by Arthur P. Wolf, 131-182. Stanford, CA: Stanford University Press.6. State Power and Imperial Culture    Elman, Benjamin A. 1991. \"Political, Social, and Cultural Reproduction via Civil Service Examinations in Late Imperial China.\" The Journal of Asian Studies no. 50 (1):7-28.    Watson, James L. 1985. \"Standardizing the Gods: The Promotion of T'ien Hou (Empress of Heaven) along the South China Coast, 960-1960.\" In Popular Culture in Late Imperial China, edited by David Johnson, Andrew J.  Nathan and Evelyn S.  Rawski, 292-324. Berkeley: University of California Press.7. Markets and Merchants     Fei, Xiaotong. 1939. \"Marketing.\" In Peasant Life in China: A Field Study of Country Life in the Yangtze Valley, 240-262. London & Henley: Routledge & Kegan Paul. 1939    Brook, Timothy. 1998. “Summer: The Last Century (1550-1644)” in The Confusions of Pleasure: Commerce and Culture in Ming China, 153-237. Berkeley; Los Angeles: University of California Press. 8. Land Tenure and Rural Crises    Huang, Philip. 1990. Peasant family and rural development in the Yangzi Delta, 1350-1988, 249-274. Stanford, CA: Stanford University Press.    Skinner, G. William. 1971. \"Chinese Peasants and the Closed Community: An Open and Shut Case.\" Comparative Studies in Society and History no. 13 (3):270-283.    Mao, Dun. 1956. \"Spring Silkworms.\" In Spring Silkworms and Other Stories. Beijing: Foreign Languages Press.9. Searching for Modernity     Spence, Jonathan D. 1981. \"Preface” & “Wanderings.\" In The Gate of Heavenly Peace, xi-xv, 61-88. Viking     Shao, Qin. 2004. \"Exhibiting the Modern: The Creation of the First Chinese Museum, 1905-1930.\" The China Quarterly (179):684-702.10. Mao’s Revolution      Zhang, Xiaojun. 2004. \"Land Reform in Yang Village: Symbolic Capital and the Determination of Class Status.\" Modern China no. 30 (1):3-45.     Bray, David. 2005. “Introduction” and “Governing Urban China: Labor, Welfare and the Danwei.” In Social Space and Governance in Urban China: The Danwei System from Origins to Reform. Stanford, CA: Stanford University Press.11. Post-Mao Reforms      Cheek, Timothy. 2007. Chapter 3 “Reforms.” Living with Reform China since 1989. London & New York: Zed Books.12. Understanding Post-Mao Chinese Society     Bian, Yanjie. 2002. \"Chinese Social Stratification and Social Mobility.\" Annual Review of Sociology no. 28:91-116     Latham, Kevin. 2009. \"Media, the Olympics and the Search for the “Real China”.\" The China Quarterly no. 197:25-43.", "recommended_readings": "To be determined by teacher concerned", "terms": {"2021-22 Term 1": {"--LEC (4970)": {"startTimes": ["11:30"], "endTimes": ["14:15"], "days": [1], "locations": ["Lee Shau Kee Archi Bldg G01"], "instructors": ["Professor LING Minhua"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Essays": "30", "Essay test or exam": "30", "Others": "10", "Short answer test or exam": "30"}}, {"code": "1005", "title": "Modern China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "Not for students who have taken CCSS2001 or CHES2001", "description": "The rapid transformation that China is experiencing today cannot be understood without considering the wider context of change in modern Chinese history. How have the Chinese searched for modernity in the recent past? How have changes been experienced by the Chinese people? In this course we shall explore the political, social, and cultural revolutions that have shaped Chinese history since late imperial times. The emphasis of this course will be on analysis of primary sources in translation and discussion of these texts within the context of the historical narrative.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1006", "title": "Politics and Governance in Contemporary China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "Not for students who have taken CCSS2130", "description": "This course introduces major political institutions and problems of governance in contemporary China to students. Departing from the early years of reform and their culmination in the crisis of 1989, the class investigates the Chinese leadership’s agenda of safeguarding one-party rule through reforms and adjustments in various domains. In order to gain a better understanding of China’s path of political development, particular attention will be paid to the varying degrees of success and the often unintended consequences of these efforts.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1007", "title": "Introduction to the Chinese Economy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This course offers an overview of the Chinese economy. Since the policies of reform and opening up were initiated in 1978, China has been transformed from a command economy to a market-oriented system and achieved over three decades of rapid growth. This course will address both the historical processes of institutional reform and major economic issues in contemporary China. It aims to provide a roadmap for the students to have a critical view of China’s growth model and obtain an informed perspective on the challenges that the Chinese economy faces now.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1010", "title": "Chinese Languages and Cultures: A Linguistic Perspective", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This course focuses on the intriguing relationship between language and culture from a linguistic perspective. Various cultural factors affecting communication will be identified, with specific reference to standard Chinese and the major dialects in China. Examples in real life settings will be given to illustrate the importance of the pragmatic framework in effective interpersonal communication and in proper understanding of Chinese cultures and society as reflected by language.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2002", "title": "Global China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This course examines China’s global connections in history as well as at present in a historical anthropological approach. While the whole world is fixated on contemporary China’s global presence with its economic prowess, this course highlights China’s multifaceted yet often unexplored engagement with the rest of the world over the past millennium. It surveys the economic, technological, political, and sociocultural aspects of engagements through trade, diplomacy, war, migration, studying abroad, reading, and imagination.", "outcome": "By the end of this course, students should:- Grasp the key historic events in China’s global history- Learn the basics of globalization in practice and in theory- Be exposed to the perspectives and methods of historical anthropology- Broaden knowledge horizon beyond China to study China - Develop analytical skills through reading and writing assignments", "syllabus": "1. Introduction: China and the World2. Globalization Revisted3. The Silk Road4. The Sea Silk Road5. The Canton System6. Missionaries in China7. Chinese Diasporas8. Students in and of the West9. Repositioning Chin in the 20th Century10. Open and Reform 11. Global China in the 21st Century: I12. Global China in the 21st Century: II", "required_readings": "1. Introduction: China and the World• Brook, T. (2008). Selected chapters. Vermeer's Hat: The Seventeenth Century and the Dawn of the Global World. New York, Bloomsbury Press.2. Globalization Revisted• Wolf, Eric. 1982. Introduction and “The Fur Trade,” Europe and the People Without History. Berkeley: University of California Press. • Harvey, David. 1990. “Time-Space Compression and the Postmodern Condition,” in The Condition of Postmodernity. Pp.240-2593. The Silk Road• Millward, James A. 2013. The Silk Road: A Very Short Introduction4. The Sea Silk Road• Dreyer, Edward L. 2007. Chapter 1. Zheng He: China and the Oceans in the Early Ming Dynasty, 1405-1433. Pearson Longman. 5. The Canton System• Van Dyke, Paul A. 2005. Introduction & Chapter 2. The Canton Trade: Life and Enterprise on the China Coast, 1700-1845. Hong Kong University.6. Missionaries in China• Spence, Jonathan. 1980. Selected chapters. To Change China: Western Advisers in China, 1620-1960. 7. Chinese Diasporas• Siu, Lok. 2005. Chapter 3 “Migration Stories: Serial Migration and the Production of Home and Identity in Diaspora,” in Memories of a Future Home: Diasporic Citizenship in Panama. Stanford University Press.8. Students in and of the West• La Fargue, Thomas E. 1987. Selected pages.  China's first hundred: educational mission students in the United States, 1872-1881. Washington State University Press. • Spence, Jonathan D. 1981. \"Preface” & “Wanderings.\" In The Gate of Heavenly Peace, xi-xv, 61-88. Viking 9. Repositioning China in the 20th Century • Shao, Qin. 2004. \"Exhibiting the Modern: The Creation of the First Chinese Museum, 1905-1930.\" The China Quarterly (179):684-702.10. Open and Reform• Cheek, Timothy. 2007. “Chap. 6: China in the world today,” in Living with Reform China since 1989. 11. China and the World in the 21st Century: I • Fong, Vanessa L. 2004. \"Filial Nationalism among Chinese Teenagers with Global Identities.\" American Ethnologist 31, no. 4: 631-48.12. China and the World in the 21st Century: II • Simpfendorfer, Ben. 2009. The New Silk Road: How a Rising Arab World is Turning Away from the West and Rediscovering China. Palgrave Macmillan. Ch. 1, “The New Silk Road,” pp. 7-27, and Ch. 8, “Implications for the West: A New Center of Gravity,” pp. 154-173  • James T. H. Tang, “Hong Kong in Transition: Globalization Versus Nationalization.” In Ming K. Chan, ed., The Challenge of Hong Kong’s Reintegration with China (Hong Kong: Hong Kong University Press, 1997), pp. 177-194", "recommended_readings": "• Trouillot, Michel-Rolph. 2003. Global Transformations: Anthropology and the Modern World. Palgrave-Macmillan.• Inda, Jonathan Xavier and Renato Rosaldo, ed. 2002. The Anthropology of Globalization: a Reader. Malden, MA: Blackwell• Wills, John E. 2001. Part III. 1688: A Global History. New York & London: W.W. Norton & Company.• Hansen, Valerie. 2012. The Silk Road: A New History. Oxford University Press.• Whitefield, Susan. 1999. Life Along the Silk Road. University of California Press.• Cheong, Weng Eang. 1997. The Hong Merchants of Canton: Chinese Merchants in Sino-Western Trade, 1684-1798• Pál Nyíri, 2003. “Moving Targets: Chinese Christian Proselytising Among Transnational Migrants from the People's Republic of China.” European Journal of East Asian Studies, vol. 2(2), pp. 263-301.• Biele, Stacey. 2004.  Patriots Or Traitors: A History of American Educated Chinese Students. M.E.Sharpe.", "terms": {"2020-21 Term 2": {"--LEC (6121)": {"startTimes": ["8:30"], "endTimes": ["10:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor Severine ARSENE"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}, "-T01-TUT (8999)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor Severine ARSENE"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}}, "assessments": {"Essays": "25", "Others": "20", "Presentation": "30", "Short answer test or exam": "25"}}, {"code": "2003", "title": "Thinking about Contemporary China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This course offers an introductory exploration of the cultural, economic, social, and political dimensions of contemporary China. We will discuss everyday Chinese society and culture, China’s recent formative history, the phenomenon of China’s economic “rise,” and the resulting costs, challenges, and trajectories of its ongoing transformation.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2005", "title": "Contemporary Chinese Popular Culture", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "From Beijing to Hong Kong, Shanghai to Taipei and beyond, this course explores the multiple, effervescent realms of popular culture in China and Chinese communities around the world today. Through reading, talking and writing about and also viewing, listening to and taking part in aspects of Chinese popular culture, students will investigate its production, mass attraction, commercial and social-political presence, and significance to Chinese people and societies and global mass culture. Topics to be presented and analysed will include popular print and online fiction, popular print magazines, animated fiction, animation, popular films, popular music, popular commercial and non-commercial art, television shows, video games, online games and entertainments, popular live culture entertainment, street fashion, body culture, and mass cultural trends.", "outcome": "By the end of the semester, students will attain:\r - a detailed understanding of the realm of popular culture in China today and strategies for thinking about its significance. \r - a first-hand experience of the varied and particular forms of contemporary Chinese popular culture and their attraction to large numbers of people. \r - the ability to reflect critically and express, orally and in writing, well-informed interpretations of popular cultural forms.", "syllabus": "1. The explosion of popular culture in reform era China\r 2. Popular culture and commerce in China today\r 3. Popular culture in print\r 4. popular culture on screen\r 5. digitized and on-line popular culture\r 6. The sound-scape of popular music\r 7. Bodily habits and living popular culture\r 8. Popular culture in a global context\r 9. Chinese culture and Chinese popular culture", "required_readings": "1. Perry Link and Richard Madsen, Unofficial China\r 2. James Lull, China Turned On\r 3. Jonathan Campbell, Red Rock\r 4. Marc Moskowitz, Cries of Joy, Songs of Sorrow\r 5. Paul Clark, Youth Culture in China\r 6. Juanjuan Wu, From Mao to Now", "recommended_readings": "1. Zha Jianying, China Pop", "terms": {"2020-21 Term 1": {"--LEC (4963)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr. SUN Lin"], "meetingDates": ["10/9", "17/9", "24/9"]}}}, "assessments": {"Essays": "10", "Essay test or exam": "30", "Others": "20", "Presentation": "20", "Short answer test or exam": "20"}}, {"code": "2030", "title": "Modern Chinese Literature", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This course is a survey of modern Chinese literature in translation. Starting with an examination of definitions of literary modernity itself, the category of Chinese literature and literary trends in late imperial times, the course will discuss new genres, styles and themes of fiction, poetry and non-fiction in the Republican era, the emergence of distinctive Taiwan, Hong Kong, and diasporic sinophone literature, socialist and post-socialist literature, and trends in Chinese literature within the context of globalization at the end of the twentieth century. The course will also involve close engagement with several significant twentieth-century authors and their major works and offer students an opportunity to explore these writings and gain from their insights into the complexities and diversity of Chinese culture and society.", "outcome": "By the end of the semester, students will have attained:\r - a solid sense of the major themes, figures, and issues of modern Chinese literature.\r - skills in close reading and theoretically informed analysis of texts of Chinese literature. \r - an ability to express well-informed and reasoned opinions in oral and written presentation and based on careful textual interpretation. \r - an awareness of the complexity to modern Chinese literature and the insights it offers into Chinese culture and society.", "syllabus": "1. Chinese literature and the literary modern\r 2. Anticipations in late Qing fiction and culture\r 3. The literary revolution of the 1910s and 1920s\r 4. Genres of the new literature \r 5. Literary culture and politics of the 1930s\r 6. Literature in war and revolution\r 7. Taiwan and Hong Kong literature \r 8. Diasporic and sinophone literature\r 9. Trends in late twentieth century Chinese literature in a globalized context", "required_readings": "1. Wu Woyao, Vignettes from the Late Ch’ing: Bizarre Happenings Witnessed over Two Decades \r 2. Lu Xun, The True Story of Ah Q\r 3. Lu Xun, Medicine\r 4. Ding Ling, Diary of Miss Sophie\r 5. Yu Dafu, Sinking\r 6. Shen Congwen, Collected Stories\r 7. Xu Zhimo, Selected Poems\r 8. Wen Yiduo, Selected Poems\r 9. Ba Jin, Family\r 10. Mu Shiying, Selected Stories\r 11. Zhang Ailing, Collected Stories\r 12. Su Qing, Collected Stories\r 13. Lao She, Teahouse\r 14. Mao Zedong, Yanan Talks on Literature\r 15. Pai Hsien-yung, Taipei People\r 16. Leung Ping-kwan, Fly Heads and Bird Claws\r 17. Gao Xingjian, Soul Mountain\r 18. Bei Dao, At the Sky’s Edge\r 19. Wei Hui, Shanghai Baby\r 20. Mo Yan, Life and Death are Wearing Me Out", "recommended_readings": "1. C.T. Hsia, Modern Chinese Stories and Novellas\r 2. C.T. Hsai, A History of Modern Chinese Fiction\r 3. Leo Lee, Shanghai Modern\r 4. David Wang, Writing Taiwan\r 5. Joseph Lau and Howard Goldblatt, Anthology of Modern Chinese Literature", "terms": {"2020-21 Term 2": {"--LEC (6194)": {"startTimes": ["8:30"], "endTimes": ["10:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor GAO Yunwen"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}, "-T01-TUT (7320)": {"startTimes": ["13:30"], "endTimes": ["14:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor GAO Yunwen"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 2": {"--LEC (7736)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Lee Shau Kee Building LT7"], "instructors": ["Professor GAO Yunwen"], "meetingDates": ["13/1", "20/1", "27/1"]}, "-T01-TUT (7759)": {"startTimes": ["13:30"], "endTimes": ["14:15"], "days": [2], "locations": ["Cheng Yu Tung Building 203"], "instructors": ["Professor GAO Yunwen"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "20", "Others": "20", "Presentation": "20", "Short answer test or exam": "20"}}, {"code": "2120", "title": "Chinese Family and Marriage", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This course explores the topic of the Chinese family, its variety of forms, functions and relationship dynamics from the pre-1949 era to the present. With a special focus on urban and rural dichotomy, the course will analyze the evolution of the Chinese family and its contemporary related social issues. Topics will include the “traditional” institutions in the Han Chinese family system and their modern transformations during the Maoist era, the family model among “ethnic minorities,” and contemporary social challenges facing Chinese families (such as family planning, property, and “left-over women”).", "outcome": "By the end of the semester, students should:\r - be familiar with the anthropology of family and kinship. \r - have a basic knowledge of Chinese family’s social changes. \r - be familiar with the sources available in English on this topic. \r - demonstrate an improved ability to present clear oral and written analysis.", "syllabus": "1. Course Introduction \r 2. The pre-1949 Chinese family: An Overview \r 3. Kinship and Lineage\r 4. Marriage and Gender Relations \r 5. Childcare and Education \r 6. Maoist revolutions\r 7. Rural-urban Differences \r 8. Marriage and family among non-Han groups\r 9. Post-reform Transformations\r 10. Contemporary challenges I: “Little Emperors”\r 11. Contemporary challenges II: “Who gets the house”\r 12. Contemporary challenges III: “Left-over women”", "required_readings": "1. Course Introduction \r Davis, Deborah, and Sara Friedman, eds. 2014. Introduction. In Wives, Husbands, and Lovers: Marriage and Sexuality in Hong Kong, Taiwan, and Urban China, pp.1-38.\r  2. The pre-1949-era Chinese family \r Freedman, Maurice, 1970, Introduction, Family and Kinship in Chinese Society, Stanford, Stanford University Press. \r  3. Kinship and Lineage \r Faure, David, 1989, “The Lineage as a Cultural Invention: The Case of the Pearl River Delta,” Modern China, 15(1), pp. 4-36. \r  4. Marriage and Gender Relations \r Watson, Rubie S. 1991. “Wives, Concubines, and Maids: Servitude and Kinship in the Hong Kong Region, 1900-1940.” In Marriage and Inequality in Chinese Society, edited by Rubie S. Watson and Patricia B. Ebrey, 231-255. Berkeley: University of California Press.\r  5. Childcare and Education \r Wolf, Margery, “Child Training and the Chinese Family,” in, Freedman, Maurice, 1970, Family and Kinship in Chinese Society, Stanford, Stanford University Press, pp. 37-62. \r  6. Maoist revolutions\r Huang, Yuqin 2012, “Jumping Out of the Agricultural Gate” (tiaochu nongmen): Social Mobility and Gendered Intra-household Resource Distribution among Children in a Central Chinese Village, 1950- 2012,” China Perspectives, 4 (92), pp. 25-33. \r  7. Rural-urban Differences \r Huang Shu-min., 1992, “Re-examining the Extended Family in Chinese Peasant Society: Findings from a Fujian Village,” Australian Journal of Chinese Affairs, 27, pp: 25-38.\r Whyte, Martin King, 2005, “Continuity and Change in Urban Chinese Family,” The China Journal, 53, pp.9-33. \r  8. Marriage and family among non-Chinese group \r Mattison, S.M., 2010, “The Economic Impacts of Tourism and Erosion of the Visiting System among the Mosuo of Lugu Lake”, The Asia Pacific Journal of Anthropology, 11(2), pp. 157-174. \r  9. Post-reform Transformations\r Harrell, Stevan, and Gonçalo Santos. 2017. \"Introduction.\" In Transforming Patriarchy. Chinese Families in the 21st Century, edited by Gonçalo Santos and Stevan Harrell. Seattle: University of Washington Press, pp. 3-36.\r  10. Contemporary challenges I: “Little Emperors”\r Feng, Xiao-Tian, Poston Dudley L., and Wang Xiao-Tao, 2014, “China's One-child Policy and the Changing Family,” Journal of Comparative Family Studies, 45, 1, pp. 17-29.\r  11. Contemporary challenges II: “Who gets the house”\r Davis, Deborah S. 2010. \"Who Gets the House? Renegotiating Property Rights in Post-Socialist Urban China.\" Modern China 36 (5):463-492.\r  12. Contemporary challenges III: “Left-over women”\r Hong Fincher, Leta, 2014, Introduction in Leftover Women: The Resurgence of Gender Inequality in China (Asian Arguments series), London & New York: Zed Books.", "recommended_readings": "Ebrey, Patricia B., and James L. Watson, eds. 1986. Kinship Organization in Late Imperial China, 1000-1940, Studies on China. Berkeley: University of California Press.\r Ebrey, Patricia B. 1990. \"Women, Marriage, and the Family in Chinese History.\" In Heritage of China: Contemporary Perspectives on Chinese Civilization, edited by Paul S. Ropp, 197-223. Berkeley, Los Angeles & Oxford: University of California Press.\r Mann, Susan. 1987. \"Widows in the Kinship, Class, and Community Structures of Qing Dynasty China.\" The Journal of Asian Studies 46 (1):37-56.\r Mann, Susan. 2002. \"Grooming a Daughter for Marriage: Brides and Wives in the Mid-Qing Period.\" In Chinese Femininities, Chinese Masculinities: A Reader, edited by Susan Brownell and Jeffrey N. Wasserstrom, 93-119. Berkeley: University of California Press.\r Yang, C. K. 1959. The Chinese Family in the Communist Revolution. Cambridge: Technology Press distributed by Harvard University Press.\r Davis, Deborah S., and Stevan Harrell, eds. 1993. Chinese Families in the Post-Mao Era. Vol. 17, Studies on China. Berkeley: University of California Press.\r Bossen, Laurel. 2002. Chinese Women and Rural Development: Sixty Years of Change in Lu Village, Yunnan. Lanham, Md.: Rowman & Littlefield Publishers.\r Hershatter, Gail. 2007. \"Birthing Stories: Rural Midwives in 1950s China.\" In Dilemmas of Victory: The Early Years of the People's Republic of China, edited by Jeremy Brown and Paul Pickowicz, 337-358. Cambridge, MA: Harvard University Press.\r Selden, Mark. 1993. \"Family Strategies and Structure in Rural North China.\" In Chinese Families in the Post-Mao Era, edited by Deborah Davis and Stevan Harrell, 139-164. Berkeley: University of California Press.\r Evans, Harriet. 1997. Women and Sexuality in China: Female Sexuality and Gender Since 1949. New York: Continuum.\r Jacka, Tamara. 1997. Women's Work in Rural China: Change and Continuity in an Era of Reform. Cambridge, UK: Cambridge University Press.\r Davis, Deborah S. 2014. \"Privatization of Marriage in Post-Socialist China.\" Modern China 40 (6):551-577. \r Davis, Deborah, and Sara Friedman, eds. 2014. Wives, Husbands, and Lovers: Marriage and Sexuality in Hong Kong, Taiwan, and Urban China.\r Evans, Harriet. 2008. The Subject of Gender: Daughters and Mothers in Urban China, Asian voices. Lanham, MD: Rowman & Littlefield.\r Fong, Vanessa L. 2002. \"China's One-Child Policy and the Empowerment of Urban Daughters.\" American Anthropologist 104 (4):1098-1109.\r Friedman, Sara L. 2005. \"The Intimacy of State Power: Marriage, Liberation, and Socialist Subjects in Southeastern China.\" American Ethnologist 32:312-327.\r Murphy, Rachel, Ran Tao, and Xi Lu. 2011. \"Son Preference in Rural China: Patrilineal Families and Socioeconomic Change.\" Population and Development Review 37 (4):665-690. \r Song, Jing, and Nancy Luke. 2014. \"Fairy Brides from Heaven: Mate Selection in Rural China, 1949-2000.\" Journal of Comparative Family Studies XLV (4):497-515.\r Ling, Minhua. 2017. \"Precious Son, Reliable Daughter: Redefining Son Preference and Parent-Child Relations in Migrant Households in Urban China.\" The China Quarterly 229:150-171.", "terms": {"2020-21 Term 2": {"--LEC (4805)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor TAM Siu Mi Maria"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}}, "assessments": {"Essays": "35", "Others": "15", "Presentation": "25", "Short answer test or exam": "25"}}, {"code": "2150", "title": "War and Revolution in China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This course investigates the profound social, cultural and political transformations of war and revolution in China between the 1930s and 1950s. This period of China’s protracted war with Japan, civil war between Nationalists and Communists, and engagement in the Korean War amid the initial triumph of Mao Zedong’s Communist revolution was critical to the formation of the modern Chinese state and society. Through analysis of a wide range of readings in secondary and primary sources to be discussed and presented in class and in short papers, students will explore beyond the received narratives of political causes and military outcomes and in to the multiple ways in which war and revolution were manifested, experienced and remembered. The course will invite reflection on the complexities of social-cultural and political processes of change through war and revolution, as well as, more broadly, on the meanings and functions of violent mass conflicts for modern states and peoples.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2450", "title": "Business and China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "Twenty-first century capitalism has been marked by an increasing international economic interdependence. Modern multinational firms from the high-income countries have spread their businesses across the world just as the Chinese economy has undergone dramatic transformations. This course examines the rise of modern multinational companies, the revolutionary changes in the structure of global business systems since the 1970s, and China’s enterprise reforms in a global context. It will involve theoretical and macro-level analysis with detailed empirical analysis, as well as considerable examination of in-depth case studies from large Chinese firms.", "outcome": "By the end of the semester, students will have attained:\r - a deeper understanding of the place of Chinese business enterprise reform in the global context. \r - considerable familiarity with theoretical and macro-level forms of analysis of the place of major Chinese business enterprises in the Chinese and global economies. \r - skills of close analysis of in-depth business enterprise case studies. \r - the ability to present clearly and effectively in written and spoken forms the core findings and the explication of case study analysis.", "syllabus": "1. Multinational firms and 21st century global capitalism\r 2. The transformation of global business systems\r 3. The transformation of the Chinese economy since 1978 and Chinese business enterprises\r 4. International enterprises in China\r 5. State-owned-enterprises in the age of globalization\r 6. Analysing sector specific case studies I\r 7. Analysing sector specific cases studies II\r 8. Chinese enterprises and overseas expansion\r 9. Chinese business in the world economy", "required_readings": "1. Harvard Business school case studies (China enterprise cases)\r 2. Michael Spence, The Next Convergence (selections) \r 3. Stephen Roach, Unbalanced (selections)", "recommended_readings": "1. Jim Mann, Beijing Jeep\r 2. Sea-jin Chang, Multinational Firms in China\r 3. David Faure, China and Capitalism\r 4. Joseph Stiglitz and Justin Yifu Lin, The Industrial Policy Revolution I\r 5. Edward Steinfeld, Forging Reform in China\r 6. Edward Steinfeld, Playing Our Game", "terms": {"2020-21 Term 1": {"--LEC (7247)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor LI Chen"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2020-21 Summer Session": {"--LEC (1517)": {"startTimes": ["16:30", "16:30", "16:30"], "endTimes": ["19:15", "19:15", "19:15"], "days": [2, 3, 4], "locations": ["Online Teaching", "Online Teaching", "Online Teaching"], "instructors": ["Professor LI Chen", "Professor LI Chen", "Professor LI Chen"], "meetingDates": ["29/6", "6/7", "13/7", "20/7", "27/7", "30/6", "7/7", "14/7", "21/7", "28/7", "8/7", "15/7", "22/7", "29/7"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "20", "Others": "20", "Presentation": "20", "Short answer test or exam": "20"}}, {"code": "2800", "title": "Chinese Politics in Comparison", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "Comparison is a persistent feature of human thinking and political debate. But under what conditions is this strategy useful and when do we compare apples with oranges? This course will introduce students to the logic of comparative analysis and investigate comparative research on contemporary Chinese politics. It aims to help students with placing the country into the global map of political development and heighten their awareness of some unique features of politics in China.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3030", "title": "China under Mao", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "Almost forty years after the death of Mao, China is still coming to grips with what historians now call the Mao era, from the founding of the People’s Republic in 1949 to his death in 1976. The Mao era has had a profound impact on China’s politics, economy, society, and culture; it is still being felt today. Examining both primary sources and recent scholarship on the Mao years, this course studies the waves of political movements and how they affected the lives of the Chinese people.", "outcome": "By the end of the semester, students should:- understand the main political movements of the Mao era, and how they affected the Chinese people. - be able to analyze primary sources and secondary scholarship, using these texts to create arguments and support them with evidence. - understand how the Mao era continues to affect China today.", "syllabus": "1. China Stands Up: The Early Years of the People’s Republic2. Mao’s Revolutionary Doctrine3. Dilemmas of Victory4. The Hundred Flowers Campaign and the Anti-Rightist Movement5. The Great Leap Forward and the Famine6. Famine from the Ground Up7. The Red Guard Movement8. The Cult of Mao9. Everyday Life in the Cultural Revolution10. Cultural Revolution’s End: From the Nixon Visit to the Gang of Four11. Shades of Mao12. Memories of the Mao Period", "required_readings": "1. Mao, “The Chinese People Have Stood Up,” September 19492. Mao, “Report on the Peasant Movement in Hunan,” February 1927    Mao, “On New Democracy,” January 15, 1940    Mao, “Talks at the Yan’an Conference on Literature and Art,” 1942    Mao, “Resolution of the Central Committee of the Chinese Communist Party on Methods of Leadership,” June 1, 1943    Cheek, Timothy.  “Comrade, Chairman, Helmsman—the Continuous Revolutions of Mao Zedong.”  In Mao Zedong and China’s Revolutions: A Brief History with Documents.  New York: Palgrave, 2002.  Pp. 1-36.3. Cheng and Lestz, “The Birth of the People’s Republic,” pp. 358-376.    Lawrence, “The Early Years of the People’s Republic,” pp. 120-140.    Zhao Ma, “Introduction: Remolding the Chinese Society: People, Cadres, and Mass Campaigns in the 1950s and 60s,” Frontiers of History in China, 7:4 (December 2012): 495-498.    Wakeman, Frederic, “’Cleanup’: The New Order in Shanghai.”  In Dilemmas of Victory, edited by Jeremy Brown and Paul G. Pickowicz.  Cambridge, MA: Harvard University Press, 2010.   4. Mao, “On the Correct Handling of Contradictions Among the People,” June 1957.    Cheng and Lestz, “The Hundred Flowers Campaign,” pp. 385-399.    Lawrence, “The Hundred Flowers,” pp. 141-156.      MacFarquhar, Roderick.  The Hundred Flowers Campaign and the Chinese Intellectuals.  New York: Frederick A. Praeger, 1960.  Pp. 3-14.    Goldman, Merle.  China’s Intellectuals: Advise and Dissent.  Cambridge, MA: Harvard University Press, 1981.  Pp. 1-17.  5. Cheng and Lestz, pp. 400-413.    Lawrence, “The Great Leap Forward,” pp. 158-182.      Ash, Robert.  “Squeezing the Peasants: Grain Extraction, Food Consumption and Rural Living Standards in Mao’s China.” In The History of the PRC, edited by Julia Strauss.      Weigelin-Schwiedrzik, Susanne.  “Re-Imagining the Chinese Peasant: The Historiography of the Great Leap Forward.”6. Zhou Xun, The Great Famine in China, 1958-1962: A Documentary History, pp. 59-71, 91-141.      Smith, Steve A.  “Local Cadres Confront the Supernatural: The Politics of Holy Water (Shenshui) in the PRC, 1949-1966.”  In The History of the PRC, edited by Julia Strauss.      Wemheuer, Felix.  “Regime Changes of Memories: Official History of the Ukrainian and Chinese Famine Under State Socialism and After the Cold War.”  7. Mao, “Just a Few Words,” Lin Biao, “Why a Cultural Revolution?,” and Zhou Enlai, “Mao Zedong Thought is the Sole Criterion of Truth”    Schoenhals, Not a Dinner Party, pp. 148-150, 173-184    Zheng, Xiaowei.  “Passion, Reflection, and Survival: Political Choices of Red Guards at Qinghua University, June 1966-July 1968.”  In The Cultural Revolution as History.  Stanford, CA: Stanford University Press, 2006.  8. Schoenhals, Not a Dinner Party, pp. 185-242.    Chen Ruoxi, “Jingjing’s Birthday,” in The Execution of Mayor Yin and Other Stories from the Great Proletarian Cultural Revolution.  Bloomington & Indianapolis: Indiana University Press, 2004.  Pp. 34-61.    Leese, Daniel.  “The Little Red Book,” in Mao Cult: Rhetoric and Ritual in China’s Cultural Revolution Cambridge: Cambridge University Press, 2011.   9. Chen, Xiaomei.  “Growing Up with Posters in the Maoist Era,” in Picturing Power in the People’s Republic of China (Lanham, MD: Rowman & Littlefield, 1999), pp. 101-119.  10. “The Shanghai Communique,” February 27, 1972     Central Committee Obituary on Mao, October 1976     Cook, Alexander.  “Settling Accounts: Law as History in the Trial of the Gang of Four” in Law and History, Current Legal Issues 6, edited by Andrew Lewis and Michael Lobban (Oxford University Press, 2003).  11. Central Committee, “Resolution on Certain Questions in the history of our Party,” June 27, 1981     Schoenhals, Not a Dinner Party, “Official Verdicts,” pp. 291-312     Dirlik, Arif.  “Mao Zedong in Contemporary Chinese Official Discourse and History,” China Perspectives, No. 2012/2 (2012): 17-27.  12. Wasserstrom, “Mao Matters,” 1996     Barme, Shades of Mao, excerpts.       Schoenhals, Not a Dinner Party, “Ordinary People Remember,” 313-355     Hubbert, Jennifer.  “(Re)collecting Mao: Memory and fetish in contemporary China.”  American Ethnologist Vol. 33 No. 2 (May 2006), 145-161.     Yang, Guobin.  “’A Portrait of Martyr Jiang Qing’: The Chinese Cultural Revolution on the Internet.”  In Re-envisioning the Chinese Revolution: The Politics and Poetics of Collective Memories in Reform China, edited by Ching Kwan Lee and Guobin Yang. Washington, D.C. and Stanford, CA: Woodrow Wilson Center Press and Stanford University Press, 2007, 287-316.", "recommended_readings": "To be determined by teacher concerned", "terms": {"2020-21 Term 1": {"--LEC (7615)": {"startTimes": ["8:30"], "endTimes": ["10:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor Jan Francis KIELY"], "meetingDates": ["10/9", "17/9", "24/9"]}, "-T01-TUT (7616)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor Jan Francis KIELY"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}, "2021-22 Term 2": {"--LEC (7761)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Esther Lee Bldg 306"], "instructors": ["Professor Jan Francis KIELY"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Essays": "40", "Others": "60"}}, {"code": "3050", "title": "Shanghai in Modern and Contemporary China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This course studies the history and development of the city of Shanghai, from provincial backwater to international metropolis. As a point of economic, political, and social contact between China and the world, Shanghai has a primary place in both the Chinese and the foreign imagination. In this role, Shanghai has been a model of and for Chinese modernity, though this model has been alternatively championed, critiqued, and questioned. In this course, students will not only study Shanghai’s history and contemporary place in China, they will also consider how historical and contemporary actors have portrayed Shanghai as a model for modernity.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3101", "title": "Media China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "Over the last three decades the Chinese media underwent a dramatic and ongoing transformation. How has this change affected Chinese politics? This course examines how politics constrain the media and how the media, in turn, shape the political process. It targets rather advanced undergraduate students that possess some background knowledge on contemporary Chinese politics, society, or communication.The course will begin with a brief introduction to the history of the media in China under Communist Party rule. It will then trace the process of commercialization and internet development, and explore how these structural changes gave rise to resolute investigative journalism and flourishing online activism, as well as adaptive reconfigurations of state propaganda and censorship. This is followed by detailed investigations of media effects on popular protest, political attitudes, policy making, nationalism, and diplomacy. The class concludes with a discussion of the links between media transformation and political change.", "outcome": "By the end of the term students should: \r - be familiar with the major changes in the Chinese media since the beginning of reform politics\r - be able to identify key issues of media impacts on Chinese politics\r - have improved their capacity of developing and defending a coherent argument in speaking and writing", "syllabus": "Topic 1 Introduction\r Topic 2 The Party and the Media\r Topic 3 Media Commercialization\r Topic 4 The Development of the Internet\r Topic 5 Investigative Journalism\r Topic 6 Online Activism\r Topic 7 Propaganda and Party Ideology 2.0\r Topic 8 Censorship 2.0\r Topic 9 The Media and Popular Protest\r Topic 10 Media Use and Political Attitudes\r Topic 11 Popular Pressure and Policy Making \r Topic 12 Mediated Nationalism\r Topic 13 Chinese Public Diplomacy and China-Reporting Abroad\r Topic 14 Conclusion: Media Transformation and Political Change?", "required_readings": "1. Shirk. 2011. Changing Media, Changing China, chap 1\r 2. Stockmann. 2013. Media Commercialization and Authoritarian Rule in China, chap. 3\r 3. Brady. 2008. Marketing Dictatorship, chap. 44\r 4. Stern and Hassid. 2012. Amplifying Silence", "recommended_readings": "To be determined by teacher concerned", "terms": {"2020-21 Term 2": {"--LEC (6122)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Cheng Yu Tung Building 203"], "instructors": ["Professor Severine ARSENE"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (7762)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Sino Building LT2"], "instructors": ["Professor Severine ARSENE"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Essays": "50", "Others": "25", "Presentation": "25"}}, {"code": "3102", "title": "Contemporary China: Summer Fieldwork", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "Pre-requisite: CCSS1001 or 1004 or 1005 or 1006 or 1010;Not for students who have taken CHES3003", "description": "The field trip will take place either in mainland China or Taiwan. Students will be guided to learn and experience firsthand Chinese culture and society.", "outcome": "By the end of the field trip, students should:\r - learn about and experience firsthand Chinese culture and society.\r - learn to observe human behavior and how to collect and consolidate data.\r - be able to prepare coherent presentations and fieldtrip reports.\r - learn to work cooperatively in teams.", "syllabus": "To be determined by teacher concerned", "required_readings": "To be determined by teacher concerned", "recommended_readings": "To be determined by teacher concerned", "terms": {"2020-21 Summer Session": {"-F01-FLD (1181)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor GAO Yunwen"], "meetingDates": ["18/05/2021 - 29/06/2021"]}}}, "assessments": {"Essays": "30", "Others": "50", "Presentation": "20"}}, {"code": "3103", "title": "Guided Fieldwork in China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ProjectInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This course offers students an opportunity to conduct individual fieldwork research in China under the guidance of a faculty instructor. Projects will be designed by the student in consultation with the faculty instructor and will be assessed by various means, including a detailed final fieldwork report or research paper.", "outcome": "Students will: \r - Learn in-depth about an aspect of Chinese society, culture, language, literature, philosophy, religion, history, economy, or politics and governance through an on-the-ground fieldwork research project in China. \r - Learn how to design a fieldwork research project. \r - Learn methods for fieldwork research relevant to their particular project. \r - Learn how to manage fieldwork data collection.\r - Learn how to report clearly and in detail on fieldwork findings.\r - Gain a greater understanding of functioning and carrying out an endeavour in China today.", "syllabus": "1. Preparing to Conduct Fieldwork in China \r 2. Designing a Fieldwork Research Project\r 3. Knowing the Academic Field\r 4. Knowing the Field Site\r 5. Fieldwork Methods\r 6. Managing Data Collection\r 7. Writing a Fieldwork Report", "required_readings": "These will depend on the research topics proposed and so be tailored to each student.", "recommended_readings": "To be determined by teacher concerned", "terms": {"2020-21 Term 1": {"-J01-PRJ (9133)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor John LAGERWEY"], "meetingDates": ["13/09/2020 - 06/12/2020"]}}, "2021-22 Term 1": {"-J01-PRJ (4971)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["07/09/2021 - 30/11/2021"]}}, "2021-22 Term 2": {"-J01-PRJ (6855)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Essays": "40", "Lab reports": "40", "Presentation": "20"}}, {"code": "3106", "title": "China Experience Internship", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This internship course will make it possible for CCS majors to “learn through doing” and “learn through social experience” in a faculty-guided and assessed internship with an organization, institution, company or enterprise in which lessons can be learned about how to make the language, cultural, social and economics-based knowledge and analytical, critical thinking and presentation expression skills learned in China studies relevant to the wide range of “real world” fields outside of the university. In keeping with the CCS educational approach, this course encourages majors to take advantage of learning “on-site” in such an internship based in Hong Kong, mainland China or Taiwan, with the course registered during the regular academic terms or in the summer school terms. Students will be expected to provide regular progress reports to their faculty adviser through a diary or online blog or video presentation, and will submit a final report assessing the organization, its engagement with Chinese society, economy, culture, and the lessons learned for practically applying area studies knowledge and skills to this field. A final oral presentation will also be given and assessed before faculty and student peers at an annual presentation of internships.", "outcome": "This guided internship will prepare students to\r 1) Learn from service and engagement with “real world” enterprises that relate to China; 2) Develop an understanding of how their knowledge and skills developed in their major can be applied in a variety of careers. \r 3) Prepare for career development with a better understanding of the working world today. \r 4) Come to an awareness of hands-on skills and additional knowledge areas to acquire that when combined with China studies knowledge and skills can help post-graduation advancement and serve society.", "syllabus": "1.Identifying opportunities for learning in society\r 2.Understanding organizations and fields that engage with China\r 3. Connecting China studies knowledge and skills to social learning\r 4. Preparing for an internship\r 5. Progress reports and challenges\r 6. Preparing the Final Report and Presentation\r 7. Learning from Experience\r 8. Presenting Findings: Final Report and Presentation", "required_readings": "To be determined by teacher concerned", "recommended_readings": "Baird, B.N. The Internship Practicum, and Field Placement Handbook (2010)\r Tse, Edward. China’s Disruptors (2015) \r Osnos, Evan, Age of Ambition (2014) \r Christensen, Matthew, Decoding China (2013)\r Wasserstrom, Jeffrey, China in the 21st Century (2013)", "terms": {"2021-22 Term 1": {"-P01-PRA (4972)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-P01-PRA (7698)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["11/01/2022 - 19/04/2022"]}}}, "assessments": {"Essays": "40", "Lab reports": "30", "Presentation": "30"}}, {"code": "3110", "title": "Social Science Research Methods and China Studies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This course familiarizes advanced undergraduate students with the fundamentals of empirical research methods and design in the social sciences. The course will be structured into two parts. Part one reviews fundamental concepts of social science research and introduces the major methodological approaches in the social sciences. In the second part the instructor will guide students in designing their own research proposals with a specific focus on specifying research questions and selecting appropriate methods. At the end of the course students should have acquired a solid understanding of the logic of social enquiry and developed a feasible empirical research proposal in the field of social scientific China Studies.", "outcome": "1. To familiarizes advanced undergraduate students with the fundamentals of empirical research methods and design in the social sciences\r 2. To introduce fundamental concepts and major methodological approaches in social science research \r 3. To enable students to plan a feasible empirical research project in the field of social scientific China Studies", "syllabus": "1. Introduction: what is a method and why do we need it?\r 2. Fundamentals: paradigms, theories, hypotheses, evidence\r 3. The logic of comparison I \r 4. The logic of comparison II \r 5. The logic of stories (case studies) I\r 6. The logic of stories (case studies) II\r 7. The logic of numbers (quantitative research) I\r 8. The logic of numbers (quantitative research) II\r 9. Revision and reflection\r 10. Research design\r 12. Research proposal presentation and discussion\r 13. Research proposal presentation and discussion\r 14. Conclusion", "required_readings": "Brady, Henry, and David Collier. 2010. Rethinking Social Inquiry: Diverse Tools, Shared Standards. Second Edition edition. Lanham, Md: Rowman & Littlefield Publishers.\r Gerring, John. 2001. Social Science Methodology: A Criterial Framework. Cambridge; New York: Cambridge University Press.\r ———. 2007. Case Study Research: Principles and Practices. Ithaca: Cornell University Press.\r King, Gary, Robert O. Keohane, and Sidney Verba. 1994. Designing Social Inquiry: Scientific Inference in Qualitative Research. Princeton, N.J: Princeton University Press.\r Lijphart, Arend. 1971. “Comparative Politics and the Comparative Method.” The American Political Science Review 65 (3): 682–93. doi:10.2307/1955513.\r Sirkin, R. Mark. 2005. Statistics for the Social Sciences. 3rd edition. Thousand Oaks, Calif: SAGE Publications, Inc.", "recommended_readings": "To be determined by teacher concerned", "terms": {"2020-21 Term 1": {"--LEC (6299)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor LING Minhua"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2021-22 Term 1": {"--LEC (4927)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Esther Lee Bldg 202"], "instructors": ["Professor Severine ARSENE"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Others": "60", "Presentation": "40"}}, {"code": "3111", "title": "Humanities Research on China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This course will provide a foundation for students to produce advanced China-focused research projects. Lectures will discuss the many variables involved in the research process, including formulating research questions, familiarity with the language of research, research ethics, methodology, among others. Additionally, assignments and discussions will begin to heighten student awareness of how their research interests and production can make meaningful contributions to the field of Chinese Studies.", "outcome": "By the end of this course, student should: - Have a strong understanding of the necessary components for producing research; - Be familiar with how their own research interests fit into the larger multi-disciplinary field of Chinese Studies; - Be able to effectively use important sources and tools for advanced research on China.", "syllabus": "1.  Foundations of effective writing2.  What is research?3.  Reading critically for research4.  Developing the Research Question5.  Research Design6.  Strategies and Sources in Research of China7.  Methodology8.  Constructing Arguments: Logic and Inference9.  What is Chinese Studies and what should it be?", "required_readings": "1. What is research?; Clough, Peter and Cathy Nutbrown. “What is research?”, in A student’s guide to methodology: justifying enquiry. London: SAGE, 2012, p. 3-23.2. Criticality and Research; Clough, Peter and Cathy Nutbrown. “Reading: Purpose and Positionality”, in A student’s guide to methodology: justifying enquiry. London: SAGE, 2012, p. 105-138.3. Research Design; Clough, Peter and Cathy Nutbrown. “Research Design: shaping the study”, in A student’s guide to methodology: justifying enquiry. London: SAGE, 2012, p. 175-196.4. Strategies and Sources in Research China; Ye Yunshan. The ALA guide to researching modern China. Chicago: ALA Editions, 2014, p. 17-102. (Chapters 3-8)5. Methodology; Clough, Peter and Cathy Nutbrown. “What is methodology?”, in A student’s guide to methodology: justifying enquiry. London: SAGE, 2012, p. 24-48.6. What is Chinese Studies?; Schafer, Edward H. “What and How is Sinology?” T’ang Studies, vol. 8-9, no. 4, 1990, p. 23-24.; Levenson, Joseph R. “The Humanistic Disciplines: Will Sinology Do?” Journal of Asian Studies, vol. 23, no. 4, 1996, p. 507-512.; Wright, Mary C. “Chinese History and the Historical Vocation” Journal of Asian Studies, vol. 23, no. 4, 1996, p. 513-516.; Skinner, G. William. “What the Study of China Can Do for Social Science” Journal of Asian Studies, vol. 23, no. 4, 1996, p. 517-522.; Freeman, Maurice. “What Social Science Can Do for Chinese Studies” Journal of Asian Studies, vol. 23, no. 4, 1996, p. 523-529.; Mote, Frederick W. “The Case for the Integrity of Sinology” Journal of Asian Studies, vol. 23, no. 4, 1996, p. 531-534.; Schwartz, Benjamin. “The Fetish of the ‘Disciplines’” Journal of Asian Studies, vol. 23, no. 4, 1996, p. 537-538.; Mote, Frederick W. “Note: Reflections on Chinese Language Study” Journal of Asian Studies, vol. 23, no. 4, 1996, p. 591-594.; Zhang Haihui, Zhaohui Xue, Shuyong Jiang, and Gary Lance Lugar, eds. A Scholarly Review of Chinese Studies in North America. Ann Arbor: Association for Asian Studies, 2013. (p. 148-173, 174-191, 192-231, 232-263, 264-291, 344-376, 377-389, 455-466)", "recommended_readings": "To be determined by teacher concerned", "terms": {"2020-21 Term 1": {"--LEC (5028)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. YANG Zhiqiang"], "meetingDates": ["11/9", "18/9", "25/9"]}}, "2021-22 Term 1": {"--LEC (4967)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Esther Lee Bldg 202"], "instructors": ["Professor Severine ARSENE"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Essays": "65", "Essay test or exam": "20", "Others": "15"}}, {"code": "3112", "title": "Fieldwork Methodology and China Studies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This course provides a survey of field research methods for advanced students in China Studies and other related disciplines. It also prepares students for their senior projects by guiding them through the process of qualitative research design. Students are introduced to key qualitative methods such as participant observation, interviewing, field-note taking, photography, and document and data analysis. This course will also discuss the moral, ethical and theoretical problems facing qualitative research as well as the particular challenges of doing field research in China.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3411", "title": "Cultural History of Modern China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "Not for students who have taken CHES3105", "description": "This course will focus on the emergence of two modern Chinas, that of the gentry and that of the people: 1) the re-emergence of Confucianism as \"this culture of ours\", eventually leading to the creation of lineage China in the 16th century; 2) the emergence of \"popular culture\", which includes a popular, increasingly state-supported pantheon of local gods, local festivals built around these gods, and popular literature (from the bianwen of the Tang to the xiaoshuo of the Ming).", "outcome": "1. Be familiar with central issues in the development of elite forms of Buddhism, Daoism, and Confucianism in the Song, Jin, and Yuan dynasties.2. Be familiar with the impact of Confucian orthodoxy on Ming-Qing Chinese culture and society.3. Be familiar with the central features of popular religion in the Song-Qing period.4. Be able to describe Song-Qing history using concepts like rationalization, interiorization, and secularization.5. Be able to make clear powerpoint presentations of readings in a strictly limited amount of time.", "syllabus": "Topic 1 Religion and Thought in the Song and JinTopic 2 Religion and Society in Ming-Qing China Topic 3 Chinese Festivals", "required_readings": "Paul Jakov Smith, “Introduction: Problematizing the Song-Yuan-Ming Transition,” in Paul Jakov Smith and Richard von Glahn, eds. The Song-Yuan-Ming Transition in Chinese History, pp. 1-34John W. Dardess: “Did the Mongols Matter? Territory, Power, and the Intelligentsia in China from the Northern Song to the Early Ming,” pp. 111-134Li Bozhong, “Was There a ‘Fourteenth-Century Turning point’? Population, Land, Technology, and Farm Management,” pp. 135-175", "recommended_readings": "None", "terms": {"2020-21 Term 1": {"--LEC (8007)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor John LAGERWEY"], "meetingDates": ["11/9", "18/9", "25/9"]}}, "2021-22 Term 1": {"--LEC (5356)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 402"], "instructors": ["Professor Jan Francis KIELY, \n\rProfessor John LAGERWEY"], "meetingDates": ["8/9", "15/9"]}}}, "assessments": {"Essay test or exam": "60", "Presentation": "40"}}, {"code": "3420", "title": "Social Issues and Problems in Contemporary China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This course examines the social problems that have emerged in contemporary China since the economic reform. With a substantive focus on inequality and social class formation, this course will analyze the shifting distribution of material assets, social status, and political power in today’s China.", "outcome": "Students will examine the natures and scopes of the social problems discussed and analyze the causes and implications of these social problems in economic, political, and sociocultural perspectives.  This course will also emphasize instructions on using on-line sources available at CUHK for any extensive research exercise so that students will be prepared for independent research projects for their thesis.", "syllabus": "1. China's Demographic Challenges2. Rural-urban Divide3. Migration and Urbanization4. Pollution and Food Safety5. Social Unrest6. Political Reform7. Ethnic and Frontier Issues8. China's Position in the Global Order", "required_readings": "To be determined by teacher concerned", "recommended_readings": "To be determined by teacher concerned", "terms": {"2020-21 Term 1": {"--LEC (4884)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. YANG Zhiqiang"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}}, "assessments": {"Essays": "45", "Others": "55"}}, {"code": "3440", "title": "China on Screen", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "Not for students who have taken CHES3101", "description": "Many 20th century Chinese films were mainly concerned with issues of nationhood, identity, trauma, and a national past. In recent years, however, while some directors have continued to focus on the nation, others have chosen to look at the present, as well as the effects of globalization on Chinese society, culture, and cinema production. This course asks that students begin to understand Chinese cinema(s) as transnational, a triangular composite of Mainland, Taiwan, and Hong Kong cinemas that has also been influenced by Japanese and Korean cinema. Students will be introduced to Chinese film history and criticism via an examination of thirteen films directed by several of Greater China's most skilled directors.", "outcome": "While “China on Screen” is by no means an exhaustive survey of Chinese cinema, the course will provide students with a detailed understanding of Chinese film history and criticism. Students will learn how to view films critically and how scholars and critics write about film. They are also expected to obtain a firm, if basic, grasp of modern Chinese history and its relation to cinema production in Greater China.", "syllabus": "None", "required_readings": "None", "recommended_readings": "1. Michael Berry, Speaking in Images: Interviews with Contemporary Chinese Filmmakers (New York:Columbia University Press, 2005).2. Sheldon Hsiao-peng Lu, Transnational Chinese Cinemas: Identity, Nationhood, Gender (Honolulu:University of Hawaii Press] 1997)3. Sheldon H. Lu and Emilie Yueh-yu Yeh, Chinese Language Film: Historiography, Poetics, Politics (Honolulu:University of Hawaii Press, 2005)4. Tonglin Lu, Confronting Modernity in the Cinemas of Taiwan and Mainland China(Cambridge, UKand New York: CambridgeUniversityPress, 2002)5. Stephen Teo, Wong Kar-wai (London:British Film Institute, 2005)6. Jing Wang and Tani E. Barlow,Cinema and Desire: Feminist Marxism and Cultural Politics in the Work of Dai Jinhua", "terms": {"2020-21 Term 1": {"--LEC (5830)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor TAM King Fai"], "meetingDates": ["10/9", "17/9", "24/9"]}, "-T01-TUT (5828)": {"startTimes": ["13:30"], "endTimes": ["14:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor TAM King Fai"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}}, "2021-22 Term 1": {"--LEC (4968)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Humanities Building 213"], "instructors": ["Professor Kristof VAN DEN TROOST"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}, "assessments": {"Essays": "40", "Essay test or exam": "40", "Others": "20"}}, {"code": "3460", "title": "Chinese Literature: Late Qing to the Present", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This course explores key themes and texts in Chinese literature from late imperial times to the present for advanced students with at least an introductory background in Chinese language and literature. It will focus on reading Chinese literary texts in translation alongside the original Chinese texts and will include readings in relevant literary criticism and cultural theory. Major themes may include representations of self, alienation, social class, gender, sexuality, colonialism, nation, “Chineseness,” diasporic identity, and post-modernity; the readings in critical theory may concern modernism, post-structuralism, cultural production, neo-Marxism, feminism, gender theory, post-colonialism, biopolitics, globalization, Lacanian analysis, and the discourse of the Sinophone.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3500", "title": "China in Regional and World Systems", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This course examines China’s changing roles in and approaches towards regional and world systems, with a particular focus on China in Asia and how China might fit into the changing global order. It outlines various theoretical approaches to regional and world systems and international order found in both International Relations and International Political Economy, to highlight differing interpretations of China’s international relations.", "outcome": "Students are expected to be able to discuss developments in China’s international relations, in particular in Asia, with reference to a number of different theoretical frameworks, and to have expressed these through discussions and written assignments.", "syllabus": "1. Historical perspective – The Chinese World Order\r 2. Overview of IR theory\r 3. Chinese approaches to IR\r 4. China and development of regional institutions in Asia\r 5. China and southeast Asia\r 6. China and central Asia\r 7. The role of the US in Asia\r 8. Chinese approaches to global governance\r 9. China as regional or global power", "required_readings": "1. David C. Kang (2012), East Asia Before the West: Five centuries of trade and tribute, NY, Columbia UP\r 2. Mark Beeson and Fujian Li (2014), China’s Regional Relations: Evolving Foreign Policy Dynamics, Boulder & London: Lynne Rienner\r 3. David Shambaugh (2013), China Goes Global: The Partial Power, OUP\r 4. Wu Guoguang, ed (2007), China Turns to Multilateralism: Foreign Policy and Regional Security, Routledge\r 5. Peter Shearman, ed (2014), Power Transition and International Order in Asia, Routledge, 2014\r 6. Amitav Acharya (2014), The End of American World Order, Polity Press\r 7. Evelyn Goh, The Struggle for Order; hegemony, hierarchy and transition in post-Cold War East Asia, Oxford: OUP, 2013 \r 8. John Ikenberry, Liberal Leviathan: The Origins, Crisis, and Transformation of the American World Order, Princeton, 2011\r 9. John J. Mearsheimer, The Tragedy of Great Power Politics, 2002 [updated edition published by Norton, 2014]\r 10. William A. Callahan and Elena Barabansteva, China Orders the World, 2011", "recommended_readings": "To be determined by teacher concerned", "terms": {"2020-21 Term 1": {"--LEC (7791)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor Timothy Andrew SUMMERS"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}, "-T01-TUT (7792)": {"startTimes": ["13:30"], "endTimes": ["14:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor Timothy Andrew SUMMERS"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2021-22 Term 1": {"--LEC (4969)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Chen Kou Bun Bldg UG05"], "instructors": ["Professor Timothy Andrew SUMMERS"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Essays": "40", "Essay test or exam": "25", "Others": "10", "Presentation": "25"}}, {"code": "3550", "title": "Political Economy of China’s Reform", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This course examines the key aspects of China’s institutional reform and political-economic development since the 1980s. It reviews the major policy controversies on China’s system transition, and presents the frontier research from the academia, policy think tanks and international institutions. Students will gain a deeper understanding of why and how China has reformed; and to what extent China’s experience may be generalized as a model for other developing countries.", "outcome": "By the end of the semester, students should:\r • gain a better understanding of the processes and mechanisms of China’s reform and institutional evolution since the 1970s\r • be familiar with various theoretical approaches and conceptual frameworks from the political-economic perspective to analyze China’s reform\r • be able to critically evaluate the major reform policy debates in contemporary China.", "syllabus": "1. Post-Soviet transition and China’s reform\r 2. big-bang therapy v.s incremental reform\r 3. Leadership and elite politics in China’s reform\r 4. Experimentalism in China’s reform\r 5. The architecture of China’s governance system: M-form v.s U-form\r 6. Industrial policy and large state-owned enterprise reform\r 7. China’s banking reform\r 8. China’s capital market reform\r 9. Fiscal reform\r 10. Local state corporatism \r 11. Bureaucracy and state capacity in China’s reform\r 12. Globalization and China’s reform", "required_readings": "Week 1-3 Post-Soviet transition and China’s reform: big-bang therapy v.s incremental reform\r McMillan, J. and Naughton, B. (1992) ‘How to reform a planned economy:\r lessons from China’, Oxford Review of Economic Policy, 8(1): 130–43 \r Shirk, S. (1993) The Political Logic of Economic Reform in China, Berkeley: University of California Press Murrell, P. (1993) “What is shock therapy? What did it do in Poland and Russia?”, Post Soviet Affairs, 9(2): 111–140\r  Week 4 Leadership and elite politics in China’s reform\r Li, Cheng and White, L. (1990) ‘Elite transformation and modern change in Mainland China and Taiwan’, China Quarterly, No.121: 1–35\r Zheng, Yongnian (2002) “Technocratic leadership, private entrepreneurship, and party transformation in the Post-Deng era’, in J. Wong and Zheng, Yongnian (eds.), China’s Post Jiang Leadership Succession: Problems and Perspectives, Singapore: Singapore University Press, pp. 87–119\r Li, Cheng (2011) China’s Midterm Jockeying: Gearing Up for 2012, Washington D.C: Brookings Institution\r  Week 5Experimentalism in China’s reform\r Heilmann, S. (2008a) “Policy experimentation in China’s economic rise”, Studies in Comparative International Development, 43 (1): 1-26\r Heilmann, S. (2008b) “From local experiments to national policy: The origins of China’s distinctive policy process”, China Journal, No.59: 1-30\r Heilmann, S. (2009) “Maximum tinkering under uncertainty: unorthodox lessons from China”, Modern China, 35(4): 450-62\r  Week 6 The architecture of China’s governance system: M-form v.s U-form\r Qian, Yingyi, Roland, G., and Xu, Chenggang (1999) ‘Why is China different from Eastern Europe? Perspectives from organization theory’, European Economic Review, 43(4–6): 1085–10944\r Qian, Yingyi (2000) “The process of China’s market transition (1978–1998): the evolutionary, historical, and comparative perspectives”, Journal of Institutional and Theoretical Economics, 156(1): 151–171\r Cai, Hongbin and Treisman, D. (2006) ‘Did government decentralization cause China’s economic miracle?’, World Politics, 58(4): 505–535\r Xu, Chenggang (2011) “The fundamental institutions of China’s reforms and development”, Journal of Economic Literature, 49 (4):1076-1151\r  Week 7-8 Industrial policy and large state-owned enterprise reform\r Nolan, P. (1996) “Large firms and industrial reform in former planned economies: the case of China”, Cambridge Journal of Economics, 20: 1–29\r Nolan, P. and Wang, X. (1999) “Beyond privatization: institutional innovation and growth in China’s large state-owned enterprises”, World Development, 27(1): 169–200\r Perkins, D. H. (2001) “Industrial and financial policy in China and Vietnam: a new model or a replay of the East Asian experience?” in J. E. Stiglitz and S. Yusuf (eds.), Rethinking the East Asian miracle, Washington, D.C.: World Bank, pp. 247–294\r  Week 9-10 China’s financial sector reform\r Allen, F., Qian, Ju and Qian, Meijun (2008) “China’s financial system: past, present and future” in. Brandt and T. Rawski (ed.), China’s Economic Transition: Origins, Mechanism, and Consequences, Cambridge: Cambridge University Press\r Huang, Yiping (2002) ‘Is meltdown of the Chinese banks inevitable?’, China Economic Review, 13(4): 382–387\r Heilmann, S. (2005) ‘Regulatory innovation by Leninist means: Communist party supervision in China’s financial industry’, China Quarterly, 181: 1–21 \r Walter, C. and Howie, F. (2006) Privatizing China: Inside China’s Stock Markets, Singapore: John Wiley & Sons\r Walter, C. and Howie, F. (2011) Red Capitalism: the Fragile Financial Foundation of China’s Extraordinary Rise, Singapore: John Wiley & Sons\r  Week 11-12 Fiscal reform and the evolution of local state corporatism\r Oi, J. (1992) “Fiscal reform and the economic foundation of local state corporatism in China”,World Politics, 45 (1): 99-126\r Oi, J. (1995) “The role of the local state in China’s transitional economy”, China Quarterly, No.144, pp 1132-1149\r Zhang, Le-Yin (1999) “Chinese central-provincial fiscal relationships, budgetary decline and the impact of the 1994 fiscal Reform: an evaluation,” China Quarterly, No.157. pp. 115-141\r Ho, Peter. (2001) “Who owns China’s land? Property rights and deliberate institutional ambiguity,” China Quarterly, No. 166, pp. 394-421\r Wong, C. (2013) “Reforming China’s public finances for long-term growth”, in Garnaut, R. and Song, L. (eds.). China: A New Model for Growth and Development, Canberra: Australian National University Press, pp. 199-219\r Wong, C. (2013) “Paying for urbanization: challenges for China’s municipal finance in the 21st Century”, in Bahl, R., Linn, J. and Wetzel, D. (eds.,). Metropolitan Government Finances in Developing Countries, Cambridge, MA: Lincoln Institute for Land Policy, 2013, pp. 273-308\r  Week 13-14 Bureaucracy and state capacity in China’s reform\r Yang, Dali (2001) ‘Rationalizing the Chinese state: the political economy of government reform’, In Chao, Chien-min and B. J. Dickson (eds.), Remaking the Chinese State: Strategies, Society, and Security, London: Routledge, pp.19–46.\r Pearson, M. (2005) “The business of governing business in China: institutions and norms of the emerging regulatory state”, World Politics, 57 (2): 296-322.\r Mertha, A. (2009) “Fragmented authoritarianism 2.0: political pluralization in the Chinese policy process” China Quarterly, No. 200, pp. 995-1012\r Wong, C. (2009) “Rebuilding government for the 21st Century: can China incrementally reform the public sector?” China Quarterly, No. 200, pp. 929-952.\r Tsang, S. (2009) “Consultative Leninism: China’s new political framework”, Journal of Contemporary China, No.62, pp.865-80\r  Week 15 Globalization and China’s reform (Optional)\r Saich, T. (2000) “Globalization, governance, and the authoritarian State: the case of China”, in Nye, J. and Keohane, R. (ed.), Governance in a Globalizing World, Washington DC: Brookings Institution, pp. 208-28.\r Lardy, N (2002) Integrating China into the Global Economy, Washington: Brookings Institution, pp. 1-28, 106-133.\r Steinfeld, E. (2004) ‘China’s shallow integration: networked production and the new challenges for late industrialization’, World Development, 32 (11): 1971–1987. Zheng, Bijian (2005) “China’s ‘Peaceful Rise’ to great-power status,” Foreign Affairs, 84(5):18-24.\r Huang, Yasheng (2011) ‘Rethinking the Beijing Consensus’, Asia Policy, 11: 1–26.\r Williamson, J. (2012) ‘Is the “Beijing Consensus” now dominant?’, Asia Policy, 13:1–16.\r The World Bank (2012), China 2030: Building a Modern, Harmonious, and Creative Society, Washington DC: The World Bank, pp 361-410.", "recommended_readings": "1. Naughton, B. (1995) Growing Out of the Plan: Chinese Economic Reform, 1978–1993, Cambridge: Cambridge University Press\r 2. Goldstein, S. (1995) “China in transition: the political foundations of incremental reform”, China Quarterly, No. 144, pp. 1105-113.\r 3. Burawoy, M. (1996) “The state and economic involution: Russia through a Chinese lens”,World Development, 24(6):1105–17\r 4. Solnick, S.L (1996) “The breakdown of hierarchies in the Soviet Union and China”, World Politics, 48 (2), pp. 209-238\r 5. Hellman, J. (1998) “Winners take all: the politics of partial reform in post-communist transitions,” World Politics 50(2): 203-234\r 6. Wu, Jinglian (2005) Understanding and Interpreting Chinese Economic Reform, Singapore: Thomson\r 7. Huang, Yasheng (2008) Capitalism with Chinese Characteristics: Entrepreneurship and the State, Cambridge: Cambridge University Press\r 8. Nolan, P. (1995) China’s Rise, Russia’s fall: Politics, Economics and Planning in the Transition from Stalinism, Basingstoke: Macmillan\r 9. Shirk, S. (1993) The Political Logic of Economic Reform in China, Berkeley: University of California Press\r 10. Lee, Hong Yung (1991) From Revolutionary Cadres to Party Technocrats in Socialist China, Berkeley: University of California Press\r 11. Li, Cheng (2001) China’s Leaders: the New Generation, Lanham MD: Rowman & Littlefield\r 12. Vogel, E. (2011) Deng Xiaoping and the Transformation of China, Cambridge, MA: Harvard University Press\r 13. Zhu, Rongji (2013) Zhu Rongji on the Record: The Road to Reform 1991-1997, Washington D.C: Brookings Institution.\r 14. Heilmann, S. and Perry, E. (2011) Mao’s Invisible Hand: The Political Foundations of Adaptive Governance in China, Cambridge, MA: Harvard University Press\r 15. Heilmann, S. (2011) “Making Plans for Markets: Policies for the Long Term in China”, Harvard Asia Quarterly, 13 (2):33-40\r 16. Heilmann, S. and Melton, O. (2012) “The Reinvention of Development Planning in China, 1993–2012”, Modern China, 39 (6): 580-628\r 17. Qian, Yingyi and Xu, Chenggang (1993) ‘Why China’s economic reforms differ: the M-form hierarchy and entry/expansion of the non-state sector’, Economics of Transition, 1(2): 135–170\r 18. Montinola, G., Qian, Yingyi and Weingast, B. R. (1995) ‘Federalism, Chinese style: the political basis for economic success in China’, World Politics, 48(1): 50–81\r 19. Qian, Yingyi and Weingast, B. R. (1996) ‘China’s transition to markets: market-preserving federalism, Chinese style’, Journal of Policy Reform, 1(2): 149–185\r 20. Steinfeld, E. (1998) Forging Reform in China: The Fate of State-Owned Industry, Cambridge: Cambridge University Press\r 21. Nolan, P. (2001) China and the Global Economy: National champions, Industrial Policy and the Big Business Revolution, London: Palgrave\r 22. Francis, C.B. (2001) “Quasi-public, quasi-private trends in emerging market economies: the case of China,” Comparative Politics, 33 (3): 275-94\r 23. Qian, Yingyi (2001) “Government control in corporate governance as a transitional institution: lessons from China”, in J. E. Stiglitz and S. Yusuf (eds.), Rethinking the East Asian miracle, Washington, D.C: World Bank, pp. 295–322\r 24. Sutherland, D. (2003) China’s Large Enterprises and the Challenge of Late Industrialisation, London: Routledge\r 25. Downs, E. (2008) “Business interest groups in Chinese politics: the cases of the oil companies”, in Cheng Li (ed.), China’s Changing Political Landscape: Prospects for Democracy, Washington D.C.: Brookings Institutions, pp.121–141\r 26. Brødsgaard, K. E. (2012) “Politics and business group formation in China: the Party in control?”, China Quarterly, No.211: 624–648\r 27. Heilmann, S. and Shih, L. (2013) The Rise of Industrial Policy in China, 1978–2012, Harvard-Yenching Institute Working Paper Series\r 28. Szamosszegi, A. and Kyle, C. (2011) An Analysis of State-owned Enterprises and State Capitalism in China, Washington D.C: US–China Economic and Security Review Commission\r 29. Allen, F., Qian, Ju and Qian, Meijun (2005) Law, Finance, and Economic Growth in China, Journal of Financial Economics, No.771: 57–116\r 30. Bowles, P and White, G. (1993) The Political Economy of China’s Financial Reforms: Finance in Late Development. Boulder: Westview Press\r 31. Lardy, N. (1998) China's Unfinished Economic Revolution, Washington: Brookings Institution, pp. 1-20, 59-127\r 32. Langlois, J. (2001) “The WTO and China’s financial system”, China Quarterly, No.167, pp. 610-6295\r 33. Fan, J. and Morck, R. (ed.) (2012) Capitalizing China, Chicago: The University of Chicago Press\r 34. Sanderson, H. and Forsythe, M. (2013) China's Super-bank: Debt, Oil and Influence – How China Development Bank is Rewriting the Rules of Finance, Singapore: John Wiley & Sons.\r 35. Lu, Yinqiu and Sun, Tao (2013) Local Government Financing Platforms in China: a Fortune or Misfortune? International Monetary Fund Working Papers 13/243\r 36. Huang, Yasheng, Saich, T. and Steinfeld, E. (eds.) (2005) Financial Sector Reform in China, Cambridge, MA: Harvard University Press\r 37. Shih, V. (2007) Factions and Finance in China: Elite Conflict and Inflation, Cambridge: Cambridge University Press\r 38. Downs, E. (2011) Inside China, Inc.: China Development Bank’s Cross-Border Energy Deals,Washington D.C.: Brookings Institution\r 39. Saich, T. (2002) “The blind man and the elephant: analysing the local state in China,” in East Asian Capitalism: Conflicts, Growth and Crisis, in Tomba, Luigi (ed.), Milan: Feltrinelli Editore, 2002), pp. 75-100\r 40. Jin, Hehui, Qian, Yingyi and Weingast, B. R. (2005) “Regional decentralization and fiscal incentives: federalism, Chinese style”, Journal of Public Economics, 89 (9–10):1719–1742\r 41. Krug, B. and Hendrischke, H. (2008) “Framing China: transformation and institutional change through co-evolution”, Management and Organization Review 4(1): 81–108\r 42. Kung, James, Xu, Chenggang and Zhou, Feizhou (2013) “From industrialization to urbanization: the social consequences of changing fiscal incentives on local governments’ behavior”, in D. Kennedy and J. Stiglitz (ed.), Law and Economics with Chinese Characteristics: Institutions for Promoting Development in the Twenty-First Century, Oxford: Oxford University Press\r 43. Lu, Yinqiu and Sun, Tao (2013) Local Government Financing Platforms in China: a Fortune or Misfortune? International Monetary Fund Working Papers 13/243\r 44. Wong, C. (1991) “Central-local relations in an era of fiscal decline: the paradox of fiscal decentralization in Post-Mao China’, China Quarterly, No. 128, pp. 691–715\r 45. Zheng, Yongnian (2004) Globalization and State Transformation in China, Cambridge: Cambridge University Press.\r 46. Steinfeld, E. (2010) Playing Our Game: Why China’s Economic Rise Doesn’t Threaten the West, Oxford: Oxford University Press.\r 47. Lieberthal, K. (2003) Governing China: From Revolution through Reform, New York: W. W. Norton & Company.\r 48. Zheng, Yongnian (2004) Globalization and State Transformation in China, Cambridge: Cambridge University Press.\r 49. Yang, Dali (2004) Remaking the Chinese Leviathan: Market Transition and the Politics of Governance in China. Stanford: Stanford University Press.\r 50. Landry, P. F. (2008) Decentralized Authoritarianism in China: the Communist Party’s Control of Local Elites in the Post-Mao Era, Cambridge: Cambridge University Press.\r 51. Zheng, Yongnian (2010) The Chinese Communist Party as Organizational Emperor: Culture, Reproduction and Transformation, London: Routledge.\r 52. Jung, Joo-Youn (2011) ‘Reinvented intervention: the Chinese central state and state-owned enterprise reform in the WTO era’, Oi, J. (ed.), The Politics of Corporate Restructuring and System Reform: Going Private in China, Stanford: Walter H. Shorenstein Asia-Pacific Research Centre.", "terms": {"2020-21 Term 2": {"--LEC (8983)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor LI Chen"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}}, "assessments": {"Essays": "25", "Essay test or exam": "25", "Others": "15", "Presentation": "25", "Short answer test or exam": "10"}}, {"code": "3610", "title": "Investment and Finance in China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This course will examine selected themes relevant to the rapidly changing Chinese economy of the past few decades, focusing, amongst others, on the changing consumer market and retail industry. Through lectures and research projects, students will learn about recent trends in specific industries.", "outcome": "By the end of the course, students are expected to:\r - have a thorough understanding of recent changes in China’s economy and business environment\r - be able to independently work on hands-on, business-related research\r - be able to present research findings clearly and convincingly", "syllabus": "1. Introduction: Thoughts on Chinese Consumer Market\r 2. Introduction: PRC historical background\r 3. Post-90s consumer revolution in China: changing demographics\r 4. Customer revolution: e-commerce and new patters of development\r 5. Mass-consumer society: history, meaning, possible future\r 6. Case study 1: Fashion industry a (Daphne and Shoes)\r 7. Case study 1: Fashion industry b (Li-Ning and Sportswear)\r 8. Case study 2: Automobile industry a (China Grand Auto)\r 9. Case study 2: Automobile industry b\r 10. Mass consumption and its international implications: China-EU food trade\r 11. Business environment in China and its future prospects\r 12. Student's presentations and assessment\r 13. Course conclusion", "required_readings": "1. Business environment in China \r General introduction\r - McKinsey, “All You Need to Know about Business in China,” http://www.mckinsey.com/business-functions/strategy-and-corporate-finance/our-insights/all- you-need-to-know-about-business-in-china\r - Goldman Sachs, “China in Transition,” http://www.goldmansachs.com/our- thinking/pages/china-an-economy-in-transition.html\r  Middle class\r - China-Britain Business Council, “China’s Middle Income Consumers,” http://www.cbbc.org/cbbc/media/cbbc_media/KnowledgeLibrary/Reports/Sector%20Profile/CB BC-China-s-Middle-Income-Consumers.pdf\r - McKinsey, “Mapping China's middle class,” http://www.mckinsey.com/industries/retail/our- insights/mapping-chinas-middle-class\r - Bloomberg, “Here's What China's Middle Classes Really Earn — and Spend,” http://www.bloomberg.com/news/articles/2016-03-09/here-s-what-china-s-middle-class-really- earn-and-spend\r - The Economist, “The new class war,” http://www.economist.com/news/special- report/21701653-chinas-middle-class-larger-richer-and-more-vocal-ever-threatens\r  Brands and intellectual property\r - The Economist, “The end of cheap China,” http://www.economist.com/node/21549956\r - Forbes, “The Revolutionary Rise Of The Chinese Brand,” http://www.forbes.com/sites/wadeshepard/2016/05/23/why-chinas-manufacturers-started-building-their-own-brands/#1ec5f1\r cb26c2\r - Rein, Shaun. The end of copycat China: the rise of creativity, innovation, and individualism in Asia. Hoboken, New Jersey: Wiley, 2014. (Access via Ebrary http://site.ebrary.com.easyaccess1.lib.cuhk.edu.hk/lib/cuhk/detail.action?docID=10937144)\r - 人民日報, “这些品牌为何能叫响,” http://finance.people.com.cn/BIG5/n1/2016/0822/c1004- 28653648.html\r  Luxury goods\r - The Economist, “China's addiction to luxury goods,” http://www.economist.com/blogs/economist-explains/2014/04/economist-explains-17\r - McKinsey, “Tapping China’s luxury-goods market,” http://www.mckinsey.com/business-functions/marketing-and-sales/our-insights/tapping-chinas-luxury-goods-market\r - Wall Street Journal, “When It Comes to Luxury, China Still Leads,” http://www.nytimes.com/2016/04/05/fashion/china-luxury-goods-retail.html- Rovai, Serena. Luxury the Chinese way: the emergence of a new competitive scenario. London: Palgrave Macmillan, 2016. (Access via Springer eBook Collection http://link.springer.com.easyaccess1.lib.cuhk.edu.hk/book/10.1057%2F9781137537751)\r  Internet revolution and e-commerce\r - McKinsey, “China’s digital transformation: The Internet’s impact on productivity and growth,” http://www.mckinseychina.com/wp-content/uploads/2014/08/MGI-China-digital_Full-report_July-2014.pdf?33c3a3\r - McKinsey, “China’s Rising Internet Wave: Wired Companies,” http://www.mckinseychina.com/chinas-rising-internet-wave-wired-companies/\r - KPMG, “E-commerce in China: Driving a new consumer culture,” https://www.kpmg.com/CN/en/IssuesAndInsights/ArticlesPublications/Newsletters/China- 360/Documents/China-360-Issue15-201401-E-commerce-in-China.pdf\r - Morgan Stanley, “China’s eCommerce Revolution,” http://www.morganstanley.com/ideas/china-e-commerce-revolution\r  Post-95s\r - The Economist, “The Net Generation, Unplugged,” http://www.economist.com/node/15582279\r - Visioncritical, “Generation Z characteristics: 5 infographics on the Gen Z lifestyle,” https://www.visioncritical.com/generation-z-infographics/\r - Refuel Agency, “Millennial Teens: Digital Explorer” http://research.refuelagency.com/wp-content/uploads/2015/07/Millennial-Teen-Digital-Explorer.pdf\r - 大數據文摘, “95 后基本不用微信,90 后研究报告!” http://mp.weixin.qq.com/s?__biz=MjM5MTQzNzU2NA==&mid=208840472&idx=1&sn=74a7d 49f567a3276dbbd9259c3c50c05&scene=21\r  2. Consumer and retail market evolution in China\r - World Economic Forum, “3 great forces changing China’s consumer market,” https://www.weforum.org/agenda/2016/01/3-great-forces-changing-chinas-consumer-market/\r - China Business Review, “Understanding Chinese Consumers,” http://www.chinabusinessreview.com/understanding-chinese-consumers/\r - The Economist, “All eyes on Chinese aisles,” http://www.economist.com/node/18712457\r - Business Insider. “Forget About The Consumer Revolution, China Has A Long Way To Go,”\r http://www.businessinsider.com/stratfor-china-consumer-2010-4\r - Holloman, Dave M. China catalyst: powering global growth by reaching the fastest growing consumer market in the world. Hoboken, New Jersey: Wiley, 2013.\r - Wang, Shuguang. China's new retail economy : a geographic perspective. New York, NY: Routledge, 2014.\r  3. Automobile \r - Tang, Rachel. “China’s Auto Sector Development and Policies: Issues and Implications,” https://www.hsdl.org/?view&did=718658\r - Deloitte, “Gaining momentum: Recent trends in China’s automobile parts market,” http://www2.deloitte.com/content/dam/Deloitte/cn/Documents/manufacturing/deloitte-cn-mfg- gaining-momentum-en-161111.pdf\r - McKinsey, “Bigger, better, broader: the perspective on China’s auto market in 2020,” http://www.sharpspixley.com/uploads/McKinseyPerspectiveonChinasautomarketin2020.pdf\r - China-Britain Business Council, “The Automotive Market in China,” http://www.ccilc.pt/sites/default/files/eu_sme_centre_sector_report_- _the_automotive_market_in_china_update_-_may_2015.pdf\r - Holweg, Matthias, Jianxi Luo, and Nick Oliver. “The past, present and future of China's automotive industry: a value chain perspective,” http://www.research.ed.ac.uk/portal/files/7765689/Oliver.pdf\r - OECD, “Recent Developments in the Automobile Industry,” https://www.oecd.org/eco/outlook/48333701.pdf\r - Baker, Mark and Markus Hyvonen. “The Emergence of the Chinese Automobile Sector,” http://www.rba.gov.au/publications/bulletin/2011/mar/pdf/bu-0311-4.pdf. \r - Chu, Wan-wen. “How the Chinese government promoted a global automobile industry,” Industrial and Corporate Change https://icc.oxfordjournals.org/content/early/2011/04/05/icc.dtr010.full.pdf?keytype=ref&ijkey=n XOTuAj2dWtz0UV. \r - Glebors, “Chinese automobile industry development,” http://www.glebors.com/bussiness/biz004.html\r - Iposos, “Trends in China’s Automotive Component Manufacturing Industry,” http://www.ipsosconsulting.com/pdf/Industry-Report-Trends-in-China's-Automotive- Component-Manufacturing-Industry.pdf\r - IBM Business Consulting services, “Inside China, The Chinese view their automotive future,” http://www-935.ibm.com/services/us/imc/pdf/ge510-6229-inside-china.pdf\r - McKinsey, “A road map to the future for the auto industry,” http://www.mckinsey.com/industries/automotive-and-assembly/our-insights/a-road-map-to- the-future-for-the-auto-industry\r - Merics, “E-mobility: China planning fresh start for domestic automobile industry,” http://www.merics.org/fileadmin/user_upload/downloads/China- Monitor/China_Monitor_No_17_en.pdf\r  4. Fashion and sportswear \r - HKTDC, “China’s Garment Market,” http://china-trade-research.hktdc.com/business- news/article/China-Consumer-Market/China-s-Garment- Market/ccm/en/1/1X000000/1X002L72.htm\r - Netherland Ambassador, “China’s Fashion Industry,” http://china.nlambassade.org/binaries/content/assets/postenweb/c/china/zaken-doen-in- china/sectoren/creatieve-industrie/china-fashion-industry-kansenrapport.pdf\r - ATKearney, “Winning China’s Apparel Market,” https://www.atkearney.com/documents/10192/1126588/Winning+China's+Apparel+Market.pdf /9ac5fb6d-6da1-40ae-94cb-f5a9d45abb2e\r - FBIC,” China’s Apparel Market, 2014,” https://www.fbicgroup.com/sites/default/files/China Retail - China%27s apparel market DEC 2014.pdf\r - WARC, “Sportswear edging luxury in China,” http://www.warc.com/LatestNews/News/Sportswear_edging_luxury_in_China.news?ID=36414\r  5. Food and health\r - HKTDC, “China’s Health Food Market,” http://china-trade-research.hktdc.com/business- news/article/China-Consumer-Market/China-s-Health-Food- Market/ccm/en/1/1X000000/1X002L54.htm\r - China Briefing, “Going Organic: Investing in China’s Growing Health Foods Market,” http://www.china-briefing.com/news/2015/06/02/going-organic-investing-in-chinas-growing- health-foods-market.html\r - The Wall Street Journal, “Selling Health Food to China,” http://www.wsj.com/articles/SB10001424052748703678404575637421610979434\r - Forbes, “China's Growing Food Problem/Opportunity,” http://www.forbes.com/sites/jackperkowski/2014/09/25/chinas-growing-food- problemopportunity/ - 3ac611a1235a\r - China-Britain Business Council, “The Food & Beverage Market in China,” http://www.ccilc.pt/sites/default/files/eu_sme_centre_report_- _the_food_and_beverage_market_in_china_update_-_july_2015.pdf\r - PWC, “Ten global trends driving change in the food industry,” http://www.pwccn.com/home/eng/food_supply_and_integrity_trends.html\r - OSEC, “The Chinese Food Market. Opportunities for Swiss Companies,” http://www.s-ge.com/de/filefield-private/files/43079/field_blog_public_files/22196\r - KREAB, “The Ever-Challenging Chinese Landscape for Food and Beverage Firms,” http://www.kreab.com/wp-content/uploads/sites/17/2013/09/Kreab-Gavin-Anderson-\r Research-Asia-China-Food-and-Beverage-Industry-Spotlight.pdf\r  6. Internet revolution and e-commerce platforms\r - Edward Tse, “Chapter 5: Changing China,” China's disruptors: how Alibaba, Xiaomi, Tencent, and other companies are changing the rules of business. New York: Penguin, 2015, pp. 145-172.\r - AliResearch, “Future of Global Trade: Connecting the World with E-Commerce,” http://i.aliresearch.com/img/20160901/20160901171708.pdf\r - McKinsey, “China’s e-tail revolution,” http://www.mckinsey.com/global-themes/asia- pacific/china-e-tailing\r - McKinsey, “Cross-border e-commerce is luring Chinese shoppers,” http://www.mckinsey.com/industries/high-tech/our-insights/crossborder-ecommerce-is-luring- chinese-shoppers\r - Switzerland Global Enterprise, “Market Study: China E-Commerce,” http://www.s-ge.com/sites/default/files/censhare_files/s-ge-marktstudie-e-commerce-china_3.pdf\r - Forbes, “China's E-Commerce Addiction Has Serious Market Potential,” http://www.forbes.com/sites/sarahsu/2016/07/16/chinas-growing-e-commerce- addiction/ - 2765fa403b01\r - Quartz, “China’s mobile internet revolution is mostly taking place among the working class,” http://qz.com/290458/chinas-mobile-internet-revolution-is-mostly-taking-place-among-the- working-class/\r - Fidelity, “China’s mobile internet revolution,” https://www.fidelity.com.hk/static/pdf/investor/en/market-commentary/market_201404c.pdf\r - McKinsey, “China’s iConsumer 2015: A growing appetite for choice and change,” http://www.mckinseychina.com/wp-content/uploads/2015/02/China’s-iConsumer- _EN_FNL.pdf?33c3a3\r - McKinsey, “China’s Economic Dip Is Moving Shoppers Online,” http://www.mckinseychina.com/chinas-economic-dip-moving-shoppers-online/ (enter your email and download)\r - McKinsey, “How Savvy, Social Shoppers Are Transforming E-commerce,” http://www.mckinseychina.com/how-savvy-social-shoppers-are-transforming-e-commerce/ (enter your email and download)", "recommended_readings": "To be determined by teacher concerned", "terms": {"2020-21 Term 1": {"--LEC (7269)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor LI Chen"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}, "-T01-TUT (6750)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor LI Chen"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}}, "assessments": {"Essays": "50", "Essay test or exam": "30", "Others": "20"}}, {"code": "3700", "title": "Urban China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This course will examine key issues of urbanization and urbanity in light of Chinese experiences. Urban development in China since the economic reform has been transformative in its scale and pace of city-building and is a range of outcomes such as rapid economic development, growing income inequality, massive population mobility, and serious institutional challenges. After offering an overview of modern China’s quest for urbanization since the late imperial era, this course will focus on the massive and rapid urbanizing process in the post-reform era. Students will be exposed to diverse issues, such as migration, population control, land policy, housing reform, urban planning, spatial reconfiguration, social welfare, inner-city poverty, infrastructure and transportation, environmental protection, and public space. The readings, drawn from multiple disciplines such as economics, sociology, anthropology, history, political science, and urban studies will examine the socioeconomic, political and cultural factors that contribute to the process and its particularities in the late-socialist context. This course will also seek to draw comparative lessons from China’s experience to obtain a comparative understanding of the complex socioeconomic consequences and diverse patterns of urbanizing processes across the globe.", "outcome": "By the end of the semester, students should:\r - be familiar with the key issues of urbanization in the Chinese context.\r - be familiar with key concepts and social theories of current research in urban studies.\r - be able to read and understand interdisciplinary academic publications on urban China.\r - develop both oral and written skills to present coherent and succinct analysis.\r - be prepared for developing senior projects.", "syllabus": "1. Introduction\r 2. A Historical Perspective on Chinese Cities\r 3. Mao’s Urban China\r 4. Post-Reform Urban China\r 5. Land Politics\r 6. Building Homes\r 7. Migration and Population Control\r 8. Consumption\r 9. Stratification and Mobility\r 10. Reconstructing Urban Space\r 11. Urban Lives I\r 12. Urban Lives II", "required_readings": "1. Introduction\r  Smart, Alan & Smart, Josephine. 2003. “Urbanization and the Global Perspective.” Annual Review of Anthropology, 32, 263-285. \r  Chen, Xiangming, Anthony Orum, and Krista Paulsen. 2012. Introduction to Cities: How Place and Space Shape Human Experience. Wiley-Blackwell. Chapter 1.\r  Chen, Xiangming. 2007. “China’s New Revolution,” pp. 126-133 in The Endless City, edited by Ricky Burdett and Deyan Sudjic. London: Phaidon.\r 2. A Historical Perspective on Chinese Cities\r  Rowe, William. 2013. “China: 1300-1900,” in The Oxford Handbook of Cities in World History, edited by Peter Clark. Oxford University Press. \r  Skinner, William. 1964 & 1965. “Marketing and Social Structure in Rural China,” Parts I, II, and III. Journal of Asian Studies.\r 3. Mao’s Urban China\r  Bray, David. 2005. Social Space and Governance in Urban China: The Danwei System from Origins to Reform. Stanford, CA: Stanford University Press. Introduction & Chapter 4.\r 4. Post-Reform Urban China\r  Hessler, Peter, 2007. “China's Instant Cities.” National Geographic.\r  Cao, G. Y., G. Chen, et al. 2012. \"Urban Growth in China: Past, Prospect, and Its Impacts.\" Population and Environment 33(2/3): 137-160.\r  Chung, J. H., & Lam, T.-c. (2004). China's \"City System\" in Flux: Explaining Post-Mao Administrative Changes. The China Quarterly (180), 945-964. \r 5. Land Politics \r  Hsing, You-tien. 2006. \"Land and Territorial Politics in Urban China.\" The China Quarterly (187):575-91.\r  Shieh, Leslie. 2011. \"Becoming Urban: Rural-Urban Integration in Nanjing, Jiangsu Province.\" Pacific Affairs no. 84 (3):475-94.\r 6. Building Homes\r  Wu, Fulong. 2002. “Real Estate Development and the Transformation of Urban Space in China's Transitional Economy, with Special Reference to Shanghai.” In J. R. Logan (Ed.), The New Chinese City: Globalization and Market Reform (pp. 167-180). Oxford; Malden, Mass.: Blackwell Publishers.\r  Tomba, L. (2005). “Residential Space and Collective Interest Formation in Beijing's Housing Disputes.” The China Quarterly (184), 934-951. \r  Huang, Youqing. 2012. “Low-income Housing in Chinese Cities: Policies and Practices.” The China Quarterly, 212, 941-964. \r 7. Migration and Population Control\r  Chan, Kam Wing, and Will Buckingham. 2008. “Is China Abolishing the Hukou System?” The China Quarterly no. 195 (1):582-606.\r  Zhang, Li. 2002. “Spatiality and Urban Citizenship in Late Socialist China.” Public Culture, 14(2), 311-334. \r  Bach, Jonathan. 2010. 'They Come in Peasants and Leave CITIZENS': Urban Villages and the Making of Shenzhen, China. Cultural Anthropology, 25(3), 421-458. \r 8. Consumption\r  Schein, Louisa. 2001. “Urbanity, Cosmopolitanism, Consumption.” In N. N. Chen, C. D. Clark, S. Z. Gottschang & L. Jeffery (Eds.), China Urban (pp. 225-241). Durham, NC: Duke University Press.\r  Yan, Yunxiang. 2000. \"Of Hamburger and Social Space: Consuming McDonald's in Beijing.\" in The Consumer Revolution in Urban China, edited by Deborah Davis. Berkeley: University of California Press\r  Song, G., & Lee, T. K. 2010. Consumption, Class Formation and Sexuality: Reading Men's Lifestyle Magazines in China. The China Journal(64), 159-177. \r 9. Stratification and Mobility \r  Fan, C. C. 2002. “The Elite, the Natives, and the Outsiders: Migration and Labor Market Segmentation in Urban China.” Annals of the Association of American Geographers, 92(1), 103-124. \r  Guang, Lei. 2003. \"Rural Taste, Urban Fashions: The Cultural Politics of Rural/Urban Difference in Contemporary China.\" Positions 11:613-646.\r  Wu, Fulong. 2004. “Urban Poverty and Marginalization under Market Transition: The Case of Chinese Cities.” International Journal of Urban and Regional Research, 28(2), 401-423. \r 10. Reconstructing Urban Space\r  Chen, N. N. 1995. Urban Spaces and Experiences of Qigong. In D. S. Davis, R. C. Kraus, B. Naughton & E. J. Perry (Eds.), Urban Spaces in Contemporary China: The Potential for Autonomy and Community in Post-Mao China (pp. 347-361). \r  Feng, Jian, Fulong Wu, and John Logan. 2008. \"From Homogenous to Heterogeneous: The Transformation of Beijing's Socio-Spatial Structure.\" Built Environment no. 34 (4):482-498. \r  Bray, David. 2008. Designing to Govern: Space and Power in Two Wuhan Communities. Built Environment, 34(4), 392-407.\r 11. Urban Lives I\r  Whyte, Martin King. 2005. “Continuity and Change in Urban Chinese Family Life.” The China Journal (53):9-33.\r  Lee, Ching Kwan. 2007. “The Unmaking of the Chinese Working Class in the Northeastern Rustbelt.” In Working in China: Ethnographies of Labor and Workplace Transformation, Asia's transformations. London; New York: Routledge\r  Fong, Vanessa L. 2002. “China's One-Child Policy and the Empowerment of Urban Daughters.” American Anthropologist 104 (4):1098-1109\r 12. Urban Lives II\r  Tomba, L. (2009). Of Quality, Harmony, and Community: Civilization and the Middle Class in Urban China. positions, 17(3), 591-616. \r  Davis, D. S. (2010). “Who Gets the House? Renegotiating Property Rights in Post-Socialist Urban China.” Modern China, 36(5), 463-492. \r  Han, Jialing. 2012. “Rapid Urbanization and the Aspiration and Challenge of Second-Generation Urban-Rural Migrants.” Chinese Education & Society, 45(1), 77-83.", "recommended_readings": "1. Rowe, W. T. (1989). Hankow: Conflict and Community in a Chinese City, 1796-1895 (pp. 15-63). Stanford, CA: Stanford University Press.\r 2. Skinner, G. W. (1977). “Regional Urbanization in Nineteenth-Century China.” In G. W. Skinner (Ed.), The City in Late Imperial China (pp. 211-252). Stanford: Stanford University Press.\r 3. Lü, X., & Perry, E. J. (Eds.). 1997. Danwei: The Changing Chinese Workplace in Historical and Comparative Perspective. Armonk, N.Y.: M. E. Sharpe.\r 4. Davis, D. S., R. C. Kraus, B. Naughton & E. J. Perry (Eds.), 1995. Urban Spaces in Contemporary China: The Potential for Autonomy and Community in Post-Mao China. Washington, D.C.; Cambridge, UK; New York: Woodrow Wilson Center Press; Cambridge University Press.\r 5. Chen, N. N., Clark, C. D., Gottschang, S. Z., & Jeffery, L. (Eds.). 2001. China Urban: Ethnographies of Contemporary Culture. Durham [N.C.]: Duke University Press.\r 6. J. R. Logan (Ed.), 2002. The New Chinese City: Globalization and Market Reform. Oxford; Malden, Mass.: Blackwell Publishers.\r 7. Zhang, L. (2010). In Search of Paradise: Middle-class Living in a Chinese Metropolis. Ithaca N.Y.: Cornell University", "terms": {"2020-21 Term 2": {"--LEC (6193)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor LING Minhua"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}, "-T01-TUT (7381)": {"startTimes": ["13:30"], "endTimes": ["14:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor LING Minhua"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}}, "assessments": {"Essay test or exam": "30", "Others": "30", "Presentation": "30", "Selected response test or exam": "10"}}, {"code": "3800", "title": "Popular Protest and Social Movements in China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This is a specialized course for students with an existing foundation on Chinese politics. The class examines major insights from comparative research on contentious politics and investigates how popular protest in China relates to, informs, and sometimes challenges these scholarly debates. Students will learn about the origins and dynamics of popular contention in China, investigate different dimensions of its impact on Chinese politics, and study the state’s strategies to manage and contain collective expressions of discontent.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4008", "title": "Places of Memory in Modern China Seminar", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This advanced seminar studies “places of memory” in modern China, or the sites, museums, monuments, and memories of the past. It includes theoretical readings on history and memory, case studies of Hong Kong and Macau, and examples from twentieth-century China that include the Sun Yat-sen Mausoleum, Tiananmen Square, the Mao Mausoleum, and the museum town of Anren. Students will consider both official and unofficial history, and read primary sources. This reading and writing-intensive seminar will culminate in an independent research paper on a “place of memory” chosen by the student.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4009", "title": "Student Protest in 20th Century China Seminar", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This course studies student movements in China in the twentieth century, taking as its case studies the May Fourth Movement in 1919 and the Tiananmen Square student movement in 1989. It considers these two movements in detail, analyzes their historical, political, and cultural contexts, and examines their legacies. It is a guided research seminar, designed to introduce students to the study of history as an academic discipline and to prepare students for independent research.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4010", "title": "Advanced Topics in Chinese Literature Seminar", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "The goal of this course is to give advanced students with at least a basic knowledge of Chinese literature an opportunity to read deeply on one aspect of the field. Topics may be defined by historical period, literary genre, theme, or aesthetic or theoretical issue. In addition to the close reading and analysis of primary texts, students will be required to read relevant works of critical research.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4410", "title": "Law and Society in China Seminar", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This course is meant to introduce students to the fundamental aspects of Chinese legal culture. Our investigation will begin with the myths and early discourses about how law should be conceptualized and continue through the legal reforms during the transition from the Qing dynasty to the early Republic era. Drawing on a number of different disciplines, we will explore the continuity and change between the debates and developments of the early history of Chinese law and the Qing legal system from the middle of the nineteenth century onwards.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4502", "title": "Selected topics in Contemporary China Studies (Humanities) I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "To be determined by teacher concerned. Students are allowed to take this course not more than twice, and gain the units each time they pass the course. However, students cannot take courses with the same course code more than once in a single term.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4504", "title": "Selected topics in Chinese Language and Culture I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "To be determined by teacher concerned. Students are allowed to take this course not more than twice, and gain the units each time they pass the course. However, students cannot take courses with the same course code more than once in a single term.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4505", "title": "Selected Topics in Chinese Language and Culture II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "To be determined by teacher concerned. Students are allowed to take this course not more than twice, and gain the units each time they pass the course. However, students cannot take courses with the same course code more than once in a single term.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4520", "title": "Capstone Research Paper", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Contemporary China Studies PC", "requirements": "", "description": "This writing-intensive seminar is the capstone course for China Studies majors. It will give graduating seniors the opportunity to design, research, and write a research paper on a subject in China Studies. Throughout the course, students will formulate a research proposal, conduct research and write a bibliographical essay, and write their final paper in multiple drafts. They will receive feedback and comments from their peers and the instructor, and revise their paper into a final draft.Advisory: For Contemporary China Studies Majors in their final year of attendance only.", "outcome": "By the end of the semester, students should: - be able to formulate and carry out an independent research project - be able to do library and/or field research - be able to construct an argument and use sources in support of the argument - be able to use secondary sources to show how the argument relates to other previous research - be able to write a clear and well-organized final paper", "syllabus": "1. Introduction to Writing a Senior Capstone 2. Model Senior Capstones 3. Finding a Topic and Identifying Your Governing Question 4. Library Research and Research Plan 5. Towards an Introduction 6. Bibliographical Essay 7. Methods and Outline 8. Writing Workshop: One Section 9. Towards a Conclusion 10. Writing Workshop: One Section 11. Student Research Presentations", "required_readings": "1. Sheila M. Reindl, “Twenty Tips for Senior Thesis Writers,” Harvard Bureau of Study Counsel 2. Three sample senior papers from previous year  “Working Parts of a Paper,” Writing in East Asian Studies 3. Jay Gitlin, “Thoughts on Finding a Topic,” Yale Senior Essay Handbook  “Choosing Something to Study,” Writing in East Asian Studies  Worksheet, “Connecting with Your Curiosity.”  Worksheet, “Putting Vague Thoughts in the Form of Questions.”  Worksheet, “Identifying Your Governing Question.” 4. “Gathering Materials and Making a Bibliography,” Writing in East Asian Studies 5. Worksheet, “Questions and Prompts towards an Introduction” 6. Quentin George Koffey, “A Sample Bibliographical Essay,” Yale Senior Essay Handbook  Worksheet, “Questions and Prompts towards a Literature Review” 7. Worksheet, “Questions and Prompts towards a Methods Section”  Worksheet, “Questions and Prompts towards a Chapter”  “The Body,” Writing in East Asian Studies 8. No Readings, Draft 1 Due 9. Worksheet, “Questions and Prompts towards a Conclusion” 10. Draft 2 Due  Fred Strebeigh and Mark Bauer, “Polishing a Rough Draft,” Yale Senior Essay Handbook  “The Importance of Rewriting,” Writing in East Asian Studies 11. Student Research Presentations  “Style Conventions for East Asian Studies,” Writing in East Asian Studies 12. Student Research Presentations", "recommended_readings": "To be determined by teacher concerned", "terms": {"2020-21 Term 2": {"A-LEC (4776)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor Jan Francis KIELY"], "meetingDates": ["15/1", "22/1", "29/1", "5/2"]}, "B-LEC (7588)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor LING Minhua"], "meetingDates": ["15/1", "22/1", "29/1", "5/2"]}, "C-LEC (7589)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor GAO Yunwen"], "meetingDates": ["15/1", "22/1", "29/1", "5/2"]}, "D-LEC (8982)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor LI Chen"], "meetingDates": ["15/1", "22/1", "29/1", "5/2"]}}, "2021-22 Term 2": {"A-LEC (7763)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Wong Foo Yuan Bldg 402"], "instructors": ["Professor Jan Francis KIELY"], "meetingDates": ["14/1", "21/1", "28/1"]}, "B-LEC (7764)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Wong Foo Yuan Bldg 403"], "instructors": ["Professor LING Minhua"], "meetingDates": ["14/1", "21/1", "28/1"]}, "C-LEC (7765)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Wong Foo Yuan Bldg 107B"], "instructors": ["Professor GAO Yunwen"], "meetingDates": ["14/1", "21/1", "28/1"]}, "D-LEC (7766)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Wong Foo Yuan Bldg 107A"], "instructors": ["Professor LI Chen"], "meetingDates": ["14/1", "21/1", "28/1"]}}}, "assessments": {"Essays": "80", "Others": "20"}}]