[{"code": "1100", "title": "University Chinese I"}, {"code": "1101", "title": "Communication in Chinese", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "", "description": "This course is designed to enhance students’ written communication skills. Ancient and modern essays are taught, by which students can study ancient and modern Chinese grammar, vocabulary and structure and strengthen their language skills. To address the daily language needs of students, special emphasis will be placed on practical writing and writing in different geners. Online language learning tools will be introduced to the students to enhance their self-learning ability.\r", "outcome": "Upon completion of the course, students will be able to:\r (1) To acquire written Chinese communication skills\r (2) To enhance the self-learning strategies through online language learning\r  修畢本科後，學生能︰ (1) 掌握書面傳意技巧﹕\r (2) 建立網上自學能力，培養持續學習的習慣。", "syllabus": "(1) characteristics of the Chinese language environment in Hong Kong;  (2) characteristics of ancient Chinese;  (3) characteristics of modern Chinese;  (4) reading of Ancient texts;  (5) reading of modern texts;  (6) writing in different geners.\r  (1) 概述中文的特質與香港的語言環境；\r (2) 古代漢語的特點；\r (3) 現代漢語的特點；\r (4) 篇章選讀一﹕古代；\r (5) 篇章選讀二﹕現代；\r (6) 不同文體寫作", "required_readings": "1. 王力、呂叔湘、徐仲華等著：《語文大師如是說﹕字和詞》。香港：商務印書館，2006。 \r 2. 朱德熙、冰心、葉聖陶等著：《語文大師如是說﹕讀和寫》。香港：商務印書館，2006。 \r 3. 余光中著：《語文大師如是說﹕中和西》。香港﹕商務印書館，2006。", "recommended_readings": "1. 中國社會科學院語言研究所詞典研究室編﹕《現代漢語詞典》(第五版)。北京﹕商務印書館，2005。 \r 2. 王力著：《古漢語通論》。香港：中外出版社，1976。\r 3. 吳仁甫等主編：《古代漢語自學指要》。上海：華東師範大學出版社，1991。\r 4. 周秉鈞編著：《古漢語綱要》。長沙：湖南教育出版社，1981。\r 5. 邵敬敏著﹕《現代漢語通論》。上海﹕上海教育出版社，2001。\r 6. 胡裕樹著﹕《現代漢語》。香港﹕三聯書店(香港)有限公司，1992。\r 7. 香港城市大學語文學部編著﹕《中文傳意──寫作篇》。香港﹕香港城巿大學出版社，2001。\r 8. 徐芷儀著﹕《兩文三語──語法系統比較》。台北﹕台灣學生書局，1999。\r 9. 賴蘭香著﹕《傳媒中文寫作》。香港﹕中華書局(香港)有限公司，2000。", "terms": {"2020-21 Term 1": {"A-LEC (9130)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Mr WONG Nap Hei"]}, "B-LEC (9131)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Mr WONG Nap Hei"]}}}, "assessments": {"Essays": "50", "Essay test or exam": "40", "Others": "10"}}, {"code": "1102", "title": "University Elementary Chinese I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "", "description": "This course is specially designed to lead students to a more advanced use of the Chinese language. It aims to consolidate students with the fundamental linguistic knowledge in various aspects. It enhances students' ability of language use, through selected linguistic disscussions and practical situations.\r", "outcome": "Upon completion of the course, students will be able to:\r [1] To acqurie basic linguistic knowledge of Chinese and to apply the knowledge in appropriate contexts.\r [2] To appreciate the Chinese language through readings of Chinese literature\r [3] To improve the self-learning strategies to raise the language ability \r  修畢本科後，學生能︰  [1] 掌握基本漢語知識，準確運用詞語和句式\r [2] 通過文學作品欣賞漢語特點\r [3] 善用自學策略，提升語文能力", "syllabus": "[1] basic Chinese grammar;  [2] practical writing; [3] appreciation of the Chinese language through traditional and local literature.\r  [1] 基本漢語語法； \r [2] 寫作簡單應用文； \r [3] 傳統及本地文學作品欣賞", "required_readings": "1. Wang, Guo’an (ed.): A Handbook for 1000 Basic Chinese Characters. 2006 The Chinese University Press (Hong Kong) \r 2. Kane, Daniel﹕ The Chinese Language. Its History and Current Usage. 2006 Tuttle publishing \r 3. 郭振華﹕A Concise Chinese Grammar 簡明漢語語法. 2003 和平圖書有限公司 (香港)", "recommended_readings": "1. Boltz, William G.: The Origin and Early Development of the Chinese Writing System. 2003 American Oriental Society.\r 2. DeFrancis, John: The Chinese Language Fact and Fantasy. 1984 Honolulu. \r 3. Blakney, R.B.: A course in the analysis of Chinese Characters. 1935 The Commercial Press, China.\r 4. Björkstén, Johan: Learn to write Chinese characters. 1994 Sweden. \r 5. McNaughton, William: Reading and writing Chinese. A guide to the Chinese writing system. 1979 Tokyo.", "terms": {"2020-21 Term 1": {"AA-LEC (5283)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Dr. CHENG Siu Pong"]}, "AB-LEC (5282)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. CHENG Siu Pong"]}, "AC-LEC (9129)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr. CHENG Siu Pong"]}}}, "assessments": {"Essays": "90", "Others": "10"}}, {"code": "1103", "title": "Self-Learning Chinese I", "career": "Undergraduate", "units": "0.00", "grading": "PCE Grades", "components": "Web-enhanced Teaching", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "", "description": "This course is tailor-made for non-JUPAS students who are admitted on advanced standing to FYFD places at The Chinese University of Hong Kong and are exempted from the 6-unit Chinese language of the University Core Requirements for fulfilment of the Chinese Language Requirements and is delivered via the web. The online self-learning system devised for the course will consist of 10 components in two parts. Part I (Self-Learning Chinese (I)) of this course is designed for improving the Chinese language standard of the students concerned at CUHK, covering various aspects of Chinese, such as the linguistic knowledge of the writing system, words, and punctuations in order to increase the linguistic awareness of Chinese. The students are expected to finish Part I of this course in one term. They will eventually be graded as “Distinction”, “Credit”, “Pass” or “Failure” in each term. Finishing Part I with “Pass” or above is a prerequisite for taking Part II (Self-Learning Chinese II).\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1104", "title": "Self-Learning Elementary Chinese", "career": "Undergraduate", "units": "0.00", "grading": "Pass (P)/Fail (U)", "components": "Web-enhanced Teaching", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "--", "description": "This course is tailor-made for non-JUPAS students who are exempted by Senate from the Chinese language requirements for admission and are admitted on advanced standing to FYFD places at The Chinese University of Hong Kong. This course is an introductory course designed for beginners who do not have knowledge of Chinese, focusing on the methods of self-learning Chinese (including Mandarin, Cantonese, and Chinese characters). Students are expected to finish this course in one term and will be graded as “Pass” or “Failure”.\r", "outcome": "1. Acquiring the basic methods of self-learning Chinese \r 　掌握自學中文的基本方法 2. Being able to find and use relevant learning tools and references for acquiring spoken Mandarin \r  能尋找和使用學習普通話口語的相關學習教材和參考文獻 3. Being able to find and use relevant learning tools and references for acquiring spoken Cantonese \r  能尋找和使用學習粵語口語的相關學習教材和參考文獻 4. Being able to find and use relevant learning tools and references for acquiring Chinese characters \r  能尋找和使用學習漢字的相關學習教材和參考文獻", "syllabus": "本科包括以下的內容：  1. Basic linguistic knowledge of modern Chinese 現代漢語概論\r 2. Self-learning Mandarin 自學普通話\r 3. Self-learning Cantonese 自學粵語\r 4. Self-learning Chinese characters 自學漢字", "required_readings": "中文系指定網上學習教材", "recommended_readings": "1. Cheung, Hung-nin Samuel (in collaboration with Sze-yun Liu and Li-lin Shih). 1994. A Practical Chinese Grammar. Hong Kong: The Chinese University of Hong Kong Press.\r 2. McNaughton, William. 2005. Reading & Writing Chinese (Simplified Chinese Edition, revised edition). Hong Kong: Tuttle Publishing.\r 3. Lee, Yin-ping Cream and Shin Kataoka. 2013. A Short Cut to Cantonese (New Edition). Hong Kong: Greenwood Press.\r 4. 李德津、程美珍編著，李德津、金德厚修訂。2008。《外國人實用漢語語法》。北京：北京語言大學出版社。\r 5. 鄭國雄。2007。《歐美人學中文（初階練習本）》。傷害：復旦大學出版社。\r 6. 野露露、于素秋及來雲鶴主編，成蕾、韓秋紅翻譯。2003。《交際漢語1（連光盤）》。北京：科學普及出版社。\r 7. 野露露、于素秋及來雲鶴主編，成蕾、韓秋紅翻譯。2004。《交際漢語2（連光盤）》。北京：科學普及出版社。\r 8. 野露露、于素秋及來雲鶴主編，成蕾、韓秋紅翻譯。2004。《交際漢語3（連光盤）》。北京：科學普及出版社。\r 9. 野露露、于素秋及來雲鶴主編，成蕾、韓秋紅翻譯。2004。《交際漢語4（連光盤）》。北京：科學普及出版社。", "terms": {"2020-21 Term 1": {"AX01-WBL (7050)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Dr. LAI Yin Yee"]}}, "2020-21 Term 2": {"BX01-WBL (7465)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Dr. LAI Yin Yee"]}}}, "assessments": {"Essays": "50", "Others": "50"}}, {"code": "1105", "title": "Self-Learning Chinese", "career": "Undergraduate", "units": "0.00", "grading": "PCE Grades", "components": "Web-enhanced Teaching", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "--", "description": "This course is tailor-made for non-JUPAS students who are admitted on advanced standing to FYFD places at The Chinese University of Hong Kong and are exempted from the 6-unit Chinese language of the University Core Requirements for fulfilment of the Chinese Language Requirements and is delivered via the web. The online self-learning system devised for the course will consist of 12 components in two parts ( zì cí piān字詞篇 and jù zi piān句子篇). This course is designed for improving the Chinese language standard of the students concerned at CUHK, covering various aspects of Chinese, such as words and grammar, argumentative and descriptive writing in order to increase the linguistic awareness of Chinese. The students are expected to finish the course by taking part in an online- examination. They will eventually be graded as “Distinction”, “Credit”, “Pass” or “Failure”.\r", "outcome": "1. Acquiring linguistic features liu shu and the development of Chinese characters \r  掌握六書及漢字流變 2. Being able to recognize traditional Chinese characters and their counterparts in simplified forms \r  掌握繁體字和簡體字的對換規律 3. Being able to distinguish between synonyms and antonyms in Chinese \r  辨識中文不同的近義詞及反義詞 4. Acquiring linguistic features of Chinese morphology\r 認識中文的構詞法 5. Being able to distinguish between correct and incorrect forms of Chinese characters \r  辨識錯別字 6. Acquiring linguistic features of Chinese syntax \r   認識中文句法的特點 7. Acquiring linguistic knowledge of common grammar mistakes in Chinese sentences\r  認識病句類型  8. Being able to master Chinese conjunctions \r   正確使用中文關聯詞 9. Being able to translate phrases and sentences from English into simple Chinese\r  把英文詞語和句子翻譯成簡單的中文 10.  Being able to master Chinese punctuations\r  正確運用中文標點符號  11.  Being able to recognize Chinese rhetoric in descriptive writing\r  能分辨出描寫文中的修辭手法 12. Being able to understand and analyze relevant arguments in argumentative writing\r  能理解並分析作者的議論立場及理據。", "syllabus": "本科共分「字詞篇」及「句子篇」兩部分，共計十二個單元，每單元介紹如下: \r 第一部分﹕「字詞篇」(六個單元)\r  1. 漢字六書和流變：Linguistic knowledge of liu shu and the development of Chinese characters 認識漢 字的六書原理和字形流變\r 2. 錯別字：Knowledge of correct and incorrect written forms of Chinese characters and reasons of writing errors 錯別字成因和類型\r 3. 繁體字和簡體字：Different features of traditional and simplified Chinese characters and rules of forming simplified Chinese characters 認識繁體字和簡體字的分別，以及簡體字構造規則\r 4. 同義詞和反義詞：Chinese synonyms and antonyms 認識中文近義詞、反義詞\r 5. 漢語構詞法﹕Acquiring linguistic features of Chinese morphology 認識中文詞語的構成方法和分類\r 6. 　閱讀理解（描寫文）：Comprehension of descriptive writing in Chinese 描寫文篇章閱讀\r  第二部分﹕「句子篇」(六個單元)\r  1. 漢語句法：Linguistic knowledge of basic Chinese grammar with a focus on sentence structure 認識基礎中文句語，以句子成分為主。\r 2. 漢語關聯詞：Linguistic knowledge and usage of conjunctions in Chinese grammar 學習中文不同類型的複句及其關聯詞\r 3. 漢語病句﹕Linguistic knowledge of common grammar mistakes in Chinese sentences 認識病句類型 \r 4. 中英轉換：English-Chinese sentence translation 中、英句子翻譯\r 5. 　漢語標點：Linguistic knowledge and usage of Chinese punctuations 中文標點符號基本知識及運用\r 6.  閱讀理解（議論文）：Comprehension of argumentative writing in Chinese 議論篇章閱讀", "required_readings": "中文系指定網上學習教材", "recommended_readings": "1.王寧、鄒曉麗﹕詞滙。2005，和平圖書有限公司。\r 2.林西莉﹕漢字王國。2008，三聯書局。\r 3.邵敬敏﹕標點符號要訣。1999，香港商務印書館。\r 4.陳瑞端﹕生活錯別字。1997，香港﹕中華書局。\r 5.Brown, Semmi MC: Read and write Chinese. 2000 Greenwood Press (Hongkong)\r 6.卉君﹕漢語基本知識。1991，香港﹕商務印書館。\r  7.胡裕樹﹕現代漢語。1992，三聯書店。\r  8.張斌﹕漢語語法修辭常識。1991，香港﹕香港教育圖書公司。\r  9.香港城市大學語文學部﹕中文傳意(基礎篇)。 2006，香港城市大學出版社。\r  10.郭振華﹕A Concise Chinese Grammar 簡明漢語語法. 2003 和平圖書有限公司 (香港)", "terms": {"2020-21 Term 1": {"AX01-WBL (7254)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Dr. LAI Yin Yee"]}}, "2020-21 Term 2": {"BX01-WBL (7464)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Dr. LAI Yin Yee"]}}}}, {"code": "1200", "title": "University Chinese II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "Prerequisite: CHLT1100", "description": "Course objectives: University Chinese (II) focuses on students’ practical use of language, refining their skills in employing different communicative strategies to meet diverse contextual needs. All students are recommended to complete the course in the first two years.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1202", "title": "University Elementary Chinese II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "", "description": "This course aims to help students strengthen knowledge of the Chinese language in various aspects, and its comprehensive use, appreciate linguistic differences between Chinese and English, similarities and differences between Cantonese and Putonghua, and acquire academic writing strategies in Chinese.\r", "outcome": "Upon completion of the course, students will be able to:\r [1] To strengthen the knowledge of Chinese,\r [2] To improve the ability of practical Chinese writing for academic purpose,\r [3] To acquire the basic English-Chinese translation skills.\r  修畢本科後，學生能︰ [1] 鞏固漢語知識\r [2] 提升中文學術寫作\r [3] 掌握英漢翻譯的基本技巧", "syllabus": "[1] sentence structure\r [2] the use of idioms\r [3] practical English-Chinese translation \r [4] explanatory and argumentative essays\r [5] Chinese for academic purpose\r  [1] 句子結構；\r [2] 成語運用；\r [3] 實務書信英漢翻譯；\r [4] 說明文章、評論文章；\r [5] 中文學術寫作", "required_readings": "1. Chao, Yuen Ren趙元任: A Grammar of Spoken Chinese. 1968 University of California Press (Berkeley)\r 2. Yip, Po-Ching and Don Rimmington: Basic Chinese: A Grammar and Workbook. 2009 (Second Edition) Routledge (London and New York)\r 3. . Yip, Virginia and Stephen Matthews. Basic Cantonese : a grammar and workbook. 2000. London ; New York : Routledge", "recommended_readings": "1. Chao, Yuen Ren: Readings in Sayable Chinese. 1968-1969 Asian Language Publications (San Francisco)\r 2. Deng, Yi鄧懿 et al.: Elementary Chinese Course漢語初級教程. 1993 Beijing Daxue Chubanshe (Beijing). vols. 3-4\r 3. Ma, Jing-Heng Sheng馬盛靜恆: Keys to Chinese Language漢語入門. 2006 The Chinese University Press (Hong Kong), Book II\r 4. Ho, Ching-hsien: Elementary Chinese. 1973 Cheng Chung Shuchü (Taipei). vol. 2\r 5. Jamieson, John C. and Lin, Tao: Kung Fu: An Elementary Chinese Text. 2002 The Chinese University Press (Hong Kong), Book II \r 6. Li, Charles N. and Thompson, Sandra A.: Mandarin Chinese: a Functional Reference Grammar. 1981 University of California Press (Berkeley)\r 7. Rouzer, Paul F.: A New Practical Primer of Literary Chinese. 2007 Harvard University Press (Cambridge, Massachusetts)", "terms": {"2020-21 Term 1": {"BA-LEC (6665)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Dr. NG Ka Yi"]}}, "2020-21 Term 2": {"DA-LEC (7081)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. NG Ka Yi"]}}}, "assessments": {"Essays": "90", "Others": "10"}}, {"code": "1203", "title": "Self-Learning Chinese II", "career": "Undergraduate", "units": "0.00", "grading": "PCE Grades", "components": "Web-enhanced Teaching", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "Pre-requisite: CHLT1103.", "description": "This course is tailor-made for non-JUPAS students who are admitted on advanced standing to FYFD places at The Chinese University of Hong Kong and are exempted from the 6-unit Chinese language of the University Core Requirements for fulfilment of the Chinese Language Requirements and is delivered via the web. The online self-learning system devised for the course will consist of 10 components in two parts. Part II (Self-Learning Chinese (II)) of this course is designed for improving the Chinese language standard of the students concerned at CUHK, covering various aspects of Chinese, such as words and grammar, argumentative and descriptive writing in order to increase the linguistic awareness of Chinese. The students are expected to finish the course in two terms. They will eventually be graded as “Distinction”, “Credit”, “Pass” or “Failure” in each term. Finishing Part I (Self-Learning Chinese I) with “Pass” or above is a prerequisite for taking Part II.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1301", "title": "Creative Chinese Writing", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "", "description": "This course aims to enhance students’ writing ability by activating their creative thinking through different creative writing skills and extensive writing exercise.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1302", "title": "Oral Communication Skills", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "", "description": "Inter-personal communication is valued in modern society. Very often, eloquence has profound influence on the success of one's study and career. This course aims to develop students' competence in oral communication with simulation practices in different situations.\r", "outcome": "修畢本科後，學生能︰ 1. 掌握粵語發音、身體語言、人際應對等口語傳意的基本知識及技巧，並能恰當運用。\r 2. 掌握不同場合、不同情況的溝通策略。\r 3. 提高敘述、說明、說服、議論等口語表達能力，俾能靈活、有效地對應不同處境。", "syllabus": "Course outline: 1) standard pronunciation in Cantonese and correction of students' articulation problems; 2) use of body language; 3) listening and reciting; 4) skills in oral communication; 5) oral skills for social interactions; 6) skills in delivering a speech;7) oral report; 8) oral skills for a meeting;9) oral skills for lodging complaints and responding to ;10). oral skills for an interview.\r  科目大綱： 一）粵語正音及糾正發音毛病； 二）身體語言之運用； 三）聆聽及複述； 四）口語傳意技巧； 五）社交口語； 六）事務演講； 七）口頭簡報； 八）會議技巧； 九）投訴及答覆投訴； 十）面試技巧。", "required_readings": "指定書目 1. «口才訓練十五講» 孫海燕編 北京大學出版社 2004\r 2. «演講力» 約翰‧哈斯林著 馬盺譯 北京大學出版社 2010\r 3. «人際溝通» 李燕等譯  揚智出版社 1994", "recommended_readings": "建議書目 1. «大學寫作與口才演講»  中國水利水電出版社  2009\r 2. «語言溝通藝術» 陳翰武 武漢大學出版社 2006\r 3. «口頭傳播：演講的理論與方法» 黃仲珊等著 遠流出版社 1993\r 4. «粵音平仄入門、粵語正音示例»合訂本 何文匯著 博益出版社 1992\r 5. «如何開會» 馬家輝編著 遠流出版事務股份有限公司 1991", "terms": {"2020-21 Term 2": {"--LEC (4908)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Dr. TSUI Ha"]}}}, "assessments": {"Essays": "90", "Others": "10"}}, {"code": "1880", "title": "Creative Writing and Literary Appreciation", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "", "description": "This course aims at developing a student's skill in creative writing. It also focuses on practical approaches to teaching creative writing in high schools. Under the instructor's guidance, students will have hands-on experience in creative writing, and in learning how to appreciate various literary genres by sharing their experiences in class.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2301", "title": "Chinese for Business Planning", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "", "description": "This course aims to introduce to students various kinds of commercial writing for business planning such as statement, proposal, budget, and management plan. It also heightens important issues such as data collection, case analysis, and the weighing of advantages and disadvantages that will be involved in the whole planning process so that students will be better prepared for such challenges in their future work in the commercial sector for strategic business planning.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2302", "title": "Chinese for Business Promotion", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "", "description": "This course aims to acquaint students with various kinds of business writing for the promotion of better business in their future practice of marketing and advertising campaigns. It also prepares students with the requisite writing skills and specific techniques. Students will be conversant with all typical commercial writings for business promotion plus a better understanding of promotional target, conceptual design and media characteristics.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2303", "title": "Speech and Negotiation", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "", "description": "Speech and negotiation, which play a key role in modern lives, are important oral communication skills. Effective use of the two skills is of great assistance to interpersonal communication, social interaction, commercial negotiation and crisis management. With simulation practices of different nature and in different contexts, this course aims to develop students' skills in delivering speeches and in negotiation with application in daily life and work context.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2304", "title": "Prose Writing and Appreciation", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "", "description": "This course aims to develop students’ skills in creative Chinese prose writing and in learning how to appreciate modern prose of different genres. By means of the analysis of works in modern prose, students will be equipped with solid writing skills and appreciation methods through various writing tasks.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2305", "title": "Chinese Writing under Globalization", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "", "description": "This course is designed for students to enhance their Chinese writing skills so as to cultivate the ability of bilingual studies in the university. Special emphasis will be placed on differentiating Chinese from English in expressing the same concepts or ideas. In view of rapid globalization through internet in recent years and the primacy of the English language as an international medium of communication, it is necessary for students to grasp the essence of fluent, concise, and accurate Chinese. By extension, the course also aims to improve students’ skills at overall thought and expression. Learning materials used in this course encompass a wide variety of practical writings like newspaper articles, magazine reviews, as well as scholarly writings like research papers particularly with regard to globalization and international relations.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2306", "title": "Classics and Life: Appreciation and Application of Chinese Classics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "", "description": "This course aims at leading students to study, understand, appreciate various works from ancient Chinese classics which reveal different aspects in human life. Related readings include Confucian, historical, philosophical and literary works. Besides empathising with our ancient sages, the course will go through and realize the invaluable experiences and thoughts which could serve as useful life guidance, ultimately let the classics to play their positive function for our lives.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2881", "title": "Appreciation of Masterpieces of Classical Chinese Literature", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "", "description": "This course is designed for high-school language teachers, focusing on guided reading and explication of important texts selected from various genres of traditional literature. It is expected that a close reading of these texts will help students improve their understanding of traditional aesthetics, sharpen their sense and sensibility and master the methodologies of analyzing literary texts of different genres and styles. 1) Poetry: 1.1 Origins, development and characteristics of traditional poetry; 1.2 Old-style poetry; 1.3 Modern-style poetry; 1.4 Song lyrics; 1.5 Anthologies and their studies. 2) Prose: 2.1 Origins, development and characteristics of traditional prose; 2.2 Ancient-style prose of the pre-Qin era and Han Dynasties; 2.3 Ancient-style prose of Tang and Song Dynasties; 2.4 Informal essays of Ming and Qing Dynasties; 2.5 Anthologies and their studies. 3) Drama: 3.1 Origins, development and characteristics of traditional drama; 3.2 Zaju; 3.3 Chuanqi; 3.4 Anthologies and their studies. 4) Fiction: 4.1 Origins, development and characteristics of traditional fiction; 4.2 Short stories; 4.3 Novels; 4.4 Traditional fiction commentaries and their studies.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2882", "title": "Appreciation of Masterpieces of Modern Chinese Literature", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "", "description": "This course is designed for high-school language teachers. It aims at enhancing their skills in and knowledge of appreciating and teaching modern Chinese literature from aesthetic, historical and cultural perspectives. Major works of fiction, poetry, prose and drama will be discussed, strategies of textual interpretation explored, and formal characteristics and central themes of modern Chinese literature expounded. Key reference works will also be introduced.", "outcome": "預期修畢本科後，學員能够：  1. 從文學史、美學、文化等角度鑑賞現代文學作品。\r 2. 掌握現代文學內容及形式之基本特色。\r 3. 掌握講授現代文學之技巧。", "syllabus": "1) Introduction: 1.1.The Origins and development of modern Chinese literature; 1.2. Methodologies analyzing modern Chinese literature; 1.3. Major reference works; 2) Fiction: 2.1 Traditional and modern fiction: similarities and differences; 2.2 Selected readings of modern novels; 2.3 Selected readings of modern short stories; 3) Poetry: 3.1 Traditional and modern poetry: similarities and differences; 3.2 Selected readings of various schools of modern poetry; 4) Prose: 4.1 Traditional and modern prose: similarities and differences; 4.2 Selected readings of various schools of modern essays; 5) Drama: 5.1 Traditional and modern drama: similarities and differences; 5.2 Selected readings of various schools of modern drama\r 一）概論：1.1 現代文學之起源及演變；1.2 現代文學作品閱讀及詮釋方法；1.3 重點參考書介紹； 二）小說：2.1 現代小說與古典小說之異同；2.2 長篇小說選讀及評鑒；2.3 短篇小說選讀及評鑒； 三）新詩：3.1 新詩與古典詩之異同；3.2 重要流派新詩選讀及評鑒；四）散文：4.1 現代散文與古典散文之異同；4.2 重要流派散文選讀及評鑒；五）戲劇：5.1 現代戲劇與古典戲劇之異同；5.2 重要流派戲劇選讀及評鑒", "required_readings": "1. 夏志清著，劉紹銘等譯：《中國現代小說史》，香港：中文大學出版社，2001年。C.T. Hsia, A History of Modern Chinese Fiction, Bloomington: Indiana University Press, 3rd ed, 1999.\r 2. 馬森：《戲劇：造夢的藝術》，台北：麥田出版社，2000年。\r 3. 陳義芝編：《散文教室》，台北：九歌出版社，2002年。\r 4. 趙家璧主編：《中國新文學大系1918-1927》(小說集一至三集)，上海：上海良友圖書公司，1936年。\r 5. 錢理群、溫儒敏、吳福輝：《中國現代文學三十年》(修訂版)，北京：北京大學出版社，1998年。\r 6. 羅青：《從徐志摩到余光中》，台北：爾雅出版社，1978年。", "recommended_readings": "1. 王德威：《閱讀當代小說：台灣‧大陸‧香港‧海外》，台北：遠流出版事業股份有限公司，1991年。\r 2. 李歐梵著，李歐梵、毛尖譯：《上海摩登：一種新都市文化在中國1930-1945》，北京：北京大學出版社，2001年。\r 3. 陳白塵、董健主編：《中國現代戲劇史稿》，北京：中國戲劇出版社，1989 年。\r 4. 陸耀東：《中國新詩史（1916－1949）》(第一卷、第二卷)，武漢：長江文藝出版社，2005－2009 年。\r 5. 盧瑋鑾編：《不老的繆思：中國現當代散文理論》，香港：天地圖書有限公司，1993年。\r 6. 嚴家炎：《中國現代小說流派史》，北京：人民文學出版社，1995年。", "terms": {"2020-21 Term 2": {"--LEC (7358)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. YIP Ka Wing"]}}}, "assessments": {"Essays": "50", "Essay test or exam": "50"}}, {"code": "2883", "title": "Selected Readings in the Classics of Ancient Texts", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "", "description": "This course is designed for high-school language teachers. It aims at enhancing their skills in and knowledge of appreciating the Confucian classics (jing), historical writings (shi) and philosophical treatises (zi) through guided readings of canonical texts. Traditional annotations, vernacular translations, excavated texts and modern reference books will be utilized in the explication of these texts and their tenets. 1) Selected readings in Confucian texts: 1.1 Selected readings of the Five Classics; 1.2 Annotations and commentaries of the Han and Tang Dynasties; 1.3 Modern vernacular translations; 1.4 Excavated texts; 1.5 Major reference books on Confucian texts; 2) Selected Readings in Philosophical Treatises: 2.1 Selected Readings of philosophical texts of various school (focusing on Daoist and Legalist texts); 2.2 Traditional annotations; 2.3 Modern vernacular translations; 2.4 Excavated texts; 2.5 Major reference books on philosophical treatises; 3) Selected Readings in Historical Writings: 3.1 Selected readings of four canonical works (focusing on Records of the Grand Historian and History of the Former Han Dynasty); 3.2 Traditional annotations; 3.3 Modern vernacular translations; 3.4 Major reference books on historical writings\r", "outcome": "預期修畢本科後，學員能够：  1. 掌握閱讀、評鑒古代文獻之方法。\r 2. 掌握古代文獻之內容特質。\r 3. 理解傳世文獻與出土文獻之關係。", "syllabus": "一、經部文獻選讀 　1.「經部」釋義\r 　2.《詩經》選讀\r 　3.《論語》選讀\r 　4.《孟子》選讀\r 二、史部文獻選讀 　1.「史部」釋義\r 　2.《史記》選讀\r 　3.《漢書》選讀\r 三、子部文獻選讀 　1.「子部」釋義\r 　2.《孫子兵法》選讀\r 　3.《老子》選讀", "required_readings": "1. 《詩經．蓼莪》、〈伐木〉。\r 2. 《史記．孔子世家》。\r 3. 《論語．子路》、〈顏淵〉。\r 4. 《孟子．告子上》。\r 5. 楊伯峻：《孟子譯注》，頁254-271。\r 6. 徐復觀：《中國人性論史》第六章。\r 7. 梁德華:〈司馬遷遊歷考略－－兼論「旅行」對其寫作《史記》之作用〉，將刊於《第三屆世界華文旅遊文學國際學術研討會論文集》，香港中文大學聯合書院、明報月刊、世界華文旅遊文學聯會聯合出版，2014年，頁57-67。\r 8. 《史記．游俠列傳》、《漢書．游俠傳序》。\r 9. 梁德華:〈論《史記．游俠列傳》中的「篇章修辭」── 兼論「篇章修辭」理論在古漢語教學中的作用〉Applied Chinese Language Studies VI (2015): 98-107.\r 10. 《史記．汲黯列傳》。\r 11. 《史記．孫子列傳》、〈老子韓非列傳〉。\r 12. 《孫子兵法．計》、〈作戰〉、〈謀攻〉。\r 13. 《老子．第一章》、〈第二章〉、〈第二十一章〉、〈第二十三章〉、〈第二十五章〉、〈第三十六章〉。", "recommended_readings": "一． 《十三經注疏》，清阮元刻本，台北︰藝文印書館，1976年。\r 二． 《十三經注疏》（整理本），《十三經注疏》整理委員會，北京：北京大學出版社，2000年。\r 三． 魏王弼注，樓宇烈校釋：《老子道德經注校釋》，收錄於《新編諸子集成》，北京：中華書局，2008年。\r 四． 清郭慶藩著：《莊子集釋》，收錄於《新編諸子集成》，北京：中華書局，2004年。\r 五． 清王先慎著，鍾哲點校：《韓非子集解》，收錄於《新編諸子集成》，北京：中華書局，1998年。\r 六． 漢司馬遷撰、劉宋裴駰集解、唐司馬貞索隱、張守節正義：《史記》，北京：中華書局，1959年。\r 七． 漢班固撰、唐顏師古注：《漢書》，北京：中華書局，1962年。", "terms": {"2020-21 Term 2": {"--LEC (7359)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. LEUNG Tak Wah"]}}}, "assessments": {"Essays": "50", "Essay test or exam": "50"}}, {"code": "2884", "title": "Introduction to Classical Chinese", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "", "description": "An introduction to various characteristic features of Classical Chinese. Topics include Chinese character, vocabulary, grammar and phonology. Major reference works will be also examined.\r", "outcome": "預期修畢本科後，學員能够：  1. 認識漢字形音義的各種關係。\r 2. 掌握詞義辨析的方法。\r 3. 了解古漢語語法的基本規律。\r 4. 認識古漢語語音的特點。", "syllabus": "1) Chinese characters; 1.1 Structure of Chinese characters; 1.2 Ancient and new characters, original and variant forms, loan characters; 1.3 Extension in usage; 1.4 Reference books on characters; 2) Vocabulary; 2.1 Components of words; 2.2 Synonyms and cognates; 2.3) Meaning of words; 2.4 Reference books on vocabulary; 3) Grammar; 3.1 Parts of speech and sentence patterns; 3.2 Free usage of parts of speech; 3.3 Ellipsis and word order; 3.4 Reference works on grammar; 4) Phonology; 4.1 Old Chinese and Middle Chinese; 4.2 Evolution of sounds (or Historical phonology); 4.3 Special pronunciations in ancient texts; 4.4 Reference books on phonology\r 一）文字； 1.1 漢字的結構；1.2 古今字、異體字、本字、假借字； 1.3 引申義和假借義； 1.4 文字工具書；二）詞匯；2.1 詞匯成分；.2 同義詞、同源詞； 2.3 詞義的辨析； 2.4 詞匯工具書；三）語法； 3.1 詞類和句式； 3.2 詞類的活用； 3.3 省略和語序； 3.4 語法工具書；四）語音；4.1 上古音、中古音； 4.2 語音的演變；4.3 古書中字詞的特殊讀音；4.4 語音工具書", "required_readings": "1. 周斌武：《中國古代語言學文選》。上海：上海古籍出版社，1988年。\r 2. 洪誠：《中國歷代語言文字學文選》。南京：江蘇人民出版社，1982年。\r 3. 胡奇光：《中國小學史》。上海：上海人民出版社，1987年。\r 4. 張世祿主編：《古代漢語教程》(重訂本)。上海：復旦大學出版社，2005年。\r 5. 許慎著、段玉裁注：《說文解字注》。上海：上海古籍出版社，1981年。\r 6. 陳彭年重修：《校正宋本廣韻》。台北：藝文印書館，1991年。\r 7. Norman, Jerry. 1988. Chinese. Cambridge: Cambridge University Press. 中譯本：羅杰瑞著、張惠英譯《漢語概說》。北京：語文出版社，1995。", "recommended_readings": "1. 王力：《古代漢語》1-4冊，北京：中華書局，1982年。\r 2. 王力：《中國語言學史》，上海：復旦大學出版社，2006年。\r 3. 張世祿主編：《古代漢語教程》上、下冊，上海：復旦大學出版社，2005年。\r 4. 蔣禮鴻、任銘善：《古漢語通論》，杭州：浙江教育出版社，1984年。\r 5. 許慎著、徐鉉校定：《說文解字》，香港：中華書局，1989年。\r 6. 馬天祥、蕭嘉祉編著：《古漢語通假字字典》，西安：陝西人民出版社，1991年。", "terms": {"2020-21 Term 1": {"--LEC (5964)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. LO Ki Wai"]}}}, "assessments": {"Essays": "50", "Essay test or exam": "50"}}, {"code": "2885", "title": "Introduction to Modern Chinese", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "", "description": "This course provides a general survey of modern Chinese, including its sounds, vocabulary and grammar. Attention will also be given to the structure and development of Chinese characters. Students will acquire a comprehensive understanding of the language and will be adequately prepared for future explorations in linguistic studies.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3301", "title": "Introduction to Chinese Classic Texts and Culture", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Chin Lang & Literature", "requirements": "", "description": "This course aims at illustrating the relationship between Chinese classic texts and Chinese culture. Through discussions of important passages in Confucian and Daoism, students can have a general picture of these philosophical schools and comprehend special features of Chinese tradition, beliefs, and values.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]