[{"code": "2001", "title": "Principles of Environmental and Occupational Health", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Not for students who have taken PHPC2009.", "description": "This public health oriented course addresses how the environmental and occupational (work-related) factors affect human health and what we can do to prevent or minimize the negative impacts. Whereas environmental science tends to address how human beings affect the environment, this course focuses on how the environment affects human health. Topics include an introduction to major categories of environmental hazards that impact population health; environmental epidemiology methods in assessing the impact of environmental exposures on human health; the evaluation and control of common hazards in the work place; and the impacts of global environmental changes on health.\r", "outcome": "After completing this course, students should be able to:  1.Discuss the history and definition of environmental and occupational health 2.Describe epidemiology and risk analysis methods to evaluate the impact of environmental exposures on human health 3.Define the major categories of hazards in the environment and workplaces 4.Discuss the direct and indirect human health effects of major environmental and occupational agents 5.Discuss the general principles of environmental pollution mitigation and occupational hazard control", "syllabus": "1. Introduction  2. Exposure, dose and risk analysis3. Fundamentals of environmental epidemiology  4. Environmental hazard and health impact  5. Natural environment and health  6. Work and health  7. Occupational disease and injury; Occupational legislation  8. Environmental health problems in Hong Kong9. Environmental health for all: global issues and international treaties", "required_readings": "Essentials of environmental health. Robert H. Friis.Sudbury, Mass. : Jones and Bartlett, c2007.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (7206)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor LAO Xiangqian"], "meetingDates": ["11/9", "18/9", "25/9"]}}, "2021-22 Term 1": {"--LEC (7788)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["No Room Required"], "instructors": ["Professor LAO Xiangqian"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Essays": "30", "Examination": "70"}}, {"code": "2002", "title": "Hong Kong Health Care System", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "Healthcare systems are complex and multidisciplinary in nature. They need to meet population needs and may include a network of services such as prevention, diagnosis, treatment, rehabilitation, and health maintenance provided to individuals of all ages and with a range of needs. This course is an introductory course on basic definitions and functions of health care systems. Using case studies and discussions, students will be able to develop understanding of practice and resources in health care.", "outcome": "After completing this course, students should be able to:  • Understand how health and social care are interrelated and delivered • Understand the basic concepts and functions of health and care systems for primary, secondary and tertiary care • Gain a brief overview of different healthcare systems from local and global perspectives • Gain a brief understanding of role of financing, hospital organization, management, and different parties involvement in healthcare system", "syllabus": "   1. Introduction and Overview2. Community Care I3. Community Care II4. Primary Care5. Acute Hospital Care I6. Acute Hospital Care II7. Community-based rehabilitation8. Long-term care   ", "required_readings": "1. Robin Gauld & Derek Gould. (2002). The Hong Kong health sector: Development & change2. Leung G.M. & Bacon-Shone J. (2006). Hong Kong's health system: reflections, perspectives and visions.3. Allot M. & Robb M. (1998). Understanding health & social care: an introductory reader. London: Sage in association with the Open University4. Carrin G. et al (2009). Health systems policy, finance, and organization. USA: Academic Press.5. Smith R.D. & Hanson K. (2012). Health systems in low-and middle-income countries: An economic & policy perspective. New York: Oxford University Press Inc", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (5014)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor LEUNG Yee Man"], "meetingDates": ["10/9", "17/9", "24/9"]}}, "2021-22 Term 1": {"--LEC (5935)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["William M W Mong Eng Bldg 713"], "instructors": ["Professor LEUNG Yee Man"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Essays": "60", "Presentation": "40"}}, {"code": "3001", "title": "Contemporary Health Issues", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "We are living in a highly complex and interdependent world. Health of the population is not only affected by local environment and individual behavioral choices, but also by other factors that are of regional and international origin. This course will introduce various major contemporary health issues that are threatening the health of people around the world, and the strategies that are being used to tackle these issues.", "outcome": "After completing this course, students should be able to:  1. Describe the top threats to global health: including the causes, current status, and the impact on people’s health around the world;2. Describe the strategies that are being used, or being proposed, to mitigate the impact of the health threats", "syllabus": "   1. Course introduction2. Weak primary health care3. Fragile and vulnerable settings4. Air pollution and climate change5. Climate change challenges 6. Dengue7. HIV8. Global influenza pandemic9. Antimicrobial resistance10. Vaccine hesitancy11. Ebola and other high-threat pathogens   ", "required_readings": "World Health Organization. Declaration of Astana. 2018. URL:https://www.who.int/docs/default source/primary health/declaration/gcphc declaration.pdf", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (5082)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. MUI Wai Ho"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}, "2021-22 Term 1": {"--LEC (7750)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Mong Man Wai Bldg 715"], "instructors": ["Dr. MUI Wai Ho"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Examination": "90", "Test or quiz": "10"}}, {"code": "3002", "title": "Health Education and Health Behaviours", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Not for students who have taken PHPC2016", "description": "The objectives of this module are teaching students the concept of health in relation to health education and health promotion in community. Different behavioral theories, models and approaches will be explored. This module will also look into how health promotion practice links to different models of health behaviours . Through understanding of factors related to health behaviour, modifications for healthy lifestyle can be planned within the social and cultural context. Students will learn how to put theory into practice.\r", "outcome": "After completing this course, students should be able to: 1. Acquire knowledge on the most common theories, models, and approaches used in studying health-related behaviours  2. Apply the theories into promoting health-related behaviours with the respective groups", "syllabus": "1. Scope of health behavior and health education 2. Theory, research and practice in health behaviour and health education3. Self-determination theory 4. The Transtheoretical Model5. Theory of Planned Behavior and the Integrated Behavioral Model6. Fear Appeal Approach, the Extended Parallel Process Model and Health Belief Model 7. Social Cognitive Theory 8. Diffusion of Innovations9. Social network and social support 10. Stress, coping and health behavior11. Ecological models of health behavior ", "required_readings": "1. Health Behaviour and Heath Education: Theory, Research and Practice. Edited by Karen Glanz, Barbara Rimer and K Viswanath. Published by Jossey-Bass Inc. US 2008 ISSN 13: 97807879961472. Health Promotion Programs: From theory to Practice. Edited by Carl I Fertman and Diane D Allenworth. By Society of Public Health Education, Published by Jossey-Bass 2010.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (4677)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor MO Phoenix Kit Han"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (7412)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["William M W Mong Eng Bldg 404"], "instructors": ["Professor MO Phoenix Kit Han"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Examination": "70", "Presentation": "30"}}, {"code": "3008", "title": "Foundations of Health Promotion", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Not for students who have taken PHPC2016", "description": "This course will provide a fundamental introduction to health promotion and needs assessment. Different approaches and models to health promotion will be introduced to students. Students will apply the models to assess and report the health needs of a community through both primary and secondary data collection and analysis.\r", "outcome": "After completing this course, students should be able to:  1. Understand basic principles of health promotion 2. Understand different health promotion models and tools 3. Conduct needs assessment for health promotion", "syllabus": "1. Overview of health promotion 2. Health promotion basics & Health Promotion Planning Models I3. Health Promotion Planning Models II4. Ethical issues in health promotion5. Assessing needs for health promotion6. Basics in analysing and reporting data", "required_readings": "McKenzie JF, Neiger BL, Thackeray R. Planning, implementing & evaluating health promotion programs: a primer. International edition of 6th revised edition. Pearson Education; 2012. 493 p.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (8640)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor YEUNG Chun Yiu"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 2": {"--LEC (7006)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Y.C. Liang Hall G06"], "instructors": ["Professor YEUNG Chun Yiu"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Essays": "25", "Examination": "40", "Presentation": "25", "Participation": "10"}}, {"code": "3115", "title": "Biostatistics for Community Health", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Not for students who have taken COMM3110, DSME2010, 2020, 2011, 2021, ECON2121, GRMD2102, PHPC1015, PHPC2015, PSYC2010, SEEM2430, SPED2600, STAT2101, 2102, 2001 or 2006.", "description": "This course will introduce the basic biostatistics concepts for public health practice. Emphasis will be placed on conceptual understanding of statistical approaches to public health data rather than on theory and equations. To enable students to acquire a set of analytical skills to deal with various public health questions, the course will focus on analyzing common types of public health data, and introduce exploratory and confirmatory biostatistical methods. The biostatistics concepts will be taught together with a user-friendly software SPSS through detailed, illustrative examples.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3117", "title": "Epidemiology for Community Health", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Not for students who have taken PHPC1014 or PHPC2017", "description": "This course aims to provide a basic understanding of the fundamental principles of epidemiological methods and their applicability to the field of health research.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4001", "title": "Settings-Approach for Health Promotion", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "Community health intervention is putting more emphasis on modification of health risk behaviours and building up the personal, cognitive and social skills which determine the ability of the individuals to gain access to, understand and make use of the information to promote and maintain good health. In many countries, there is a well-structured health care system to address diseases and illnesses but there is no system addressing health particularly on promotion of positive health. Healthy Setting is a value-based approach which has the ability of translation into language to fit the context of the particular setting. The concept of Healthy Setting is evolution from Ottawa Charter for Health Promotion by building healthy public policy, re-orientation of health services, strengthening community actions, building up personal health skills and health advocacy. This module will discuss the role of different settings in promoting health of the population. Students will gain basic understanding of healthy cities, health promoting school and health promoting workplace.", "outcome": "After completing this course, students should be able to: \r 1. Understand the paradigm shift of community health intervention moving beyond traditional health boundary;  2. Acquire the basic concept of setting approach for health promotion and learn how to adopt the concept for community health intervention;  3. Identify the potential settings for health promotion;  4. Select the appropriate tools for needs assessment and evaluation;  5. Acquire sufficient knowledge and skills to assist in developing community health intervention programme using the setting approach.", "syllabus": "1. Seminars (6 session) \r a. Introduction to Setting-Approach for Health Promotion\r b. Needs Assessment in Healthy Settings\r c. Programme Planning and Evaluation in Health Settings\r d. Schools as Health Settings\r e. The concept of Healthy Cities Project & Health Promoting Workplace\r f. Lecture revision\r  2. Project presentation (1 session)\r  3. Site visit - Visiting the site for project health needs assessment", "required_readings": "", "recommended_readings": "1. Dooris, M. Healthy Settings: Challenges to generating evidence of effectiveness. Health Promotion International 2006;21:55-65. \r 2. Doris, M., Poland, B., Kolbe, L., deLeeuw, E., McCall, D., Wharf-Higgins, J. Healthy settings: Building evidence for the effectiveness of whole-system health promotion-challenges and future directions. In McQueen, D and Jones C. (eds). Global perspectives on Health Promotion Effectiveness. New York: Springer, 2007. \r 3. Lee A., Ho M., Keung V. Healthy Setting as an ecological model for prevention of childhood obesity. Research in Sports Medicine: An International Journal 2010;18(1):49-61.", "terms": {"2020-21 Term 2": {"--LEC (7754)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Lai Chan Pui Ngong LT"], "instructors": ["Dr. YUNG Ka Chun"], "meetingDates": ["15/1", "22/1", "29/1", "5/2"]}}, "2021-22 Term 2": {"--LEC (7179)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Mong Man Wai Bldg 715"], "instructors": ["Dr. YUNG Ka Chun"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Presentation": "0", "Short answer test or exam": "0", "Selected response test or exam": "0"}}, {"code": "4002", "title": "Health Communication", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "This module will discuss various communication theories and their application in health promotion message design.\r", "outcome": "After completing this course, students should be able to:  1. Demonstrate and work with in-depth theoretical knowledge  from the area of health communication and critically analyse, evaluate and synthesise concepts, strategies, and cases from  various disciplines, such as, communication, public health, psychology, sociology, and so on, to generate ideas for effective health communication  2.  Apply knowledge and skills in developing and creating health communication campaigns; exercise appropriate judgement in  the effects of various media and/or user-generated content on public beliefs about health issues and evaluate the effectiveness of health communication interventions;3.  Participate constructively in group discussions and make formal and informal presentations to specialised and non-specialised audiences on the objectives, strategies, and outcomes of the health communication campaigns conceived in class as part of a group project; use multi-media skills in creating and presenting the campaigns", "syllabus": "1. Introduction to health communication  2. Foundational theories I – Interpersonal health communication3. Foundational theories II – Mediated health communication  4. Foundational theories III – Health communication campaign theories  5. Application of foundational theories 6. Critical cultural studies of health communication  7. Sociological approach to health communication. 8. Planned uses of communication for health I – Health communication campaigns  9. Planned uses of communication for health II – Other forms of intervention  10. Unplanned uses of communication for health I – News media  11. Unplanned uses of communication for health II – Celebrity and entertainment", "required_readings": "To be advised by the course teacher", "recommended_readings": "1. Schiavo R. Health Communication: From Theory to Practice. 2nd edition. California: Jossey-Bass, 2014. 2. Harrington, N. G. (Ed.). Health Communication: Theory, Method, and Application. Routledge, 2014. 3. Glanz, K., Rimer, B. K., & Viswanath, K. (Eds.). Health Behavior and Health Education: Theory, Research, and Practice. 5th edition. John Wiley & Sons, 2015.", "terms": {"2020-21 Term 2": {"--LEC (8932)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [3], "locations": ["Basic Med Sci Bldg LT"], "instructors": ["Professor DONG Dong"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (6944)": {"startTimes": ["12:30"], "endTimes": ["15:15"], "days": [4], "locations": ["William M W Mong Eng Bldg 713"], "instructors": ["Professor DONG Dong"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Classwork": "20", "Examination": "40", "Project": "40"}}, {"code": "4003", "title": "Research Methods in Community Health", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "This module will focus on using mixed research methodology (quantitative, qualitative) to study community health practice. Students will learn how to develop appropriate tools for studying the desired health topic and translating the evidence into practice.\r", "outcome": "After completing this course, students should be able to: \r 1.Acquire techniques and develop tools for quantitative research, e.g. questionnaire design, choosing appropriate measures, techniques of survey interview, coding and preparation of quantitative data;  2. Conduct qualitative study, e.g. focus groups, in-depth interviews", "syllabus": "1. Lectures\r a. The principles of research and key steps in the research process\r b. Quantitative research: Surveys and experimental design \r c. Sample size, sampling, and response rates for quantitative research\r d. Practical issues in questionnaire design \r e. Techniques of survey interviewing \r f. Preparation of quantitative data for coding and analysis I \r g. Preparation of quantitative data for coding and analysis II\r h. Qualitative research: Observational studies\r i. Qualitative research: Unstructured interview and focus groups \r j. Data analysis for qualitative research\r k. Ethical issues for research\r 2. Workshops and laboratories", "required_readings": "", "recommended_readings": "1. Bowling A. Research Methods in Health: investigating health and health services. 4th ed. Open University Press. c2014.", "terms": {"2020-21 Term 1": {"--LEC (5233)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Mong Man Wai Bldg 702"], "instructors": ["Professor MO Phoenix Kit Han"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2021-22 Term 2": {"--LEC (7107)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["William M W Mong Eng Bldg 405"], "instructors": ["Professor MO Phoenix Kit Han"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Essays": "0", "Presentation": "0", "Short answer test or exam": "0", "Selected response test or exam": "0"}}, {"code": "4004", "title": "Management of Non-Governmental Organisations", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "This module will discuss the management and operation of non-governmental organisations (NGO) of varying sizes.\r", "outcome": "After completing this course, students should be able to:  1.Understand the role of NGO in the society and how they complement the mainstream services;  2.Acquire the basic knowledge and skill to work in NGO.", "syllabus": "1. Introduction to NGO management  2. Governance and internal control of NGO  3. NGO capacity-building  4. Establishment of NGO", "required_readings": "Salamon LM, Anheier HK. Defining the nonprofit sector: A cross-national analysis. Manchester and New York: Manchester UniversityPress. 1997.Koontz H. The management theory jungle. Academy of Management Journal 1961;4:174–188.McGregor D. The Human Side of Enterprise. McGraw-Hill, 1960.Maslow AH. Maslow on Management. Wiley, 1998.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (8534)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Mong Man Wai Bldg 702"], "instructors": ["Dr. MUI Wai Ho"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 2": {"--LEC (6760)": {"startTimes": ["12:30"], "endTimes": ["15:15"], "days": [4], "locations": ["Mong Man Wai Bldg 715"], "instructors": ["Dr. MUI Wai Ho"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Classwork": "20", "Examination": "80"}}, {"code": "4005", "title": "Social Marketing Methods", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "Physical inactivity, unhealthy diet, smoking, people nowadays are often living an unhealthy lifestyle. Education and the rule of law have been used in attempts to change people’s behaviour with limited success. Social marketing is a systematic planning process that utilizes commercial marketing techniques to change people’s behaviour and achieve social good. The primary difference between social and commercial marketing is that the ultimate goal for commercial marketing is financial gain, whereas for social marketing, it is societal gain.This course will focus on the social marketing planning process, which includes scoping, target and behaviour selection, understanding of facilitators and barriers, and design of social marketing campaigns.", "outcome": "After completing this course, students should be able to:1. Explain the importance of target-centred programme planning; 2. Explain why a particular group is chosen as the priority segment;3. Identify the type of factors that affect people’s decision to change their behaviour;4. Explain the importance of campaign positioning and how to develop a unique position;5. Develop interventions that can facilitate behaviour change by using strategies from the marketing mix.", "syllabus": "1. Introduction to social marketing 2. Analysing the social marketing context3. Understanding target segmentation4. Understanding the priority segment5. Positioning6. Product platform7. Pricing and place strategies8. Promotion strategies", "required_readings": "1. Nancy R. Lee, Philip Kotler. Social marketing : changing behaviors for good. 5th ed. Sage Publications. c2016.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (8535)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Y.C. Liang Hall G04"], "instructors": ["Dr. MUI Wai Ho"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 2": {"--LEC (6761)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [2], "locations": ["William M W Mong Eng Bldg 706"], "instructors": ["Dr. MUI Wai Ho"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Classwork": "15", "Examination": "40", "Project": "45"}}, {"code": "4006", "title": "Community-Based Rehabilitation and Self-Care Management", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "Although health advice and/or education is routinely given in day to day consultation with health professionals, more intensive self-management programmes should be designed for better control of chronic illnesses. Care in community is way forward for sustainable development of health care system. Patients including their caregivers need to be better equipped to maintain their functional capacity at optimal level. Students will learn the fundamental principles and concepts of community based rehabilitation by improving the health status of people with chronic visceral disability so they would live independently as far as possible. Students will also learn the skills to empower patients and families in self-management of chronic illness in community setting, and improving their health conditions.\r", "outcome": "After completing this course, students should be able help patients with chronic diseases to: \r 1. Deal with problems associated their diseases from physical, psycho-social perspectives\r 2. Devise lifestyle programme for maintenance and improvement of health and functional well-being;  3. Learn the appropriate use of treatment, both medication and lifestyle management;  4. Communicate effectively with family, friends, and health professional;  5. Understand the role of community health practitioners in disease management", "syllabus": "1. Overall view of chronic care model and community-based rehabilitation; Why is it important?\r 2. Dissecting out the essential components for successful patient self-management and community-based rehabilitation programmes \r 3. Self-Care behaviours for effective control for diabetes mellitus, hypertension, Lipid disorders \r 4. How would patients and their family members help themselves in Cardiac rehabilitation and pulmonary rehabilitation?\r 5. How would children with asthma maximize their functional capacity?\r 6. Would patients and their families help themselves with their mental health problem? \r 7. Will stroke patients be always home-bound? How would patients and carers maintain their cognitive functions? \r 8. a. Care for terminal illnesses?\r b. What is District Health System? \r 9. Revisit the concept of community health practice", "required_readings": "1. Lee A. Lecture Notes on Patient self-management and Community Based Rehabilitation. Centre for Health Education and Health Promotion, The Chinese University of Hong Kong, 2018 (website will be given for downloading)\r 2. Fong K and Tong KW (eds). Community Care in Hong Kong: Current Practices, Practice-Research Studies, and Future Directions. City University Press, 2014.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (5015)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Lai Chan Pui Ngong LT"], "instructors": ["Professor LEE Albert"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}, "2021-22 Term 1": {"--LEC (8176)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Y.C. Liang Hall G06"], "instructors": ["Professor LEE Albert"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Essays": "0", "Participation": "0", "Short answer test or exam": "0", "Selected response test or exam": "0"}}, {"code": "4008", "title": "Health Promotion Planning and Evaluation", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Pre-requisite: CHPR3008;Not for students who have taken PHPC2016", "description": "This course aims to provide a practical introduction to health promotion project planning. Successful health promotion project requires careful planning in order to increase project effectiveness and efficiency. Great health promotion project also takes into account the impact of project design on long-term generalizability and sustainability. This course will guide students through the process of planning a health promotion project, including developing project goals and objectives, choosing suitable intervention strategies, designing monitoring and evaluation methods, budgeting and timetabling.\r", "outcome": "After completing this course, students should be able to:  1. Reiterate the process to develop a health intervention using the Intervention Mapping Approach2. Describe real-world examples of how Intervention Mapping was used in different countries around the world3. Collaborate with community-based organization to design printed promotion material4. Perform basic project time management and budgeting", "syllabus": "1. Planning health promotion interventions2. Community engagement activity briefing3. Theory-based intervention4. Fundamental printed material design5. Programme evaluation6. Resource allocation and programme management", "required_readings": "Bartholomew LK, Parcel GS, Kok G, Gottlied NH, Fernandez ME. Planning health promotion programs: an intervention mapping approach. 4th   edition. Jossey Bass. 201 6 (e book through library)     McKe nzie JF, Neiger BL, Thackeray R. Planning, implementing, & evaluating health promotion programs: a primer. 6 th edition. Pearson.            2013.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (7838)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Mong Man Wai Bldg 702"], "instructors": ["Dr. MUI Wai Ho"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2021-22 Term 1": {"--LEC (6624)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [3], "locations": ["William M W Mong Eng Bldg 706"], "instructors": ["Dr. MUI Wai Ho"], "meetingDates": ["8/9", "15/9"]}}}, "assessments": {"Classwork": "10", "Examination": "40", "Project": "50"}}, {"code": "4011", "title": "Food Security : Global and Local Perspectives", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "Despite the advancement in economic development and food technology, there are people living without the basic supply of sufficient and clean foods require for their physiological well-being. The World Food Summit of 1996 defined food security as existing “when all people, at all times, have physical and economic access to sufficient, safe and nutritious food to meet their dietary needs and food preferences for an active and healthy life”. This course introduces the factors affecting the sustainability of the contemporary food systems at both global and local perspectives. Areas including natural and manmade disasters, technological advancement, economic drive, political stability, as well as socio-cultural influences will be analyzed critically as insights to tackle the challenge of future food crisis. The concept of food safety will be introduced as a sub-topic of food security.\r", "outcome": "After completing this course, students should be able to: \r 1. Understand in detail the definition and scope of food security \r 2. Apply the understanding of food security to the analysis of global and local situations of food and nutrition supply\r 3. Realise the global effort in improving food insecurity and the promotion of food sufficiency for vulnerable populations in the local perspective\r 4. Understand the role and importance of food safety to human’s health and the steps of its protection mechanisms", "syllabus": "- Introduction to food security and food safety \r - Food system in the 21st century\r - Factors influencing the food system\r - Food security in Hong Kong and China\r - Impact of food security on human’s health\r - Global efforts to achieve food security\r - Ensuring food safety to promote food security\r - Food borne illnesses and human’s health\r - Food safety control from production to consumption\r - Food laws and regulations\r - Challenges to a safe food system in Hong Kong: Impact of food supply from China", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (5314)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [4], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Dr. YUNG Ka Chun"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 2": {"--LEC (7238)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [4], "locations": ["William M W Mong Eng Bldg 401"], "instructors": ["Dr. YUNG Ka Chun"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Essays": "0", "Presentation": "0", "Short answer test or exam": "0", "Selected response test or exam": "0"}}, {"code": "4012", "title": "Mental Health as a Public Health Issue", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "(UGED4926 is double-coded with CHPR4012.) The course aims to enhance students’ knowledge on mental health and its determinants in public health and psychological perspectives. Major components of the course include 1) the epidemiology of mental health problems;  2) relationships among sociocultural factors, interpersonal resources, individual characteristics, and mental health; 3) mental health issues after adverse life events; 4) concepts and theories related to mental health promotion in the community; and 5) community health services and interventions to improve mental health.", "outcome": " After completing this course, students should be able to:  1. Understand the relationships among sociocultural factors, interpersonal resources, individual characteristics, and people’s mental health  2. Apply basic concepts in public health and psychological theories to understand the determinants of people’s mental health  3. Demonstrate understanding on mental health issues among urban people, at-risk populations, and people with negative life experience.  4. Familiarize themselves with current interventions and community services to improve people’s mental health.", "syllabus": " 1. Epidemiology of common mental health problems 2. Individual factors as determinants of mental health 3. Sociocultural factors as determinants of mental health 4. Stress, coping, and mental health 5. Health behaviors and mental health 6. Addiction as a mental health issue 7. Mental health issues after negative life events 8. Psychological adjustment to chronic illnesses 9. Positive psychology and mental health 10. Mental health among minority and at-risk populations 11. Disclosure and mental health 12. Community mental health services and interventions", "required_readings": "  Epidemiology of common mental health problems Lam, L.C.W., Wong, C.S.M., Wang, M.J., Chan, W.C., Chen, E.Y.H., Ng, R.M.K.et al. (2015). Prevalence, psychological correlates and service utilization of depressive symptoms and anxiety disorders in Hong Kong: The Hong Kong Mental Morbidity Survey (HKMMS). Social Psychiatry and Psychiatric Epidemiology, 50, 1379-1388. Steel, Z., Marnane, C., Iranpour, C., Chey, T., Jackson, J.W., Patel, V. et al. (2014). The global prevalence of common mental disorders: A systematic review and meta-analysis 1980-2013. International Journal of Epidemiology, 43, 476-493. World Health Organization (2020). Mental Health Altas. https://www.who.int/mental_health/evidence/atlasmnh/en/    Individual factors as determinants of mental health Carlson, M.C., Eldreth, D., Chuang, Y.F., & Eaton, W.W. (2012). Mental disorders across the life span and the role of executive function networks. In Public Mental Health. Oxford University Press. Martins, S. S., Ko, J., Kuwabara, S., Clarke, D., Alexandre, P., Zandi, P.P., ... Eaton, W.W. (2012). The relationship of adult mental disorders to socioeconomic status, race/ethnicity, marital status, and urbanicity of residence. In Public Mental Health. Oxford University Press. Zandi, P.P., Wilcox, H.C., Dong, L., Chon, S., & Maher, B. (2012). Genes as a source of risk for mental disorders. In Public Mental Health. Oxford University Press.    Sociocultural factors as determinants of mental health Fowler, J.H. & Christakis, N.A. (2008). Dynamic spread of happiness in a large social network: Longitudinal studies over 20 years in the Framingham Heart Study. BMJ, 337, a2338. Murayama, H., Fujiwara, Y., & Kawachi, I. (2012). Social capital and health: A review of prospective multilevel studies. Journal of Epidemiology, 22, 179-187. Ni, M.Y., Yao, X., Leung, K.S.M., Yau, C., Leung, C.M.C., Lun, P. et al. (2020). Depression and post-traumatic stress during major social unrest in Hong Kong: A 10-year prospective cohort study. Lancet, 395, 273-284.    Stress, coping, and mental health Bradshaw, C.P., Rebok, G.W., Zablotsky, B., LaFair, L. N., Mendelson, T., & Eaton, W.W.(2012). Models of stress and adapting to risk: A life course, developmental perspective. In Public Mental Health. Oxford University Press. Carver, C. S. & Vargas, S. (2011). Stress, coping, and health. The Oxford Handbook of Health Psychology, p.162-188. Dougall & Baum (2012). Stress, health, and illness. Handbook of Health Psychology (2nd Edition), p.53-79.    Health behaviors and mental health Chekroud, S.R., Gueorguieva, R., Zheutlin, A.B., Paulus, M., Krumholz, H.M., Krystal, J.H. et al. (2018). Association between physical exercise and mental health in 1.2 million individuals in the USA between 2011 and 2015: A cross-sectional study. The Lancet Psychiatry, 5, 739-746. Lopresti, A.L., Hood, S.D., & Drummond, P.D. (2013). A review of lifestyle factors that contribute to important pathways associated with major depression: Diet, sleep, and exercise. Journal of Affective Disorders, 148, 12-27. Walsh, R. (2011). Lifestyle and mental health. American Psychologist, 66, 579-592.    Addiction as a mental health issue Hasin, D., O’Brien, C.P., Auriacombe, M., Borges, G., Bucholz, K., Budney, A. et al. (2013). DSM-5 criteria for substance use disorders: Recommendations and rationale. American Journal of Psychiatry, 170, 834-851. MacLean, S., Cameron, J., Harney, A. & Lee, N.K. (2012). Psychosocial therapeutic interventions for volatile substance use: A systematic review. Addiction, 278-288. National Institute on Drug Abuse (2018). Drugs, Brains, and Behavior. The Science of Addiction. https://www.drugabuse.gov/publications/drugs-brains-behavior-science-addiction/drugs-brain    Mental health issues after negative life events Goldmann, E. & Galea, S. (2014). Mental health consequences of disasters. Annual Review of Public Health, 35, 169-183. Newman, E., Pfefferbaum, B., Kirlic, N., Tett, R., Nelson, S., Liles, B. (2014). Meta-analytic review of psychological interventions for children survivors of natural and man-made disasters. Current Psychiatry Reports, 16, 462. Wu, X., Kaminga, A.C., Dai, W., Deng, J., Wang, Z., Pan, X. et al. (2019). The prevalence of moderate-to-high posttraumatic growth: A systematic review and meta-analysis. Journal of Affective Disorders, 243, 408-415.    Psychological adjustment to chronic illnesses Badr, H. & Acitelli, L.K. (2017). Re-thinking dyadic coping in the context of chronic illness. Current Opinion in Psychology, 13, 44-48. Helgeson, V.S. & Zajdel, M. (2017). Adjusting to chronic health conditions. Annual Review of Psychology, 68, 545-571. Matire, L.M., Schulz, R., Helgeson, V.S., Small, B.J. & Saghafi, E.M. (2010). Review and meta-analysis of couple-oriented interventions for chronic illness. Annals of Behavioral Medicine, 40, 325-342.    Positive psychology and mental health Boiler, L., Haverman, M., Westerhof, G., Riper, H., Smit, F. & Bohlmeijer, E. (2013). Positive psychology interventions: A meta-analysis of randomized controlled studies. BMC Public Health, 13, 119. Donaldson, S.I., Dolwet, M., Rao, M.A. (2015). Happiness, excellence, and optimal human functioning revisited: Examining the peer-reviewed literature linked to positive psychology. Journal of Positive Psychology, 10, 185-195. Seligman M.E.P. & Csikszentmihalyi, M. (2014) Positive Psychology: An Introduction (pp.279-298). In: Flow and the Foundations of Positive Psychology. Springer, Dordrecht.    Mental health among minority and at-risk populations Clement, S., Suchauman, O., Graham, T., Maggioni, F., Evans-Lacko, S., Bezborodovs, N. et al. (2015). What is the impact of mental health-related stigma on help-seeking? A systematic review of quantitative and qualitative studies. Psychological Medicine, 45, 11-27. Mak, W.W., Poon, C.Y., Pun, L.Y., & Cheung, S.F. (2007). Meta-analysis of stigma and mental health. Social Science and Medicine, 65, 245-261. Thornicroft, G., Mehta, N., Clement, S., Evans-Lacko, S., Doherty, M., Rose, D. et al. (2016). Evidence for effective interventions to reduce mental-health-related stigma and discrimination. Lancet, 387, 1123-1132.    Disclosure and mental health Frattaroli, J. (2006). Experimental disclosure and its moderators: A meta-analysis. Psychological Bulletin, 132, 823-865. Kupeli, N., Chatzitheodorou, G., Troop, N.A., McInnerney, D., Stone, P. & Candy, B. Expressive writing as a therapeutic intervention for people with advanced disease: A systematic review. BMC Palliative Care, 18, 65. Pennebaker, J.W. & Chung, C.K. (2011). Expressive writing: Connections to physical and mental health. The Oxford Handbook of Health Psychology.   12. Community mental health services and interventions Chan, W., Lam, L.C.W., & Chen, E.Y.H. (2015). Hong Kong: Recent development of mental health services. BJPsych Advances, 21, 71-72. Kobau, R., Seligman, M.E., Peterson, C., Diener, E., Zack, M.M., Chapman, D. et al. (2011). Mental health promotion in public health: Perspectives and strategies from positive psychology. American Journal of Public Health, 101, e1-9. Tse, S., Ng, R.M.K., & Lam, L.C.W. (2015). Mental health services in Hong Kong (pp. 155-169). Routledge handbook of psychiatry in Asia.    ", "recommended_readings": " Eaton, W.W. (2014). Public Mental Health. http://www.amazon.com/Public-Mental-Health-William-Eaton/dp/0190211164 (available online at CUHK library)   World Health Organization. (2005). Promoting Mental Health: Concepts, Emerging Evidence, and Practice. http://www.who.int/mental_health/evidence/MH_Promotion_Book.pdf   Other references will be provided in class", "terms": {"2020-21 Term 2": {"--LEC (4729)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Lee Shau Kee Building LT2"], "instructors": ["Professor YEUNG Chun Yiu"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 2": {"--LEC (7371)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Science Centre LG23"], "instructors": ["Professor YEUNG Chun Yiu"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Essays": "25", "Examination": "50", "Project": "25"}}, {"code": "4901", "title": "Practicum in Community Health Practice I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Workshop", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "", "description": "This module will prepare the students for their upcoming field placements (CHPR4902). Students will learn about the mission, vision and values of various community placement sites and the communities served by these organizations with the specific health needs of these communities. A learning plan for the upcoming field placement will be devised.\r", "outcome": "With a solid foundation in health promotion theories, methods and issues, the most important process that community health practice students must undergo prior to their transition into public health professionals is learn the expected attitudes, behaviours, work ethics and responsibilities required of a public health practitioner in the community. This opportunity is valuable for students to apply their acquired knowledge and skills when they participate in health promotion or health service activities in a community setting. The objective of this course is to facilitate the students in: 1. Understanding the vision, missions, values and responsibilities and the populations served by the designated community organization.", "syllabus": "1. The first module of the two-part practicum begins with a briefing which focus on advising students about things they need to be mindful of prior to being engaged in the field.  Planning and engagement of field practicum  2. Each student will be asked to select from a list of collaborating health promotion agencies as their practicum setting. These agencies include (but are not limited to) those that regularly employ individuals with a health promotion background, such as health education centres, non-profit health advocacy groups, hospitals/clinics, worksite wellness centres, and special population groups. Prior to the engagement of practicum, each student must discuss his or her potential role and responsibilities with the assigned agency supervisor within two course terms (including CHPR4902) based on the major needs of the agency. The student’s involvement in a meaningful contributing role is strongly encouraged. Upon the end of this discussion, both parties will be asked to complete and sign an official form detailing the expectations on the students and the goals/objectives of their involvement.", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"-W01-WKS (8689)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. YUNG Ka Chun, \n\rProfessor MO Phoenix Kit Han"], "meetingDates": ["13/09/2020 - 06/12/2020"]}}, "2021-22 Term 1": {"-W01-WKS (6625)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. YUNG Ka Chun, \n\rProfessor MO Phoenix Kit Han"], "meetingDates": ["08/09/2021 - 01/12/2021"]}}}}, {"code": "4902", "title": "Practicum in Community Health Practice II", "career": "Undergraduate", "units": "5.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "JC Sch of Pub Health Prim Care", "requirements": "Pre-requisite: CHPR4901", "description": "This module will provide opportunities for experiential learning for students in community settings related to health promotion or health service. This experience is designed to place the students into a real work setting and be part of a team with other community health workers and provide opportunities for the students to apply their acquired knowledge and skills as they participate in health promotion or health services activities of designated community organizations.\r", "outcome": "After completing this course, students should be able to:   1. Apply knowledge and skills learned from taught courses as they participate as a working member of a community organization;  2. Assist in the design, execution and/or evaluation of health promotion or health service activities of relevant health organizations.", "syllabus": "Student involvement in any activities or projects for this module should consist of no less than a total of 220 hours before the end of the term, the distribution of which is up to the discretion between the student, agency supervisor, and campus supervisor.", "required_readings": "Not applicable", "recommended_readings": "", "terms": {"2020-21 Term 2": {"-P01-PRA (6169)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Dr. YUNG Ka Chun, \n\rProfessor MO Phoenix Kit Han"], "meetingDates": ["17/01/2021 - 25/04/2021"]}}, "2021-22 Term 2": {"-P01-PRA (5690)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Dr. YUNG Ka Chun, \n\rProfessor MO Phoenix Kit Han"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Essays": "25", "Internship or practicum": "50", "Presentation": "25"}}]