[{"code": "2200", "title": "Literature Survey in CMB and Scientific Communication", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "LectureWorkshop", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "Pre-requisite: BIOL2120.", "description": "This pre-capstone course uses a ‘writing-to-learn’ approach that guides student step-by-step through the making of a primary research article in the life science discipline. The course introduces students to the process of problem solving in science through the scientific method of inquiry. The underlying principles of commonly used life-science methodologies for conducting research will be introduced through lectures while practical training in literature survey, information gathering, and data analysis will be provided through hands-on experience. The course will also introduce techniques in scientific communications by guiding students through each stage of the writing process and by conducting oral presentations, group discussion and peer reviews.\r", "outcome": "After completing the course, students are expected to be able to: \r 1. Perform literature search independently using online databases to find the relevant scientific information on a given topic\r 2. Understand the overall process of the scientific method of inquiry and apply it to identify and analyze scientific problems\r 3. Develop scientific writing and oral presentation skills including crafting arguments and supporting claims with the relevant evidence\r 4. Develop problem-solving skills and logical reasoning through critical evaluation of available data\r 5. Understand and appreciate the process of research discoveries, and the importance of information sharing in life science research\r 6. Develop effective communication skill and inter-personal skills through team work", "syllabus": "The course adopts a ‘writing-to-learn’ approach to help students establish a conceptual framework that serves as the basis for understanding the scientific method. Students engage with and reflect on the scientific method by progressively writing a primary research article that mimic those published in a peer-reviewed science journal. The course provides intensive training in literature search, scientific writing and oral communication skills. Students’ performances are evaluated by regular writing assignments, in-class discussion, and oral presentations.", "required_readings": "", "recommended_readings": "Current issues recommended and provided by all staff members", "terms": {"2020-21 Term 2": {"--LEC (6113)": {"startTimes": ["11:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. PANG Kok Shuen"]}}}, "assessments": {"Essays": "70", "Others": "20", "Presentation": "10"}}, {"code": "2500", "title": "Research Internship", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "", "description": "This course is designed for students who have participated in a summer internship in a local laboratory or laboratory abroad during the summer period and have gained relevant scientific research experience.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3010", "title": "Cell and Molecular Biology Laboratory I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "Co-requisite: CMBI3030.", "description": "This laboratory course provides the practical experience in techniques of molecular biology and cell culturing. Project-based experimental projects are designed to guide students through the investigative process of scientific research. Molecular biology work includes the construction of the recombinant DNA clones tagged with fluorescent proteins (FPs) as well as the generation, characterization and purification of the encoded FP-tagged fusion proteins. In addition, the training in aseptic cell culturing techniques to handle E. coli, plant and mammalian cell lines is provided for the skill preparation of the subsequent transient expression, establishment of transgenic plants and cell lines carrying the previously constructed recombinant DNA clones.Students’ progress will be evaluated through records of data analysis and evaluation in experimental logbooks, laboratory write-up and a final lab report in addition to quizzes and exams at term’s end. Students will also be divided into groups to produce a science video illustrating a Cell and Molecular Biology related topic of their own interests. Students are expected to demonstrate team-spirit through division of labor in the project as well as to learn and communicate science through self-motivated pursuit of knowledge.\r", "outcome": "After taking this lab course series, students are expected to:\r 1. Demonstrate mastery of the scientific method, the design and application of the experiments and interpretation of the results to address questions related to CMB\r 2. Be proficient in basic laboratory skills in cell and molecular biology such as recombinant DNA techniques, plant and animal cell culturing techniques as well as bright-field and fluorescent microscopy techniques\r 3. Be able to synthesize ideas and generate hypothesis by reading and integrating scientific primary literature\r 4. Be proficient in scientific communication skills (written and oral) and the planning and organization of experimental projects\r 5. Develop a proper attitude towards science that values curiosity, creativity and innovation\r 6. Understand the importance of scientific integrity and ethical scientific conduct", "syllabus": "CMBI3010 and CMBI3030 belong the first part of the course series that provides students with hands-on, practical laboratory experience. In this two-part course series, students receive intensive training in molecular techniques and plant and animal cell culturing. Molecular biology work including the construction of recombinant DNA clones tagged with fluorescent proteins (FPs), and the production and purification of the FP-tagged fusion proteins. In addition, the courses will introduce students to aseptic cell culturing techniques for handling plant and animal cell lines through two projects that focus on the establishment of transgenic plant cell lines and transient recombinant protein expression in mammalian cells, respectively. Students will learn how to generate experimental data, analyze them and communicate their findings in formal writings and presentations that will provide a foundation for research productivity and future career development.", "required_readings": "", "recommended_readings": "Lab manual provided by the instructors", "terms": {"2020-21 Term 1": {"-L01-LAB (6659)": {"startTimes": ["14:30", "14:30"], "endTimes": ["18:15", "18:15"], "days": [4, 2], "locations": ["Science Center 127", "Science Center 127"], "instructors": ["Dr. PANG Kok Shuen", "Dr. PANG Kok Shuen"]}}}, "assessments": {"Lab reports": "32", "Others": "36", "Short answer test or exam": "32"}}, {"code": "3020", "title": "Cell and Molecular Biology Laboratory II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "Prerequisite: CMBI3010 & CMBI3030. Co-requisite: CMBI3040.", "description": "This laboratory course is a continuation of CMBI3010 Cell and Molecular Biology Laboratory I. This laboratory course provides practical experience in the studies of cell biology. Project-based experimental projects are designed to guide students through the investigative process of scientific research. Different from traditional lab courses, which consist of separate and unrelated exercises, this CMB lab course is offered as term-long projects with all techniques or experimental methods incorporated into each project. Students will therefore not only learn various modern techniques, but also how and when these techniques are applied in life science research. In addition to the transgenic plant cell lines established in CMBI3010, this course will introduce students to transient expressions in animal cell models. Cell imaging approach employing high-end methodologies in microscopy to detect the expression and sub-cellular localization of fluorescent proteins as well as organelle dynamics will be used. Hands-on experience on conventional experimental methods including protein purification, Western blotting analysis and other common in-vivo or in-vitro cellular assays will also be provided.\r", "outcome": "After taking this lab course series, students are expected to:\r 1. Demonstrate mastery of the scientific method, the design and application of the experiments and interpretation of the results to address questions related to CMB\r 2. Be proficient in basic laboratory skills in cell and molecular biology such as recombinant DNA techniques, plant and animal cell culturing techniques as well as bright-field and fluorescent microscopy techniques\r 3. Be able to synthesize ideas and generate hypothesis by reading and integrating scientific primary literature\r 4. Be proficient in scientific communication skills (written and oral) and the planning and organization of experimental projects\r 5. Develop a proper attitude towards science that values curiosity, creativity and innovation\r 6. Understand the importance of scientific integrity and ethical scientific conduct", "syllabus": "CMBI3020 and CMBI3040 is the second part of the course series that provides students with hands-on, practical laboratory experience. In the latter part of the course series, students continue to build up on their practical skills and in molecular biology research and animal cell biology to solve scientific problems and communicate their findings in a setting that mimic real research laboratories. Experimental approaches commonly used in cell biology research will be introduced. Cell imaging approach employs high-end methodologies in microscopy to detect the expression and sub-cellular localization of the fluorescent proteins as well as organelle dynamics. Conventional experimental methods including protein purification, Western blotting analysis and other common in-vivo or in-vitro cellular assays are also included.", "required_readings": "", "recommended_readings": "Lab manual provided by the instructors", "terms": {"2020-21 Term 2": {"-L01-LAB (6164)": {"startTimes": ["14:30", "14:30"], "endTimes": ["18:15", "18:15"], "days": [4, 2], "locations": ["Science Center 127", "Science Center 127"], "instructors": ["Dr. PANG Kok Shuen", "Dr. PANG Kok Shuen"]}}}, "assessments": {"Others": "60", "Short answer test or exam": "40"}}, {"code": "3030", "title": "Cell and Molecular Biology Laboratory III", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "Co-requisite: CMBI3010.", "description": "This laboratory course provides the hands-on experience in various advanced microscopies that are commonly employed in cell biology research. Students first get familiar with the operation of the high-end microscopes in the laboratory. Subsequently, using the microscopes, students validate the materials established in CMBI3010, which will be used in CMBI3020 and CMBI3040.", "outcome": "The students taking this course are expected to achieve the following:\r 1. To learn the basic techniques in microscopy\r 2. To understand the principles of techniques in microscopy\r 3. To know how to apply these techniques in future experiments to solve practical problems", "syllabus": "CMBI3010 and CMBI3030 are the first part of the course series that provide students with hands-on, practical laboratory experience. In this two-part course series, students receive intensive training in molecular techniques and plant and animal cell culturing. Molecular biology work including the construction of recombinant DNA clones tagged with fluorescent proteins (FPs), and the production and purification of the FP-tagged fusion proteins. In addition, the courses will introduce students to aseptic cell culturing techniques for handling plant and animal cell lines through two projects that focus on the establishment of transgenic plant cell lines and transient recombinant protein expression in mammalian cells, respectively. Students will learn how to generate experimental data, analyze them and communicate their findings in formal writings and presentations that will provide a foundation for research productivity and future career development.\r   ", "required_readings": "Lab manual provided by teachers", "recommended_readings": "", "terms": {"2020-21 Term 1": {"-L01-LAB (5251)": {"startTimes": ["13:30", "13:30"], "endTimes": ["14:15", "14:15"], "days": [2, 4], "locations": ["Science Center 127", "Science Center 127"], "instructors": ["Dr. PANG Kok Shuen", "Dr. PANG Kok Shuen"]}}}, "assessments": {"Lab reports": "50", "Others": "40", "Short answer test or exam": "10"}}, {"code": "3040", "title": "Cell and Molecular Biology Laboratory IV", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "Pre-requisite: CMBI3010 & CMBI3030. Co-requisite: CMBI3020.", "description": "This laboratory course provides the hands-on experience in the advanced techniques in cell and molecular biology research. The techniques include reporter gene assay, co-immunoprecipitation, real time polymerase chain reaction, and Forster resonance energy transfer. With the materials established and knowledge gained in CMBI3010, 3020 and 3030, students make use of these advanced techniques to explore new aspects in cell and molecular biology research.\r", "outcome": "The students taking this course are expected to achieve the following:\r 1. To learn the advanced techniques in cell and molecular biology\r 2. To understand the principles of these advanced techniques in cell and molecular biology\r 3. To know how to apply these techniques in future experiments to solve practical problems", "syllabus": "CMBI3020 and CMBI3040 is the second part of the course series that provides students with hands-on, practical laboratory experience. In the latter part of the course series, students continue to build up on their practical skills and in molecular biology research and animal cell biology to solve scientific problems and communicate their findings in a setting that mimic real research laboratories. Experimental approaches commonly used in cell biology research will be introduced. Cell imaging approach employs high-end methodologies in microscopy to detect the expression and sub-cellular localization of the fluorescent proteins as well as organelle dynamics. Conventional experimental methods including protein purification, Western blotting analysis and other common in-vivo or in-vitro cellular assays are also included.\r  ", "required_readings": "Lab manual provided by teachers", "recommended_readings": "", "terms": {"2020-21 Term 2": {"-L01-LAB (8518)": {"startTimes": ["13:30", "13:30"], "endTimes": ["14:15", "14:15"], "days": [2, 4], "locations": ["Science Center 127", "Science Center 127"], "instructors": ["Dr. PANG Kok Shuen", "Dr. PANG Kok Shuen"]}}}, "assessments": {"Lab reports": "50", "Others": "40", "Short answer test or exam": "10"}}, {"code": "3100", "title": "Methodology of Critical Thinking in CMB", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "DiscussionLecture", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "", "description": "This course provides intensive training on literature reading and analysis in cell and molecular biology. Following CMBI2200, the first STOT course offered, a group of students are assigned to individual teachers for more direct and closer supervision. Students choose and work on the subjects of their interest, and the project involves intensive literature reading and discussions with the supervisor. Students are required to identify major questions or problems in cell and molecular biology fields. A literature review and an oral presentation for the identified questions or problems are assessed at term end.\r", "outcome": "Students taking this course are expected to achieve the following:\r  1) To be able to read scientific literature in CMB critically to identify new questions or problems in the field\r 2) To have increased skills in scientific writing\r 3) To have increased capability of oral communication", "syllabus": "CMBI3100 and CMBI3200 are the two components of the Student-oriented teaching (STOT) courses, which are required for all students in the CMB programme. In CMBI3100, which is offered in the first term, students will perform a literature analysis on a topic of their choice that is related to cell and molecular biology (CMB) under the guidance of their course advisor. In CMBI3200, students will learn how to develop research questions and prepare a scientific research proposal under the supervision of the same advisor. By the end of each term, students are required to submit a written report (a literature review in CMBI3100 and a research proposal in CMBI3200) and give an oral presentation to fellow students and the course examiners. Student’s performance is evaluated by the quality of the written report and the oral defense at the end of each term.", "required_readings": "", "recommended_readings": "Literature recommended or provided by individual staff members", "terms": {"2020-21 Term 1": {"-D01-DIS (6105)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Dr. PANG Kok Shuen, \n\rProfessor AU Wing Ngor Shannon, \n\rProfessor CHAN Ho Yin Edwin, \n\rProfessor CHAN Ting Fung Philos, \n\rProfessor CHOW Hei Man, \n\rProfessor GUO Dianjing, \n\rProfessor HE Junxian, \n\rProfessor HUI Jerome Ho Lam, \n\rProfessor JIANG Liwen, \n\rProfessor KANG Byung Ho, \n\rProfessor KWAN Kin Ming, \n\rProfessor LAU Kwok Fai, \n\rProfessor LUO Haiwei, \n\rProfessor NGAI Sai Ming, \n\rProfessor NGO Chi Ki Jacky, \n\rProfessor TSANG Suk Ying, \n\rProfessor WONG Kam Bo, \n\rProfessor WONG Wing Tak Jack, \n\rProfessor ZHONG Silin, \n\rProfessor ZHUANG Xiaohong"]}}}, "assessments": {"Essays": "40", "Others": "20", "Presentation": "40"}}, {"code": "3101", "title": "Biology of Model Organisms for CMB Research", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "", "description": "This course provides an overview on the phylogeny and basic biology of selected top model organisms including mouse, zebrafish, fruit-fly, Caenorhabditis elegans, Arabidopsis thaliana, and yeast. Due to their biological and technical advantages, these model organisms have been extensively employed for discovering a series of fundamental biological questions in the research of the modern life sciences. The course is instructed by our faculty members and invited speakers from other universities who use these models extensively in their researches.", "outcome": "Students taking this course are expected to achieve the following:\r  1) To develop a sense of biodiversity\r 2) To understand phylogenetic relations of major groups of organisms\r 3) To understand the major advantages offered by various model organisms and the major fields of their uses\r 4) To be aware of various cutting-the-edge biotechniques that can be applied to these model organisms", "syllabus": "1. Biodiversity, Phylogeny and Model Organisms\r 2. Studying fundamental processes in cell biology using a single‐celled eukaryotic microorganism\r 3. We are no better than a can of worms, molecular genetic application and implication from worm to human\r 4. The use of fruitfly Drosophila in Cell and Molecular Biology Research\r 5. Zebrafish as a model for genetics, toxicology and human diseases\r 6. A mouse with a tale \r 7. More than a plant: the impact of research on Arabidopsis thaliana", "required_readings": "", "recommended_readings": "Literature provided by individual teachers", "terms": {"2020-21 Term 2": {"--LEC (6063)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor CHAN Ho Yin Edwin, \n\rProfessor HE Junxian, \n\rProfessor HUI Jerome Ho Lam, \n\rProfessor KWAN Kin Ming, \n\rProfessor ZHUANG Xiaohong"]}}}}, {"code": "3200", "title": "Proposal Formulation and Creative Scientific Writing in CMB", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "DiscussionLecture", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "Prerequisite:CMBI3100", "description": "This course is the continuation of its pre-requisite CMBI3100. Regarding the questions addressed in CMBI3100, students learn how to prepare a research proposal under supervision by the same teacher. In addition to the scientific writing and oral communication, the main focus is on the proposal writing, including question identification, idea/hypothesis formulation, organization, and language usage. Performance is evaluated by the proposal and an oral defense at term end.\r", "outcome": "Students taking this course are expected to achieve the following:\r  1) To be able to draft a research proposal in the form of RGC grant proposal\r 2) To have increased skills in scientific writing\r 3) To have increased capability of oral communication", "syllabus": "CMBI3200 is a continuation of CMBI3100. In CMBI3100, students performed literature analysis on a topic of their choice that is related cell and molecular biology (CMB) and identified relevant scientific questions in the field under the guidance of their course advisor. In CMBI3200, students learn how to identify and approach research questions by preparing a scientific research proposal under the supervision of the same course advisor. By the end of the term, students are required to submit a written research proposal and give an oral presentation on the proposed research plan. Student’s performance is evaluated by the quality of the written proposal and the oral defense at the end of the term.", "required_readings": "", "recommended_readings": "Students are expected to search for all essential information by themselves", "terms": {"2020-21 Term 2": {"-D01-DIS (6163)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Dr. PANG Kok Shuen, \n\rProfessor AU Wing Ngor Shannon, \n\rProfessor CHAN Ho Yin Edwin, \n\rProfessor CHAN Ting Fung Philos, \n\rProfessor CHOW Hei Man, \n\rProfessor GUO Dianjing, \n\rProfessor HE Junxian, \n\rProfessor HUI Jerome Ho Lam, \n\rProfessor JIANG Liwen, \n\rProfessor KANG Byung Ho, \n\rProfessor KWAN Kin Ming, \n\rProfessor LAU Kwok Fai, \n\rProfessor LUO Haiwei, \n\rProfessor NGAI Sai Ming, \n\rProfessor NGO Chi Ki Jacky, \n\rProfessor TSANG Suk Ying, \n\rProfessor WONG Kam Bo, \n\rProfessor WONG Wing Tak Jack, \n\rProfessor ZHONG Silin, \n\rProfessor ZHUANG Xiaohong"]}}}, "assessments": {"Essays": "40", "Others": "20", "Presentation": "40"}}, {"code": "4001", "title": "Protein Trafficking", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "Pre-requisite: BIOL2120.", "description": "This course covers the general principles of and current developments in protein trafficking for both prokaryotic and eukaryotic cells. Specific topics include the structures and functions of transport vesicles, receptor-mediated protein transport, protein compartmentation in the secretory and endocytic pathways as well as in other organelles, protein degradation and the biological consequences of protein mis-localization in organisms. Students are required to watch online Lecture Videos in KEEP or Blackboard about Basic Knowledge in protein trafficking prior to the Lectures. These online Lecture Videos are supplemented with online quizzes in which students need to finish after watching these videos. In addition, students will also watch videos discussing recent Research Papers. During lectures, students will have in-depth discussion regarding the questions, key concepts and up-to-date research. By these means students will be able to clarify their concepts and be familiar with the latest research findings that are related to protein trafficking. Students will also learn the current developments of protein trafficking in details by delivering a presentation on a relevant topic derived from a recent research paper, with a Q&A session. The presentation will be graded by both Professor and peer students.Blended-mode class section is available for this course. Please refer to the “Class Notes” of the blended-mode class section for details.\r", "outcome": "Students taking this course are expected to achieve the following:\r  1) To understand the molecular mechanism of vesicular transport\r 2) To appreciate the rapid and current development in cellular trafficking\r 3) To acquire and appreciate the most up-to-date cellular technology and research methods\r 4) To synthesize new ideas from their knowledge on protein trafficking in research", "syllabus": "Topics:\r I. Introduction \r II. Basic concepts of protein trafficking in eukaryotic cells\r III. Basic techniques and new technology for studying protein trafficking \r IV. Discussion on selective landmark or classical papers \r V. Discussion on selective current papers VI. Self-learning & learning via teaching (student presentation and discussion)", "required_readings": "", "recommended_readings": "Current papers provided or recommended by the teacher", "terms": {"2020-21 Term 1": {"--LEC (8064)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor JIANG Liwen"]}}}, "assessments": {"Discussion": "9", "Others": "21", "Presentation": "40", "Short answer test or exam": "30"}}, {"code": "4002", "title": "Protein Folding", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "Pre-requisite: BCHE2030 and BIOL2120.", "description": "This course covers the energetics of protein folding including hydrophobic effect, hydrogen bond, electrostatic interactions, and conformational entropy, and how these factors interplay in protein folding and functions. Through detailed in-class discussion on the classic and the latest research literatures, students will learn how important theories and hypotheses of protein folding energetics were formulated, supported or disproved by experiments. The students will also learn how to apply the theories to improve protein stability in protein design and engineering through a group project.\r", "outcome": "Students are expected to achieve the following:\r  1) To understand the energetics of protein folding, including hydrophobic effect, hydrogen bond, electrostatic interactions, and \r conformational entropy \r 2) To understand how these energetic factors affect protein stability \r 3) To apply their knowledge learned in the design/engineering of proteins with improved protein stability \r 4) To synthesize new ideas from their knowledge on protein folding in research", "syllabus": "Stage 1: Learn how to address scientific problems by studying research literatures\r We aim to teach students on how to formulate and support their hypothesis in protein folding research by good examples of research. We start with the classical protein folding experiments of Anfinsen who lead to the Nobel Prize in 1972, to the latest research on protein folding energetics. The students are challenged with open-end questions on how to address key questions on energetic factors that contribute to protein stability. Through intensive in-class discussions and quizzes, the students will learn how hypotheses on protein folding are supported or disproved by experimental evidence. Examples also include those published by scientists in Hong Kong so that the students have a more personal touch on how scientists innovate and design their researches.\r Stage 2: Learn how to apply the theories learnt to improve protein stability in a group project.\r The students are divided into small groups and work together on a group project to study how to improve protein stability using the theory of protein folding energetic learnt. They will survey the latest research literatures on the field and are asked to give critical assessment on how protein stability can be improved and present their views and findings in an oral presentation.", "required_readings": "", "recommended_readings": "Current papers provided or recommended by the teacher", "terms": {"2020-21 Term 1": {"--LEC (8755)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor WONG Kam Bo"]}}}, "assessments": {"Discussion": "10", "Presentation": "50", "Short answer test or exam": "40"}}, {"code": "4003", "title": "Signal Transduction", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "Pre-requisite: BIOL2120.", "description": "This course covers the general principles, concepts and moderntechnologies in signal transduction for both prokaryotic and eukaryotic cells. Specific topics include signal perception by different receptors, phosphorylation-mediated signaling, signaling crosstalk, and methodologies in signal transduction research.\r", "outcome": "Students are expected to achieve the following:\r  1) To understand the basic and current development in signal transduction\r  2) To understand the current knowledge about the mechanisms and roles of signal transduction in controlling various biological functions\r 3) To appreciate the current literatures in signalling and biological function", "syllabus": "• Course overview --Some basics of signal transduction\r • Introduction to brassinosteroids(BRs) \r • BR perception on the cell surface by BR receptors\r • BR signaling in the cytoplasm \r • BR signaling in the nucleus \r • BR-regulated gene expression\r • Concepts of signaling crosstalk \r • BR and GA signaling crosstalk in plants \r • Light and GA signaling crosstalk in plants\r • Genetic approaches \r • Genomic approaches \r • Biochemical approaches", "required_readings": "", "recommended_readings": "Current papers provided or recommended by the teacher", "terms": {"2020-21 Term 1": {"--LEC (5494)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor HE Junxian"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "20", "Short answer test or exam": "20", "Selected response test or exam": "40"}}, {"code": "4101", "title": "Cancer Cell Biology", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "Pre-requisite: BIOL2120.", "description": "This advanced cell biology course provides a comprehensive review on current issues on cancer cell biology such as the molecular mechanisms of cancer pathogenesis, cancer cell proliferation and differentiation, programmed cell death (apoptosis), cell migration (metastasis), and the current technologies for cancer diagnosis and therapy.\r", "outcome": "Upon the completion of this course, students should be able to: \r 1. Apply their knowledge of cancer biology and related skills in real-life situations;  2. Sharpen their problem-solving abilities; 3. Strengthen their organizational power;  4. Develop effective communicative and interpersonal skills through group work; 5. Disseminate cancer-related information in a clear, concise and logical manner; 6. Create innovative ideas and methods to solve problems in the cancer research field\r 7. Appreciate the advantages of cooperative learning;  8. Become an effective member in group dynamics; and \r 9. Accept new challenges and independent responsibilities.", "syllabus": "Topics:\r 1. Basics and Hallmarks of Cancer \r 2. Emerging Hallmarks of Cancer Current Advances in Cancer Research \r 3. Current Advances for Cancer Diagnosis and Therapy \r 4. Immunotherapy Relationship between Microbiota and Cancer", "required_readings": "", "recommended_readings": "Review and research articles provided or recommended by the teacher", "terms": {"2020-21 Term 2": {"--LEC (7560)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Professor NGO Chi Ki Jacky"]}}}, "assessments": {"Discussion": "20", "Homework or assignment": "30", "Presentation": "30", "Short answer test or exam": "20"}}, {"code": "4102", "title": "Stem Cell Biology", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "Pre-requisite: BIOL2120.", "description": "This advanced cell biology course introduces basic cellular and molecular features of pluripotent stem cells and provides a comprehensive review on current important issues in stem cell research and regenerative medicine.\r", "outcome": "Students taking this course are expected to achieve the following:\r  1) To understand basic cell and molecular biology of stem cells\r 2) To gain an insight into the potential applications of stem cell technology in regenerative medicine\r 3) To comprehend the literature and follow the most recent developments in the field of stem cell technology\r 4) To understand the current technologies used in stem cell research", "syllabus": "Topics:\r A) Introduction to stem cells a. What are stem cells? b. Basics of developmental biology \r B) Different types of stem cells and their biology a. Embryonic stem cells b. Induced pluripotent stem cells c. Tissue-specific stem cells d. Cancer stem cell hypothesis \r C) Stem cells and their applications a. Current applications b. Potential future applications", "required_readings": "", "recommended_readings": "Review and research articles provided or recommended by the teacher", "terms": {"2020-21 Term 2": {"--LEC (5033)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor TSANG Suk Ying"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "20", "Short answer test or exam": "20", "Selected response test or exam": "40"}}, {"code": "4103", "title": "Neuronal Cell Biology", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "Pre-requisite: BIOL2120.", "description": "This advanced cell biology course focuses on the basic functional units and development of the mammalian nervous systems. Special cellular and molecular features of neurons are also discussed. Other topics include neuronal polarity, membrane trafficking, axonal transport, axon guidance, synapse formation and synaptic plasticity.\r", "outcome": "Students taking this course are expected to achieve the following:\r  1) To gain a deep knowledge of the unique features of neurons at cell and molecular levels\r 2) To comprehend the literature and follow the most recent developments in the field of neurobiology\r 3) To be aware of the current central issues in neuronal cell biology and neuroscience in general", "syllabus": "Topics: \r  Introduction on Nervous system.\r The questions about neuronal cell biology.\r Neuronal cell specification in Drosophila and vertebrate Neural tube development.\r Differentiation of neurons.\r Neural Stem cell.\r Axon navigation.\r Synapse formation.\r Research orientated topics.", "required_readings": "", "recommended_readings": "Review and research articles provided or recommended by the teacher", "terms": {"2020-21 Term 2": {"--LEC (8105)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor KWAN Kin Ming"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "20", "Short answer test or exam": "20", "Selected response test or exam": "40"}}, {"code": "4201", "title": "Genomics and Transcriptomics", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "Pre-requisite: BIOL2120.", "description": "This advanced molecular biology course introduces the latest research focuses on genomics and transcriptomics. It covers the sequencing and mapping of the entire genome, methodologies in RNA gene expression profiling, structure and function of genes as well as regulation and dynamics of the transcriptome in an organism.", "outcome": "Students taking this course are expected to achieve the following:\r  1) To understand principles and current status of genomics and transcriptomics\r 2) To gain basic knowledge of bioinformatics and instrumentations for data acquisition and analysis in genomics and transcriptomics\r 3) To comprehend the literature and follow the most recent developments in the field of genomics and transcriptomics\r 4) To be prepared for further research in genomics and transcriptomics", "syllabus": "• Week 1: genomics\r • Week 2: practical session \r • Week 3: transcriptomics \r • Week 4: student presentation / discussions", "required_readings": "", "recommended_readings": "Review and research articles provided or recommended by the teacher", "terms": {"2020-21 Term 1": {"--LEC (5495)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor CHAN Ting Fung Philos"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "20", "Short answer test or exam": "20", "Selected response test or exam": "40"}}, {"code": "4202", "title": "Proteomics", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "Pre-requisite: BIOL2120.", "description": "This advanced molecular biology course introduces the principles and methods of proteomics, the high-throughput investigation of proteins. In particular, the structural and functional relationships between proteins are discussed. The course provides students a global view of protein components involved in important biological pathways of living cells. Common web-based tools for protein sequence annotation, protein structure prediction and protein structure analysis are covered. Besides, advances in methodologies for discussion include the two-dimensional gel electrophoresis (2DE), liquid chromatography (LC), mass spectrometry and high throughput x-ray crystallography.\r", "outcome": "Students taking this course are expected to achieve the following:\r  1) To understand principles and current status of proteomics\r 2) To comprehend the literature and follow the recent developments in the field of proteomics\r 3) To be prepared for future research in proteomics", "syllabus": "Topics:\r Concepts and principles in proteomics.\r Basic techniques and current developments in proteomics.", "required_readings": "", "recommended_readings": "Review and research articles provided or recommended by the teacher", "terms": {"2020-21 Term 1": {"--LEC (8065)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor NGAI Sai Ming"]}}}, "assessments": {"Essay test or exam": "20", "Short answer test or exam": "20", "Selected response test or exam": "60"}}, {"code": "4203", "title": "Metabolomics", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "Pre-requisite: BIOL2120.", "description": "This advanced molecular biology course aims to familiarize students with the latest research focuses in metabolomics, which concerns data acquisition and quantitative characterization of metabolites and metabolic pathways in living organisms. Modern technologies in profiling and identifying metabolites are introduced, and recent applications of metabolomics in various aspects of biology are also discussed.", "outcome": "Students taking this course are expected to achieve the following:\r  1) To understand principles and current status of metabolomics\r 2) To gain basic knowledge of bioinformatics and its application in metabolomics\r 3) To comprehend the literature and follow the most recent developments in the field of metabolomics\r 4) To be prepared for further research in metabolomics", "syllabus": "Topics:\r Concepts and technology in Metabolomics\r Applications in Metabolomics", "required_readings": "", "recommended_readings": "Review and research articles provided or recommended by the teacher", "terms": {"2020-21 Term 1": {"--LEC (8066)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor GUO Dianjing"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "20", "Short answer test or exam": "20", "Selected response test or exam": "40"}}, {"code": "4301", "title": "Current Topics in Cell Biology", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "Pre-requisite: BIOL2120.", "description": "This is an advanced course in understanding the current topics and the most up-to-date developments in cell biology research, through problem-based discussion using several recent and significant research papers preferably from different top-ranked international journals. Specific topics include protein targeting and its targeted disease, protein trafficking and biotechnology, organelle dynamics and biogenesis, stem cell development in therapy and antibody engineering.\r", "outcome": "Students are expected to achieve the following:\r  1) To comprehend the literature and follow the most recent developments in cell biology\r 2) To appreciate the new and rapid development in cell biology research \r 3) To be able to propose future direction in research and development of cell biology", "syllabus": "Topics:\r Synaptic plasticity (synaptic tagging and metaplasticity) \r Single particle cryo-EM \r Autophagy and autophagosome \r Organelle contact sites", "required_readings": "", "recommended_readings": "Current papers provided or recommended by the teacher", "terms": {"2020-21 Term 2": {"--LEC (8106)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor ZHUANG Xiaohong"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "20", "Short answer test or exam": "20", "Selected response test or exam": "40"}}, {"code": "4302", "title": "Current Topics in Molecular Biology", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "Pre-requisite: BIOL2120.", "description": "This is an advanced course in understanding the current topics and the most up-to-date developments in the research on molecular biology, through problem-based discussion using several recent and significant research papers preferably from different top-ranked international journals. Specific topics for discussion include the technology and development of current DNA sequencing and cloning, transformation and transgenic technology as well as the molecular mechanisms of the developmental regulation.\r", "outcome": "Students are expected to achieve the following:\r  1) To comprehend the literature and follow the most recent developments in molecular biology\r 2) To appreciate new development in molecular biology and propose future research\r 3) To be able to propose future direction in research and development of molecular biology", "syllabus": "Topics:\r Central dogma of molecular biology – a revisit \r RNA and disease \r Protein phosphorylation", "required_readings": "", "recommended_readings": "Current papers provided or recommended by the teacher", "terms": {"2020-21 Term 2": {"--LEC (7561)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor LAU Kwok Fai"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "20", "Short answer test or exam": "20", "Selected response test or exam": "40"}}, {"code": "4303", "title": "Current Topics in Biotechniques", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "Pre-requisite: BIOL2120.", "description": "This is an advanced course in understanding the current topics and the most up-to-date developments in biotechniques for cell and molecular biology research, through problem-based discussion using several recent and significant research papers preferably from different top-ranked international journals. Specific topics for discussion include the development and application of fluorescent technology and cell imaging, nanotechnology for biosciences, MS technology for proteomics, metabolomics and genomics.\r", "outcome": "Students are expected to achieve the following:\r  1) To comprehend the literature and follow the most recent developments in biotechniques for cell and molecular biology\r 2) To understand the principles, development and application of these new biotechniques\r 3) To be able to propose future application and development of technology for research in cell and molecular biology", "syllabus": "Topics:\r Electromagnetic waves, Light microscopy I \r Light microscopy II, Electron microscopy I \r Electron microscopy II, Correlative Light and Electron microscopy \r Discussion, Student presentation", "required_readings": "", "recommended_readings": "Current papers provided or recommended by the teacher", "terms": {"2020-21 Term 2": {"--LEC (7562)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor KANG Byung Ho"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "20", "Short answer test or exam": "20", "Selected response test or exam": "40"}}, {"code": "4901", "title": "Senior Experimental Project I", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "", "description": "In this course, students carry out an independent laboratory research project either provided by the supervisor or jointly decided with the student. To fulfill the course requirement, students are required to discuss their progresses with their supervisors regularly and submit a research proposal.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4902", "title": "Senior Experimental Project II", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "", "description": "In this course, students carry out an independent laboratory research project either provided by the supervisor or jointly decided with the student. Students are required to discuss their progresses with their supervisors regularly and submit a progress report at the end of the term. For students who will not enroll in CMBI4903, a final report in the form of a manuscript and an oral presentation are assessed at the end of term for performance.\r", "outcome": "Students taken this course are expected to develop the following abilities:\r 1) Integrate the knowledge and skills learnt previously in other courses\r 2) Survey scientific literature relevant to their research project\r 3) Read scientific literature critically to identify the scientific questions or problems\r 4) Design independent research project to address the scientific questions \r 5) Acquire hands-on research techniques in conducting experiments\r 6) Develop problem-solving abilities\r 7) Develop data analysis and interpretation skills in a logical and scientific ways\r 8) Improve skills in scientific writing and oral presentation\r 9) Develop a sense of responsibility and team spirit\r  學生將會發展以下能力： 1) 應用在課堂中獲得的知識及技能\r 2) 搜尋相關文獻的技巧\r 3) 具批判性思維閱讀及分析文獻的內容，並認知及思考當中的科學問題\r 4) 就自己的專題研究題目，設計實驗去解說科學問題\r 5) 各式實驗的操作能力\r 6) 解決問題的能力\r 7) 數據分析，並合乎邏輯性和具科學角度地表述出來\r 8) 書寫符合標準科技論文格式的書面報告及口頭報告的能力\r 9) 有責任感及團體精神\r  学生将会发展以下能力： 1) 应用在课堂中获得的知识及技能\r 2) 搜寻相关文献的技巧\r 3) 具批判性思维阅读及分析文献的内容，并认知及思考当中的科学问题\r 4) 就自己的专题研究题目，设计实验去解说科学问题\r 5) 各式实验的操作能力\r 6) 解决问题的能力\r 7) 数据分析，并合乎逻辑性和具科学角度地表述出来\r 8) 书写符合标准科技论文格式的书面报告及口头报告的能力\r 9) 有责任感及团体精神", "syllabus": "The students should continue to work on the research project from CMBI4901. Students should discuss the progress with their supervisors and submit a progress report in the end of the term. Students who do not continue to work on the research project in CMBI4903 should submit a final report and give an oral presentation.\r  學生就CMBI4901的研究課題繼續進行研究，並定期向教授匯報及討論研究所得的數據。於學期結束前遞交一份研究進展報告。如不修讀CMBI4903，學生須遞交一份書面報告及作口頭報告。\r  学生就CMBI4901的研究课题继续进行研究，并定期向教授汇报及讨论研究所得的数据。于学期结束前递交一份研究进展报告。如不修读CMBI4903，学生须递交一份书面报告及作口头报告。", "required_readings": "Relevant reference materials to the selected project will be provided by the supervisor.", "recommended_readings": "Relevant reference materials to the selected project will be provided by the supervisor.", "terms": {"2020-21 Term 1": {"-J01-PRJ (5023)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN Ting Fung Philos, \n\rProfessor CHEUNG Chat Pan Kenneth, \n\rProfessor HE Junxian, \n\rProfessor JIANG Liwen, \n\rProfessor KANG Byung Ho, \n\rProfessor LAM Hon Ming, \n\rProfessor LAU Kwok Fai, \n\rProfessor NGAI Sai Ming, \n\rProfessor TSANG Suk Ying"]}}}, "assessments": {"Lab reports": "50", "Others": "50"}}, {"code": "4903", "title": "Senior Experimental Project III", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Cell and Molecular Biology PC", "requirements": "Pre-requisite: CMBI4902.", "description": "In this course, students continue to work on and finish up the research project from CMBI4902. Relevant data analysis and conclusion formulation are performed after discussion with supervisors. A final report in the form of a manuscript and an oral presentation are assessed at the end of term for performance.\r", "outcome": "Students taken this course are expected to develop the following abilities:\r 1) Integrate the knowledge and skills learnt previously in other courses\r 2) Survey scientific literature relevant to their research project\r 3) Read scientific literature critically to identify the scientific questions or problems\r 4) Design independent research project to address the scientific questions \r 5) Acquire hands-on research techniques in conducting experiments\r 6) Develop problem-solving abilities\r 7) Develop data analysis and interpretation skills in a logical and scientific ways\r 8) Improve skills in scientific writing and oral presentation\r 9) Develop a sense of responsibility and team spirit\r  學生將會發展以下能力： 1) 應用在課堂中獲得的知識及技能\r 2) 搜尋相關文獻的技巧\r 3) 具批判性思維閱讀及分析文獻的內容，並認知及思考當中的科學問題\r 4) 就自己的專題研究題目，設計實驗去解說科學問題\r 5) 各式實驗的操作能力\r 6) 解決問題的能力\r 7) 數據分析，並合乎邏輯性和具科學角度地表述出來\r 8) 書寫符合標準科技論文格式的書面報告及口頭報告的能力\r 9) 有責任感及團體精神\r  学生将会发展以下能力： 1) 应用在课堂中获得的知识及技能\r 2) 搜寻相关文献的技巧\r 3) 具批判性思维阅读及分析文献的内容，并认知及思考当中的科学问题\r 4) 就自己的专题研究题目，设计实验去解说科学问题\r 5) 各式实验的操作能力\r 6) 解决问题的能力\r 7) 数据分析，并合乎逻辑性和具科学角度地表述出来\r 8) 书写符合标准科技论文格式的书面报告及口头报告的能力\r 9) 有责任感及团体精神", "syllabus": "The students should continue to work on the research project from CMBI4902. Students should discuss the progress with their supervisors and submit a final report in the form of manuscript and present orally at term end.\r  學生就CMBI4902的研究課題繼續進行研究，並定期向教授匯報及討論研究所得的數據。於學期結束前遞交一份科技論文並作口頭報告。\r  学生就CMBI4902的研究课题继续进行研究，并定期向教授汇报及讨论研究所得的数据。于学期结束前递交一份科技论文并作口头报告。", "required_readings": "Reference materials relevant to the selected project will be provided by the supervisor", "recommended_readings": "Reference materials relevant to the selected project will be provided by the supervisor", "terms": {"2020-21 Term 2": {"-J01-PRJ (5712)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN Ting Fung Philos, \n\rProfessor CHEUNG Chat Pan Kenneth, \n\rProfessor HE Junxian, \n\rProfessor JIANG Liwen, \n\rProfessor KANG Byung Ho, \n\rProfessor LAM Hon Ming, \n\rProfessor LAU Kwok Fai, \n\rProfessor NGAI Sai Ming, \n\rProfessor TSANG Suk Ying"]}}}, "assessments": {"Lab reports": "40", "Others": "30", "Presentation": "30"}}, {"code": "5101", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Cell and Molecular Biology", "description": "Students shall be required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in general biochemistry and in-depth knowledge in a particular field of biomedical sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1371)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}, "2020-21 Term 2": {"-S01-SEM (1408)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "5201", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Cell and Molecular Biology", "description": "Students shall be required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in general biochemistry and in-depth knowledge in a particular field of biomedical sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1387)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}, "2020-21 Term 2": {"-S01-SEM (1409)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "5301", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Cell and Molecular Biology", "description": "Students shall be required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in general biochemistry and in-depth knowledge in a particular field of biomedical sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1388)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}, "2020-21 Term 2": {"-S01-SEM (1410)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7101", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Cell and Molecular Biology", "description": "Students shall be required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in general biochemistry and in-depth knowledge in a particular field of biomedical sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1389)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}, "2020-21 Term 2": {"-S01-SEM (1411)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7201", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Cell and Molecular Biology", "description": "Students shall be required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in general biochemistry and in-depth knowledge in a particular field of biomedical sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1390)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}, "2020-21 Term 2": {"-S01-SEM (1412)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7301", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Cell and Molecular Biology", "description": "Students shall be required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in general biochemistry and in-depth knowledge in a particular field of biomedical sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1397)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}, "2020-21 Term 2": {"-S01-SEM (1440)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7401", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Cell and Molecular Biology", "description": "Students shall be required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in general biochemistry and in-depth knowledge in a particular field of biomedical sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1398)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}, "2020-21 Term 2": {"-S01-SEM (1441)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7501", "title": "seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Cell and Molecular Biology", "description": "Students shall be required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in general biochemistry and in-depth knowledge in a particular field of biomedical sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1399)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}, "2020-21 Term 2": {"-S01-SEM (1442)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7601", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Cell and Molecular Biology", "description": "Students shall be required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in general biochemistry and in-depth knowledge in a particular field of biomedical sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1400)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}, "2020-21 Term 2": {"-S01-SEM (1443)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7701", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Cell and Molecular Biology", "description": "Students shall be required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in general biochemistry and in-depth knowledge in a particular field of biomedical sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1401)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}, "2020-21 Term 2": {"-S01-SEM (1444)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "8003", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Cell and Molecular Biology", "description": "In this course, a student is required to meet regularly with his/her supervisor who provides necessary guidance and supervision to write up a thesis and monitors the student’s academic progress.", "outcome": "Development of research skills, including field and/or laboratory studies and data analysis as related to the students' thesis research.", "syllabus": "-    Identify a research topic-    Develop a research hypothesis-    Prepare a research proposal-    Develop research methodology and experimental design-    Conduct an original research with impact in a specific field or subject-    Analyze experimental results and make appropriate data interpretation-    Prepare a research dissertation/thesis and related manuscripts for publication", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-M01-TMC (1402)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN Michael Kenneth, \n\rProfessor CHAN Ting Fung Philos, \n\rProfessor GUO Dianjing, \n\rProfessor JIANG Liwen, \n\rProfessor KWAN Kin Ming, \n\rProfessor LAU Wilson Chun Yu, \n\rProfessor TSANG Suk Ying"]}}, "2020-21 Term 2": {"-M01-TMC (1464)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN Michael Kenneth, \n\rProfessor CHAN Ting Fung Philos, \n\rProfessor GUO Dianjing, \n\rProfessor JIANG Liwen, \n\rProfessor KWAN Kin Ming, \n\rProfessor LAU Wilson Chun Yu, \n\rProfessor TSANG Suk Ying"]}}}}, {"code": "8006", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "6.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Cell and Molecular Biology", "description": "In this course, a student is required to meet regularly with his/her supervisor who provides necessary guidance and supervision to write up a thesis and monitors the student’s academic progress.", "outcome": "Development of research skills, including field and/or laboratory studies and data analysis as related to the students' thesis research.", "syllabus": "-    Identify a research topic-    Develop a research hypothesis-    Prepare a research proposal-    Develop research methodology and experimental design-    Conduct an original research with impact in a specific field or subject-    Analyze experimental results and make appropriate data interpretation-    Prepare a research dissertation/thesis and related manuscripts for publication", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-M01-TMC (1416)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN Michael Kenneth, \n\rProfessor CHAN Ting Fung Philos, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor GUO Dianjing, \n\rProfessor HE Junxian, \n\rProfessor JIANG Liwen, \n\rProfessor KANG Byung Ho, \n\rProfessor KWAN Kin Ming, \n\rProfessor LAU Kwok Fai, \n\rProfessor LEUNG Lai Kwok, \n\rProfessor TSANG Suk Ying, \n\rProfessor WONG Wing Tak Jack, \n\rProfessor ZHONG Silin, \n\rProfessor ZHUANG Xiaohong"]}}, "2020-21 Term 2": {"-M01-TMC (1092)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN Michael Kenneth, \n\rProfessor CHAN Ting Fung Philos, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor GUO Dianjing, \n\rProfessor HE Junxian, \n\rProfessor JIANG Liwen, \n\rProfessor KANG Byung Ho, \n\rProfessor KWAN Kin Ming, \n\rProfessor LAU Kwok Fai, \n\rProfessor LEUNG Lai Kwok, \n\rProfessor TSANG Suk Ying, \n\rProfessor WONG Wing Tak Jack, \n\rProfessor ZHUANG Xiaohong"]}}}}, {"code": "8012", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "12.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Cell and Molecular Biology", "description": "In this course, a student is required to meet regularly with his/her supervisor who provides necessary guidance and supervision to write up a thesis and monitors the student’s academic progress.", "outcome": "Development of research skills, including field and/or laboratory studies and data analysis as related to the students' thesis research.", "syllabus": "-    Identify a research topic-    Develop a research hypothesis-    Prepare a research proposal-    Develop research methodology and experimental design-    Conduct an original research with impact in a specific field or subject-    Analyze experimental results and make appropriate data interpretation-    Prepare a research dissertation/thesis and related manuscripts for publication", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-M01-TMC (1077)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN Ho Yin Edwin, \n\rProfessor CHAN Michael Kenneth, \n\rProfessor CHAN Ting Fung Philos, \n\rProfessor CHU Ka Hou, \n\rProfessor GUO Dianjing, \n\rProfessor JIANG Liwen, \n\rProfessor KANG Byung Ho, \n\rProfessor KWAN Kin Ming, \n\rProfessor LAU Wilson Chun Yu, \n\rProfessor TSANG Suk Ying, \n\rProfessor WONG Wing Tak Jack, \n\rProfessor ZHONG Silin"]}}, "2020-21 Term 2": {"-M01-TMC (1118)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN Ho Yin Edwin, \n\rProfessor CHAN Michael Kenneth, \n\rProfessor CHAN Ting Fung Philos, \n\rProfessor CHU Ka Hou, \n\rProfessor GUO Dianjing, \n\rProfessor JIANG Liwen, \n\rProfessor KANG Byung Ho, \n\rProfessor KWAN Kin Ming, \n\rProfessor LAU Wilson Chun Yu, \n\rProfessor TSANG Suk Ying, \n\rProfessor WONG Wing Tak Jack, \n\rProfessor ZHONG Silin"]}}}}]