[{"code": "5002", "title": "Abdominal Ultrasonography 1", "career": "Postgraduate - Taught", "units": "4.50", "grading": "Graded", "components": "LecturePracticumInteractive Tutorial", "campus": "Main Campus", "academic_group": "Division of I & I Radiology", "requirements": "For students in MSc Diagnostic Ultrasonography only", "description": "This course will introduce an in-depth knowledge on the sonographic anatomy, common pathologies and scanning techniques of the hepatobiliary system, pancreas, spleen, adrenal glands, genito-urinary and gastrointestinal systems. Case-based tutorials will be conducted to facilitate the students to critically analyze different sonographic findings in order to work out the diagnosis. The technical pitfalls, differential diagnosis, correlative imaging, alternative investigations and useful clinical information will be discussed. Advanced imaging such as 3D imaging, contrast-enhanced ultrasound and elastography are also included. (Remarks: live demonstration and hands-on practical on live subjects will be provided)", "outcome": "After the course, the students should be able to understand the normal anatomy of major organs of the upper abdomen; acquire the scanning techniques and protocols; scan in a systematical approach; capture sonograms of diagnostic quality; critically evaluate normal and abnormal sonographic findings; correlate clinical, biochemical and/or other imaging data with sonographic findings; Suggest diagnosis and document sonographic findings.", "syllabus": "This course will introduce an in-depth knowledge on the sonographic anatomy, common pathologies and scanning techniques of the hepatobiliary system, pancreas, spleen, adrenal glands, genito-urinary and gastrointestinal systems. Case-based tutorials will be conducted to facilitate the students to critically analyze different sonographic findings in order to work out the diagnosis. The technical pitfalls, differential diagnosis, correlative imaging, alternative investigations and useful clinical information will be discussed.   Advanced imaging such as 3D imaging, contrast-enhanced ultrasound and elastography are also included. (Remarks: live demonstration and hands-on practical on live subjects will be provided)", "required_readings": "Reading list will be provided by lecturers in class.", "recommended_readings": "Reading list will be provided by lecturers in class.", "terms": {"2021-22 Term 1": {"--LEC (1542)": {"startTimes": ["14:00"], "endTimes": ["16:00"], "days": [6], "locations": ["Wu Ho Man Yuen Bldg 502"], "instructors": ["Professor LEUNG Yee Fong, \n\rProfessor LIU Kin Hung"], "meetingDates": ["11/9", "18/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11", "4/12"]}, "-P01-PRA (1541)": {"startTimes": ["18:00"], "endTimes": ["19:00"], "days": [6], "locations": ["Wu Ho Man Yuen Bldg 502"], "instructors": ["Professor LEUNG Yee Fong, \n\rProfessor LIU Kin Hung"], "meetingDates": ["11/9", "18/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11", "4/12"]}, "-T01-TUT (4291)": {"startTimes": ["16:00"], "endTimes": ["17:00"], "days": [6], "locations": ["Wu Ho Man Yuen Bldg 502"], "instructors": ["Professor LEUNG Yee Fong, \n\rProfessor LIU Kin Hung"], "meetingDates": ["11/9", "18/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11", "4/12"]}}}, "assessments": {"Examination": "50", "Internship or practicum": "30", "Test or quiz": "20"}}, {"code": "5003", "title": "Abdominal Ultrasonography 2 & Small part Ultrasonography", "career": "Postgraduate - Taught", "units": "5.50", "grading": "Graded", "components": "LecturePracticumInteractive Tutorial", "campus": "Main Campus", "academic_group": "Division of I & I Radiology", "requirements": "For students in MSc Diagnostic Ultrasonography only", "description": "This course will introduce an in-depth knowledge on the sonographic anatomy, common pathologies and scanning techniques of the urogenital system of both females and males, and small parts (thyroid, parathyroid, salivary glands, lymph nodes, eyes, scrotum and breasts). Case-based tutorials will be conducted to facilitate the students to critically analyze different sonographic findings in order to work out the diagnosis. The technical pitfalls, differential diagnosis, correlative imaging, alternative investigations and useful clinical information will be discussed. (Remarks: live demonstration and hands-on practical will be provided)", "outcome": "After the course, the students should be able to understand the normal anatomy of urinary system, major organs of the male and female pelvis, and small parts such as thyroid, parathyroid, salivary glands, , eyes, scrotum, penis and breasts; acquire the scanning techniques and protocols; scan in a systematical approach; capture sonograms of diagnostic quality; critically review the normal and abnormal sonographic findings; correlate clinical, biochemical and/or other imaging data with sonographic findings; suggest disease diagnosis and document sonographic findings.", "syllabus": "This course will introduce an in-depth knowledge on the sonographic anatomy, common pathologies and scanning techniques of the urogenital system of both females and males, and small parts (thyroid, parathyroid, salivary glands, lymph nodes, eyes, scrotum and breasts). Case-based tutorials will be conducted to facilitate the students to critically analyze different sonographic findings in order to work out the diagnosis.  The technical pitfalls, differential diagnosis, correlative imaging, alternative investigations and useful clinical information will be discussed.  (Remarks: live demonstration and hands-on practical will be provided)", "required_readings": "Reading list will be provided by lecturers in class.", "recommended_readings": "Reading list will be provided by lecturers in class.", "terms": {"2021-22 Term 1": {"--LEC (3933)": {"startTimes": ["14:00"], "endTimes": ["17:00"], "days": [6], "locations": ["Wu Ho Man Yuen Bldg 502"], "instructors": ["Professor LEUNG Yee Fong"], "meetingDates": ["15/1", "22/1", "29/1"]}, "-P01-PRA (3932)": {"startTimes": ["18:00"], "endTimes": ["19:00"], "days": [6], "locations": ["Wu Ho Man Yuen Bldg 502"], "instructors": ["Professor LEUNG Yee Fong"], "meetingDates": ["15/1", "22/1", "29/1"]}, "-T01-TUT (4296)": {"startTimes": ["17:00"], "endTimes": ["18:00"], "days": [6], "locations": ["Wu Ho Man Yuen Bldg 502"], "instructors": ["Professor LEUNG Yee Fong"], "meetingDates": ["15/1", "22/1", "29/1"]}}}, "assessments": {"Examination": "50", "Internship or practicum": "30", "Test or quiz": "20"}}, {"code": "5004", "title": "Vascular Ultrasonography", "career": "Postgraduate - Taught", "units": "4.00", "grading": "Graded", "components": "LecturePracticumInteractive Tutorial", "campus": "Main Campus", "academic_group": "Division of I & I Radiology", "requirements": "For students in MSc Diagnostic Ultrasonography only", "description": "This course will focus on peripheral and visceral vasculatures. It will provide an in-depth knowledge and practical skills needed to perform Doppler ultrasound examinations in the following areas: intracranial and extracranial arteries, peripheral arterial and venous system, and visceral organs. An introduction of adult echocardiography will also be provided. (Remarks: live demonstration and hands-on practical on live subjects will be provided)", "outcome": "After the course, the students should be able to understand the normal vascular anatomy and the respective scanning techniques and protocols in peripheral and visceral vasculatures, and adult heart. The students also should be able to scan in a systematical approach; capture sonograms of diagnostic quality in peripheral and visceral vasculatures; to critically review the normal and abnormal findings of ultrasound images with reference to the clinical data in evidence-based approach; and to document normal and abnormal Doppler findings, and to suggest disease diagnosis.", "syllabus": "This course will focus on peripheral and visceral vasculatures.  It will provide an in-depth knowledge and practical skills needed to perform Doppler ultrasound examinations in the following areas: intracranial and extracranial arteries, peripheral arterial and venous system, and visceral organs.  An introduction of adult echocardiography will also be provided. (Remarks: live demonstration and hands-on practical on live subjects will be provided)", "required_readings": "Reading list will be provided by lecturers in class.", "recommended_readings": "Reading list will be provided by lecturers in class.", "terms": {"2020-21 Term 1": {"--LEC (4427)": {"startTimes": ["14:00"], "endTimes": ["15:00"], "days": [6], "locations": ["Prince of Wales Hospital"], "instructors": ["Ms. HO Pik Yuk, \n\rProfessor FUNG Erik Yee Mun George, \n\rProfessor HO Sin Yee Stella, \n\rProfessor KAM Ka Ho Kevin, \n\rProfessor LEE Pui Wai, \n\rProfessor LEUNG Wai Hong Thomas, \n\rProfessor LEUNG Yee Fong, \n\rProfessor LIU Kin Hung, \n\rProfessor YIH Chun Ling Patricia"], "meetingDates": ["12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11", "5/12"]}, "-P01-PRA (4428)": {"startTimes": ["16:00"], "endTimes": ["17:00"], "days": [6], "locations": ["Prince of Wales Hospital"], "instructors": ["Miss LAM Hoi Ling Christina, \n\rMr. MAK Yu Hin Poe, \n\rMs WONG Ka Man, \n\rMs. LAM Yuen May, \n\rMs. SOU Miu Yi, \n\rProfessor HO Sin Yee Stella, \n\rProfessor LEUNG Yee Fong, \n\rProfessor LIU Kin Hung"], "meetingDates": ["12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11", "5/12"]}, "-T01-TUT (4429)": {"startTimes": ["15:00"], "endTimes": ["16:00"], "days": [6], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor LEUNG Yee Fong, \n\rProfessor LIU Kin Hung"], "meetingDates": ["12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11", "5/12"]}}}, "assessments": {"Examination": "50", "Internship or practicum": "30", "Test or quiz": "20"}}, {"code": "5007", "title": "Paediatric Ultrasonography", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Division of I & I Radiology", "requirements": "For students in MSc Diagnostic Ultrasonography only", "description": "This course is designed to provide comprehensive knowledge of the sonographic anatomy, common pathologies and scanning techniques in neonatal brain, spine, neck, abdomen, hips and musculoskeletal system. Clinical approach including diagnosis, assessment and management of patients will be taught. Case-based tutorials will be conducted to facilitate the students to critically analyze different sonographic findings for diagnostic work-up. (Remarks: live demonstration will be provided)", "outcome": "After the course, the students should be able to understand the indications and clinical applications of paediatric sonography; understand the advantages and limitations of paediatric ultrasound; understand the normal sonographic anatomy and scanning techniques of the neonatal brain, spine and hips, neck, abdomen and musculoskeletal system; critically review the normal and abnormal sonographic findings, and to correlate with clinical and biochemical data; suggest disease diagnosis", "syllabus": "This course is designed to provide comprehensive knowledge of the sonographic anatomy, common pathologies and scanning techniques in neonatal brain, spine, neck, abdomen, hips and musculoskeletal system.  Clinical approach including diagnosis, assessment and management of patients will be taught.  Case-based tutorials will be conducted to facilitate the students to critically analyze different sonographic findings for diagnostic work-up. (Remarks: live demonstration will be provided)", "required_readings": "Reading list will be provided by lecturers in class.", "recommended_readings": "Reading list will be provided by lecturers in class.", "terms": {"2020-21 Term 2": {"--LEC (4501)": {"startTimes": ["14:00"], "endTimes": ["15:00"], "days": [6], "locations": ["Prince of Wales Hospital"], "instructors": ["Dr KAN Yee Ling Elaine, \n\rProfessor CHU Chiu Wing Winnie, \n\rProfessor HUNG Hiu Yee, \n\rProfessor IP Chei Bing Matthew, \n\rProfessor LEUNG Yee Fong, \n\rProfessor NG Wing Hung, \n\rProfessor WONG Ka Tak"], "meetingDates": ["23/1", "30/1", "6/2"]}, "-T01-TUT (4502)": {"startTimes": ["15:00"], "endTimes": ["16:00"], "days": [6], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor LEUNG Hoi Ying, \n\rProfessor LEUNG Yee Fong"], "meetingDates": ["23/1", "30/1", "6/2"]}}}, "assessments": {"Examination": "50", "Internship or practicum": "30", "Test or quiz": "20"}}, {"code": "5008", "title": "Musculoskeletal Ultrasonography", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "LecturePracticum", "campus": "Main Campus", "academic_group": "Division of I & I Radiology", "requirements": "For students in MSc Diagnostic Ultrasonography only", "description": "This course will cover the anatomy, scanning approaches and pathologies of upper limb (shoulder, arm, elbow and forearm), lower limb (hips, thigh, knee, calf, ankle and foot), and abdominal wall. The location, echopattern, vascularity and artefacts of the bone, tendon, ligament, bursa, muscle, nerve and adipose tissues will be discussed. Special attention will be given to obtain the standard imaging planes to identify the various normal structures in the upper and lower limbs and abdominal wall. Case-based tutorials will be conducted to enhance students' ability to critically analyse various sonographic features and their relationship with different pathologies. (Remarks: live demonstration and hands-on practical on live subjects will be provided)", "outcome": "After the course, the students should be able to understand the normal anatomy of human musculoskeletal system; understand the scanning techniques and protocols; scan in a systematic approach and capture images of diagnostic quality; critically review common sonographic findings, and to correlate with alternative imaging, clinical and biochemical data; suggest common disease diagnosis", "syllabus": "This course will cover the anatomy, scanning approaches and pathologies of upper limb (shoulder, arm, elbow and forearm), lower limb (hips, thigh, knee, calf, ankle and foot), and abdominal wall. The location, echopattern, vascularity and artefacts of the bone, tendon, ligament, bursa, muscle, nerve and adipose tissues will be discussed. Special attention will be given to obtain the standard imaging planes to identify the various normal structures in the upper and lower limbs and abdominal wall. Case-based tutorials will be conducted to enhance students' ability to critically analyse various sonographic features and their relationship with different pathologies. (Remarks: live demonstration and hands-on practical on live subjects will be provided)", "required_readings": "Reading list will be provided by lecturers in class.", "recommended_readings": "Reading list will be provided by lecturers in class.", "terms": {"2020-21 Term 1": {"--LEC (4430)": {"startTimes": ["17:00"], "endTimes": ["18:00"], "days": [6], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor HUNG Hiu Yee, \n\rProfessor James Francis GRIFFITH, \n\rProfessor LEE Ka Lok, \n\rProfessor LIU Kin Hung, \n\rProfessor NG Wing Hung"], "meetingDates": ["12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11", "5/12"]}, "-P01-PRA (4431)": {"startTimes": ["18:00"], "endTimes": ["19:00"], "days": [6], "locations": ["Prince of Wales Hospital"], "instructors": ["Mr WONG Koon Wing, \n\rProfessor HUNG Hiu Yee, \n\rProfessor James Francis GRIFFITH, \n\rProfessor LEE Ka Lok, \n\rProfessor LEUNG Yee Fong, \n\rProfessor LIU Kin Hung, \n\rProfessor NG Wing Hung"], "meetingDates": ["12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11", "5/12"]}}}, "assessments": {"Examination": "50", "Internship or practicum": "30", "Test or quiz": "20"}}, {"code": "5009", "title": "Obstetric Ultrasonography", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Division of I & I Radiology", "requirements": "For students in MSc Diagnostic Ultrasonography only", "description": "This course will introduce the basic concept of embryology, the normal and abnormal sonographic appearance of fetal structures. The pregnancy including complications in the first, second and third trimester will be discussed. A brief account of sonographic screening of chromosomal abnormalities and genetic syndrome in the first and second trimester scans will be provided. Clinical approach includes biochemical screening for Downs syndrome and open neural tube defect will be covered. The students need to understand the prevalence, etiology, prenatal sonographic features and prognosis for certain common fetal abnormalities. Determination of the number, size, location and chorionicity of pregnancy will be discussed. Brief discussion on multiple pregnancies and its associated assessment, placental location, fetal structural abnormalities and their correlations to pregnancy complication will be included. A discussion on the ultrasound scanning of adnexal regions and understanding of the maternal diseases that are related to pregnancy will be required. (Remarks: live demonstration will be provided)", "outcome": "After the course, the students should be able to understand the role of ultrasound in the diagnosis and management of pregnancy complications; understand ultrasound as the main diagnostic tool in the prenatal detection of congenital abnormalities; critically review the normal and abnormal sonographic findings; identify major fetal structural defects; correlate clinical, biochemical and sonographic findings; understanding pregnancy related maternal diseases.", "syllabus": "This course will introduce the basic concept of embryology, the normal and abnormal sonographic appearance of fetal structures. The pregnancy including complications in the first, second and third trimester will be discussed.  A brief account of sonographic screening of chromosomal abnormalities and genetic syndrome in the first and second trimester scans will be provided. Clinical approach includes biochemical screening for Downs syndrome and open neural tube defect will be covered. The students need to understand the prevalence, etiology, prenatal sonographic features and prognosis for certain common fetal abnormalities.  Determination of the number, size, location and chorionicity of pregnancy will be discussed.  Brief discussion on multiple pregnancies and its associated assessment, placental location, fetal structural abnormalities and their correlations to pregnancy complication will be included. A discussion on the ultrasound scanning of adnexal regions and understanding of the maternal diseases that are related to pregnancy will be required.  (Remarks: live demonstration will be provided)", "required_readings": "Reading list will be provided by lecturers in class.", "recommended_readings": "Reading list will be provided by lecturers in class.", "terms": {"2020-21 Term 2": {"--LEC (4552)": {"startTimes": ["17:00"], "endTimes": ["18:00"], "days": [6], "locations": ["TBA"], "instructors": ["Professor LEUNG Yee Fong, \n\rProfessor LIU Kin Hung"], "meetingDates": ["16/1", "23/1", "30/1", "6/2"]}, "-T01-TUT (4553)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor LEUNG Yee Fong, \n\rProfessor LIU Kin Hung"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}}, "assessments": {"Examination": "50", "Internship or practicum": "30", "Test or quiz": "20"}}, {"code": "5012", "title": "Clinical Attachment", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Division of I & I Radiology", "requirements": "For students in MSc Diagnostic Ultrasonography only", "description": "The clinical attachment aims to provide students with the opportunities to familiarize with and enhance the scanning skills acquired in the lectures and practical sessions; to experience the practice in hospital settings including ultrasound related patient care and infection control; and to be exposed to a wide range of abnormal / complex cases. The clinical attachment consists of 15–day attachment at Department of Imaging and Interventional Radiology, Prince of Wales Hospital. Hands-on examinations on patients under supervision may be provided if prevailing workload allows. Students must attain full attendance of the 15-day attachment, complete the Practicum Record with no less than the designated number of cases required, and demonstrate the “Basic Techniques” as listed in the Practicum Record during the clinical attachment. ", "outcome": "After the course, the students should be able to understand patient care and infection control related to ultrasound examinations; perform the scans of abdomen and vascular systems in systematic approach; capture sonograms of diagnostic quality; critically review the normal and abnormal sonographic findings; correlate clinical, biochemical and/or other imaging data with sonographic findings; document normal and abnormal sonographic findings; suggest disease diagnosis.", "syllabus": "The clinical attachment aims to provide students with the opportunities to familiarize with and enhance the scanning skills acquired in the lectures and practical sessions; to experience the practice in hospital settings including ultrasound related patient care and infection control; and to be exposed to a wide range of abnormal / complex cases.  The clinical attachment consists of 15–day attachment at Department of Imaging and Interventional Radiology, Prince of Wales Hospital.  Hands-on examinations on patients under supervision may be provided if prevailing workload allows.  Students must attain full attendance of the 15-day attachment, complete the Practicum Record with no less than the designated number of cases required, and demonstrate the “Basic Techniques” as listed in the Practicum Record during the clinical attachment.     ", "required_readings": "Reading list will be provided by lecturers in class.", "recommended_readings": "Reading list will be provided by lecturers in class.", "terms": {"2020-21 Term 2": {"-F01-FLD (4500)": {"startTimes": ["15:00"], "endTimes": ["17:00"], "days": [1], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor CHU Chiu Wing Winnie, \n\rProfessor LIU Kin Hung, \n\rProfessor SO Tiffany Yuen Tung"], "meetingDates": ["18/1", "25/1", "1/2", "8/2"]}}}, "assessments": {"Attendance": "15", "Examination": "60", "Homework or assignment": "25"}}, {"code": "5013", "title": "Foundation Studies in Ultrasound and Research", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Division of I & I Radiology", "requirements": "For students in MSc Diagnostic Ultrasonography only", "description": "This course will introduce the fundamental concepts of physical ultrasound & instrumentation as well as research methodology. In the former, physical principle of different modes of sonographic imaging (gray-scale and pulsed Doppler Imaging); optimization of control settings in ultrasound equipment; effect of ultrasound artifacts on the image quality and diagnosis; bioeffects and safety of ultrasound; and quality assurance tests etc. will be taught. In the latter, the concept of research design, descriptive statistics, epidemiology, statistical methods (sample size estimation, null hypothesis testing, significant difference, parametric and non-parametric tests, and correlation and reliability analysis etc.) will also be discussed.", "outcome": "After the course, the students should be able to understand the physical principle of gray-scale and different modes of Doppler imaging; understand the pros and cons of different types of Doppler imaging; understand their effects on image resolution; identify different types of image artifacts; appreciate their effects and benefits on the image interpretation; understand the significance of optimizing the control settings to produce images of diagnostic value and beware of the potential bioeffects of ultrasound and ensure safe use; select appropriate imaging modes in the course of an ultrasound examination, and adjust the machine control settings to produce images of diagnostic value. The students should also be able to apply appropriate statistical tests to analyze the research / clinical data.", "syllabus": "This course will introduce the fundamental concepts of physical ultrasound & instrumentation as well as research methodology.   In the former, physical principle of different modes of sonographic imaging (gray-scale and pulsed Doppler Imaging); optimization of control settings in ultrasound equipment; effect of ultrasound artifacts on the image quality and diagnosis; bioeffects and safety of ultrasound; and quality assurance tests etc. will be taught.  In the latter, the concept of research design, descriptive statistics, epidemiology, statistical methods (sample size estimation, null hypothesis testing, significant difference, parametric and non-parametric tests, and correlation and reliability analysis etc.) will also be discussed.", "required_readings": "Reading list will be provided by lecturers in class.", "recommended_readings": "Reading list will be provided by lecturers in class.", "terms": {"2021-22 Term 1": {"--LEC (3934)": {"startTimes": ["17:00"], "endTimes": ["18:00"], "days": [6], "locations": ["Wu Ho Man Yuen Bldg 502"], "instructors": ["Professor LEUNG Yee Fong"], "meetingDates": ["11/9", "18/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11", "4/12"]}}}, "assessments": {"Examination": "70", "Test or quiz": "30"}}, {"code": "5014", "title": "Critical Review Studies", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Division of I & I Radiology", "requirements": "For students in MSc Diagnostic Ultrasonography only", "description": "This course aims to enhance the students’ knowledge in evidence-based practice through a systematic guided review of research literature. Students will be taught the meaning of evidence-based practice, good clinical practice and different types of epidemiological studies. They will also learn how to perform literature search using electronic database; critically appraise scientific articles related to not only clinical ultrasound but also other clinical topics focusing on the rationale of the study, appropriateness of study design, correctness of data analysis, significance of the results and thoroughness of the discussion.", "outcome": "After the course, the students should be able to understand the appraisal criteria for different epidemiological studies and critically appraise a research article in order to determine the usefulness and validity of the research findings", "syllabus": "This course aims to enhance the students’ knowledge in evidence-based practice through a systematic guided review of research literature.    Students will be taught the meaning of evidence-based practice, good clinical practice and different types of epidemiological studies.  They will also learn  how to perform literature search using electronic database; critically appraise scientific articles related to not only clinical ultrasound  but also other clinical topics  focusing on the rationale of the study, appropriateness of study design, correctness of data analysis, significance of the results and thoroughness of the discussion.   ", "required_readings": "Reading list will be provided by lecturers in class.", "recommended_readings": "Reading list will be provided by lecturers in class.", "terms": {"2020-21 Term 2": {"--LEC (4505)": {"startTimes": ["18:00"], "endTimes": ["19:00"], "days": [6], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor CHONG Ka Chun, \n\rProfessor HO Sin Yee Stella, \n\rProfessor LEUNG Yee Fong, \n\rProfessor LIU Kin Hung"], "meetingDates": ["23/1", "30/1", "6/2"]}}}, "assessments": {"Homework or assignment": "40", "Presentation": "30", "Test or quiz": "30"}}, {"code": "5015", "title": "Research Study", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Division of I & I Radiology", "requirements": "For students in MSc Diagnostic Ultrasonography only", "description": "This course aims to enhance the students’ understanding of the key components of research such as ethics approval, literature research, data analysis and report writing through conducting a small-scale research study. The students in group are required to do an independent study in a designated subject under the supervision of teacher(s) from the faculty and participate in group presentations on their research topics. Each student needs to complete a dissertation no more than 3,000 words. A maximum of 10 students will be accepted for this course. Selection will be based on the exam performance of the students in research methodology.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]