[{"code": "1001", "title": "Introduction to Policy Sciences", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course introduces key concepts, theories and models in the study of policy sciences. To resolve complex and multi-level public problems of a globalized world in ways that help to identify and enhance the common interest, policy sciences provide an integrated and interdisciplinary approach for making good policy decisions. This course also aims to help students understand the process and structure in designing policies. The concerns of this course are integrating theory and practice into actionable social knowledge and apply it to real world problems.", "outcome": "By the end of this course, students should be able to:\r a. Understand the policy process and its application in real life policies; b. Understand key concepts and theoretical approaches to public sciences and analysis; c. Adopt and apply theories to understand real world problems; d. Formulate their own knowledge system based on the knowledge and concepts introduced.", "syllabus": "1. Introduction to Policy Sciences and public policy \r 2. Basic concepts & theories in Policy Sciences\r 3. Key models and frameworks in Policy Analysis \r 4. Wicked problems & international affairs in the globalized world\r 5. Integrated and interdisciplinary approach for policy-making\r 6. Main process and structure in designing and evaluating policies\r 7. Theories and its application in the context of Hong Kong and comparative contexts", "required_readings": "- Howlett, M., Ramesh, M., & Perl, A. (2009). Studying public policy: Policy cycles and policy subsystems (Vol. 3). Oxford: Oxford University Press.\r - Sabatier, P. A., & Weible, C. M. (Eds.). (2014). Theories of the policy process. Westview Press.", "recommended_readings": "- Birkland, T. A. (2015). An introduction to the policy process: Theories, concepts, and models of public policy making. Routledge.\r - Hajer, M., Hajer, M. A., & Wagenaar, H. (Eds.). (2003). Deliberative policy analysis: understanding governance in the network society. Cambridge University Press.\r - Innes, J. E., & Booher, D. E. (2010). Planning with complexity: An introduction to collaborative rationality for public policy. Routledge.", "terms": {"2020-21 Term 2": {"--LEC (8812)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor CHU May"]}}}, "assessments": {"Essay test or exam": "70", "Homework or assignment": "20", "Others": "10"}}, {"code": "1002", "title": "Data Science and Public Policy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course focuses on the important connection between data science and public policy by identifying and analyzing the policy challenges posed by data science technologies. It assesses what policy options and tools are available to address them and examines what new capacities governments and also citizens must develop in the era of data science. Students would also be introduced to the professional and ethical responsibilities and social, economic, political and legal impacts under the changes and innovations brought by data science.", "outcome": "By the end of this course, students should be able to:\r a. Identify and analyze the policy challenges caused by data science technologies; b. Understand the usage of policy instruments and policy implementation in the era of data science\r c. Understand the great social changes and influences brought by data science", "syllabus": "1）Introduction to data science and public policy, connection between data science and public policy\r 2）Basic data science technologies and policy analysis methods (policy options and tools) \r 3）Basic analysis skills and tools for identifying and analyzing the policy challenges by data science\r 4）Government capacities and responsibilities in the changing society ( big data & information explosion)\r 5）Social impact brought by data science (social, economic, political and legal)", "required_readings": "- Chun, S., Shulman, S., Sandoval, R., & Hovy, E. (2010). Government 2.0: Making connections between citizens, data and government. Information Polity, 15(1, 2), 1-9.\r - Mayer-Schonberger, V., & Cukier, K. (2013). Big data: A revolution that will transform how we live, work, and think. NY: Houghton Mifflin Harcourt.\r - Schintler L. A., & Kulkarni, R. (2014). Big Data for Policy Analysis: The Good, The Bad, and the Ugly, Review of Policy Research 31(4), 343-348.", "recommended_readings": "- Athey, S. (2017). Beyond prediction: Using big data for policy problems. Science, 355(6324), 483-485.\r - Bennett, C. J. (1992). Regulating privacy: data protection and public policy in Europe and the United States. Cornell University Press.\r - Rethemeyer R K & Isett K (2016). Big Data in Public Affairs, Public Administration Review 76(6), 928-937.", "terms": {"2020-21 Term 1": {"--LEC (8078)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor WONG Wai Ho"]}}}, "assessments": {"Essay test or exam": "80", "Presentation": "20"}}, {"code": "1003", "title": "Foundation of Data Science", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This is a foundational course to equip students with the essential skills and knowledge in the major fields contributing to data science, including statistics, mathematics, computer, and engineering, to prepare them for the technical courses in the Data Science and Policy Studies Programme. It would also introduce students to the concepts and applications of new and evolving technologies in data science and related fields, such as machine learning, computer-human interaction, big data, data mining, informatics, social analytics, cybersecurity, Internet of Things (IoT), and artificial intelligence.", "outcome": "Students are expected to acquire foundational knowledge and basic skills about data science, including its sub-sets, their theoretical applications and developmental trajectory. Also, they would also need to able to use certain software and programming language to yield reasonable result.", "syllabus": "1) Introduction of data science, essential skills and basic knowledge\r 2) Master the basics in sub-sets, such as statistics, mathematics, computer, and engineering\r 3) Data science application in specific policy areas\r 4) The concepts and applications of new and evolving technologies in data science and related fields, such as machine learning, computer-human interaction, big data, data mining, informatics, social analytics, cybersecurity, Internet of Things (IoT), and artificial intelligence.\r 5) Data processing software learning", "required_readings": "- Graham, R. L., Knuth, D. E., Patashnik, O., & Liu, S. (1989). Concrete mathematics: a foundation for computer science. Computers in Physics, 3(5), 106-107.\r - Godsey, B. (2017). Think like a Data Scientist: Tackle the data science process step-by-step. NY: Mannings.\r - Wu, X., Zhu, X., Wu, G. Q., & Ding, W. (2014). Data mining with big data. IEEE transactions on knowledge and data engineering, 26(1), 97-107.", "recommended_readings": "- Kelleher, J., & Tierney, B. (2018). Data Science. Cambridge, MA: MIT Press.\r - Lazer, D., Pentland, A. S., Adamic, L., Aral, S., Barabasi, A. L., Brewer, D., ... & Jebara, T. (2009). Life in the network: the coming age of computational social science. Science (New York, NY), 323(5915), 721.\r - Lohr, S. (2012). The age of big data. New York Times, 11(2012).", "terms": {"2020-21 Term 1": {"--LEC (6835)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr. HO Chi Pui"]}}, "2020-21 Term 2": {"--LEC (5005)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. HO Chi Pui"]}}}, "assessments": {"Essay test or exam": "35", "Others": "10", "Presentation": "10", "Project": "35", "Participation": "10"}}, {"code": "2101", "title": "Research Methods for Policy Studies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course introduces major methods used in policy studies research, with both quantitative and qualitative methods as the foci. This course discusses major methodological issues, stages and process of research, the use of appropriate methods, strategies and tools with the objective of enabling students to adopt a multimethod and critical approach to conduct research of public policies and data science. Course contents also include the interpretation and communication of findings to different stakeholders, research ethics and limitations, and using research to generate impact.\r", "outcome": "By the end of this course, students should be able to:\r a. Have a clear picture about the theory, concept, measurement, and hypothesis in research methods in policy studies; b. Know about the main stages and approaches for conducting qualitative and quantitative research in policy studies; c. Develop the basic skills to evaluate public policy and social programmes", "syllabus": "1) Introduction to major methods used in policy studies research (both quantitative and qualitative methods)\r 2) Theories and concepts of research principles and design\r 3) Knowledge of major statistical methods widely used in policy studies\r 4) Skills and methods in qualitative and quantitative analysis\r 5) Multimethod and critical approach to conduct research of public policies and data science\r 6) Ethics and social responsibilities of policy research", "required_readings": "- Neuman, W. L. (2013). Social research methods: Qualitative and quantitative approaches. Pearson education.\r - Majchrzak, A., & Markus, M. L. (2014). Methods for Policy Research. CA: Sage.", "recommended_readings": "- Bryman, A. (2016). Social research methods. NY: Oxford university press.\r - Denzin, N. K., & Lincoln, Y. S. (1994). Handbook of qualitative research. CA: Sage.\r - Singleton Jr, R., Straits, B. C., Straits, M. M., & McAllister, R. J. (1988). Approaches to social research. NY: Oxford University Press.\r - Spencer, L., & Ritchie, J. (2002). Qualitative data analysis for applied policy research. In Analyzing qualitative data (pp. 187-208). NY: Routledge.", "terms": {"2020-21 Term 2": {"--LEC (4733)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. YANG Litianqing"]}}}, "assessments": {"Essay test or exam": "50", "Homework or assignment": "20", "Others": "10", "Project": "20"}}, {"code": "2102", "title": "Statistical Analysis for Policy Decision", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS1003", "description": "This course introduces the tools and techniques of statistical analysis for policy decision. In designing policies, statistical analysis provides the key to making evidence-based and data-driven decisions. This course teaches students how to collect and analyze both observational and experimental data, and make better decisions based on empirical findings. The course also equips students with a good foundation of statistical knowledge and quantitative skills to prepare them for mastering the data analytics and coding in data science.", "outcome": "By the end of this course, students should be able to: a. Develop the statistical skills for conducting quantitative research; b. Develop the effective skills to perform statistical analysis and evaluation on public policy; c. Establish a solid foundation for data analytics and coding in data science", "syllabus": "1) Introduction in quantitative analysis for policy research (tools and statistical techniques) 2) Statistical knowledge in quantitative analysis and decision-making in policies 3) Basic skills in designing quantitative research (data collection, hypothesis setting and testing, modeling, etc.) 4) Analyzing different kinds of data (e.g., observational data, experimental data) 5) Report of findings and data visualization 6) Major tools and statistical packages in quantitative analysis and data science", "required_readings": "- Agresti, A., Franklin, C. A., Klingenberg, B. (2016). Statistics: The art and science of learning from data. 4th ed. NY: Pearson. - Gorard, S. (2003). Quantitative methods in social science research. NY: Continuum. - Miller, J. D. (2017). Statistics for Data Science. UK: Packt.", "recommended_readings": "- Neuman, W. L. (2013). Social research methods: Qualitative and quantitative approaches. NY: Pearson education. - Punch, K. F. (2013). Introduction to social research: Quantitative and qualitative approaches. CA: Sage. - Thompson, B. (2002). What future quantitative social science research could look like: Confidence intervals for effect sizes. Educational Researcher, 31(3), 25-32. - Black, T. R. (1999). Doing quantitative research in the social sciences: An integrated approach to research design, measurement and statistics. CA: Sage.", "terms": {"2020-21 Term 1": {"--LEC (8077)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. HO Chi Pui"]}}}, "assessments": {"Others": "10", "Project": "30", "Short answer test or exam": "60"}}, {"code": "2201", "title": "Data Analytics for Public Policy I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "Pre-requisite(s): DSPS2102", "description": "This course teaches students the major computing applications and coding languages, such as R and/or Python, of data analytics and how to apply them in public policy. The emphasis of the course is to apply data analytics to make theory-guided and data-driven policy decisions. With the technical competence provided by the course, students are expected to be both a skillful user of data analytics and an intelligent policymaker informed by data science.", "outcome": "Students are expected to acquire the basic knowledge of computing applications and coding languages, such as R and/or Python, of data analytics and apply it to solve problems in public policy.", "syllabus": "1) Introduction to data analytics for public policy \r 2) Quantitative research design and basic methods for analysis\r 3) Understanding the application of major computing applications and coding languages, such as R and/or Python\r 4) Basic knowledge in data collecting, data coding and analysis \r 5) Interpreting research results in different models", "required_readings": "- Dunleavy, P., & Margetts, H. (2015). Design principles for essentially digital governance.\r - Milan, S., & ten Oever, N. (2017). Coding and encoding rights in internet infrastructure. Internet Policy Review, 6(1).\r - Raschka, S., & Mirjalili, V. (2017). Python machine learning. Packt Publishing Ltd.\r - VanderPlas, J. (2016). Python Data Science Handbook. CA: O’Reilly.", "recommended_readings": "- Lane, J. (2016). Big data for public policy: The quadruple helix. Journal of Policy Analysis and Management, 35(3), 708-715.\r - Gil-Garcia, J. R., Pardo, T. A., & Luna-Reyes, L. F. (2018). Policy Analytics: Definitions, Components, Methods, and Illustrative Examples. In Policy Analytics, Modelling, and Informatics (pp. 1-16). Springer, Cham.\r - Sun, Y., Song, H., Jara, A. J., & Bie, R. (2016). Internet of things and big data analytics for smart and connected communities. IEEE access, 4, 766-773.", "terms": {"2020-21 Term 2": {"--LEC (4985)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. HO Chi Pui"]}}}, "assessments": {"Essay test or exam": "40", "Homework or assignment": "25", "Others": "10", "Project": "25"}}, {"code": "2301", "title": "Policy Analysis and Design Thinking", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course integrates public policy analysis and design thinking to give students an integrated and comprehensive approach of resolving public problems. Design thinking, with its key features of being solution-based, user involvement, co-creation of knowledge, co-evolution of solution and problem, complements the economics-based and analytical model of public policy analysis well. Together they strengthen students’ ability in serving the dual role of a capable policy designer and an effective analyst who solve the policy problem and satisfy the diverse concerns of stakeholders.", "outcome": "By the end of this course, students should be able to:\r a. Understand the process of policy making and steps and theoretical perspectives of design thinking; b. Apply the framework of design thinking in policymaking; c. Analyze policy from different stakeholders’ perspectives in policy design;  d. Have a solid foundation of policy design and analysis.", "syllabus": "1) Basic knowledge in public policy analysis (key concepts, major theories, main methods)\r 2) Integrated and comprehensive approach in resolving public problem from a design thinking perspective\r 3) Process of policy making, understanding key factors (e.g., common interest, stakeholders, interest groups, etc.）\r 4) Understanding actors in policy design, their roles, and interaction dynamics \r 5) Acquiring knowledge about analytical model of public policy analysis", "required_readings": "- Brown, T. (2009). Change by Design: How Design Thinking Transforms Organizations and Inspires Innovation. NY: Harper Collins.\r - Dunn, W. N. (2015). Public policy analysis. NY: Routledge.\r - Weimer, D. L., & Vining, A. R. (2017). Policy analysis: Concepts and practice. NY: Routledge.", "recommended_readings": "- Liedtka, J., King, A., & Bennett, K. (2013). Solving Problems with Design Thinking: Ten Stories of What Works. NY: Columbia Business School\r - Howlett, M., Ramesh, M., & Perl, A. (2009). Studying public policy: Policy cycles and policy subsystems (Vol. 3). Oxford: Oxford University Press.\r - Sabatier, P. A., & Weible, C. M. (Eds.). (2014). Theories of the policy process. CA: Westview Press.", "terms": {"2020-21 Term 1": {"--LEC (4854)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Esther Lee Bldg 405"], "instructors": ["Dr. CHAN Wai Yin"]}}}, "assessments": {"Essay test or exam": "70", "Others": "10", "Project": "20"}}, {"code": "2501", "title": "Managing Technology and Policy Innovation", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Data Science & Policy Stud PC", "requirements": "", "description": "This course introduces the theories and strategies of managing technology and policy innovation by analyzing the process and key factors. It shows how organizational, institutional and social contexts are interconnected in fostering policy creativity and promoting the diffusion and adoption of innovation. It lets students understand that policy innovation via technologies is a social and organizational process and sustainable policy innovation is only possible with recognition of the technological, institutional, and human dimensions of technological innovation.", "outcome": "By the end of this course, students should be able to:\r a. Identify and understand key literature and theories on innovation in the public sector\r b. Understand how technology can encourage or hinder government innovation\r c. Identify the major factors driving the result and performance of policy innovation\r d. Draw experience from both local and global perspectives in analyzing cases of technology and innovation", "syllabus": "1) Theories and strategies of managing technology and policy innovation\r 2) Public policy analysis and application and development of technology\r 3) Policy creativity and innovation in organizational, institutional and social contexts\r 4) Mechanism and process of policy innovation, learning, and diffusion\r 5) Case studies in governmental innovation and policy innovation", "required_readings": "- Leyden, D. P., & Link, A. N. (2015). Public sector entrepreneurship: US technology and innovation policy. Oxford: OUP.\r - Mazzucato, M. (2016). From market fixing to market-creating: a new framework for innovation policy. Industry and Innovation, 23(2), 140-156.\r - Vonorta, N. S., Rouge, P. C., Aridi, A. (2015). Innovation Policy. NY: Springer.\r - Wallace, D. (2017). Environmental policy and industrial innovation: Strategies in Europe, the USA and Japan. NY: Routledge. (Chap 1 & 2).", "recommended_readings": "- Block, F. L., & Keller, M. R. (2015). State of innovation: the US government's role in technology development. NY: Routledge. (Chap 10 & 11).\r - Costantini, V., Crespi, F., Martini, C., & Pennacchio, L. (2015). Demand-pull and technology-push public support for eco-innovation: The case of the biofuels sector. Research Policy, 44(3), 577-595.\r - Guo, P., Wang, T., Li, D., & Zhou, X. (2016). How energy technology innovation affects transition of coal resource-based economy in China. Energy Policy, 92, 1-6.\r - Wallace, D. (2017). Environmental policy and industrial innovation: Strategies in Europe, the USA and Japan. NY: Routledge. (Chap 5 & 7).", "terms": {"2020-21 Term 2": {"--LEC (4734)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr. CHAN Wai Yin"]}}}, "assessments": {"Essay test or exam": "50", "Others": "10", "Presentation": "20", "Project": "20"}}]