[{"code": "2110", "title": "Principles of Curriculum and Instructional Design", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "The course aims at introducing the theories and skills of curriculum and instructional design. The theories include: (1) models of curriculum and instructional design; (2) factors that should be considered in curriculum and instructional design; (3) establishing curriculum aims and instructional objectives; (4) selection of learning opportunities; (5) curriculum and instructional organization; (6) catering for individual differences; and (7) evaluation of student learning. These theories and skills provide learners with a foundation for designing school curricula and classroom instruction.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2120", "title": "Principles and Implementation of Curriculum and Instructional Design", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkDiscussionLectureProject", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "The course aims at introducing the theories and skills of curriculum and instructional design. The theories include: 1) models of curriculum and instructional design; 2) factors that should be considered in curriculum and instructional design; 3) curriculum aims and instructional objectives; 4) curriculum organization; 5) curriculum implementation; 6) teaching strategies; 7) learning activities; 8) catering for individual differences;9) assessing the learning of students; and 10) school-based curriculum design and implementation. It is hoped that learners will be able to apply what they have acquired throughout the course to handle curriculum matters and teaching tasks properly in schools.\r", "outcome": "By the end of this course, students will be able to: \r 1. obtain a grasp of curriculum design models \r 2. understand the principles and key concepts underpinning a curriculum design \r 3. articulate factors influencing curriculum and instructional design\r 4. comprehend the individual differences of students \r 5. recognize features characterizing school-based curriculum development and implementation\r  學生修畢本科後，能夠:\r 1. 掌握不同的課程設計模式 \r 2. 明白課程設計的原則及概念 \r 3. 理解影响課程與教學設計的因素 \r 4. 了解學生的個別差異 \r 5. 認識校本課程設計與實施的特徵", "syllabus": "For reference only, please refer to the course outline of respective instructor for details\r 1. models of curriculum and instructional design\r 2. factors that should be considered in curriculum and instructional design \r 3. curriculum aims and instructional objectives\r 4. curriculum organization \r 5. curriculum implementation \r 6. teaching strategies\r 7. learning activities\r 8. catering for individual differences \r 9. assessing the learning of students \r 10. school-based curriculum design and implementation\r  課題可因應個別導師的科目設計而調校 1. 課程與教學設計模式 \r 2. 設計課程與教學應考慮的要素 \r 3. 課程目的與教學目標 \r 4. 課程組織 \r 5. 課程實施 \r 6. 教學策略 \r 7. 學習活動 \r 8. 照顧個別差異 \r 9. 學生學習評估 \r 10. 校本課程設計與實施", "required_readings": "Required readings (if any) would depend on individual instructors\r 1. Morris, P. & Adamson, B. (2010), Studying the curriculum. In Curriculum, schooling and society in Hong Kong (pp. 1-15). Hong Kong: Hong Kong University Press. \r 2. 楊思賢(2013)。〈課程設計的轉變〉。輯於楊思賢、林德成、梁偉倫、羅耀珍《課程改革與創新》(頁 93-126)。香港:香港大學出版社。(英文版:Yeung, S.S.Y. (2012), Change in curriculum design. In S.S.Y. Yeung, J.T.S. Lam, A.W.L. Leung, & Y.C. Lo (Eds.), Curriculum change and innovation (pp. 93-124). Hong Kong: Hong Kong University Press.", "recommended_readings": "Recommended readings would depend on individual instructors\r 1. Amstrong, D. G. (2003). Curriculum today. Upper Saddle River, MJ: Merrill Prentice Hall.\r 2. Brady, L. & Kennedy, K. (2003). Curriculum construction. Sydney: Prentice Hall. \r 3. Borich, G. D. (2004). Effective teaching methods. Upper Saddle River, N.J.: Merrill. \r 4. Cook, R. E., Klein, M. D., & Chen, D. (2012). Adapting early childhood curricula for children with special needs (8th ed.). Boston: Pearson. \r 5. Fisher, D., & Frey, N. (2001). Responsive curriculum design in secondary schools: Meeting the diverse needs of students. Lanhma, Md.: Scarecrow Education. \r 6. Gargiulo, R. M., & Metcalf, D. J. (2013). Teaching in today’s inclusive classrooms: A universal design for learning approach (2nd ed.). Belmont, CA: Wadsworth Cengage Learning. \r 7. Hlebowitsh, P. S. (2005). Designing the school curriculum. Boston: Pearson/Allyn and Bacon. \r 8. Kelly, A. V. (2009). The curriculum: Theory and practice (6th ed.). Thousand Oaks, CA: SAGE Publications. \r 9. Morrison, G. R., Ross, S. M., & Kemp, J. E. (2004). Designing effective instruction (4th ed.). Hoboken, NJ: J. Wiley & Sons. \r 10. Morse, T. E. (2008). Designing appropriate curriculum for special education students in urban schools. In B. S. Stern & M. L. Kysilka (Eds.), Contemporary readings in curriculum (pp. 255-262). Thousand Oaks, CA: Sage Publications. \r 11. Peterson, J. M., & Hittie, M. M. (2003). Inclusive teaching: Creating effective schools for all learners. Boston: Allyn and Bacon. \r 12. Singh, A. (2007). Curriculum and instruction. Delhi, India: Academic Excellence. \r 13. Tyler, R. W. (1949). Basic principles of curriculum and instruction. Chicago: University of Chicago Press.\r 14. Wiles, J. & Bondi, J. (2011) Curriculum development: A guide to practice (8th ed.). Boston: Pearson. \r 15. 李子建主编 (2010)。 校本課程發展, 教師發展與伙伴協作。北京：教育科學出版社。 \r 16. 林智中、陳建生、張爽 (2006)。課程組織。北京：教育科學出版社 \r 17. 楊龍立 (2005)。課程組織 : 理論與實務。台北市 : 高等教育文化事業有限公司。", "terms": {"2020-21 Term 2": {"A-LEC (7785)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor DAI Yun"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}, "B-LEC (8689)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. WAN Wai Yan"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 2": {"A-LEC (8000)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Yasumoto Int'l Acad Park 505"], "instructors": ["Professor DAI Yun"], "meetingDates": ["11/1", "18/1", "25/1"]}, "B-LEC (5460)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Yasumoto Int'l Acad Park 405"], "instructors": ["Dr. WAN Wai Yan"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Essays": "50", "Others": "20", "Project": "30"}}, {"code": "2130", "title": "Environmentalism and Environmental Education", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Curriculum & Instruct", "requirements": "", "description": "(UGEC2710 is double-coded with EDUC2130.) The course is aimed at preparing students as global and future citizens who not only have critical understandings of the environmental issues, but also the capabilities and attitudes to take an active role in tackling the issues and educating for the environment. This course is structured around key issues pertaining to environmentalism and environmental education, including climate changes, sustainability, green groups and environmental curriculum and teaching at schools. Using an issue-inquiry approach, course participants will be led to critically reflect on the issues from various perspectives: philosophical, scientific, social and educational. The different approaches to environmental education in the Western and Chinese communities will be explored in the contexts of eastern and western cultures. A field trip is included to provide experiential education in the environment.\r", "outcome": "  At the end of this course, students will be able to:     understand the complexity of environmental issues as an interplay between science, politics, values, economy, education and social development;    critically understand key environmental issues at both local and global levels;    actively participate in the discourse and actions concerning environmental issues;    recognize different approaches to environmental education and critically analyze their strengths and constraints;    understand the relations between environmental education and cultural differences;    actively participate in environmental education both inside and outside the school systems;    appreciate and to live an environmentally-friendly lifestyle ", "syllabus": "    How do people start to care about the environment - a historical understanding of environmentalism and its definition    A framework for understanding environmental issues    Is climate change a myth or hoax - understanding the science behind and its limitations    Why don’t people take climate change seriously - consequences and solutions of climate change    What’s wrong with the countries – politics and the environment    What’s wrong with our society – modern capitalism and the environment    Is sustainable development a myth?    What’s wrong with human beings – environmental ethics?    What’s wrong with the environmental advocacy groups - myths of some environmental activities?    What's wrong with our education - aims and approaches of environmental education?    How do different countries approach environmental education –Hong Kong, China, Taiwan and others    Overview of issues related to environmental problems and environmental education    Field trip to a site related to current environmental issues in Hong Kong, such as North East development farmland, EcoPark, Fung Yuen butterfly convervation centre. ", "required_readings": "  Speth, J. G. (2008). The bridge at the edge of the world: capitalism, the environment, and crossing from crisis to sustainability. New Haven: Yale University Press. (E book in CU library)   李逆熵 (2011). 喚醒69億隻青蛙. 經濟日報出版社: 香港   樊綱(主編) (2010).世界低碳發展的中國主張. 商務印書館: 香港   李子建, 黄宇, 馬慶堂 (2009) 校本環境教育的設計與实施. 人民教育出版社: 北京   Henson, R. (2006). The rough guide to climate change (1. ed.). New York: Rough Guides.   Lee, J.C.K. & Williams, M. (Eds.) (2006). Environmental and geographical education for sustainability: Cultural contexts. New York: Nova Science Publishers, Inc. (Chapter 3, 5, 6, 11, 13, 16, 20)           Class                                                 Topics                           Readings            1             History of environmentalism in Europe             Timeline of European Environmental History    http://www.eh-resources.org/timeline/timeline.html            2             Understanding the science behind climate change and clarifying some myths        Explaining climate change science & rebutting global warming misinformation    http://www.skepticalscience.com/            3        Consequences and solutions of climate change        喚醒69億隻青蛙,李逆熵 (ch 17-28)                 4        The role of politics in climate change deals between nations        樊綱(主編) (2010).世界低碳發展的中國主張. 商務印書館: 香港 第1-3章            5        Capitalism as the prevalent social values and the environmental issues        The bridge at the edge of the world capitalism (ch 7, 8, 9)                 6        Basic concepts about sustainable development        Basic Principles of Sustainable Development     by Jonathan M. Harris, June 2000                 7        Environmental ethics        Unearthed: the economic roots of environmental crisis, ch14    http://www3.nd.edu/~philinst/energy.html            9        Approaches of environmental education        Lee, J.C.K. & Williams, M. (Eds.) (2006). Environmental and geographical education for sustainability: Cultural contexts.Ch2, 4            10        How do different countries do environmental education –Hong Kong, China, Taiwan and others        Lee, J.C.K. & Williams, M. (Eds.) (2006). Environmental and geographical education for sustainability: Cultural contexts.Ch7,10,11           ", "recommended_readings": "Alma, P. (1993). Environmental concerns. Cambridge: Cambridge University Press. (Chapter 1–Environmental concerns having global impacts; Chapter 2–Environmental concerns having local impacts)Blewitt, J. and Cullingford, C. (Eds.) (2004). The sustainability curriculum: the challenge for higher education. London: Earthscan.Cooper, D. E., and Palmer, A.J. (1992). The environment in question: Ethics and global issues. London: Routledge.Corcocan, P.B. and Wals, A. E.J. (Eds.) (2004). Higher education and the challenge of sustainability: problematics, promise, and practice. Boston: Kluwer Academic Publishers.Chambers, B. (1996). Awareness into action. Sheffield: Geographical Association.Elliott, J. A. (2006). An introduction to sustainable development (3rd ed.). London: Routledge.Environmental Protection Department (2005). Environment Hong Kong. Hong Kong: Environmental Protection Department.Gore, A. (2006). An inconvenient truth: The planetary emergency of global warming and what we can do about it. New York: Rodale Press.Harris, G., and Blackwell, C. (1996). Environmental issues in education. Hants: Arena. (Chapter 1–The nature and purposes of environmental education; Chapter 3–Young people’s ideas about global environmental issues)Hills, P., and Man, C. S. (Eds.) (2003). New directions in environmental education for Hong Kong. Hong Kong: Centre of Urban Planning and Environmental Management, University of Hong Kong.Huckle, J. 及 Sterling, S.主編，王民等譯（2002）。《可持續發展教育》。北京：中國輕工業出版社。Lee, J.C.K. and Williams, M. (Eds.) (2009). Schooling for sustainable development in Chinese Communities: Experience with younger children. The Netherlands: Springer.Kidder, A. (2001). How big is your backyard? Camden, Maine: Institute for Global Ethics.Man, S. W. (1995). The environment. In Cheng, J.Y.S. and S.S.H. Lo (Eds.), From colony to SAR: Hong Kong’s challenge ahead. Hong Kong: Chinese University Press.Munro, D. A. (1991). Caring for the earth: A strategy for sustainable living. Gland, Switzerland: International Union for Conservation of Nature and Natural Resources (IUCN), United Nations Environment Program (UNEP) and World Wide Fund for Nature (WWF).Palmer, J. A. (1998). Environmental education in the 21st century: Theory, practice, progress and promise. London: Routledge. (Part II–The global agenda)Palmer, J., and Neal, P. (1994). The handbook of environmental education. London: Routledge.Postma, D. W. (2006). Why care for nature? In search of an ethical framework for environmental responsibility and education. Dordrecht, The Netherlands: Springer.Reid, A., and Scott, W. (Eds.) (2008). Researching education and the environment: Retrospect and prospect. London: Routledge. (Theme 1–Environmental education and education for sustainable development; Theme 4–environmental learning as process and outcome; Theme 5–Environmental education for …)The World Commission on Environment and Development (WCED) (1987). Our common future. Oxford: Oxford University press.文思慧 (1998)。 《香港綠色難產》。香港 : 香港人文科學出版社。李子建 (1998)。《中小學環境教育理論與實踐 – 邁向可持續發展》。北京：北京師範大學出版社。周兆祥 (1989)。《綠色思想》。 香港 : 明窗出版社。螢火蟲學苑之友 (2005)。《螢火蟲學苑：綠色教育札記》。 香港：藍藍的天。 Useful journalsApplied Environmental Education and CommunicationThe Ecologist [UL: QH540 .E297]Environment [UL: GF75 .E58]Environmental Education Research [CC: GE70 .E5815]Green Teacher [electronic resource]International Journal of Environmental Education & Information [CC: GE70 .E5813]Journal of Environmental Education [UL: S946.E54]Nature and Resources [UL: GB651.N3]《環境》[UL: TD169.H83]《環境教育》[CC: GE70.H783]《環境教育研究》Internet resourceshttp://www.ied.edu.hk/esdweb/http://www.hkbws.org.hk/lvalley/indexc.htmlhttp://www.ecc.org.hk/http://www.foe.org.hk/welcome/gettc.asphttp://www.greenpower.org.hk/http://www.wwf.org.hk/http://www.epd-asg.gov.hk/cindex.phphttp://www.kepu.net.cn/gb/index.htmlhttp://en.wikipedia.org/Video resources綠色未來 [錄像資料] / 編導陳偉棠 ; 監製鄭惠芳 ; 香港電台電視部製作.TD171.5.H6 Z25 2007-0331 VOD綠色新一代 [錄像資料] / 編導葉婉虹 ; 監製伍婉嫻 ; 香港電台電視部製作.DS796.H7 K45 2004-0725 VOD", "terms": {"2020-21 Term 2": {"--LEC (7476)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Fung King Hey Bldg Swire Hall2"], "instructors": ["Dr. MA Kwan Ki, \n\rProfessor LAU Kwok Chi"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}}, "2021-22 Term 2": {"--LEC (5382)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Esther Lee Bldg 405"], "instructors": ["Dr. MA Kwan Ki, \n\rProfessor LAU Kwok Chi"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Essays": "0", "Others": "0", "Presentation": "0"}}, {"code": "2210", "title": "Education and Society in Hong Kong", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "Not for students who have taken UGEC2895", "description": "The course is designed to help students to reflect on the social and education system for about 150 years. By applying historical perspective and sociological concepts, the course will analyze the development experience of Hong Kong over the years under the influences of Britain and Modern China. The course will also introduce research findings on Hong Kong society and education which have been accumulated for the last four decades. It is intended to help students to have a broader and more penetrating understanding of Hong Kong society and its educational system.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2220", "title": "Educational Thought", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "Not for students who have taken UGED2682", "description": "This course aims to discuss the prominent thoughts directing educational practice and their philosophical origins or foundations. Topics including the meaning and aims of education, content and practice of teaching and learning will be introduced and examined in relation to various fields of philosophical investigation concerning knowledge and value, humanity and society, etc. Traditional and modern, Chinese and Western perspectives on education will be scrutinized.\r", "outcome": "By the end of this course, students will be able to:\r 1. gain some basic knowledge of Chinese and English thoughts about education.\r 2. critically reflect on these educational thoughts in relation to some general problems of education, including nature, aims, values and implied practices of education.\r 3. reflectively think about one’s own educational life against these educational thoughts.\r  學生修畢本科後，能夠:\r 1. 獲得中西教育思想的基本知識。\r 2. 對應教育的一般問題（包括教育的性質、目的、價值及其引申之實踐）之答問，對這些中西教育思想作出批判反思。\r 3. 對應這些中西教育思想，對自己個人的教育人生作出反省思考。", "syllabus": "For reference only, please refer to the course outline of respective instructor for details \r M1. Enrichment of thought and enhancement (empowerment) of thinking\r M2. Concept of Education and Ideals of Education\r M3. Intellectualist perspective on education\r M4. Moralist perspective on education\r M5. Autonomist perspective on education\r M6. Axiology (values) of education\r M7. Qualitarian perspective on education\r M8. SQUID Narrative Method for Self-Understanding for the Good Life\r M9. Intellectual Education\r M10. Moral Education\r M11. Spiritual Education\r M12. Social Education\r M13. Aesthetic Education\r  課題可因應個別導師的科目設計而調校 M1. 思想的厚化與思考的強化：教育思想的意義\r M2. 教育的概念與教育的理想：何謂教育？\r M3. 尚智教育觀\r M4. 尚德教育觀\r M5. 自主教育觀\r M6. 教育價值論\r M7. 品育觀\r M8.「生命三維敘事法」如何促進自我理解以活出美好人生？\r M9. 智育\r M10.德育\r M11.靈育\r M12.群育\r M13.美育", "required_readings": "Required readings (if any) would depend on individual instructors\r   Basic Readings for M1:\r 1B1: 鄭漢文（2003）〈中大人身分的聚散：香港中文大學的意義〉，載於：《中大四十》下冊頁264至267（香港，中大學生出版委員會出版）；選段載於：《通識的路如何走：通識教育手記一集》頁103-107，題為〈通識教育是教外別傳──《中大人身分的聚散》選段〉，（香港，從心會社，2008）。\r 1B2: 鄭漢文（1995）〈運用「聽讀寫進思法」（CAROL Method）“集思成文”：聽講讀寫思，學而時習之〉筆記。\r  Basic Readings for M2:\r 2B1: 何秀煌（1998）。〈教育畢竟仍是一種良心事業〉，載於：《從通識教育的觀點看──文明教育和人性教育的反思》（台北：東大圖書公司），頁1-5。\r 2B2: 明報（2004）〈人生何價？──訪問鄭漢文談價值教育的推行〉。《教得樂》（2004年3月9日）頁8至9。\r  Basic Readings for M3:\r 3B1: White, J.P. (1995) Problems of the Philosophy of Education, in: T.Honderich (ed) (1995) The Oxford Companion to Philosophy (Oxford, OUP) pp.216-219.\r 3B2:Cheng, H.-M.R.（1999）Education Requiring Contextualized Epistemology: Restructuring Knowledge-based Education into Quality-based Education in Contexts, Education Journal., Vol.26（2）& Vol.27（1）pp.135-158.\r  Basic Readings for M4:\r 4B1: 王國維（1906）〈論教育之宗旨〉，載於：商友敬（編）（1995）《教育古文選》（上海，上海社會科學院出版社）頁211至214。\r 4B2:石元康（1998）。〈兩種道德觀──試論儒家倫理的形態〉，載於：《從中國文化到現代性：典範轉移》（台北，東大圖書公司），頁105至123。\r  Basic Readings for M5:\r 5B1: White, J.P. (1995) Problems of the Philosophy of Education, in: T.Honderich (ed) (1995) The Oxford Companion to Philosophy (Oxford, OUP) pp.216-219.\r 5B2: White, J.P. (1990) Education for Personal Autonomy, in: Ed. and the Good Life (London, Kogan Page) Ch.5, pp.74-94.\r  Basic Readings for M6:\r 6B1: 鄭漢文（2001）〈用才教育與謀財價值的惡性循環〉，載於：《信報》（2001/6/12）。\r 6B2: Haydon, G. (1996) Aims of Education, in: J.J.Chambliss (ed) Philosophy of Education: An Encyclopedia (New York, Garland Publishing, Inc.,), pp.11-13.\r  Basic Readings for M7:\r 7B1: 鄭漢文（1998）〈品育觀下的香港教育：心力並養與群己兼顧的育成人才〉，載於：陳慎慶（編）《香港的遠象》（香港：基督教文藝出版社，1998年），頁203至230。\r 7B2: Peters, R.S.(1977) The Meaning of Quality in Education, in: Education and the Education of Teachers (London, Boston: Routledge & K. Paul, 1977), Ch.2, pp.22-45.\r  Basic Readings for M8:\r 8B1: 鄭漢文（2007）總序及鄭序，載於：鄭漢文、鄧雪貞、吳玉樹合著(2008) 。《尋求美好人生的自我理解》，頁8至15及16至23。香港：香港基督徒學生福音團契。 \r 8B2: 鄭漢文（2011）〈價值散亂而流動的自我得以敘事整合的生命教育〉，宣讀於：《2011兩岸四地生命教育論壇》（2011.12.19）。\r  Basic Readings for M9:\r 9B1: 鄭漢文（2001）〈養智的教育需由傳知變為啟思〉，載於：《信報》（2001/3/17）。\r 9B2: Cheng, H.-M.R. (1999) Education Requiring Contextualized Epistemology: Restructuring Knowledge-based Education into Quality-based Education in Contexts, Education Journal, Vol.26(2) & Vol.27(1) pp.135-158.\r  Basic Readings for M10:\r 10B1: Cheng, H.M.R. (2004) Moral Education in Hong Kong: Confucian-parental, Christian-religious and liberal-civic influences, Journal of Moral Education, Vol. 33, No.4, pp. 533-552, December 2004. \r 10B2: Larrabee, Mary J. (ed.) (1993) Gender and Moral Development, in: An Ethic of Care: Feminist and Interdisciplinary Perspectives (London, Routledge) Ch.1, pp.3-16. \r  Basic Readings for M11:\r 11B1: Taylor, C. (1991) Sources of Authenticity, in: The Ethics of Authenticity (Cambridge, Mass., Harvard UP) Ch.3, pp.25-29. \r 11B2:鄭漢文（2000）〈三態合一的靈性教育〉《思想教育》講稿。\r  Basic Readings for M12:\r 12B1: 曾榮光（1995）〈民族教育與公民權責教育之間：過渡期香港公民教育的議論〉，載於：《教育學報》（香港，香港中文大學香港教育研究所）第20卷第2期頁161-172。\r 12B2: Roger, H.M. Cheng, John, C.K. Lee and Leslie, N.K. Lo (2006). Values Education for Citizens in the New Century: Meaning, Desirability and Practice. In: R.H.M. Cheng, J.C.K. Lee and L.N.K.Lo (eds.) (2006): Values Education for Citizens in the New Century, pp. 1-32. HK Institute of Educational Research, Chinese University of HK: Chinese University Press. \r  Basic Readings for M13:\r 13B1: 鄭漢文（1998）〈開心得意的教育：從字到文的美育經驗想起〉，載於：《香港美術教育協會通訊》（香港，香港美術教育協會）第二期，頁4至5。\r 13B2: Hirst, P.H. (1992) Aesthetic Education, in: D.E.Cooper (ed) (1992) A Companion to Aesthetics (Oxford, Blackwell) pp.127-130.", "recommended_readings": "Recommended readings would depend on individual instructors \r  Recommended References for M1:\r 1R1: 杜祖貽（1988）〈教育哲學的觀念、方法與功能〉，載於：杜祖貽、劉述先（編）（1988）《哲學、文化與教育》（香港，香港中文大學出版社）第二章，頁9至35。\r 1R2: 鄭漢文（1999）〈教育理想與理想教育〉，載於：《九九中大開放日特刊》（香港中文大學開放日籌委會出版部，1999年11月20-21日）第34至35頁（2000年4月4日修訂）。.\r  Recommended References for M2:\r 2R1: 嚴元章（1993）〈宗旨論〉，載於：《中國教育思想源流》第二章，頁32至59。\r 2R2: Peters, R.S. (1965) The Concept of Education, in: Ethics and Education (London, George Allen & Unwin) pp.23-45.\r  Recommended References for M3:\r 3R1: 鄭漢文（1998）〈好問〉，載於：《川流》第五期（1998/11），頁20至21。\r 3R2: Hirst, P.H.(1965) Liberal Education and the Nature of Knowledge, in:（1975）Knowledge and the Curriculum（London, RKP）Ch.3, pp.30-53; also in: R.S.Peters (ed)(1973) The Philosophy of Education (Oxford, OUP) Ch.IV, pp.87-111.\r  Recommended References for M4:\r 4R1: 劉國強（1994）〈唐君毅論教育目的與教者意識──傳統的繼承與發展〉，載於：李明輝（編）（1994）《當代新儒家人物論》（台北，文津出版社）頁187至198。\r 4R2: 葛楚英（1993）〈德與才之間的關係〉，載於：《《三國演義》與人才學》（台北，遠流）頁339至342。\r  Recommended References for M5:\r 5R1: 吳梓明等（1997）〈「邁向自主」：一個受過道德教育與宗教教育的人的素質〉，載於：吳梓明（1997）《學校宗教教育的新路向》（香港，基督教文藝出版社）頁86至98。\r 5R2: Wringe, C. (1997) In Defence of Rational Autonomy as an Educational Goal, in: D.Bridges (ed) (1997) Education, Autonomy and Democratic Citizenship: Philosophy in a Changing World (London, Routledge) Ch.10, pp.115-126. \r  Recommended References for M6:\r 6R1: 嚴元章（1993）〈宗旨論〉，載於：《中國教育思想源流》第二章，頁32至59。\r 6R2: 課程發展議會（2000）〈學生應該學些甚麼〉，載於：《學會學習》第三章，頁23至34。 \r  Recommended References for M7:\r 7R1: White, J.P. (1982) The Educated Man, in: The Aims of Education Restated (London, RKP) Ch.6, pp.121-139.\r 7R2: Frankena, W.K. (1964), Aristotle’s Philosophy of Education, in: Three Historical Philosophies of Education: Aristotle, Kant and Dewey (Chicago: Scott, Foresman, 1965), Ch.2, pp.15-54. \r  Recommended References for M8:\r 8R1: 鄭漢文、鄧雪貞、吳玉樹合著(2008) 。《尋求美好人生的自我理解》。香港：香港基督徒學生福音團契。 \r 8R2: 鄭漢文（2001）〈善借機緣養心力的老師〉，載於：吳玉樹（編）（2001）《誰改變了我》。（香港，學生福音團契出版社），頁28至35。 \r  Recommended References for M9: \r 9R1: Pring, R.A. (1995) Liberal and Vocational Education, in: Closing the Gap: Liberal Education and Vocational Preparation (London, Hodder & Stoughton) Ch.8, pp.183-195. \r 9R2: Hirst, P.H.(1965) Liberal Education and the Nature of Knowledge, in:（1975）Knowledge and the Curriculum（London, RKP）Ch.3, pp.30-53; also in: R.S.Peters (ed)(1973) The Philosophy of Education (Oxford, OUP) Ch.IV, pp.87-111\r  Recommended References for M10:\r 10R1:陳特（1988）〈道德哲學與道德教育〉，載於：杜祖貽、劉述先編）（1988）《哲學、文化與教育》（香港，香港中文大學出版 社）第五章，頁91至117。\r 10R2:Peters, R.S. (1981) Reason and Habit: the Paradox of Moral Education, in: Moral Development and Moral Education (London, Allen & Unwin) Ch.3, pp.45-60.\r  Recommended References for M11:\r 11R1:吳梓明等（1997）〈「邁向自主」：一個受過道德教育與宗教教\r 的人的素質〉，載於：吳梓明（1997）《學校宗教教育的新路向》\r （香港，基督教文藝出版社）頁86至98。\r 11R2: Carr, D. (1996) Rival Conceptions of Spiritual Education, Journal of Philosophy of Education 30(2) 1996, pp.159-178.\r  Recommended References for M12:\r 12R1: Heater, D. (1990) Multiple Citizenship, in: Citizenship: The Civic Ideal in World History, Politics and Education (London, Longman) Pt.3: Synthesis, Ch.9, pp.314-45.\r 12R2: Crittenden, J. (1992) The Disposition of the Self, in: Beyond Individualism: Reconstituting the Liberal Self (Oxford, OUP) Ch.1, pp.13-37.\r  Recommended References for M13:\r 13R1: 黃宇鵬（2004）〈從價值論看香港藝術的敘述〉，載於：《如何「看」香港藝術》（How To See”Hong Kong Art）（香港：1aSpace，香港藝術發展局）頁70-75。\r 13R2: Redfern, H.B. (1986) How is the Aesthetics related to Art? in: Questions in Aesthetic Education (London, Allen & Unwin) Ch.2, pp.14-30.", "terms": {"2020-21 Term 2": {"--LEC (5891)": {"startTimes": ["16:30", "16:30"], "endTimes": ["18:15", "18:15"], "days": [1, 3], "locations": ["Yasumoto Int'l Acad Park LT4", "Yasumoto Int'l Acad Park LT6"], "instructors": ["Dr. NG Mei Lin", "Dr. NG Mei Lin"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2", "13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (4482)": {"startTimes": ["16:30", "16:30"], "endTimes": ["18:15", "18:15"], "days": [1, 3], "locations": ["Li Koon Chun Hall LT1", "Sino Building LT2"], "instructors": ["Dr. NG Mei Lin", "Dr. NG Mei Lin"], "meetingDates": ["10/1", "17/1", "24/1", "12/1", "19/1", "26/1"]}}}}, {"code": "2240", "title": "Understanding Schooling and Education Policy in Hong Kong", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "This course introduces learners to a structural analysis of schooling: its nature and how it has been shaped and, at the same time, how it contributes to macro social divisions and contradictions along class, gender and racial/ethnic lines. It also sensitizes learners to various aspects of school life at a micro level, in order to see how these are constrained by macro economic, political and social forces on the one hand, and how these forces go into the making of students’ identities and relationships on the other. This course attempts to portray all these macro and micro dynamics in the local context, and at the same time, depicts how these are played out in selected education policies and the process of policy-making itself.", "outcome": "By the end of this course, students will be able to:\r • to grasp the essence of various critical perspectives – including the application of the relevant theories and concepts – in understanding the operation of schooling\r • to understand the relationship between education policy and schooling \r • to relate the implications of such discussions to their (future) classroom practices", "syllabus": "For reference only, please refer to the course outline of respective instructor for details\r 1. Introduction: The sociological perspective in education\r 2. Education and class inequality: cultural capital, symbolic violence, and social closure \r 3. Education and gender: identities, positioning and schooling outcomes\r 4. Racial and ethnic minorities and their schooling experience in Hong Kong\r 5. Language and social selection: the case of post-colonial Hong Kong\r 6. Globalization and the education reforms in Hong Kong: social polarization and neoliberal practices in schools\r 7. Policy-making in education in Hong Kong: the limits of civic/professional participation\r 8. Concluding discussion: education for socialization or for transformation?\r  課題可因應個別導師的課程設計而作出調校 1. 導言：教育的社會學視角\r 2. 教育與階級不均等：文化資本、符號暴力和社會壁壘\r 3. 教育與性別：身份、位置與學習後果\r 4. 香港少數種族/族裔人士和他們的學校經驗\r 5. 語文和社會篩選：後殖時期香港的狀況\r 6. 全球化與香港教育改革：社會兩極化和學校的新自由主義實踐\r 7. 香港教育政策過程：公民/專業參與的限制\r 8. 總結：教育目的是「社化」抑或轉化？", "required_readings": "Required readings (if any) would depend on individual instructors \r 1. 曾榮光《香港特區教育政策分析》，香港，三聯書店（香港）有限公司，香港浸會大學當代中國研究所，2011年\r 2. 曾榮光《香港教育政策分析：社會學的視域》。香港：三聯書店，1998年\r 3. 蔡寶瓊、黃家鳴編 <<姨媽姑爹論盡教改>>，香港，進一步多媒體有限公司，2002年\r 4. 蔡寶瓊、陳潔華編著《教育的性別視角：課堂與教學實證研究》，香港城市大學出版社，2012年\r 5. 陳潔華、蔡寶瓊編著《性別顯微鏡：教育與個人成長》，香港城市大學出版社，2012年\r 6. 何強星「教育機會均等狀況」，載謝均才編，《我們的地方，我們的時間：香港社會新編》，2002年，香港，牛津，頁157-188\r 7. 謝均才《教育機會差異在香港：現狀和研究議題評述》，香港，香港中文大學香港教育研究，1998\r 8. 謝均才「『教育質素』何價？香港教育改革的矛盾、弔詭和效果」，《香港社會科學學報》，第二十期 2001年秋 ; 頁1-55\r 9. Tse, Kwan-Choi Thomas, “Civic education and the making of deformed citizenry: From British colony to Chinese SAR”, in Agnes S. Ku and Ngai Pun (eds), Remaking Citizenship in Hong Kong: community, nation and the global city, London and New York, Routledge, 2006, pp. 54-73\r 10. Ball, Stephen J. “Perfomativities and fabrications in the education economy: towards the performative society”, in Hugh Lauder, Phillip Brown, Jo-Anne Dillabough and A.H. Halsey (eds), Education, Globalization, and Social Change, Oxford, Oxford U Press, 2006, pp. 692-701\r 11. Choi, Po King, \"'The best students will learn English': ultra-utilitarianism and linguistic imperialism in education in post-1997 Hong Kong\", Journal of Education Policy, Vol.18, no.6, Nov-Dec 2003, p. 673-694\r 12. Pong, Suet-ling & Tsang, Wing Kwong. 2010. “The Educational Progress of Mainland Chinese Immigrant Students in Hong Kong.” Research in Sociology of Education 17: 201-230.\r 13. Loper, Kelley (2004).Race and equality: A study of ethnic minorities in Hong Kong’s education system. HK: Centre for Comparative and Public Law, Faculty of Law, U. of HK.\r 14. Bourdieu, Pierre, “The forms of capital”, in Hugh Lauder, Phillip Brown, Jo-anne Dillabough and A.H. Halsey (eds), Education, Globalization and Social Change, Oxford U. Press, 2006, pp. 105-118\r 15. Sinikka Aapola, M. Gonick and A. Harris, Young Femininity: Girl Power and Social Changes, New York, Palgrave Macmillan, 2005, chap. 3, “Education, work and self-making ” , pp. 56-78\r 16. Brown, Phillip, “Cultural capital and social exclusion: some observations on recent trends in education, employment and the labour market, in A.H. Halsey, H. Lauder, P. Brown and A.S. Wells (eds), Education, Culture, Economy and Society, Oxford, Oxford University Press, 1997, pp. 736-74", "recommended_readings": "Recommended readings would depend on individual instructors\r 1. 何玉芬《流沙上的朝聖者足跡—從教師口述個案看教育承傳與教改》，香港，進一步多媒體有限公司，2006年\r 2. 吳康寧《教育社會學》，高雄，高雄復文，2002年\r 3. 林生傳《教育社會學》，台北，巨流，2005年\r 4. 陳奎熹《教育社會學》，台北，三民書局2001年\r 5. 陳照雄《當代教育社會學導論》，台北，心理，2006年。\r 6. Choi Po King, “A Critical Evaluation of Education Reforms in Hong Kong: Counting our Losses to Economic Globalisation”, in international Studies in Sociology of Education, Vol.15, no.3, 2005, pp. 241-261\r 7. Weiner, Gaby, Madeleine Arnot, and Miriam David, \"Is the future female? Female success, male disadvantage, and changing gender patterns in education\", in A.H. Halsey, Hugh Lauder, Phillip Brown and Amy Stuart Wells (eds), Education: Culture, Economy, and Society, Oxford, Oxford University Press, 1997, pp. 620-630\r 8. Ringrose, Jessica, “Successful girls? Complicating post-feminist, neoliberal discourses of educational achievement and gender equality”, Gender and Education, Vol. 19, no. 4, July 2007, pp. 471-489\r 9. Lin, Angel, “Bilingualism or linguistic segregation? Symbolic domination, resistance and code switching in Hong Kong schools”, Linguistics and Education, Vol.8, no.1, pp.49-84; 10. Ballantine, J. H.. Sociology of education: A systematic analysis. Boston: Person, 2001, Chapter 5\r 11. DeMarrais, K. B. & LeCompte, M. D. The way schools work: A sociological analysis of education. Boston: Pearson, 1999 (中文DeMarrais, K. B. & LeCompte著，林郡雯譯（2007)《教育的社會學分析—學校運作之道》，台北：學富文化事業。", "terms": {"2020-21 Term 1": {"A-LEC (7392)": {"startTimes": ["14:30", "14:30"], "endTimes": ["17:15", "17:15"], "days": [3, 1], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor KOH Aaron Soon Lee", "Professor KOH Aaron Soon Lee"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}, "2020-21 Term 2": {"B-LEC (5353)": {"startTimes": ["8:30", "8:30"], "endTimes": ["11:15", "11:15"], "days": [5, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Dr. WONG Yi Lee", "Dr. WONG Yi Lee"], "meetingDates": ["15/1", "22/1", "29/1", "5/2", "13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 1": {"A-LEC (5032)": {"startTimes": ["14:30", "14:30"], "endTimes": ["17:15", "17:15"], "days": [1, 3], "locations": ["Yasumoto Int'l Acad Park LT9", "Li Koon Chun Hall LT1"], "instructors": ["Professor KOH Aaron Soon Lee", "Professor KOH Aaron Soon Lee"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "8/9", "15/9"]}, "B-LEC (5286)": {"startTimes": ["8:30", "8:30"], "endTimes": ["11:15", "11:15"], "days": [3, 1], "locations": ["Yasumoto Int'l Acad Park LT9", "Yasumoto Int'l Acad Park LT7"], "instructors": ["Professor CHEUNG Chi Keung Alan", "Professor CHEUNG Chi Keung Alan"], "meetingDates": ["8/9", "15/9", "6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10"]}}, "2021-22 Term 2": {"C-LEC (7505)": {"startTimes": ["10:30", "10:30"], "endTimes": ["13:15", "13:15"], "days": [4, 2], "locations": ["Esther Lee Bldg LT4", "Wu Yee Sun College Theatre"], "instructors": ["Professor KOH Aaron Soon Lee", "Professor KOH Aaron Soon Lee"], "meetingDates": ["13/1", "20/1", "27/1", "11/1", "18/1", "25/1"]}}}, "assessments": {"Discussion": "20", "Essays": "50", "Presentation": "30"}}, {"code": "2312", "title": "Child and Adolescent Development", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkDiscussionExerciseLectureOthersProject", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "Nor for students who have taken PSYC2540", "description": "This course provides an introduction to major theoretical orientations in understanding human development. The contexts and the motivational foundation of child and adolescent development will be highlighted. The core of the course lies in different aspects of development (e.g., cognitive, moral, aesthetic, social, emotional; and self) in childhood and adolescence, which will be examined from both theoretical and applied perspectives. Issues of current concern (e.g., talent development, special educational needs, and various kinds of psychological disturbances) will also be discussed.", "outcome": "By the end of this course, students will be able to:\r 1. understand the contexts of child and adolescent development \r 2. understand the different theoretical perspectives in explaining various domains of child and adolescent development \r 3. understand the dialectic between theory and practice \r 4. cultivate their abilities in the application, analysis, synthesis and evaluation of related knowledge by doing homework assignments and a case study assignment\r 5. enhance their sensitivity to ongoing issues of child and adolescent development\r  學生修畢本科後，能夠:\r 1. 了解兒童及青少年發展的環境和動機因素 \r 2. 從不同理論角度了解兒童及青少年在各種範疇的發展 \r 3. 了解理論與實踐的辨證關係 \r 4. 透過研習計劃增進自身在應用、分析、綜合和評估相關知識的能力 \r 5. 提昇自身對當前的兒童及青少年發展議題的敏感度", "syllabus": "For reference only, please refer to the course outline of respective instructor for details\r 1. Basic concepts and theories\r 2. Modern theories\r 3. Emotional development, temperament, and attachment\r 4. Development of self and social cognition\r 5. Intelligence and achievement \r 6. Moral development and aggression\r 7. Family and school influences on development\r 8. Media and peer influences on development\r  *course content and order of topics may differ between Instructors", "required_readings": "Required readings (if any) would depend on individual instructors\r S. A. Rathus: Childhood and Adolescence: Voyages in Development, 6th Edition \r ISBN-10: 1-305-50459-3; ISBN-13: 978-1-305-50459-2", "recommended_readings": "Recommended readings would depend on individual instructors\r 1. Adams, G. (2000). Adolescent development: The essential readings. Malden, Mass: Blackwell Publishers.\r 2. Akhtar, S. (2011). The electrified mind: Development, psychopathology, and treatment in the era of cell phones and the internet. Lanham, MD: Jason Aronson. \r 3. Barry, C. T., Kerig, P. K., Stellwagen, K. K., & Barry, T. M. (Eds.). (2011). Narcissism and machiavellianism in youth: Implications for the development of adaptive and maladaptive behavior. Washington, D.C.: American Psychological Association.\r 4. Berger, K. S. (2014). The developing person through the life span (9th ed.). New York: Worth Publishers.\r 5. Berk, L. E. (2013). Child development. Boston: Pearson.\r 6. Berns, R. M. (2013). Child, family, school, community: Socializing and support (International edition, 9th ed.). CA: Wadsworth, Cengage Learning. \r 7. Bleach, M. J. (2010). Parental involvement in primary education in Ireland. Dublin: Liffey Press.\r 8. Boyd, D., & Bee, H. (2015). Lifespan development (7th ed.). Boston: Pearson.\r 9. Bronfenbrenner, U., & Ceci, S. J. (1994). Nature-nurture reconceptualized in developmental perspective: A bioecological model. Psychological Review, 101(4), 568-586. \r 10. Castelli, D. M., Centeio, E. E., Hwang, J., Barcelona, J. M., Glowacki, E. M., Calvert, H. G., & Nicksic, H. M. (2014). The history of physical activity and academic performance research: Informing the future. Monographs of the Society for Research in Child Development, 79, 119-148. \r 11. Coleman, J. (2011). The nature of adolescence. London, New York: Routledge. \r 12. Conkbayir, M., & Pascal, C. (2014). Early childhood theories and contemporary issues: An introduction. London: Bloomsbury. \r 13. DeFrates-Densch, N. (2008). Case studies in child and adolescent development for teachers. Boston, Mass: McGraw-Hill Higher Education.\r 14. Haines, J., & Neumark-Sztainer, D. (2006, December). Prevention of obesity and eating disorders: A consideration of shared risk factors. Health Education Research, 21, 770-782.\r 15. Harold, R. D., Colarossi, L. G., & Mercier, L. R. (2007). Smooth sailing or stormy waters? Family transitions through adolescence and their implications for practice and policy. Mahwah, N.J.: Lawrence Erlbaum Associates. \r 16. Harris, B. (2011). Working with distressed young people. Exeter: Learning Matters.\r 17. Harrison, K., & Hefner, V. (2006, April). Media exposure, current and future body ideals, and disordered eating among preadolescent girls: A longitudinal panel study. Journal of Youth and Adolescence, 35, 153-163.\r 18. Kassem, D., Murphy, L., & Taylor, E. (Eds.). (2010). Key issues in childhood and youth studies. NY: Routledge.\r 19. Kirshner, B., O'Donoghue, J. L., & McLaughlin, M. (Eds.). (2002). Youth participation: Improving institutions and communities. San Francisco, CA.: Jossey-Bass.\r 20. Laser, J. A., & Nicotera, N. (2011). (Eds.). Working with adolescents: A guide for practitioners. New York: Guilford Press.\r 21. Levin, D. E. (2013). Beyond remote-controlled childhood: Teaching young children in the media age. Washington, DC: National Association for the Education of Young Children. \r 22. Maholmes, V., & Lomonaco, C. G. (Eds.). (2010). Applied research in child and adolescent development: A practical guide. New York: Psychology Press.\r 23. National Center for Health Statistics. (2011, Update). Prevalence of overweight among children and adolescents: United States. Hyattsville, MD: U. S. Department of Health and Human Services, Centers for Disease Control and \r Prevention.\r 24. Nicholas, B. A. (Ed.). (2008). Adolescent emotional development and the emergence of depressive disorders. New York: Cambridge University Press.\r 25. Papalia, D. E., Feldman, R. D., & Martorell, G. (2014). Experience human development (13th ed.). Boston, MA: McGraw-Hill. \r 26. Rew, L. (2005). Adolescent health: A multidisciplinary approach to theory, research, and intervention. Thousand Oaks, CA: Sage Publications.\r 27. Scharf, M., & Mayseless, O. (Eds.). (2007). Attachment in adolescence: Reflections and new angles. San Francisco, Calif.: Jossey-Bass.\r 28. Scully, P. A., Barbour, C., & Roberts-King, H. (2015). Families, schools and communities: Building partnerships for education (6th ed.). Boston: Pearson.\r 29. Siegler, R., DeLoache, J., Eisenberg, N., & Saffran, J. (2014). How children develop (4th ed.). New York: Worth Publishers.\r 30. Silbereisen, R. K., & Lerner, R. M. (Eds.). (2007). Approaches to positive youth development. Los Angeles, Calif.: Sage Publications.\r 31. Spencer, J. M., Zimet, G. D., Aalsma, M. C., & Orr, D. P. (2002). Self-esteem as a predictor of initiation of coitus in early adolescents. Pediatrics, 109, 581-584.\r 32. Trivette, C. M., Dunst, C. J., & Hamby, D. W. (2010). Influences of family-systems intervention practices on parent-child interactions and child development. Topics in Early Childhood Special Education, 30(1), 3-19. \r 33. Woolfolk, A., & Perry, N. E. (2012). Child and adolescent development. Upper Saddle River, N.J.: Pearson.", "terms": {"2020-21 Term 1": {"A-LEC (8731)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. WONG Pak Ho"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}, "B-LEC (8732)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr. WONG Pak Ho"], "meetingDates": ["10/9", "17/9", "24/9"]}}, "2021-22 Term 1": {"A-LEC (7247)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Lee Shau Kee Building LT7"], "instructors": ["Staff"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}, "B-LEC (7248)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Yasumoto Int'l Acad Park 505"], "instructors": ["Staff"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Essay test or exam": "60", "Homework or assignment": "15", "Project": "25"}}, {"code": "3110", "title": "School-based Curriculum Development and Implementation", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "The course aims at helping learners investigate the various models of curriculum development (including the highly centralized as well as the school-based models) found in different socio-political environments and, based on this, study the history of the machinery for curriculum development and of curriculum design in Hong Kong. Learners also have the opportunities to examine the major issues of school-based curriculum development and implementation. This course also helps learners to master the basic skills of implementing curriculum change in schools.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3140", "title": "Curricular Strategies for Tackling Individual Differences", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "DiscussionLectureProject", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "Catering for individual differences is one of the challenges facing classroom teachers. This course aims to help student teachers develop basic understanding of the nature of the problem and means of tackling individual differences through curricular and instructional measures. Strategies such as curriculum adaptation, cooperative learning, mastery learning and assessment for learning will be covered. Student teachers will also acquire practical instructional strategies such as cubing. To make the course directly relevant to practical teaching environment, subject-specific examples and case studies will be widely used.", "outcome": "By the end of this course, students will be able to:\r 1. apply the principles of differentiated instruction (DI) to design at least one learning activity that matches your learning objective(s)\r 2. produce a differentiated lesson plan \r 3. present and reflect upon learning experience in a learning activity\r  學生修畢本科後，能夠:\r 1. 運用差異化教學(DI)原則設計至少一項符合學習目標的學習活動\r 2. 擬定一個有效差異化教學的課程計劃\r 3. 展示並反思在學習活動中的學習經歷", "syllabus": "For reference only, please refer to the course outline of respective instructor for details\r • Basic understandings of differentiated instruction \r • Principles of a differentiated classroom \r • Strategies for managing a differentiated classroom\r • Learner characteristics \r • Differentiated lesson planning \r • Differentiation by content\r • Differentiation by process\r • Differentiation by product\r • Differentiation by learning environment\r • Differentiated assessment practices\r • Using ICT for differentiated instruction\r  課題可因應個別導師的科目設計而調校 • 差異化教學的基本理解 • 差異化課堂的原則 • 差異化課堂策略 • 學習者特徵 • 差異化的課程計劃 • 按內容區分的差異化教學 • 按流程區分的差異化教學 • 按產品區分的差異化教學 • 通過學習環境進行差異化教學 • 差異化的評估實踐 • 使用ICT進行差異化教學", "required_readings": "Required readings (if any) would depend on individual instructors\r Tomlinson, C.A. (2001). How to differentiate instruction in mixed-ability classrooms. Alexandria, VA: ASCD.\r Tomlinson, C.A. (2014). 能力混合班級的差異化教學。台北市:五南圖書出版股份有限公司 。", "recommended_readings": "Recommended readings would depend on individual instructors\r Chapman, C. & King, R. (2012). Differentiated assessment strategies: one tool doesn’t fit all. Thousand Oaks, CA: Corwin.", "terms": {"2020-21 Term 1": {"--LEC (5238)": {"startTimes": ["9:30", "9:30"], "endTimes": ["11:15", "11:15"], "days": [1, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Dr. WAN Wai Yan", "Dr. WAN Wai Yan"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10"]}}, "2021-22 Term 1": {"--LEC (7669)": {"startTimes": ["9:30", "8:30"], "endTimes": ["11:15", "10:15"], "days": [1, 3], "locations": ["Lee Shau Kee Archi Bldg G03", "Esther Lee Bldg 405"], "instructors": ["Dr. WAN Wai Yan", "Dr. WAN Wai Yan"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "8/9", "15/9"]}}}, "assessments": {"Discussion": "20", "Project": "30", "Report": "50"}}, {"code": "3200", "title": "Developing Intercultural Competence: Experiential Learning", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "This course aims to equip students with essential understanding of intercultural concepts and theories for providing effective educational services for people from diverse cultural backgrounds in Hong Kong. Students will be: (a) engaging with placement activities in a range of local social and educational contexts, (b) examining the rationale and policies and modes of social service provisions for ethnic minorities and new arrivals students in Hong Kong in the light of the theories and concepts, (c) analyzing and reflecting problems and shortfalls with the current educational settings, and (d) suggesting possible solutions to the identified problems. An experiential learning approach coupled with a wide range of interactive activities such as group presentation, site-based observations and services will be employed to sharpen the students’ intercultural awareness and sensitivity and to develop their personal perspective on themselves, others and their relations with cultural differences and diversity.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3201", "title": "Ethics and Professional Standards for Teachers", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "This course provides an overview of professional standards for teachers in Hong Kong, encompassing issues related to law, professional ethics, values and behavior. Case studies are used to illustrate key aspects of T-standard+ and professional code, which include rights and responsibilities of teachers vis-a-vis other major stakeholders like students, employers, colleagues, parents/guardians, and to explicate what values and principles teachers can use to make ethical decisions and take ethical actions. Key legal issues related to professional development are also addressed and examined.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3260", "title": "Teacher Development and Leadership", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "Not for students who have taken EDUC3230 or 3250", "description": "Teachers are expected to play multiple roles in the education reform process. Shifting expectations require teachers to have a firm understanding of how schools operate and how reforms affect their roles both in and outside of the classroom. To effectively reshape their work in line with growing expectations, teachers must understand the current reality of school administration, their own personal weaknesses, commit to career-long professional development and consider strategies for maximizing their effectiveness. This course is designed to help teachers understand and shape their roles in a reform environment. In others words it aims to help teachers become leaders of their own professionalism. It does this in two ways. First, its aims to nurture teachers’ awareness of their own professional growth and how they can maximize the latest opportunities available in this area. Second, it helps teachers understand life in schools undergoing reform and the effect this can have on their professional life. Topics covered in the course are: understanding teachers’ role and the complexity of the school organization, developing personal mastery and personal vision in education, systems thinking and problem solving in the organization and in the classroom, learning shared vision and team learning skills, leading and managing change in school, etc.", "outcome": "By the end of this course, students will be able to:\r 1. understand recent educational reforms and their impacts on Hong Kong’s education system;  2. analyze influential factors of the development of teaching profession;  3. examine teachers’ role to key aspects of changes required under reform contexts;  4. devise an individualized professional development plan within school contexts;  5. able to reflect on and improve their individual practices.", "syllabus": "For reference only, please refer to the course outline of respective instructor for details \r  1. Teachers in a changing world and teacher competencies\r 2. Stages of teacher development and personal growth\r 3. Teacher roles, identities and teaching as a profession\r 4. School culture: Conflicts, collaboration and micro-politics in schools \r 5. Continuing professional development in schools and different types of teacher professional development \r 6. Collaborative relationship and organizational culture in schools: Development of teacher learning communities \r 7. Teacher leadership and team building\r 8. Quality assurance, teacher appraisal and teacher development \r 9. Collaborative relationship and working with various stakeholders \r 10. Reflection and teacher development (1): Developing individual education philosophy \r 11. Reflection and teacher development (2): Mentoring and lesson study \r 12. Reflection and teacher development (3): Action research \r 13. Concerns of beginning teachers: Learning from the first year of school life", "required_readings": "Required readings (if any) would depend on individual instructors", "recommended_readings": "Recommended readings would depend on individual instructors\r  1. Argyris, C. (1976). Increasing leadership effectiveness. NY: John Wiley & Sons.\r 2. Argyris, C. (1985). Strategy, change and defensive routines. Boston, MA: Pitman.\r 3. Argyris, C. (1990). Overcoming organizational defenses: Facilitating organizational learning. Boston, MA: Allyn and Bacon.\r 4. Argyris, C. (2003). Knowledge for action. San Francisco, CA: Jossey-Bass.\r 5. Argyris, C. & Schön, D. (1974). Theory in practice. San Francisco, CA: Jossey-Bass.\r 6. Brown, A.D. (1999). The six dimensions of leadership. London: Random House.\r 7. Covey, S.R. (1989). The seven habits of highly effective people. NY: Simon & Schuster.\r 8. Covey, S.R. (2004). The eighth habit: From effectiveness to greatness. NY: Free Press\r 9. Day,C., Sachs,J., Earl,L.M., & Timperley,H. (2008). Professional learning conversations: Challenges in using evidence for improvement. Dordrecht: Springer Netherlands.\r 10. Erikson, E.H. (1974). Dimensions of a new identity. NY: Norton.\r 11. Ford, D. (1988). The dark side of the light chasers. NY: The Berkley Publishing Group\r 12. Friere, P. (1970). Pedagogy of the oppressed (translated by M.B. Ramos). NY: The Continuum International Publishing Group Inc.\r 13. Fullan, M. (2001). Leading in a culture of change. San Francisco, CA: Jossey-Bass.\r 14. Fullan, M. & Hargreaves, A. (1991). What’s worth fighting for in your school. Buckingham: Open University Press.\r 15. Gabriel, Y. (1999). Organizations in depth: The psychoanalysis of organizations. London: Sage Publications Ltd.\r 16. Gardner, H., Csikszentmihalyi, M. & Damon, W. (2001). Good work: when excellence and ethics meet. New York, NY: Basic Books.\r 17. Greenleaf, R.K. (1970). Servant leadership: Journey into the nature of legitimate power and greatness. New York: Paulist Press.\r 18. Hargreaves, A. (1994). Changing teachers, changing times: Teachers’ work and culture in the postmodern age. London: Cassell.\r 19. Heifetz, R.A., & Linsky, M. (2002). Leadership on the line: Staying alive through the dangers of leading. Boston, MA: Harvard Business School Press.\r 20. Isaacs, W. (1999). Dialogue and the art of thinking together. NY: Currency.\r 21. Jung, C.G. (1969). The archetypes and the collective unconsciousness (translated by R.F.C. Hull), London: Routledge & Paul.\r 22. Kahane, A. (2004). Solving tough problems: An open way of talking, listening, and creating new realities. San Francisco, CA: Berrett-Koehler Publishers, Inc.\r 23. Kegan, R. (1982). The evolving self: Problems and process in human development. Boston, MA: Harvard University Press.\r 24. Kets de Vries, M.F.R. (1980). Organizational paradoxes: Clinical approaches to management. London: Tavistock Publications.\r 25.Kets de Vries, M.F.R. (1984). The neurotic organization. San Francisco, CA : Jossey-Bass Publishers.\r 26. Kets de Vries, M.F.R. (2001). The leadership mystique: An owner’s manual. London: Financial Times Prentice Hall. \r 27. Lencioni, P. (2002). The five dysfunctions of a team. San Francisco, CA: Jossey-Bass.\r 28. Martin, R. (2002). The responsibility virus. NY: Basic Books.\r 29. Mitchell, C., & Sackney, L. (2000). Profound improvement: Building capacity for a learning community. The Netherlands: Swets & Zeitlinger.\r 30.Parks, S.D. (2005). Leadership can be taught. Boston, MA: Harvard Business School Press.\r 31. Schön, D. (1983). The reflective practitioner. How professionals think in action. NY: Basic Books.\r 32. Schön, D. (1987). Educating the reflective practitioner: Toward a new design of teaching and learning in the professions. San Franscisco CA: Jossy-Bass.\r 33. Senge, P.M. (1990). Fifth discipline: The art and practice of the learning organization. NY: Doubleday.\r 34. Senge, P.M., Cambron-McCabe, N., Lucas, T., Smith, B., Dutton, J., & Kleiner, A. (2000). Schools that learn. NY: Doubleday.\r 35. Shor, I. (1992). Empowering education: Critical teaching for social change. Chicago, IL: The University of Chicago Press.\r 36. Stone, D., Patton, B., & Heen, S. (1999). Difficult conversations: How to discuss what matters most. NY: Penguin Book.\r 37. Stapley, L.F. (1996). The personality of the organization: A psychodynamic explanation of culture and change. London: Free Association Books.\r 38. Torbert, W.R. (1987). Managing the corporate dream: Restructuring for long-term success. Homewood, IL: Dow Jones-Irwin.\r 39. Torbert, B. (2004). Action inquiry: The secret of timely and transforming leadership. San Francisco, CA: Berrett-Koehler Publisher, Inc.\r 40. Yankelovich, D. (1999). The magic of dialogue: Transforming conflict into cooperation. NY: Simon & Schuster.", "terms": {"2020-21 Term 2": {"--LEC (4650)": {"startTimes": ["14:30", "14:30"], "endTimes": ["16:15", "16:15"], "days": [1, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor WONG Lai Ngok Jocelyn", "Professor WONG Lai Ngok Jocelyn"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2", "13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (8821)": {"startTimes": ["14:30", "14:30"], "endTimes": ["16:15", "16:15"], "days": [1, 3], "locations": ["Esther Lee Bldg LT3", "Yasumoto Int'l Acad Park 405"], "instructors": ["Dr. TAM Wai Ming Frank", "Dr. TAM Wai Ming Frank"], "meetingDates": ["10/1", "17/1", "24/1", "12/1", "19/1", "26/1"]}}}, "assessments": {"Discussion": "10", "Homework or assignment": "60", "Project": "30"}}, {"code": "3270", "title": "Engendering Education", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "Not for students who have taken GDRS2004 or UGEC2672", "description": "Drawing on sociological and socio-psychological perspectives, this course tries to sensitize students to the gender implications underlying educational structures and processes. This course examines how various aspects of education, including its hierarchical structure, the curriculum and school processes, are shaped by the changing needs of capitalism and patriarchy. At the same time, this course will attempt to identify the various contradictions, paradoxes and space for resistance embedded in education. This course sees education as the site for the construction of and contests involving gender and sexualities. It also deconstructs dominant epistemologies, and introduces students to research concerning gender-differentiated modes of learning. The ultimate goal is to enable students to question existing power relationships in patriarchy, as well as concepts and views that are deeply embedded in such relationships, so as to be able to build up a broader intellectual space for themselves.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3280", "title": "An introduction to Moral and Citizenship Education", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "This course aims to help student-teachers to reflect on their own values and on the ways they teach values, especially those values related to moral education and citizenship education in school. Philosophical, historical, social, psychological and pedagogical foundations on moral education and citizenship education will be explored. Among other important considerations, students are asked whether teachers should or can teach their own values in the classroom, and whether this is indeed inevitable. Taking education as a means aiming at nurturing human qualities for the sake of personal and social well-being, the course examines a range of values such as truth, beauty, goodness and justice as embodied in ‘whole-person education’. Key concepts like human rights, rule of law, democracy, nation-state, and globalization will be compared. How these concepts can be taught and learnt in daily classroom will be discussed. During the course students will discuss the nature of morality and explore various perspectives of moral education, values education and citizenship education. Students will also be asked to reflect upon how they understand their own personal and professional development in relation to values, moral and civic education and how to enact their various roles in the school.\r", "outcome": "By the end of this course, students will be able to:\r (1) develop a critical understanding of the place of values in moral education and citizenship education; (2) understand and appreciate some important concepts related to moral, values and citizenship education; (3) apply these important concepts to understanding and evaluating Hong Kong situations.\r (4) be able to develop pedagogies related to moral, values and citizenship education possibly in the form of case studies or lesson plans.", "syllabus": "For reference only, please refer to the course outline of respective instructor for details\r  Introduction\r 1. What is Moral Education and Citizenship Education? \r  Moral Education\r 1. Goodness and Morality \r 2. The cognitive approach: Moral development of young people\r 3. The feminist approach: Care and connectedness\r 4. The narrative approach: Authoring moral experience\r 5. The axiological approach: Valuing and Evaluating\r  Citizenship Education\r 1. Citizenship as membership\r 2. Citizenship as rights and responsibilities of citizens\r 3. Citizenship as virtues: whose version of good citizen?\r 4. Global citizenship\r  Conclusion \r 1. The roles of education and educators in Moral and Citizenship Education: An examination of limits & possibilities in Hong Kong", "required_readings": "Required readings (if any) would depend on individual instructors", "recommended_readings": "Recommended readings would depend on individual instructors\r  A. Moral Education\r 1. Blackburn, S.(2001). Being good. Oxford: Oxford University Press.\r 2. Bouchard, N.(2002). A narrative approach to moral experience using dramatic play and writing. Journal of moral education. 31(4), pp.407-421. [ejournal]\r 3. Carr, D. (2005). On the contribution of literature and the arts to the educational cultivation of moral virtue, feeling and emotion, Journal of moral education, 34(2), pp.137–151. [ejournal]\r 4. Carr, D.(2006). The moral roots of citizenship: Reconciling principle and character in citizenship education. Journal of moral education, 35(4), pp. 443–456. [ejournal]\r 5. Carr, D. & Steutel, J.(eds.)(1999). Virtue ethics and moral education. London & New York: Routledge.\r 6. Cheng, H. M. R.(2004). Moral education in Hong Kong: Confucian-parental, Christian-religious and liberal-civic influences. Journal of moral education. 33(4), December 2004, pp.533-552.\r 7. Crain, W.(2011). Chapter 7: Kohlberg’s stages of moral development. Theories of development: Concepts and applications. 6th ed. Boston: Pearson.\r 8. Damon, W.(1988). Chapter 1: Moral concerns from the child’s perspective. The moral child: Nurturing children’s natural moral growth. New York: The Free Press.\r 9. Damon, W.(1988). The moral child: Nurturing children’s natural moral growth. New York: The Free Press.\r 10. Damon, W.(1995). Chapter 7: A framework of guidance for children’s intellectual and moral growth. Greater expectations: Overcoming the culture of indulgence in America’s homes and schools. New York: The Free Press.\r 11. D'Olimpio, L. (2017). Media and Moral Education: A Philosophy of Critical Engagement. London: Taylor and Francis Ltd.\r Eaude, T. (2016). New perspectives on young children's moral education: Developing character through a virtue ethics approach. New York: Bloomsbury Academic\r 12. Garrod, A.(ed.)(1993). Approaches to moral development: New research and emerging themes. New York: Teachers’ College Press. [陽琬譯（2002）。《教育與道德發展》。台北：桂冠。]\r 13. Gibbs, J.C.(2010). Moral development and reality: Beyond the theories of Kohlberg and Hoffman. 2nd ed. Boston: Allyn & Bacon.\r 14. Gilligan, C.(1993). In a Different Voice: Psychological Theory and Women’s Development. Cambridge, Mass.: Harvard University Press.\r 15. Gilligan, C., Ward, J.V. & Taylor, J.M.(eds.)(1988). Mapping the moral domain. Camdridge, Mass.: Harvard University Press.\r 16. Gooderham, D. W.(1997). What rough beast…? Narrative relationships and moral education. Journal of moral education, 26(1), pp.59-72.\r 17. Greene, M.(1994). Wide-awakeness and the moral life. Exploring education: An introduction to the foundations of education. Boston: Allyn & Bacon.\r 18. Halstead, J.M. & McLaughlin, T.H.(eds.)(1999). Education in morality. London: Routledge.\r 19. Hansen, D.T. (1997). Being a good influence. In N. C. Burbules & D. T. Hansen(eds.), Teaching and its predicaments, pp.163-174. Colorado: Westview Press\r 20. Hansen, D. (2001). Exploring the moral heart of teaching: Toward a teachers’ creed. New York: Teachers College Press.\r 21. Hersh, R.H., Miller, J.P. & Fielding, G.D.(1980). Models of moral education: An appraisal. New York: Longman. [劉秋木、呂正雄譯（1993）。《德育模式》。台北：五南。]\r 22. Hoffman, M. L.(2000). Empathy and moral development. Cambridge: Cambridge University Press.\r 23. Jackson, P.W., Boostrom, R.E & Hansen, D.T.(1993). The moral life of schools. San Francisco: Jossey-Bass.\r 24. Kagan, J. & Lamb, S.(eds.)(1987). The emergence of morality in young children. Chicago: University of Chicago Press.\r 25. Kohlberg, L.(1981). Essays on moral development (Volume 1): The philosophy of moral development. San Francisco: Harper & Row.\r 26. Kohlberg, L.(1984). Essays on moral development (Volume 2): The psychology of moral development. San Francisco: Harper & Row.\r 27. Kohlberg, L. & Reimer, J.(1989). From moral discussion to democratic governance. In C. Power, A. 3 Higgins & L. Kohlberg(eds.), Lawrence Kohlberg’s approach to moral education. New York: Columbia University Press.\r 28. Li, M.S., Taylor, M.J. & Yang S.G.(eds.)(2004). Journal of moral education. Special issue: Moral education in changing Chinese societies. 33(4), December 2004. Abington: Carfax.\r 29. Noddings, N.(1992). Chapter 2: Caring, & Chapter 4: An alternative vision. The challenge to care in schools. New York & London: Teachers College Press.\r 30. Noddings, N. (1994). Conversation as moral education. Journal of Moral Education. 23(2), p107-119. [ejournal]\r 31.Nucci, L.(ed.)(1989). Moral development and character education: A dialogue. Berkeley: McCutchan.\r 32. Nucci, L. (2001). Education in the moral domain. New York: Cambridge University Press. \r 33. Nucci, L., Narváez, D., & Krettenauer, T. (2014). Handbook of Moral and Character Education (2nd edition). New York: Routledge. \r 34. Pardales, M. J.(2002). “So, How did you arrive at that decision?” Connecting moral imagination and moral judgment. Journal of moral education, 30(4), pp.423-437. [ejournal]\r 35. Pring, R. (2001). Education as a moral practice, Journal of moral education, 30(2), pp.101–112. [ejournal]\r 36. Straughan, R.(1988). Chapter 1: What are the problems? & Chapter 3: What does it mean to be good? Can we teach children to be good? Basic issues in moral, personal and social education. Milton Keynes, Philadephia: Open University Press. 或： 周兆祥譯（1987）。〈德育涉及那些問題？〉及〈何謂「好」孩子？〉。《學校德育探究》，第一、二章。香港：田園書屋。原著：Straughan, R.(1982). Can we teach children to be good? London: Allen & Unwin.\r 37. Tappan, M. & Brown, L.M.(1989). Stories told and lessons learned: Toward a narrative approach to moral development and moral education. Harvard education review, 59(2), pp. 182-203.\r 38. Tappan, M. & Packer, M. (Eds.). (1991). Narrative and storytelling: Implications for understanding moral development. New Directions for Child Development, #54. San Francisco: Jossey-Bass.\r 39. Warnock, M.(1996). Moral values. In J. M. Halstead & M. J. Taylor(eds.), Values in education and education in values, pp. 45-53. London: Falmer Press.\r 40. 方志華（2004）。《關懷倫理學與教育》。台北：洪葉。\r 41. 高德胜（2003）。《知性德育及其超越——現代德育困境研究》。北京：教育科學出版社。\r 42. 高德胜（2008）。《道德教育的時代遭遇》。北京：教育科學出版社。\r 43. 戚萬學（1995）。《衝突與整合——20 世紀西方道德教育理論》。濟南：山東教育。\r 44. 劉秋木、呂正雄譯（1993）。認知道德發展模式。《德育模式》，第七章。台北：五南。原著：Hersh, R.H., Miller, J.P. & Fielding, G.D.(1980). Models of moral education: An appraisal. New York: Longman. \r 45. 劉國強（2007）。《中華美德教育的理論意義與當前時代意義》。香港：香港教育研究所。\r 46. 簡成熙（1997）。關懷倫理學與教育——姬莉根與諾丁思想初探。收於簡成熙編：《哲學和教育》。高雄：復文。\r  B. Values Education\r 1. 伍美蓮（2003）。「乃若其『情』則可以為善矣」——論感情．價值與教育。收於中央大學儒學研究中心編，《第一屆 青年儒學國際會議論文集》，頁 482-500。中壢：中央大學儒學研究中心。\r 2. Halstead, J.M. & Taylor, M.J.(2000). The development of values, attitudes and personal qualities: A review of recent research. 3. Berkshire: National Foundation for Educational Research\r 4. Ryle, G.(1972). Can virtue be taught? In R. F. Dearden, P. Hirst & R. S. Peters(eds.), Education and the development of reason, part 3: Education and reason. London: Routledge & Kegan Paul.\r 5. Savater, F. (2010). 對與錯的人生邏輯課 [Ética para Amador.Chinese] (初版 ed.). 台北市: 漫遊者文化事業股份有限公司.\r 6. R.H.M. Cheng, J.C.K. Lee and L.N.K Lo (eds.), Values education for citizens in the new century, pp. 49-66. Hong Kong: Chinese University Press.\r 7. Lickona, T.(1991). Educating for character: How our schools can teach respect and responsibility. New York: Bantam.\r  C. Citizenship Education\r 1. Wang, C.M. and Goh, D.P.S. (Eds.).(2017). Precarious Belongings: Affect and Nationalism in Asia. Roman & Littlefield.\r 2. Delanty, G. (2000). Citizenship in a global age: Society, culture, politics. Buckingham: Open University Press.\r 3. Fairbrother, G.P & Kennedy, K.J. (2011). Civic education curriculum reform in Hong Kong: What should be the direction under Chinese sovereignty?. Cambridge Journal of Education, 41(4), 425-443.\r 4. Gearon, L. (2010). Learning to teach citizenship in the secondary school. (2nd ed.) London & New York: Routledge.\r 5. Heater, Derek (1999) What is citizenship? Cambridge: Polity. [中譯本:德里克‧希特著。張慧芝、郭進成譯(2006) 。《公民身分》。永和：韋伯文化。郭忠華譯(2007) 。 《何謂公民身份》。長春:吉林出版集團。]\r 6. 劉國強、謝君才編（2004）。《變革中的兩岸德育與公民教育》。香港：香港中文大學。\r 7. 梁恩榮、阮衛華。(2011）。《公民教育，香港再造！迎向新世代公民社會》。香港:印象文字及香港基督徒學會。第一5,6,7,16,17章。頁86-96, 102-108,110-128,288-327。\r 8. 陳弘毅(2012)。《法治、人權與民主憲政的理想》。香港：商務印書館(香港)有限公司。\r 9. 陳健民(2010）。《走向公民社會：中港的經驗與挑戰》。香港：上書局出版社。\r 10. 戚本盛(2012)。《國民教育是什麼-演變與爭議》。香港：進一步多媒體有限公司。\r 11. 謝均才(2011)。〈國民教育可以怎麼辦？給教育工作者的一些參考建議〉。《思》第 122 期（2011 年 10月）頁11-15。http://www.hkcidata1.org/database/sze/122/sze122.pdf\r 12. 戴耀廷(2010)。《香港的憲政之路》。香港：香港中華書局。\r  D. Web Resources*\r 1. Journal of Moral Education: http://www.tandf.co.uk/journals/titles/03057240.asp (Full-text search available via CUHK Library system)\r 2. 香港廉政公署德育資源網：http://www.icac.org.hk/me/new/index.html\r 3. 香港教育城教育資源庫: http://resources.hkedcity.net/\r 4. 香港教育局德育、公民及國民教育: http://www.edb.gov.hk/tc/curriculum-development/4-key-tasks/moral-civic/index.html\r 5. 課程發展處。《公民教育科參考資料(一)、公民教育科參考資料(二)、加強學習、認識中國》。http://www.cdccdi.hk.linkage.net/cdi/cross/main/main5.htm\r 6. 課程發展處。各學習階段之學習期望及生活事件事例舉隅。http://www.edb.gov.hk/index.aspx?langno=2&nodeID=7109\r 7. 課程發展議會(2002)。《個人、社會及人文教育學習領域課程指引（小一至中三）》。香港：政府印務局。 \r 8. 課程發展議會(編)(2010)。《個人、社會及人文教育學習領域生活與社會課程指引(中一至中三) 》。香港: 課程發展議會。Curriculum Development Council (2010). Life and Society Curriculum Guide (Secondary 1-3). http://www.edb.gov.hk/FileManager/TC/Content_3241/ l&s_curriculum_guide_chi.pdf http://www.edb.gov.hk/FileManager/EN/Content_3241/curriculum%20guide_eng_20101027.pdf\r 9. 課程發展議會(編)(2007)。《通識教育科課程與評估指引》。香港: 課程發展議會。Curriculum Development Council and Hong Kong Examinations Assessment Authority. (2007). Liberal Studies: Curriculum and Assessment Guide (Secondary 4-6). http://www.edb.gov.hk/FileManager/EN/Content_5941/ls_e_070307.pdf\r 10. 生活與社會課程(中一至中三)教學資源及參考資料http://www.edb.gov.hk/tc/curriculum- development/kla/pshe/references-and-resources/life-and-society/index.html\r 11. 教育統籌局德育及公民教育網頁 http://www.cd.edb.gov.hk/mce/\r 12. 香港人權監察 http://www.hkhrm.org.hk/\r 13. 香港基督徒學會公民社會教育http://www.hkci.org.hk/educate/intro.html\r 14. 香港教育學院管治與公民研究中心 http://www.ied.edu.hk/cgc/\r 15. 基層大學網頁 http://www.grass-root.org\r 16. O.N.E (Oxfam Hong Kong News E-magazine) http://www.oxfam.org.hk/one/\r 17. 香港獨立媒體 http://www.inmediahk.net/\r 18. 北京大学法学院人权与人道法研究中心http://www.hrol.org/", "terms": {"2020-21 Term 1": {"--LEC (5220)": {"startTimes": ["11:30", "11:30"], "endTimes": ["13:15", "13:15"], "days": [4, 2], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor TSE Kwan Choi", "Professor TSE Kwan Choi"], "meetingDates": ["10/9", "17/9", "24/9", "8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10"]}}, "2021-22 Term 1": {"--LEC (5291)": {"startTimes": ["14:30", "13:30"], "endTimes": ["16:15", "15:15"], "days": [2, 4], "locations": ["Mong Man Wai Bldg 703", "Lee Shau Kee Archi Bldg G03"], "instructors": ["Professor TSE Kwan Choi", "Professor TSE Kwan Choi"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Essays": "70", "Fieldwork or field study": "30"}}, {"code": "3290", "title": "Meaning Concerns, Death and Life Education", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "This course aims to help student-teachers to reflect on their attitudes towards death in search for meaning of life and other meaning concerns in life education. It will draw on philosophical, historical, cultural, psychological, pedagogical and religious sources when relevant.　Among other important deliberations, students are helped to reflect on their quest of meaning of life, in which kinds of deaths and their causes (e.g. mental health problems) are explored. Students learn how to cope with suicidal tendency of oneself and others, or sudden deaths of family members or friends. They will also learn how to prepare themselves as teachers in helping their future school pupils to cope with related issues on meaning concerns in death and life education.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3311", "title": "Psychology Applied to Learning and Teaching", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "Not for students who have taken PSYC3550.", "description": "This course provides a general overview on major psychological theories of learning and their implications for teaching. Emphasizing on the application of theories in teaching practice, the following topics are introduced:1) Behavioral, cognitive, social-cognitive, and socio-cultural theories of learning; 2) Basic cognitive processes: attention and memory; 3) Higher-order cognition and metacognition; 4) Cognition and instruction; 5) Classroom management; 6) Motivation and individual differences; 7) Design and implementation of classroom assessments", "outcome": "By the end of this course, students will be able to:1. Demonstrate an understanding of major behavioral, cognitive, social-cognitive, and socio-cultural theories of learning and motivation2. Apply knowledge of basic cognitive processes (attention and memory) to educational settings3. Describe higher-order cognition and use metacognitive strategies to improve educational practices4. Devise effective classroom strategies to accommodate individual differences among students5. Apply effective strategies to foster students' motivation6. Acquire basic concepts of classroom management and school discipline7. Develop knowledge of assessment strategies and use them to improve classroom learning and teachingAll learning outcomes are assessed via the class test and group project.學生修畢本科後，能夠:1. 展示對學習及動機各個學派理論（包括行為、認知、社會認知和社會文化）的理解2. 在教學環境裏，應用他們對基本認知過程（注意力和記憶力）的認識3. 描述高階認知過程及應用元認知策略以提高教學實踐4. 設計有效的課堂教學策略，以處理學生的個別差異5. 應用有效策略以促進學生的學習動機6. 描述基本課室管理與學校管教概念7. 建立對課堂評估策略的認識，以改善學習與教學質素所有學習成果通過課堂測試和小組項目進行評估。", "syllabus": "For reference only, please refer to the course outline of respective instructor for details1. Behavioral and cognitive theories of learning2. Basic cognitive processes: attention and memory3. Higher-order cognition and metacognition4. Cognition and instruction5. Classroom management6. Motivation and individual differences7. Design and implementation of classroom assessments課題可因應個別導師的科目設計而調校1. 學習的行為和認知理論2. 基本認知過程：集中力與記憶3. 高階認知系統與元認知4. 認知與教學之關係5. 課室管理6. 動機和個別差異7. 課堂評估的設計與實施", "required_readings": "Required readings (if any) would depend on individual instructors  1. Ormrod, J.E. (2014). Essentials of educational psychology: Big ideas to guide effective teaching (3rd Ed.—Pearson New International Edition). UK: Pearson. ISBN: 978-1-292-02620-6.", "recommended_readings": "Recommended readings would depend on individual instructors 1. Anderson, L.W., Krathwohl, D.R., Airasian, P.W., Cruikshank, K.A., Mayer, R.E., Pintrich, P.R., Raths, J., & Wittrock, M.C. (Eds.). (2001). A taxonomy for learning, teaching, and assessing: A revision of Bloom’s taxonomy of educational objectives. NY: Longman.  2. de Vega, M., Glenberg, A.M., & Graesser, A.C. (Eds.). (2008). Symbols and embodiment: Debates on meaning and cognition. NY: Oxford University Press.  3. Domjan, M. (2010). Principles of learning and behavior (6th Ed.). CA: Cengage.  4. Estes, T.H., Mintz, S.L., & Gunter, M.A. (2009). Instruction: A models approach (6th Ed.). NJ: Pearson. 5. Glenberg, A.M. (2008). Embodiment for education. In P. Calvo and A. Gomila (Eds.), Handbook of cognitive science: An embodied approach (pp. 355-372). Amsterdam: Elsevier.  6. Gronlund, N.E., & Brookhart, S.M. (2008). Writing instructional objectives for teaching and assessment (8th Ed.). NJ: Pearson.  7. Hacker, D.J., Dunlosky, J., & Graesser, A.C. (Eds.) (2009). Handbook of metacognition in education. NY: Routledge.  8. Halpern, D.F., Graesser, A., & Hakel, M. (2007). 25 Learning principles to guide pedagogy and the design of learning environments. Washington DC: Association for Psychological Science.  9. Jones, V., & Jones, L. (2009). Comprehensive classroom management: Creating communities of support and solving problems (9th Ed.). NY: Prentice Hall.  10. Mayer, R.E. (2008). Learning and Instruction (2nd Ed.). NJ: Pearson.  11. Mayer, R.E. (2011). Applying the science of learning. MA: Pearson.  12. Mayer, R.E., & Alexander, P.A. (Eds.) (2011). Handbook of research on learning and instruction. NY: Routledge.  13. Mok, M.M.-C. (2011). Self-directed learning oriented assessment: Assessment that informs learning and empowers the learner. HK: Pace Publishing.  14. Ormrod, J.E. (2011). Human learning (6th Ed.). NJ: Pearson.  15. Pashler, H., Bain, P.M., Bottge, B.A., Graesser, A., Koedinger, K.R., McDaniel, M., & Metcalfe, J. (2007). Organizing instruction and study to improve student learning. Institute of Educational Sciences practice guide. Washington DC: National Center for Educational Sciences.  16. Pecher, D., & Zwaan, R.A. (2005). Grounding cognition: The role of perception and action in memory, language, and thinking. NY: Cambridge University Press.  17. Roediger, H.L. (Ed.) (2008). Learning and memory: a comprehensive reference. CA: Academic Press.  18. Schunk, D.H. (2011). Learning theories: An educational perspective (6th Ed.). NJ: Pearson.  19. Schunk, D.H., Pintrich, P.R., & Meece, J.L. (2008). Motivation in education: Theory, research, and applications (3rd Ed.). NJ: Pearson.  20. Waters, H.S., Schneider, W., & Borkowski, J. (Eds.) (2009). Metacognition, strategy use, and instruction. NY: Guilford Press.  21. Zhang, L.F., Biggs, J., & Watkins, D. (2010). Learning and development of Asian students: What the 21st century teacher needs to think about. Singapore: Pearson.  22. Zimmerman, B.J., & Schunk, D.H. (Eds.) (2011). Handbook of self-regulation of learning and performance. NY: Routledge.  23. 林瑞芳（２００４）。《教育心理學實用手冊》。香港：香港心理學會敎育心理學部。  24. 李雅言（２０１１）。 《教學心理學》。香港：商務印書館。  25. 黃振能、李雅言、謝志成、伍斐然、黃桂玲、王茜（２０１２）。《學心理‧識教子──有根有據培育良方》。香港：商務印書館。", "terms": {"2020-21 Term 1": {"A-LEC (5033)": {"startTimes": ["14:30", "14:30"], "endTimes": ["17:15", "17:15"], "days": [4, 2], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor WONG Kwai Ling", "Professor WONG Kwai Ling"], "meetingDates": ["10/9", "17/9", "24/9", "8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10"]}}, "2020-21 Term 2": {"B-LEC (7907)": {"startTimes": ["8:30", "8:30"], "endTimes": ["11:15", "11:15"], "days": [4, 2], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor WONG Kwai Ling", "Professor WONG Kwai Ling"], "meetingDates": ["14/1", "21/1", "28/1", "4/2", "12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 1": {"A-LEC (4501)": {"startTimes": ["14:30", "14:30"], "endTimes": ["17:15", "17:15"], "days": [4, 2], "locations": ["Chung Chi College Chapel", "William M W Mong Eng Bldg LT"], "instructors": ["Professor TSE Chi Shing", "Professor TSE Chi Shing"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10"]}}, "2021-22 Term 2": {"B-LEC (4379)": {"startTimes": ["8:30", "8:30"], "endTimes": ["11:15", "11:15"], "days": [3, 5], "locations": ["Yasumoto Int'l Acad Park LT4", "Chen Kou Bun Bldg LT3"], "instructors": ["Professor TSE Chi Shing", "Professor TSE Chi Shing"], "meetingDates": ["12/1", "19/1", "26/1", "14/1", "21/1", "28/1"]}, "C-LEC (4384)": {"startTimes": ["14:30", "14:30"], "endTimes": ["17:15", "17:15"], "days": [4, 2], "locations": ["Yasumoto Int'l Acad Park LT4", "Yasumoto Int'l Acad Park LT2"], "instructors": ["Professor TSE Chi Shing", "Professor TSE Chi Shing"], "meetingDates": ["13/1", "20/1", "27/1", "11/1", "18/1", "25/1"]}}}, "assessments": {"Presentation": "10", "Project": "30", "Short answer test or exam": "10", "Selected response test or exam": "50"}}, {"code": "3320", "title": "Motivation and Individual Differences", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "Understanding the motivation of and individual differences among students is essential for effective teaching and learning. An integrated approach of theory, research and practice will be adopted in this course. It begins with inviting course participants to explore major theories of motivation for deeper insights into the learning process. Current research findings on psychological constructs related to motivation and de-motivation in school learning will then be discussed. Examples of these constructs are self-concept, self-efficacy, goal orientation, self-regulation, curiosity, interest, flow, learned helplessness, teachers’ expectations and teachers' feedbacks. Individual differences in such aspects as cognitive style, memory, intelligence, creativity, problem solving, prior knowledge and personal epistemology will also be examined. To discuss teaching strategies that would optimize students’ motivational level and to accommodate for their individual differences, we will deliberate on various instructional designs, ranging from classroom strategies to a school-wide approach.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4030", "title": "Teaching Practice I", "career": "Undergraduate", "units": "5.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "Not for students who have taken EDUC4010", "description": "The first block of teaching practice provides students with the opportunity to capitalize on the theoretical work provided during their studies. Students will be able to integrate theory and practice in the classroom setting when they are attached to schools to have teaching practice. Students will compile a Teaching Practice Portfolio which promotes reflection and a critical awareness of their teaching. Completion of ‘School Experience’, during which students observe classroom teaching and school life in general, is a prerequisite for this course.", "outcome": "By the end of this course, students will be able to:\r 1. Integrate and apply knowledge and skills acquired and developed in the programme in designing lessons and teaching these lessons in the classroom;  2. Use language effectively in the classroom for teaching purposes;  3. Analyse critically their performance in teaching;  4. Demonstrate an understanding of the professional roles of a teacher in the classroom and in the school", "syllabus": "For reference only, please refer to the course outline of respective instructor for details", "required_readings": "Required readings (if any) would depend on individual instructors", "recommended_readings": "Recommended readings would depend on individual instructors\r 1. Adams Bullock, A. and Hawk, P.P. (2001). Developing a teaching portfolio: A guide for preservice and practicing teachers. Upper Saddle River, N.J.: Merrill Prentice Hall. \r 2. Goethals, M. S, Howard, R. A. and Sanders, M.M. (2004). Student Teaching: A process approach to reflective practice : A guide for preservice and inservice teachers (2nd Edition). Upper Saddle River, N.J.: Pearson/Merrill/Prentice Hall.", "terms": {"2020-21 Term 2": {"AF01-FLD (4698)": {"startTimes": ["13:30", "8:30", "8:30", "8:30", "8:30", "8:30"], "endTimes": ["18:15", "11:15", "18:15", "18:15", "18:15", "18:15"], "days": [5, 5, 2, 1, 4, 3], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric"], "meetingDates": ["12/3", "19/3", "26/3", "12/3", "19/3", "26/3", "9/3", "16/3", "23/3", "8/3", "15/3", "22/3", "11/3", "18/3", "25/3", "10/3", "17/3", "24/3"]}, "BF01-FLD (4699)": {"startTimes": ["13:30", "8:30", "8:30", "8:30", "8:30", "8:30"], "endTimes": ["18:15", "11:15", "18:15", "18:15", "18:15", "18:15"], "days": [5, 5, 4, 1, 2, 3], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Professor TSANG Wai Chung", "Professor TSANG Wai Chung", "Professor TSANG Wai Chung", "Professor TSANG Wai Chung", "Professor TSANG Wai Chung", "Professor TSANG Wai Chung"], "meetingDates": ["12/3", "19/3", "26/3", "12/3", "19/3", "26/3", "8/4", "15/4", "22/4", "8/3", "15/3", "22/3", "9/3", "16/3", "23/3", "10/3", "17/3", "24/3"]}, "CF01-FLD (4700)": {"startTimes": ["13:30", "8:30", "8:30", "8:30", "8:30", "8:30"], "endTimes": ["18:15", "11:15", "18:15", "18:15", "18:15", "18:15"], "days": [5, 5, 2, 3, 4, 1], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Dr. WAN Wai Yan", "Dr. WAN Wai Yan", "Dr. WAN Wai Yan", "Dr. WAN Wai Yan", "Dr. WAN Wai Yan", "Dr. WAN Wai Yan"], "meetingDates": ["12/3", "19/3", "26/3", "12/3", "19/3", "26/3", "9/3", "16/3", "23/3", "10/3", "17/3", "24/3", "11/3", "18/3", "25/3", "8/3", "15/3", "22/3"]}, "DF01-FLD (8477)": {"startTimes": ["8:30", "13:30", "8:30", "8:30", "8:30", "8:30"], "endTimes": ["11:15", "18:15", "18:15", "18:15", "18:15", "18:15"], "days": [5, 5, 4, 1, 2, 3], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Dr. CHAN Yip Cheung", "Dr. CHAN Yip Cheung", "Dr. CHAN Yip Cheung", "Dr. CHAN Yip Cheung", "Dr. CHAN Yip Cheung", "Dr. CHAN Yip Cheung"], "meetingDates": ["12/3", "19/3", "26/3", "12/3", "19/3", "26/3", "11/3", "18/3", "25/3", "8/3", "15/3", "22/3", "9/3", "16/3", "23/3", "10/3", "17/3", "24/3"]}}, "2021-22 Term 2": {"AF01-FLD (7048)": {"startTimes": ["8:30", "13:30", "8:30", "8:30", "8:30", "8:30"], "endTimes": ["11:15", "18:15", "18:15", "18:15", "18:15", "18:15"], "days": [5, 5, 1, 4, 2, 3], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Professor WONG Yu Ka", "Professor WONG Yu Ka", "Professor WONG Yu Ka", "Professor WONG Yu Ka", "Professor WONG Yu Ka", "Professor WONG Yu Ka"], "meetingDates": ["11/3", "18/3", "25/3", "11/3", "18/3", "25/3", "7/3", "14/3", "21/3", "28/3", "10/3", "17/3", "24/3", "31/3", "8/3", "15/3", "22/3", "29/3", "9/3", "16/3", "23/3", "30/3"]}, "BF01-FLD (7049)": {"startTimes": ["8:30", "13:30", "8:30", "8:30", "8:30", "8:30"], "endTimes": ["11:15", "18:15", "18:15", "18:15", "18:15", "18:15"], "days": [5, 5, 1, 2, 3, 4], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Professor TSANG Wai Chung", "Professor TSANG Wai Chung", "Professor TSANG Wai Chung", "Professor TSANG Wai Chung", "Professor TSANG Wai Chung", "Professor TSANG Wai Chung"], "meetingDates": ["11/3", "18/3", "25/3", "11/3", "18/3", "25/3", "7/3", "14/3", "21/3", "28/3", "8/3", "15/3", "22/3", "29/3", "9/3", "16/3", "23/3", "30/3", "10/3", "17/3", "24/3", "31/3"]}, "CF01-FLD (7050)": {"startTimes": ["8:30", "13:30", "8:30", "8:30", "8:30", "8:30"], "endTimes": ["11:15", "18:15", "18:15", "18:15", "18:15", "18:15"], "days": [5, 5, 1, 2, 3, 4], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Dr. WAN Wai Yan", "Dr. WAN Wai Yan", "Dr. WAN Wai Yan", "Dr. WAN Wai Yan", "Dr. WAN Wai Yan", "Dr. WAN Wai Yan"], "meetingDates": ["11/3", "18/3", "25/3", "11/3", "18/3", "25/3", "7/3", "14/3", "21/3", "28/3", "8/3", "15/3", "22/3", "29/3", "9/3", "16/3", "23/3", "30/3", "10/3", "17/3", "24/3", "31/3"]}, "DF01-FLD (6743)": {"startTimes": ["8:30", "13:30", "8:30", "8:30", "8:30", "8:30"], "endTimes": ["11:15", "18:15", "18:15", "18:15", "18:15", "18:15"], "days": [5, 5, 2, 3, 4, 1], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Dr. CHAN Yip Cheung", "Dr. CHAN Yip Cheung", "Dr. CHAN Yip Cheung", "Dr. CHAN Yip Cheung", "Dr. CHAN Yip Cheung", "Dr. CHAN Yip Cheung"], "meetingDates": ["11/3", "18/3", "25/3", "11/3", "18/3", "25/3", "8/3", "15/3", "22/3", "29/3", "9/3", "16/3", "23/3", "30/3", "10/3", "17/3", "24/3", "31/3", "7/3", "14/3", "21/3", "28/3"]}}}}, {"code": "4040", "title": "Teaching Practice II", "career": "Undergraduate", "units": "5.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "Not for students who have taken EDUC4020", "description": "The second block of teaching practice to be held in the final year of study further enhances students' understanding of school life and their teaching competence. The Teaching Practice Portfolio which students compile documents their professional development as student teachers in addition to developing a critical awareness of their teaching, teaching beliefs and teaching philosophy.", "outcome": "By the end of this course, students will be able to:\r 1. Integrate and apply knowledge and skills acquired and developed in the programme in designing lessons and teaching these lessons in the classroom;  2. Use language effectively in the classroom for teaching purposes;  3. Analyse critically their performance in teaching;  4. Demonstrate an understanding of the professional roles of a teacher in the classroom and in the school", "syllabus": "For reference only, please refer to the course outline of respective instructor for details", "required_readings": "Required readings (if any) would depend on individual instructors", "recommended_readings": "Recommended readings would depend on individual instructors\r 1. Adams Bullock, A. and Hawk, P.P. (2001). Developing a teaching portfolio: A guide for preservice and practicing teachers. Upper Saddle River, N.J.: Merrill Prentice Hall. \r 2. Goethals, M. S, Howard, R. A. and Sanders, M.M. (2004). Student Teaching: A process approach to reflective practice : A guide for preservice and inservice teachers (2nd Edition). Upper Saddle River, N.J.: Pearson/Merrill/Prentice Hall", "terms": {"2020-21 Term 1": {"AF01-FLD (7215)": {"startTimes": ["13:30", "8:30", "8:30", "8:30", "8:30"], "endTimes": ["18:15", "18:15", "18:15", "18:15", "18:15"], "days": [5, 1, 4, 2, 3], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric"], "meetingDates": ["6/11", "13/11", "20/11", "27/11", "4/12", "2/11", "9/11", "16/11", "23/11", "30/11", "5/11", "12/11", "19/11", "26/11", "3/12", "3/11", "10/11", "17/11", "24/11", "1/12", "4/11", "11/11", "18/11", "25/11", "2/12"]}, "BF01-FLD (4610)": {"startTimes": ["13:30", "8:30", "8:30", "8:30", "8:30"], "endTimes": ["18:15", "18:15", "18:15", "18:15", "18:15"], "days": [5, 1, 2, 3, 4], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Professor Scott Charles AUBREY", "Professor Scott Charles AUBREY", "Professor Scott Charles AUBREY", "Professor Scott Charles AUBREY", "Professor Scott Charles AUBREY"], "meetingDates": ["6/11", "13/11", "20/11", "27/11", "4/12", "2/11", "9/11", "16/11", "23/11", "30/11", "3/11", "10/11", "17/11", "24/11", "1/12", "4/11", "11/11", "18/11", "25/11", "2/12", "5/11", "12/11", "19/11", "26/11", "3/12"]}, "CF01-FLD (6037)": {"startTimes": ["8:30", "8:30", "8:30", "8:30", "8:30", "13:30"], "endTimes": ["18:15", "18:15", "18:15", "18:15", "11:15", "18:15"], "days": [1, 2, 3, 4, 5, 5], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Professor LAU Kwok Chi", "Professor LAU Kwok Chi", "Professor LAU Kwok Chi", "Professor LAU Kwok Chi", "Professor LAU Kwok Chi", "Professor LAU Kwok Chi"], "meetingDates": ["2/11", "9/11", "16/11", "23/11", "30/11", "3/11", "10/11", "17/11", "24/11", "1/12", "4/11", "11/11", "18/11", "25/11", "2/12", "5/11", "12/11", "19/11", "26/11", "3/12", "6/11", "13/11", "20/11", "27/11", "4/12", "6/11", "13/11", "20/11", "27/11", "4/12"]}, "DF01-FLD (5698)": {"startTimes": ["8:30", "8:30", "8:30", "8:30", "8:30", "13:30"], "endTimes": ["18:15", "18:15", "18:15", "18:15", "11:15", "18:15"], "days": [1, 2, 3, 4, 5, 5], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Dr. CHAN Yip Cheung", "Dr. CHAN Yip Cheung", "Dr. CHAN Yip Cheung", "Dr. CHAN Yip Cheung", "Dr. CHAN Yip Cheung", "Dr. CHAN Yip Cheung"], "meetingDates": ["2/11", "9/11", "16/11", "23/11", "30/11", "3/11", "10/11", "17/11", "24/11", "1/12", "4/11", "11/11", "18/11", "25/11", "2/12", "5/11", "12/11", "19/11", "26/11", "3/12", "6/11", "13/11", "20/11", "27/11", "4/12", "6/11", "13/11", "20/11", "27/11", "4/12"]}}, "2021-22 Term 1": {"AF01-FLD (5321)": {"startTimes": ["8:30", "8:30", "8:30", "8:30", "13:30"], "endTimes": ["18:15", "18:15", "18:15", "18:15", "18:15"], "days": [1, 4, 2, 3, 5], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric", "Dr. NG Mau Yuen Eric"], "meetingDates": ["1/11", "8/11", "15/11", "22/11", "29/11", "4/11", "11/11", "18/11", "25/11", "2/12", "2/11", "9/11", "16/11", "23/11", "30/11", "3/11", "10/11", "17/11", "24/11", "1/12", "5/11", "12/11", "19/11", "26/11", "3/12"]}, "BF01-FLD (5324)": {"startTimes": ["8:30", "8:30", "8:30", "8:30", "13:30"], "endTimes": ["18:15", "18:15", "18:15", "18:15", "18:15"], "days": [1, 2, 3, 4, 5], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Professor Scott Charles AUBREY", "Professor Scott Charles AUBREY", "Professor Scott Charles AUBREY", "Professor Scott Charles AUBREY", "Professor Scott Charles AUBREY"], "meetingDates": ["1/11", "8/11", "15/11", "22/11", "29/11", "2/11", "9/11", "16/11", "23/11", "30/11", "3/11", "10/11", "17/11", "24/11", "1/12", "4/11", "11/11", "18/11", "25/11", "2/12", "5/11", "12/11", "19/11", "26/11", "3/12"]}, "CF01-FLD (5328)": {"startTimes": ["8:30", "8:30", "8:30", "8:30", "8:30", "13:30"], "endTimes": ["18:15", "18:15", "18:15", "18:15", "11:15", "18:15"], "days": [1, 2, 3, 4, 5, 5], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Professor LAU Kwok Chi", "Professor LAU Kwok Chi", "Professor LAU Kwok Chi", "Professor LAU Kwok Chi", "Professor LAU Kwok Chi", "Professor LAU Kwok Chi"], "meetingDates": ["1/11", "8/11", "15/11", "22/11", "29/11", "2/11", "9/11", "16/11", "23/11", "30/11", "3/11", "10/11", "17/11", "24/11", "1/12", "4/11", "11/11", "18/11", "25/11", "2/12", "5/11", "12/11", "19/11", "26/11", "3/12", "5/11", "12/11", "19/11", "26/11", "3/12"]}, "DF01-FLD (5329)": {"startTimes": ["8:30", "8:30", "8:30", "8:30", "8:30", "13:30"], "endTimes": ["18:15", "18:15", "18:15", "18:15", "11:15", "18:15"], "days": [1, 2, 3, 4, 5, 5], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Professor CHIU Kin Fung", "Professor CHIU Kin Fung", "Professor CHIU Kin Fung", "Professor CHIU Kin Fung", "Professor CHIU Kin Fung", "Professor CHIU Kin Fung"], "meetingDates": ["1/11", "8/11", "15/11", "22/11", "29/11", "2/11", "9/11", "16/11", "23/11", "30/11", "3/11", "10/11", "17/11", "24/11", "1/12", "4/11", "11/11", "18/11", "25/11", "2/12", "5/11", "12/11", "19/11", "26/11", "3/12", "5/11", "12/11", "19/11", "26/11", "3/12"]}}}}, {"code": "4110", "title": "Design and Implementation of Student Activities (DISA)", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "Contrary to common belief, student activities are not “supplementary” to school curriculum. They comprise an indispensable part of the school curriculum and often a significant part of students’ memories of school life. As the Hong Kong school curriculum evolves, greater significance is attached to extra-curricular, academic, cross-curricular, integrated curricular and life-wide learning activities. Organizing student activities is an integral duty of educators nowadays, and it is a pre-requisite that they know how to design and implement student activities that are both safe and meaningful.This course aims to equip students with knowledge and skills required in design and implementation of student activities. The ultimate goal is to enhance both the processes and outcomes of student activities in the school curriculum and meet educational expectations on student learning through activities. Another aim is to heighten students’ awareness of safety and insurance issues in risk assessment through class activities.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4130", "title": "Information Technology in Education", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "DiscussionLectureOthersProject", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "Not for students who have taken EDUC4120.", "description": "The rapid development of information technology brings new educational opportunities to students and teachers. This course aims to equip participants with both pedagogical knowledge and technical skills to integrate IT into the process of learning and teaching in school contexts.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4131", "title": "e-Learning in Schools", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "DiscussionLectureOthersProject", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "Not for students who have taken EDUC4130.", "description": "The rapid development of information technology (IT) brings new e-Learning opportunities to students. This course aims to develop participants’ ability to apply IT in education and design e-Learning activities in school contexts. Apart from gaining pedagogical knowledge and technological skills for leveraging IT to facilitate face-to-face teaching and self-directed learning, participants will work in groups to innovate inside- and/or outside-the-classroom activities with e-Learning strategies for addressing various educational needs or challenges in schools. The e-Learning strategies to be covered in the course include multimedia-enhanced learning, mobile learning, flipped classroom, computer-supported collaborative learning, as well as web-based inquiry learning.", "outcome": "By the end of this course, students will be able to:\r 1. gain pedagogical knowledge and technological skills related to e-Learning; 2. apply various e-Learning strategies to support face-to-face teaching and self-directed learning;  3. analyse and evaluate the strengths and weaknesses of various e-Learning strategies with respect to different educational contexts;  4. innovate and design inside-/ outside-the-classroom e-Learning activities and resources that address different educational needs and challenges in schools; 5. realize the importance of collaboration in the learning process with sharpened collaboration skills.", "syllabus": "For reference only, please refer to the course outline of respective instructor for details\r • Multimedia-enhanced learning\r • Mobile learning\r • Flipped classroom \r • Computer-supported collaborative learning\r • Web-based inquiry learning", "required_readings": "Required readings (if any) would depend on individual instructors", "recommended_readings": "Recommended readings would depend on individual instructors\r • Angeli, C., & Valanides, N. (Eds.). (2014). Technological pedagogical content knowledge: Exploring, developing, and assessing TPCK. Heidelberg: Springer.\r • Bergmann, J., & Sams, A. (2014). Flipped learning: Gateway to student engagement. Eugene, OR: International Society for Technology in Education.\r • Howland, J. L., Jonassen, D., & Marra, R. M. (2012). Meaningful learning with technology (4th ed.). New York: Pearson.\r • Hwang, G. J., Lai, C. L., & Wang, S. Y. (2015). Seamless flipped learning: A mobile technology-enhanced flipped classroom with effective learning strategies. Journal of Computers in Education, 2(4), 449–473.\r • Jang, S., Vitale, J. M., Jyung, R. W., & Black, J. B. (2017). Direct manipulation is better than passive viewing for learning anatomy in a three-dimensional virtual reality environment. Computers & Education, 106, 150-165.\r • Jong, M. S. Y. (2016). Teachers’ concerns about adopting constructivist online game-based learning informal curriculum teaching. British Journal of Educational Technology, 47(4), 601–617.\r • Jong, M. S. Y. (2017). Empowering students in the process of social inquiry learning through flipping the classroom. Educational Technology & Society, 20(1), 306–322.\r • Jong, M. S. Y., Chan, T., Hue, M. T., & Tam, V. (2018). Gamifying and mobilising social enquiry‐based learning in authentic outdoor environments. Educational Technology & Society, 21(4), 277–292.\r • Koh, J. H. L., Chai, C. S., Wong, B., & Hong, H. Y. (2015). Design thinking for education: Conceptions and applications in teaching and learning. Singapore: Springer.\r • Mayer, R. (2009). Multimedia learning (2nd ed.). New York: Cambridge University Press.\r • Mayer, R. E. (Ed.). (2014). The Cambridge Handbook of Multimedia Learning. New York: Cambridge University Press.\r • Pachler, N., Bachmair, B., & Cook, J. (2013). A sociocultural ecological frame for mobile learning. In Z. L. Berge & L. Y. Muilenburg (Eds), Handbook of mobile learning (pp. 35– 46). New York: Routledge.\r • Prensky, M. (2012). From digital natives to digital wisdom. Thousand Oaks, CA: Corwin.\r • Razzouk, R., & Shute, V. (2012). What is design thinking and why is it important? Review of Educational Research, 82(3), 330–348.\r • Tsai, Y. L., & Tsai, C. C. (2018). Digital game-based second-language vocabulary learning and conditions of research designs: A meta-analysis study. Computers & Education, 125, 345–357\r • Wrigley, C., & Straker, K. (2017). Design thinking pedagogy: The educational design ladder. Innovations in Education and Teaching International, 54(4), 374–385.", "terms": {"2020-21 Term 2": {"--LEC (6218)": {"startTimes": ["9:30", "9:30"], "endTimes": ["11:15", "11:15"], "days": [3, 5], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor CHIU Kin Fung", "Professor CHIU Kin Fung"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2", "15/1", "22/1", "29/1", "5/2"]}}, "2021-22 Term 2": {"--LEC (6648)": {"startTimes": ["9:30", "9:30"], "endTimes": ["11:15", "11:15"], "days": [3, 5], "locations": ["Sino Building 614", "Sino Building 614"], "instructors": ["Professor CHIU Kin Fung", "Professor CHIU Kin Fung"], "meetingDates": ["12/1", "19/1", "26/1", "14/1", "21/1", "28/1"]}}}, "assessments": {"Essays": "20", "Others": "20", "Project": "60"}}, {"code": "4210", "title": "Teachers and the Teaching Profession", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "The course examines two significant themes in teaching – the nature of teaching as work and the actors involved in it. Topics include: the meaning of teacher work, the professionalization of teaching, the contribution of teacher professionalism to improving education, and the cultures of teachers as persons and as professionals.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4310", "title": "Designing and Implementing Classroom Assessments", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "This course aims to assist students to master the basic knowledge, skills and value judgment that are essential to effective classroom assessment in teaching different school subjects. It starts tracing the historical developments of student assessment and the thoughts behind the changes, particularly in the context of Hong Kong. With the background, the significant concepts and principles of educational assessment and measurement are explicated, including those about validity, reliability, instructional utility, criterion-reference and norm-reference assessment, and formative and summative assessment, relationships between curriculum, assessment, and learning, and teachers’ and students’ roles in classroom assessment. It then evaluates the utilities and the limitations of various assessment formats for assessing student attainments including knowledge, skills and behaviors. The assessment formats include the traditional ones (e.g., multiple-choice questions, short answers, essays), the alternative ones (e.g., portfolios, performance assessments; self and peer assessment, group assessment), and the types of assessment rubrics (holistic or analytic; generalized or task specific) used for evaluating student performance on the alternative assessments.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4320", "title": "Classroom Management and School Discipline", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "ClassworkDiscussionIndependent StudyLecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "The course is designed to familiarize students with both the theoretical and the practical aspects of classroom management and school discipline. It also aims at assisting teachers to promote an optimum learning environment and to encourage the development of self-discipline among students. Topics include: organizational perspective of discipline, group dynamics, management skills in context, student-teacher relationship, school rules and organization policies, coordination between discipline and guidance, home-school partnership and whole school discipline.\r", "outcome": "By the end of this course, students will be able to:\r 1. state the characteristics and purposes of the selected conceptual and theoretical models on classroom management and school discipline; 2. identify the factors affecting the positive student-teacher relationship development in the classroom and in school; 3. be aware of personal strengths and limitations as a teacher in the subject of classroom management; 4. acquire skills to build a strong and positive student-teacher rapport as well as to promote an environment of optimal learning in the classroom; and \r 5. develop effective strategies to promote self-discipline and positive behaviors among primary students.", "syllabus": "For reference only, please refer to the course outline of respective instructor for details\r  Topics:\r Introduction and Reflection\r Understand your students’ needs \r  Kounin Model\r  Rogerian Model\r  Ginott Model\r  Dreikurs Model\r  Glasser Reality Model\r  Canter Model\r  You can’t do it alone\r Continuous development of the “SELF”\r  Peer-Evaluation in class\r Resources for expanding horizons\r  Course Evaluation", "required_readings": "Required readings (if any) would depend on individual instructors\r Charles, C. M. (1981). Building classroom discipline: from models to practice. New York: Longman. (Also available in Chinese: 金樹人(編譯)。(1994)。《敎室裡的春天 : 敎室管理的科學與藝術》。台北市: 張老師文化事業股份有限公司。)", "recommended_readings": "Recommended readings would depend on individual instructors\r Kounin Model\r Kounin, J. (1971, 1977). Discipline and group management in classrooms. New York: Holt, Rinebart and Winston.\r Kounin, J. & Gump, P. V. (1958). The ripple effect in discipline. The Elementary School Journal. Vol. 59, No.3 (pp.158-162)\r  Ginott Model\r Ginott, H. G. (1993). Teacher and child: a book for parents and teachers. New York: Maxwell Macmillan International. (Also available in Chinese:\r 許麗玉(譯)。(1977)。《老師怎樣跟學生說話》。香港: 光華書局。\r 许丽玉(译)。(1989)。《敎育孩子的谈话艺朮: 献给敎师和父母》。北京: 世界图书出版公司。\r 許純欣(譯)。(1992)。《師生之間》。 香港: 基督敎文藝出版社。\r 許麗美﹑許麗玉(譯)。(2001)。《老師如何跟學生說話: 親師與孩子的溝通技巧》。台北市:心理出版社股份有限公司。)\r Ginott, H. G. (1969). Between parent and teenager. New York: Macmillan. (Also available in Chinese: \r 伍惠亞(譯)。(1972)。《了解現代少年》。香港 : 基督教文藝出版社。\r 張天溥﹑姚宜瑛(譯)。(1994)。《父母怎樣管敎靑少年》。臺北 : 大地出版社。)\r  Dreikurs Model\r Dreikurs, R., Cassel, P., & Ferguson, E. D. (2004). Discipline without tears: how to reduce conflict and establish cooperation in the classroom. John Wiley & Sons Canada.\r Dreikurs, R., Grunwald, B. B. & Pepper, F. C. (1982). Maintaining sanity in the classroom: classroom management techniques. New York: HarperCollins. (Also available in Chinese: 曾端眞﹑曾玲珉(譯)。(2002)。《班級經營與兒童輔導》。台北市: 天馬文化事業有限公司。)\r  Glasser Model\r Glasser, W. (1975). Schools without failure. New York: Perennial Library. (Also available in Chinese: 唐曉杰(譯)。(1998)。《沒有失敗的學校》。臺北市: 桂冠圖書股份有限公司。)\r Glasser, W. (1998a). The quality school: managing students without coercion. New York: HarperPerennial.\r Glasser, W. (1998b). The quality school teacher: specific suggestions for teachers who are trying to implement the lead-management ideas of the quality school in their classrooms. New York: HarperCollins.\r Glasser, W. (1998c). Choice theory in the classroom. New York: Harper Perennial.\r Glasser, W. (2001). Every student can succeed. Chatsworth, CA: William Glasser Incorporated.\r  Canter Model\r Canter, L. (1994). Lee Canter's assertive discipline. Teacher's plan book plus. Santa Monica, Calif. : Lee Canter & Associates.\r Canter, L. (1995). Lee Canter's positive parent involvement kit: strategies for increasing communication and cooperation between teachers and families. Santa Monica, CA: Lee Canter & Associates.\r Canter, L. (2010). Lee Canter's assertive discipline: positive behavior management for today's classroom. Bloomington, IN: Solution Tree Press.\r Canter, L., & Canter, M. (1989). Assertive discipline. Resource materials workbook, elementary, K-6. Santa Monica, Calif: Canter and Associates.\r Canter, L., & Canter, M. (1993a). Succeeding with difficult students [videorecording]: new strategies for reaching your most challenging students. Santa Monica, CA: Lee Canter & Association, Inc.\r Canter, L., & Canter, M. (1993b). Assertive discipline inservice video package: positive behavior management for today's classroom [videorecording]. Santa Monica, CA: Lee Canter & Associates.\r Canter, L., & Canter, M. (1993c). Succeeding with difficult students [workbook] : [new strategies for reaching your most challenging students] / Lee Canter and Associates presents.\r Canter, L., & Canter, M. (1993d). Succeeding with difficult students [Leader’s Manual] : [new strategies for reaching your most challenging students] / Lee Canter and Associates presents.\r Canter, L., & Canter, M. (1995). Behavior management in the middle school classroom : a teacher's guide to meeting the special challenges of early adolescents. Santa Monica, CA : Canter & Associates.\r Canter, L., & Canter, M. (2001). Assertive discipline: positive behavior management for today's classroom. Los Angeles, CA: Canter & Associates.\r Canter, L., & Canter, M. (2001). Parents on your side: a teacher's guide to creating positive relationships with parents. Los Angeles, Calif. : Canter & Associates.\r  Bianco, A. (2002). One-minute discipline: Classroom management strategies that work. Jossey-Bass A Wiley Company.\r Cangelosi, J. S. (2004). Classroom management strategies: gaining and maintaining students' cooperation. Hoboken, N.J.: Wiley.\r Chan, C. C., Chan, K. Y., Cheung, W. M., Ngan, M. Y., & Yeung, V. M. (1992). Primary school teacher self-concept: Its relationship with teacher behaviors and students’ educational outcomes. Journal of Primary Education, 3(1),9-28.\r Charles, C. M. (2005). Building classroom discipline (8th ed). MA:Boston: Pearson/Allyn and Bacon.\r Charles, C. M., & Senter, G. W. (2005). Elementary classroom management (4th ed.). Boston: Pearson/Allyn and Bacon.\r Charles, C. M. (2014). Building classroom discipline (11th ed). Pearson Education, Inc.\r Charney, R. S. (1991). Teaching children to care: management in the responsive classroom. Greenfield, MA: Northeast Foundation for Children.\r Charney, R. S. (2002). Teaching children to care : classroom management for ethical and academic growth, K-8. Greenfield, MA : Northeast Foundation for Children. (Also available in Chinese: 辛蒂。查妮(譯) 。(2005) 。《教孩子關心 : 美德和學業成長的課室管理K-8》。郭妙芳台北縣中和市 : 光佑文化事業股份有限公司。)\r Denti L.G. (2012). Proactive classroom management, K-8 : a practical guide to empower students and teachers. Thousand Oaks, Calif. : Corwin.\r Evertson, C. M., Emmer, E. T., & Worsham, M. E. (2006). Classroom management for elementary teachers (7th ed.). Boston: Pearson/Allyn and Bacon.\r Fontana, D. (1994). Managing classroom behaviour. Leicester, United Kingdom: British Psychological Society. (Also available in Chinese: 李彥(譯)。(2000)。《課室管理技巧》。香港：中文大學出版社。)\r Glasgow, N. A., & Hicks, C.D. (2008). What successful teachers do: 91 research-based classroom strategies for new and veteran teachers. (Also available in Chinese: 杜宜展(譯)。(2008) 。《如何成為成功的教師 : 以研究為基礎的91個班級經營策略》。台北市 : 心理出版社股份有限公司。)\r Gordon, T. (1980). Teaching children self-discipline--at home and at school. New York: Times Books.\r Gordon, T. (1994). T.E.T.: Teacher effectiveness training. New York: Peter H. Wyden. (Also available in Chinese: 歐申談(譯)。(1993)。《教師效能訓練》。三重: 新雨出版社。)\r Henley M. (2000). Classroom management : a proactive approach (2nd ed).. Boston : Pearson\r Hook P. & Vass A. (2000a). Confident classroom leadership. London : David Fulton. \r Hook P. & Vass A. (2000b). Creating winning classrooms. London : David Fulton.\r Hue, M. K., & Li, W. S. (2008). Classroom management: creating a positive learning environment. Hong Kong University Press.\r Jones, V. F., & Jones, L. S. (1981). Responsible classroom discipline : creating positive learning environments and solving problems. Boston: Allyn and Bacon.\r Jones, V. F., & Jones, L.S. (2010). Comprehensive classroom management: creating communities of support and solving problems (9th ed). Upper Saddle River, N.J.: Merrill.\r Katafiasz, K. (1997). Teacher therapy. St. Meinrad, Ind.: One Caring Place. (Also available in Chinese: 林鶯(譯)。(1998)。《寶貝你的學生》。台灣：台灣張老師出版社。)\r Kauffman, J.M. (2011). Managing classroom behavior: a reflective case-based approach (5th ed.).Upper Saddle River, N.J.: Pearson Education.\r Levin, J., & Nolan, J. F. (2010). Principles of classroom management: a professional decision-making model (6th ed.). Boston: Pearson.\r Manning, M. L., & Bucher, K. T. (2003). Classroom management: models, applications, and cases. Upper Saddle River, N.J.: Merrill.\r Nelsen, J., Lott, L., & Glenn, H. S. (2000). Positive discipline in the classroom: developing mutual respect, cooperation, and responsibility in your classroom. Rooseville, Calif.: Prima Pub. \r Petty, R. (2001). Classroom management: a resource manual for frontline teachers. Lanham, MD: Scarecrow Press.\r Phifer, S. J. (2002). Setting up and facilitating student-centered classrooms. Lanham, Md.: Scarecrow Education.\r Pierangelo, R., & Giuliani, G. (2008). Classroom management techniques for students with ADHD. Thousand Oaks, CA: Corwin Press.\r Rogers, C.R., & Freiberg, H. J. (1994). Freedom to learn (3rd ed.). New York: Merrill; Toronto: Maxwell Macmillan Canada.\r Wolfgang, C.H. (2009). Solving discipline and classroom management problems: methods and models for today's teachers (7th ed.). Hoboken, NJ: John Wiley & Sons.\r Wong, H.K., & Wong, R.T. (1998). The first days of school: how to be an effective teacher. Mountainview, CA: Harry K. Wong Publications.\r 洪進華, 彭可兒著。(2007)。《70個教學實務錦囊》。香港：匯智出版有限公司。\r 何仲廉。(2008)。《告別混亂課室：行為心理學與課室秩序》。香港：文林出版有限公司。\r 何仲廉, 梁展鵬著。(2000)。《課室行為改造ABC》。香港：出版者不詳。\r 林孟平。(1984)。〈師生關係：學校教育的關鍵〉。《香港中文大學教育學報》。十二卷二期，頁18-23。\r 周朱瑞華。(1996)。《有效課室管理70式》。香港：香港教育圖書公司。\r 趙志成﹑陳漢森。(1996)。《教師加油站》。香港：香港教育圖書公司。\r 龐念安。(1996)。《情濃訓導室》。香港：突破出版社。\r 冼權鋒編。(1999)。《營建融洽有序的學習環境：課室管理 — 建立常規》。香港：仁濟醫院﹑教育評議會。\r 吳仰明編。(1999)。《營建融洽有序的學習環境：課室管理 — 奬賞有方》。香港：仁濟醫院﹑教育評議會。\r 李立志編。(1999)。《營建融洽有序的學習環境：課室管理 —懲罰有道》。香港：仁濟醫院﹑教育評議會。\r 冼權鋒﹑吳仰明﹑李立志合編。(1999)。《教師語態調查報告》。香港：仁濟醫院﹑教育評議會。\r 蕭寧波。(2000)。〈五個印花可以換甚麼？〉。《亞洲輔導學報》。第七卷一期，頁53-63。\r 蕭寧波。(2002)。〈懲罰以外〉。《亞洲輔導學報》。第九卷一及二期，頁69-81。\r 阿濃。(2000) 。《新愛的敎育》。香港 : 突破出版社。\r 簡女貞。(2007) 。《老師的十二樣見面禮》。台北縣中和市 : 印刻出版有限公司。\r 許明得﹑李偉成。(2008)。《有效課堂管理 : 營造積極學習氣氛》。香港 : 香港大學出版社。\r  Useful Website: http://www.educationworld.com/a_curr/archives/classmanagement.shtml", "terms": {"2020-21 Term 2": {"--LEC (8482)": {"startTimes": ["11:30", "11:30"], "endTimes": ["13:15", "13:15"], "days": [2, 4], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Ms. NG Ka Chun", "Ms. NG Ka Chun"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2", "14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 1": {"--LEC (5330)": {"startTimes": ["14:30", "14:30"], "endTimes": ["16:15", "16:15"], "days": [3, 1], "locations": ["Esther Lee Bldg LT3", "Yasumoto Int'l Acad Park LT7"], "instructors": ["Ms. NG Ka Chun", "Ms. NG Ka Chun"], "meetingDates": ["8/9", "15/9", "6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10"]}}}, "assessments": {"Essays": "50", "Others": "20", "Presentation": "20", "Participation": "10"}}, {"code": "4330", "title": "School Guidance and Counselling", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "ClassworkDiscussionExerciseLaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "The course aims to explore different kinds of guidance services and their functions, and to promote guidance activities in schools in Hong Kong. The course content includes: (1) history and aims of guidance; (2) what is guidance and counselling?; (3) major dimensions in school guidance; (4) the importance of teacher counsellor as a person; (5) basic counselling theories, attitudes and techniques; (6) individual and group counselling; (7) coordination of guidance and discipline; (8) whole school approach to guidance; (9) home-school partnership; and (10) referral counselling and consultation services.\r", "outcome": "By the end of this course, students will be able to:\r 1. Demonstrate an understanding of the basic objectives of school guidance and counseling.\r 2. Identify various roles and functions of teachers in school guidance and counseling.\r 3. Gain knowledge of major counseling theories and use them as a guide to understand the social and emotional needs of students. \r 4. Apply basic counselling skills and interventions to work with students and their families in dealing with students’ socioemotional issues.\r 5. Improve self-awareness and self-care as a person to engage in more reflective and effective teaching and helping.", "syllabus": "For reference only, please refer to the course outline of respective instructor for details\r Basic counselling skills, major theories of counselling, roles and functions of teachers, assessment and types of student concerns, objectives of student guidance and counselling.", "required_readings": "Required readings (if any) would depend on individual instructors\r Kottler, J.A., & Kottler, E. (2007). Counseling skills for teachers (2nd ed.). Thousand Oaks, CA: Corwin Press. (Reissued in 2015 by Skyhorse publishing)\r Also available in Chinese: 孫守湉、林秀玲(譯),許維素(校)(2011) 。教師諮商技巧 (第二版)。 台灣：心理出版社。", "recommended_readings": "Recommended readings would depend on individual instructors\r Chen, P.-W. (2009). A counseling model for self-relation coordination for Chinese clients with interpersonal conflicts. The Counseling Psychologist, 37, 987-1009.\r Gysbers, N. C. (2000). Implementing a whole school approach to guidance through a comprehensive guidance system. Asian Journal of Counselling, 7 (2), 5-17.\r Hill, C. E. (2014). Helping skills: Facilitating exploration, insight, and action (4th ed.). Washington DC: American Psychological Association.\r Hue, M.-T. (2007) The relationships between school guidance and discipline: critical contrasts in two Hong Kong secondary schools, Educational Review, 59(3), 343-361.\r Luk-Fong, P. Y. Y. & Lee-Man, Y.C. (2011). School guidance and counseling: Trends and practices. HKU Press. (also available in Chinese: 陸方鈺儀、李文玉清 (2011)。學校輔導 – 趨勢與實務。 香港 : 香港大學出版社。) Note: The electronic version is available online at CUHK library.\r Rogers, C. R. (1995). On becoming a person: a therapist's view of psychotherapy. Boston: Houghton Mifflin.\r Yuen, M. T. (2006). School counseling in Hong Kong: History, policy, current implementation status, and future directions. In C. H. So (ed.), School counseling and career guidance (pp.44-70). University of Macau Faculty of Education.\r Yuen, M., Chan R.M.C., Lau, P. S.Y., Gysbers, N.C., & Shea, P.M.K. (2007). Comprehensive guidance and counselling programmes in the primary schools of Hong Kong: Teachers’ perceptions and involvement. Pastoral Care in Education: An International Journal of Personal, Social and Emotional Development, 25(4), 17-24.\r Yuen, M., Chan, R., Lau, P. S.Y., Yu, L., Chan R.M.C., Gysbers, N.C., & Shea, P. M.K. [袁文得､陳子康､劉兆瑛､于璐､陳茂釗､余文基](2010). Implementing the comprehensive guidance and counseling program in Hong Kong: High school teachers’ perspectives [全方位輔導計畫在香港的推行：高中老師的觀感]. Asian Journal of Counselling, 17(1-2), 61-79.\r 林孟平 (2012). 輔導與心理治療 (修訂版)。 香港：商務印書館。", "terms": {"2020-21 Term 1": {"--LEC (8483)": {"startTimes": ["14:30", "14:30"], "endTimes": ["16:15", "16:15"], "days": [1, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor LAM Yu Hin", "Professor LAM Yu Hin"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10"]}}, "2021-22 Term 2": {"--LEC (7925)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "12:15"], "days": [4, 2], "locations": ["Sir Run Run Shaw Hall", "Lee Shau Kee Archi Bldg G03"], "instructors": ["Professor LAM Yu Hin", "Professor LAM Yu Hin"], "meetingDates": ["13/1", "20/1", "27/1", "11/1", "18/1", "25/1"]}}}, "assessments": {"Essays": "30", "Participation": "10", "Report": "30", "Short answer test or exam": "15", "Selected response test or exam": "15"}}, {"code": "4340", "title": "Supporting Students with Special Educational Needs", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "DiscussionLectureProject", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "This course aims to provide students with theoretical foundations of selected areas of special needs and help them to understand possible learning difficulties children with these special needs would encounter. These areas of special needs include: 1) learning disabilities; 2) giftedness and talents; 3) autism spectrum disorder; 4) attention deficit hyperactivity disorder; and 5) emotional and behavioral disorders. For each kind of special need, students will learn its characteristics, causes, and provision of special education in Hong Kong. Besides, this course will also prepare students for developing essential intervention strategies and techniques to help children with learning difficulties. Students will also work in small groups, under the supervision of the instructor, to conduct case studies in order to strengthen their knowledge of the learning difficulties of selected groups of children.", "outcome": "By the end of this course, students will be able to:\r 1. acquire basic principles of identification and education of various types of special-needs children \r 2. have an understanding of provision of special education in Hong Kong \r 3. critically evaluate current issues related to the education of students with special educational needs\r 4. develop relevant intervention strategies to facilitate student development and enhance learning in primary school years", "syllabus": "For reference only, please refer to the course outline of respective instructor for details", "required_readings": "Required readings (if any) would depend on individual instructors\r Hallahan, D., Kauffman, J., Pullen, P.C. (2018). Exceptional learners: An introduction to Special Education (Fourteenth Edition). Pearson (ISBN: 978-0133570724). \r 林寶貴策畫主編；王欣宜、王淑娟、吳亭芳、沈慶盈、林寶貴、邱滿艷、陳明聰、黃志雄、廖華芳、蔣明珊、簡明建著 (2016).　特殊教育理論與實務（第五版）. 心理出版社.", "recommended_readings": "Recommended readings would depend on individual instructors\r Carpenter, B., Egerton, J., Cockbill, B., Bloom, T., Fotheringham, J., Rawson, H., & Thistlethwaite, J. (2015). Engaging learners with complex learning difficulties and disabilities: a resource book for teachers and teaching assistants. Abingdon, Oxon ; New York, NY : Routledge 2015\r Chan, D. W. (2003). Assessing adjustments problems of gifted students in Hong Kong: The development of the student adjustment problems inventory. Gifted Child Quarterly, 47(2), 107-117.\r Clark, B. (1997). Growing up gifted (5th Edition). Columbus: Merrill Publishing Company.\r DuPaul, G.J. & Stoner, G. (2014). ADHD in the schools: assessment and intervention strategies. New York: The Guilford Press.\r Hirschland, D. (2015). When young children need help: understanding and addressing emotional, behavioral, and developmental challenges. St. Paul, MN : Redleaf Press.\r Ravet, J. (2015). Supporting change in autism services: bridging the gap between theory and practice. Abingdon, Oxon; New York: Routledge \r 張慧如 (2014)。大哥哥、大姐姐，請看看：我們很棒！：14個特殊教育的心路故事點亮社會的角落。\r 林瑞芳﹙編﹚﹙2004﹚。《教育心理學實用手冊》。香港：香港心理學會敎育心理學部。\r 李震梅(2008)《不一樣的孩子﹣﹣認識及培養學習差異兒童 》 。香港：中文大學出版社。\r 石丹理﹙編﹚﹙2004﹚。《華人社會青少年院護及特殊敎育服務》。香港：商務。\r 李憲嚴 (2013)。過度活躍專注力及自閉-從大腦解決。星島 / 星文社 / 星島教育\r 何定邦﹙2005﹚。《四點鐘的驚恐：探討兒童過度活躍症》。香港：花千樹。\r 蔡美馨 (2007)。《過動兒的教養妙方》。台北﹕新苗文化有限公司。\r 瑪麗．福樂（Mary Fowler)著，何善欣譯。2005。《我不是不聽話！》。台北：新手父母出版。\r 黎程正家(2003)，《如鷹展翅─提高低成就學生之學習動機及學習能力，教師資源手冊》，香港：冬青樹圖書制作公司。\r 劉佳蕙,鄭淨勻(2005).亞斯伯格症在融合教育的成功策略. 台北市: 心理出版社\r 藍瑋琛 編著(2010)《自閉症學生教學策略》。臺北市立教育大學特殊教育中心\r 陳錦鴻(2014)。《我和兒子的每一步》。世界出版社\r 資優教育概論 (2012)。GARY A. DAVIS。華騰文化股份有限公司　\r  Websites:\r (香港) 特殊教育資源中心網站Special Education Resource Centre http://www.edb.gov.hk/serc\r (香港) 特殊學習困難專業教育發展小組Teacher Development for Student with Specific Learning Difficulties http://www.fed.cuhk.edu.hk/~tdspld/\r 香港特殊學習障礙協會 Hong Kong Association for Specific Learning Disabilities http://www.asld.org.hk\r 專注力不足/過度活躍症(香港)協會Hong Kong Association for AD/HD http://www.adhd.org.hk\r (香港) 專注力促進會ADHD Foundation http://www.adhd.hk/\r (香港) 努力試中心Louis Program Training Centre (for autistic children) http://www.lp.org.hk/\r (香港) 特殊教育學會網站Special Education Society of Hong Kong http://www.seshk.org.hk/\r (香港) 特殊學習需要與融合教育中心Centre for Special Needs and Studies in Inclusive Education \r http://www.ied.edu.hk/csnsie\r (香港) 特殊教育研究發展中心Centre for Advancement in Special Education http://www.hku.hk/case\r 香港中文大學語言學及現代語言系手語及聾人研究中心 Centre for Sign Linguistics & Deaf Studies http://www.cuhk.edu.hk/cslds/\r (台灣) 有愛無障網站http://www.daleweb.org\r (台灣) 中華民國學習障礙協會http://ald.daleweb.org\r 國際閱讀障礙症協會 International Dyslexia Association http://www.interdys.org\r Pyramid Educational Consultants. (2007). What is PECS? – PECS Autism. http://www.pecs.org.uk/general/what.htm\r 香港教育學院 (2005)，蕊展計劃，擷取自2012年11月5日http://www.ied.edu.hk/aspire/aspire_2_21.html\r 協康會(2005)，協康會：自閉症及亞氏保加症，擷取自2012年11月5日http://www.heephong.org/webprod/cht/child-development-and-training/autism-and-asperger-syndrome#\r 賴鶴明(2009)， 識別自閉症及亞氏保加症兒童，擷取自2012年11月5日http://blog.yahoo.com/_QYE5PQCFXBMHKIXCYP2XT7KRA4/articles/57689", "terms": {"2020-21 Term 1": {"A-LEC (8915)": {"startTimes": ["9:30", "9:30"], "endTimes": ["11:15", "11:15"], "days": [1, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor SO Wing Chee", "Professor SO Wing Chee"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10"]}}, "2020-21 Term 2": {"B-LEC (6412)": {"startTimes": ["16:30", "16:30"], "endTimes": ["18:15", "18:15"], "days": [1, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor SO Wing Chee", "Professor SO Wing Chee"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2", "13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 1": {"A-LEC (4439)": {"startTimes": ["9:30", "8:30"], "endTimes": ["11:15", "10:15"], "days": [1, 3], "locations": ["Yasumoto Int'l Acad Park LT9", "Wong Foo Yuan Bldg LT4"], "instructors": ["Professor SO Wing Chee", "Professor SO Wing Chee"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "8/9", "15/9"]}}, "2021-22 Term 2": {"B-LEC (4475)": {"startTimes": ["16:30", "16:30"], "endTimes": ["18:15", "18:15"], "days": [1, 3], "locations": ["Yasumoto Int'l Acad Park LT4", "Yasumoto Int'l Acad Park LT4"], "instructors": ["Professor SO Wing Chee", "Professor SO Wing Chee"], "meetingDates": ["10/1", "17/1", "24/1", "12/1", "19/1", "26/1"]}}}, "assessments": {"Essays": "40", "Homework or assignment": "30", "Presentation": "30"}}, {"code": "4350", "title": "Personal Development of Teachers", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Education", "requirements": "", "description": "This course promotes the personal development of students in a teacher education programme context. Specially, it will discuss teachers’ physical and mental health and other related issues. Through experiential learning activities, students can raise their self-awareness and understanding of their professional and personal development. Examples of topics include teachers’ self-concept, effective communication, social support and interpersonal relationships, stress and burnout and possible physical hazards resulting from teaching, and so on. Students’ abilities to self-reflect and evaluate are particularly important.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]