[{"code": "2010", "title": "Energy Technologies and the Environment", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Mech & Automation Engg", "requirements": "Not for students who have taken ENER2010.", "description": "In a modern society, our living standard strongly correlates with our energy consumption rate. The rapid rise of energy use after WWII has caused the degradation of our environment as well as adverse health effects in human populations. Furthermore, the steady rise of recent global average temperature and its correlation with the atmospheric CO2 concentration is particularly alarming. This course provides an overview of the present energy industry and their environmental impact. Fossil fuel is our main energy source today. Therefore, coal, petroleum and natural gas are emphasized. Their formation, exploration, reserve distribution, production, transport, refinement, final consumption, waste disposal and the carbon cycle are studied. The mechanical structure, configuration and efficiency of various fossil-fueled power plants and automobile engines are described. The life cycle assessment method is used to evaluate their requirement on water withdraw and consumption, carbon footprint and their relationship to global warming. Nuclear power plants provide approximately 20% of our electricity without producing greenhouse gases. Their operating principle, the biological effects of ionizing radiations, the radioactive waste problem, the nuclear weapon proliferation concerns, the risk of large scale accidents like Chernobyl (1986) and Fukushima (2011), and different nuclear policies adopted by various governments are discussed. These lead to the need of renewable energy sources for sustainable developments. The current status of solar, wind, biomass, hydropower, and geothermal energies are briefly presented as an introduction to the next course on renewable energy technologies.Note: Calculus is NOT a prerequisite. However, high school level of physics, chemistry and mathematics are required.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2020", "title": "Renewable Energy Technologies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Mech & Automation Engg", "requirements": "Not for students who have taken ENER2020.", "description": "The effort of securing more sustainable, reliable, and affordable energy supplies is among the most challenges faced in this century. This course focuses on scientific and engineering fundamentals of renewable energy resources and conversion technologies. The subject-specific lectures will be provided in more depth to cover these topics: global energy sources, thermodynamics for renewable energy, solar energy, wind energy, hydro power, bioenergy, geothermal, fuel cell, and design, modeling and analysis of energy systems.\r", "outcome": "Upon completion of the course, students should have achieved the following outcomes:\r (1) understand the fundamental physics of solar collector, thermal energy storage, and photovoltaic cells and systems and to investigate the solar cell efficiency; (2) use wind speed data to evaluate wind energy, design and select wind turbines; (3) investigate the hydraulic energy and design and select water turbines, and the associated environmental risk and impact; (4) know fundamental chemistry of biomass energy systems, conversion technologies for gasification and liquefaction of biomass feedstocks, and ecological aspects of biomass energy systems;  (5) understand the principle of thermoelectric effect, thermoelectric generator, and its design and application; (6) understand the general principles of fuel cells and batteries, hydrogen production and storage, and application in transportation; (7) conduct assigned lab experiments to get familiar with several different renewable energy systems.", "syllabus": "The details will be provided by the course instructor.", "required_readings": "", "recommended_readings": "(1) Aldo Vieira da Rosa (2009). Fundamentals of renewable energy processes (2nd ed.), Burlington, MA: Academic Press.\r (2) G.N. Tiwari and M.K. Ghosal (2007). Fundamentals of renewable energy sources, Oxford, U.K.: Alpha Science International Ltd.", "terms": {"2020-21 Term 1": {"--LEC (5187)": {"startTimes": ["12:30", "12:30"], "endTimes": ["13:15", "14:15"], "days": [1, 2], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor CHEN Yongsheng", "Professor CHEN Yongsheng"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}, "-T01-TUT (5188)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHEN Yongsheng"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2021-22 Term 1": {"--LEC (5090)": {"startTimes": ["15:30", "16:30"], "endTimes": ["16:15", "18:15"], "days": [4, 2], "locations": ["Science Centre L1", "Science Centre L4"], "instructors": ["Professor REN Wei", "Professor REN Wei"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}, "-T01-TUT (8140)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor REN Wei"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}}, "assessments": {"Essay test or exam": "40", "Homework or assignment": "30", "Project": "30"}}, {"code": "2030", "title": "Energy and Environmental Economics and Management", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Mech & Automation Engg", "requirements": "Not for students who have taken SEEM2540.", "description": "This course aims to provide the students with an introduction to economic principles that pertain to energy and the environment. The objective is to apply economics to particular issues of local and global energy markets, energy planning and demand management, government regulations and policies, environmental impact and conservation, local pollution control and new technologies. The course will cover fundamental concepts in environmental economics including cost-benefit analysis and economic valuation of the environment. The students will learn how to analyze the effects of government policies and regulations on energy demand and supply, prices and the environment. The course also provides an introduction to the role of economic analysis in designing policies which address issues of energy security, climate change and related environmental externalities. Through this course, the students will understand the economics of energy markets and externalities, acquire skills in conducting energy and carbon auditing and accessing environmental and economic impact of government policies, and also develop an appreciation of the complexities of the interactions between the environment, the economy and sustainability.\r", "outcome": "Upon completion of the course, students should have achieved the following outcomes:\r (1) apply economic principles in supply and demand of energy; (2) acquire basic principles in environmental and ecological economics; (3) access the impact of government policies and regulations; (4) acquire basic principles in energy markets and carbon auditing. \r  This course contributes to the following EEEN Programme Learning Outcomes:\r (1) E1: Acquired basic knowledge related to energy and environmental engineering, including physics, mathematics, thermodynamics, energy technologies, power systems, environmental economics, building control and assessment, air pollution, etc. (K,S); (2) E6: Acquired the understanding of professional and ethical responsibilities in the field of energy and environmental engineering (V); (3) E7: Developed proficiency in technical communication (both oral and written) (S); (4) E8: Acquired a broad understanding of the importance of economic, environmental, political, social and other global implications of energy and environment-related issues (V); (5) E9: Acquired knowledge in historical and contemporary issues (S,V); (6) E13: Established a good understanding and vision of the energy and environmental industries in terms of technologies, tradeoffs and impacts (K).\r  K = Knowledge outcomes; S = Skills outcomes; V = Values and attitude outcomes.", "syllabus": "The details will be provided by the course instructor.", "required_readings": "", "recommended_readings": "(1) D. S. Kirschen and G. Strbac, Fundamentals of Power System Economics, Reprinted edition. John Wiley & Sons Ltd. 2009.\r (2) S. Stoft, Power System Economics: Designing Markets for Electricity\" , Wiley-Interscience, 2002.", "terms": {"2020-21 Term 2": {"--LEC (6435)": {"startTimes": ["14:30", "9:30"], "endTimes": ["15:15", "11:15"], "days": [4, 2], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor XU Yunjian", "Professor XU Yunjian"], "meetingDates": ["14/1", "21/1", "28/1", "4/2", "12/1", "19/1", "26/1", "2/2", "9/2"]}, "-T01-TUT (6436)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor XU Yunjian"], "meetingDates": ["15/01/2021 - 23/04/2021"]}}, "2021-22 Term 2": {"--LEC (5258)": {"startTimes": ["9:30", "14:30"], "endTimes": ["11:15", "15:15"], "days": [2, 4], "locations": ["Mong Man Wai Bldg 707", "Basic Med Sci Bldg LT"], "instructors": ["Staff", "Staff"], "meetingDates": ["11/1", "18/1", "25/1", "13/1", "20/1", "27/1"]}, "-T01-TUT (5775)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Staff"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Attendance": "10", "Essay test or exam": "40", "Homework or assignment": "20", "Presentation": "30"}}, {"code": "2040", "title": "Building Service Engineering and Green Building", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Mech & Automation Engg", "requirements": "Not for students who have taken ESTR2404.", "description": "This course introduces the primary Building Services, including heating, ventilation, and air-conditioning (HVAC), electrical distribution, lighting, fire protection, plumbing and drainage, vertical transportation, security, telecommunication, and building automation systems. This course also introduces Green Buildings based on BEAM Plus, one of the most widely-used green building labelling schemes in Hong Kong, including site aspects, materials aspects, energy use, water use, indoor environmental quality, innovations and additions for both new and existing buildings. This course also introduces the U.S. green building labelling scheme Leadership in Energy and Environmental Design (LEED).", "outcome": "Upon completion of the course, students should have achieved the following outcomes:\r (1) understand the introduced primary building services including their components and working principles;  (2) be able to analyze the primary building services according to the basic working principles; (3) understand the basic concepts of green buildings from engineering, design, and management perspectives;  (4) be able to analyze the energy and environmental design of a building according to the green building labelling schemes.\r  This course contributes to the following EEEN Programme Learning Outcomes:\r (1) E1: Acquired basic knowledge related to energy and environmental engineering, including physics, mathematics, thermodynamics, energy technologies, power systems, environmental economics, building control and assessment, air pollution, etc. (K,S);  (2) E3: Developed the ability to design and build engineering components, structures, processes or systems to meet targeted needs in specific energy and environmental applications (K,S);  (3) E4: Acquired the ability to function as a member of an interdisciplinary team (S,V);  (4) E5: Acquired the ability to identify, formulate and solve real-life engineering problems and tradeoffs related to energy system and optimization, environmental monitoring and control, and green building technologies (K,S); (5) E7: Developed proficiency in technical communication (both oral and written) (S); (6) E11: Acquired the ability to use the techniques, skills and tools to practice in the energy and environmental engineering discipline and be aware of entrepreneur opportunities (K,S);  (7) E12: Acquired the ability to use the computer/IT tools relevant to the discipline along with an understanding of their processes and limitations (K,S,V); (8) E13: Established a good understanding and vision of the energy and environmental industries in terms of technologies, tradeoffs and impacts (K).\r  K = Knowledge outcomes; S = Skills outcomes; V = Values and attitude outcomes.", "syllabus": "The details will be provided by the course instructor.", "required_readings": "", "recommended_readings": "(1) David V. Chadderton, Building Services Engineering 6th Edition. Routledge. \r (2) BEAM Plus for New Buildings Version 1.2. available at: http://www.beamsociety.org.hk/files/download/download-20130724174420.pdf\r (3) BEAM Plus for Existing Buildings Version 1.2. available at: http://www.beamsociety.org.hk/files/download/download-20130724174504.pdf \r (4) U.S. Green Building Council, LEED Reference Guide for Building Design and Construction v4 2013. ISBN-10: 1932444181.", "terms": {"2020-21 Term 2": {"--LEC (7899)": {"startTimes": ["11:30", "10:30"], "endTimes": ["13:15", "11:15"], "days": [3, 5], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor CHEN Chun", "Professor CHEN Chun"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2", "15/1", "22/1", "29/1", "5/2"]}, "-T01-TUT (7906)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHEN Chun"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 2": {"--LEC (4557)": {"startTimes": ["10:30", "11:30"], "endTimes": ["11:15", "13:15"], "days": [5, 3], "locations": ["Mong Man Wai Bldg 703", "Lady Shaw Bldg LT3"], "instructors": ["Professor CHEN Chun", "Professor CHEN Chun"], "meetingDates": ["14/1", "21/1", "28/1", "12/1", "19/1", "26/1"]}, "-T01-TUT (4558)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor CHEN Chun"], "meetingDates": ["12/01/2022 - 20/04/2022"]}}}, "assessments": {"Essay test or exam": "50", "Homework or assignment": "10", "Presentation": "10", "Report": "10", "Selected response test or exam": "20"}}, {"code": "2602", "title": "Engineering Practicum", "career": "Undergraduate", "units": "1.00", "grading": "Pass (P)/Fail (U)", "components": "Practicum", "campus": "Main Campus", "academic_group": "Dept of Mech & Automation Engg", "requirements": "Not for students who have taken ENGG2602.", "description": "The course combines activities designed to develop employability with the knowledge and skills gained through attending workshops or seminars. Successful completion of the course will provide students with the employability skills required for transition to the world of work. Students who have attended certain industrial and professional workshops or seminars required by the EEEN programme may be able to count these towards the course.\r", "outcome": "Upon completion of the course, students should have achieved the following outcomes:\r (1) have hands-on skills of engineering practice; (2) understand the value of practical engineering skills and experiences.", "syllabus": "The details will be provided by the course instructor.", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Summer Session": {"-P01-PRA (1221)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SONG Xu"], "meetingDates": ["18/05/2021 - 29/06/2021"]}}}}, {"code": "3010", "title": "Building Automation and Control", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Mech & Automation Engg", "requirements": "Not for students who have taken ESTR3410. Pre-requisite: MAEG2030 / ESTR2402 or with the consent of the course instructor.", "description": "This course introduces various mechanical systems of modern buildings: heating, ventilation, and air-conditioning (HVAC), lighting, electrical, plumbing, fire, security, and elevator, and presents the physical principles, signals and functions of the instrumentations, and control equipments involved. This course also includes the building automation systems (BAS), which ensure the proper configuration, operations, troubleshooting, and performance of the overall building based on gathered information and control strategies. Basic concepts of control system, communication network and protocols will also be presented.\r", "outcome": "Upon completion of the course, students should have achieved the following outcomes:\r (1) understand the introduced mechanical systems of modern buildings including their components, fundamental working principles, and engineering applications;  (2) understand the basic building automation systems (BAS) including the system-related instrumentations and control equipment; (3) understand the concepts and principles of building energy consumption breakdown analysis;  (4) be able to formulate basic system design of HVAC and lighting systems for buildings located in different climate zones with different demands;  (5) be able to determine appropriate control strategies of HVAC and lighting systems for a given building.\r  This course contributes to the following EEEN Programme Learning Outcomes:\r (1) E1: Acquired basic knowledge related to energy and environmental engineering, including physics, mathematics, thermodynamics, energy technologies, power systems, environmental economics, building control and assessment, air pollution, etc. (K,S);  (2) E3: Developed the ability to design and build engineering components, structures, processes or systems to meet targeted needs in specific energy and environmental applications (K,S);  (3) E4: Acquired the ability to function as a member of an interdisciplinary team (S,V);  (4) E5: Acquired the ability to identify, formulate and solve real-life engineering problems and tradeoffs related to energy system and optimization, environmental monitoring and control, and green building technologies (K,S); (5) E7: Developed proficiency in technical communication (both oral and written) (S); (6) E11: Acquired the ability to use the techniques, skills and tools to practice in the energy and environmental engineering discipline and be aware of entrepreneur opportunities (K,S);  (7) E12: Acquired the ability to use the computer/IT tools relevant to the discipline along with an understanding of their processes and limitations (K,S,V); (8) E13: Established a good understanding and vision of the energy and environmental industries in terms of technologies, tradeoffs and impacts (K).\r  K = Knowledge outcomes; S = Skills outcomes; V = Values and attitude outcomes.", "syllabus": "The details will be provided by the course instructor.", "required_readings": "", "recommended_readings": "(1) S. Wang, Intelligent Buildings and Building Automation, Spon Press, London and New York, 2010. \r (2) R. McDowall, Fundamentals of HVAC Systems, Elsevier, 2008.", "terms": {"2020-21 Term 1": {"--LEC (8014)": {"startTimes": ["10:30", "12:30"], "endTimes": ["12:15", "13:15"], "days": [1, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor CHEN Chun", "Professor CHEN Chun"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}, "-T01-TUT (8015)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHEN Chun"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2021-22 Term 1": {"--LEC (8586)": {"startTimes": ["10:30", "12:30"], "endTimes": ["12:15", "13:15"], "days": [1, 3], "locations": ["William M W Mong Eng Bldg 404", "Lee Shau Kee Building 201"], "instructors": ["Professor CHEN Chun", "Professor CHEN Chun"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11", "8/9", "15/9"]}, "-T01-TUT (8587)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor CHEN Chun"], "meetingDates": ["07/09/2021 - 30/11/2021"]}}}, "assessments": {"Essay test or exam": "60", "Homework or assignment": "10", "Presentation": "10", "Report": "10", "Selected response test or exam": "10"}}, {"code": "3020", "title": "Energy Utilization and Human Behaviour", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Mech & Automation Engg", "requirements": "Not for students who have taken ENER3020 or ESTR3400.", "description": "This course emphasizes the intersection between energy consumption and human/corporate/economic activities. The course follows a grid structure in its organisation. The grid’s horizontal lines are about energy consumption, involving electricity use, and direct burning of fuels including combustion engines, boilers, stoves, etc. The vertical lines are about human activities, involving major economic sectors including the industrial, transport, commercial, and residential ones. The intersections between the grid’s horizontal lines and vertical lines are the lecture topics. Each lecture has discussion over three aspects: (1) how energy is utilized; (2) what factors are affecting energy consumption in intensity and in total; and (3) how human behaviour could be changed for energy conservation and pollution control.\r", "outcome": "Upon completion of the course, students should have achieved the following outcomes:\r (1) develop a basic understanding of present global energy issues, including different kinds of energy technologies, energy consumption/reservation and their short term and long term impacts on human activities and behaviours; (2) perform basic quantitative analyses to evaluate and study the relationship between energy consumptions, environment, and economic growth; (3) develop a basic understanding in human decision theory, e.g., game theory; (4) be able to analyze the benefits, impact and challenges brought by the new developments in the electricity generation and transportation sectors.", "syllabus": "The details will be provided by the course instructor.", "required_readings": "", "recommended_readings": "(1) Joseph M. Dukert, \"Energy (Greenwood Guides to Business and Economics)\", December 2008, ABC-CLIO (ISBN: 0313348774)\r (2) Fred Bosselman, \"Energy, Economics and the Environment, 3d: 3rd Edition\", July 2010, Foundation Press. (ISBN: 1599417227)\r (3) Carol A. Dahl , \"International Energy Markets: Understanding Pricing, Policies and Profits\", April 2004, PennWell Corporation (ISBN:0878147993)\r (4) David JC Mackay, “Sustainable Energy Energy – without the hot air” UIT Cambridge, 2009.", "terms": {"2020-21 Term 2": {"--LEC (4739)": {"startTimes": ["16:30", "13:30"], "endTimes": ["18:15", "14:15"], "days": [4, 2], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor XU Yunjian", "Professor XU Yunjian"], "meetingDates": ["14/1", "21/1", "28/1", "4/2", "12/1", "19/1", "26/1", "2/2", "9/2"]}, "-T01-TUT (4761)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor XU Yunjian"], "meetingDates": ["17/01/2021 - 25/04/2021"]}}}, "assessments": {"Attendance": "10", "Essay test or exam": "35", "Homework or assignment": "10", "Presentation": "15", "Project": "30"}}, {"code": "3030", "title": "Engineering Materials", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Mech & Automation Engg", "requirements": "Not for students who have taken ENER3030 or ESTR3402.", "description": "This course introduces fundamentals of materials including atomic bonding; crystal structures, defects; mechanical properties of materials, phase diagram; overview of metals, alloys, ceramics, polymers, semiconductors and composites; electrical, optical, magnetic, and thermal properties of materials; materials selection and design considerations for engineering technologies. Applications of materials to energy and environmental engineering, mechanical engineering, medical engineering, and others will be discussed.\r", "outcome": "Upon completion of the course, students should have achieved the following outcomes:\r (1) describe the basic structures and key properties of engineering materials; (2) select engineering materials for a given application purpose by evaluating their structure-property-performance relationship; (3) understand the functions of various analytical and material characterization tools in characterizing the properties of various engineering materials; (4) utilize various physical, chemical, and material techniques in the modeling, and performance evaluation of engineering materials for given engineering applications; (5) conduct various characterization instruments for analysis and design; (6) quantitatively evaluate the suitableness and the properties of various energy storage technologies for engineering applications;  (7) design engineering materials upon given an application with desired performance and application specifications.", "syllabus": "The details will be provided by the course instructor.", "required_readings": "Textbook: W. D. Callister Jr., D. G. Rethwisch, Materials Science and Engineering: An Introduction, John Wiley and Sons; 8th edition, 2010.", "recommended_readings": "(1) D. S. Ginley and D. Cahen, Fundamentals of Materials for Energy and Environmental Sustainability. Cambridge, New York, Cambridge University Press, c2012.\r (2) M. J . Schulz, A. D . Kelkar, and M. J. Sundaresan, Nanoengineering of Structural, Functional and Smart Materials, CRC Press 2005.", "terms": {"2020-21 Term 2": {"--LEC (6854)": {"startTimes": ["14:30", "11:30"], "endTimes": ["16:15", "12:15"], "days": [2, 1], "locations": ["Lee Shau Kee Building LT5", "Online Teaching"], "instructors": ["Professor LU Yi Chun", "Professor LU Yi Chun"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2", "11/1", "18/1", "25/1", "1/2", "8/2"]}, "-L01-LAB (4683)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor LU Yi Chun"], "meetingDates": ["11/01/2021 - 19/04/2021"]}, "-T01-TUT (6868)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor LU Yi Chun"], "meetingDates": ["17/01/2021 - 25/04/2021"]}}, "2021-22 Term 2": {"--LEC (4829)": {"startTimes": ["14:30", "11:30"], "endTimes": ["16:15", "12:15"], "days": [2, 1], "locations": ["William M W Mong Eng Bldg LT", "Lady Shaw Bldg LT1"], "instructors": ["Professor LU Yi Chun", "Professor LU Yi Chun"], "meetingDates": ["11/1", "18/1", "25/1", "10/1", "17/1", "24/1"]}, "-L01-LAB (7347)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor LU Yi Chun"], "meetingDates": ["11/01/2022 - 19/04/2022"]}, "-T01-TUT (7054)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor LU Yi Chun"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Essay test or exam": "40", "Homework or assignment": "8", "Lab reports": "9", "Presentation": "15", "Report": "21", "Short answer test or exam": "7"}}, {"code": "4010", "title": "Kinetic Energy Harvesting Devices and Systems", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Mech & Automation Engg", "requirements": "Not for students who have taken ENER4010 or ESTR4400.", "description": "In this course, we will discuss kinetic energy harvesting devices and systems, from basic mechanisms to applications. The first half semester of this course will start with talking about the fundaments of kinetic energy harvesting, including mechanisms of electromagnetic, piezoelectric, triboelectric, electrostatic, and others. And then it will cover basic device designs and energy transfer; physics and circuit models; electromechanical modeling and analysis; simulation methods and practice; and interfacing circuits. The second half semester will cover the applications of kinetic energy harvesting in various situations, including power plants, wind turbine, vibrations, hydro system, ocean waves, body motions and others, and ends with discussions on kinetic energy harvesting technology in the future. The evaluation will be based on final project, midterm exam, homework, lab report, and participation in class.\r", "outcome": "Upon completion of the course, students should have achieved the following outcomes:\r (1) understand the principles and prospective of kinetic energy harvesting technologies; (2) grasp the principles of different kinds of energy harvesters, their role in kinetic energy harvesting systems, their constraints, and application preferences; (3) develop models for analysis and optimization of kinetic energy harvesting systems; (4) experience the application oriented design, fabrication, and testing of kinetic energy harvesting devices; (5) explore applications on kinetic energy harvesting for making good use of the energy.", "syllabus": "The details will be provided by the course instructor.", "required_readings": "", "recommended_readings": "(1) Tom J. Kazmierski, Steve Beeby, Energy Harvesting Systems: Principles, Modeling and Applications, ISBN 978-1-4419-7565-2, Springer, 2011\r (2) Shashank Priya, Daniel J. Inman, Energy Harvesting Technologies, ISBN 978-0-387-76463-4, Springer, 2009\r (3) D. Spreemann and Y. Manoli, Electromagnetic Vibration Energy Harvesting Devices, ISBN 978-94-007-2944-5, Springer, 2012\r (4) A. Erturk, D. J. Inman, Piezoelectric Energy Harvesting, 978-11-199-9115-1 Wiley, 2011\r (5) Philippe Basset, Elena Blokhina, Dimitri Galayko, Electrostatic Kinetic Energy Harvesting, ISBN 978-1-84821-716-4, ISTE Ltd and John Wiley & Sons, Inc., 2016\r (6) Z.L. Wang, L. Lin, J. Chen, S. Niu, Y. Zi, Triboelectric Nanogenerators, ISBN 978-3-319-40038-9, Springer, 2016", "terms": {"2020-21 Term 2": {"--LEC (4741)": {"startTimes": ["17:30", "9:30"], "endTimes": ["18:15", "11:15"], "days": [3, 1], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor ZI Yunlong", "Professor ZI Yunlong"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2", "11/1", "18/1", "25/1", "1/2", "8/2"]}, "-T01-TUT (4762)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor ZI Yunlong"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 2": {"--LEC (5361)": {"startTimes": ["17:30", "9:30"], "endTimes": ["18:15", "11:15"], "days": [3, 1], "locations": ["William M W Mong Eng Bldg 712", "Y.C. Liang Hall 101"], "instructors": ["Professor ZI Yunlong", "Professor ZI Yunlong"], "meetingDates": ["12/1", "19/1", "26/1", "10/1", "17/1", "24/1"]}, "-T01-TUT (7302)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor ZI Yunlong"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Essay test or exam": "35", "Homework or assignment": "15", "Lab reports": "5", "Project": "35", "Participation": "10"}}, {"code": "4020", "title": "Solar Energy and Photovoltaic Technology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureProjectInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Mech & Automation Engg", "requirements": "Not for students who have taken ENER4020 or ESTR4402;Pre-requisite(s):;1. ELEG2202 and EEEN2020/ENER2020 or;2. ELEG2202 and ELEG3201/ESTR3200", "description": "This course provides students with knowledge of solar energy and photovoltaic technologies. It covers the following topics: introduction to solar energy technologies, semiconductors for photovoltaics; working principle and performance evaluation of photovoltaic cells (PVs); photovoltaic technologies (crystalline PVs, thin film PVs, and organic and nanostructure based PVs), solar panel system design, cost aspects, and market development and environmental impact of photovoltaic industry.\r", "outcome": "Upon completion of the course, students should have achieved the following outcomes:\r (1) understand the importance of utilizing solar energy and the major advantages and limitations of photovoltaic technologies; (2) understand the working principles of photovoltaics (PVs) and the fundamental limitation of their performance; (3) recognize the main advantages and drawbacks of different photovoltaic technologies, including crystalline PVs, thin-film PVs, and organic and nanostructure based PVs; (4) understand how to calculate the cost of a solar panel system and be able to compare the cost aspects of different PV technologies; (5) perform the basic steps to design a complete solar system for a particular application and to perform quantitative analysis for PV materials and PV cell performance; (6) understand the relation between government policy and solar technology market.", "syllabus": "The details will be provided by the course instructor.", "required_readings": "", "recommended_readings": "Text: \r Jenny Nelson, The Physics of Solar Cells, Imperial College Press, 2003.\r  Reference book:\r (1) S. M. Sze, Semiconductor Devices (2nd Edition), John Wiley & Sons, 2002\r (2) Peter Würfel, Physics of Solar Cells: From Basic Principles to Advanced Concepts, Wiley-VCH, 2009\r (3) Mario Pagliaro, Giovanni Palmisano, and Rosaria Ciriminna, Flexible Solar Cells, Wiley-VCH, 2008", "terms": {"2020-21 Term 1": {"--LEC (7429)": {"startTimes": ["13:30", "10:30"], "endTimes": ["14:15", "12:15"], "days": [2, 1], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor ZHAO Ni", "Professor ZHAO Ni"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12", "7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}, "-T01-TUT (7430)": {"startTimes": ["14:30"], "endTimes": ["15:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor ZHAO Ni"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}, "-T02-TUT (9019)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor ZHAO Ni"], "meetingDates": ["09/09/2020 - 02/12/2020"]}}, "2021-22 Term 1": {"--LEC (4778)": {"startTimes": ["13:30", "10:30"], "endTimes": ["14:15", "12:15"], "days": [2, 1], "locations": ["Chen Kou Bun Bldg 109", "Hui Yeung Shing Bldg G05"], "instructors": ["Professor ZHAO Ni", "Professor ZHAO Ni"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11", "6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}, "-T01-TUT (4779)": {"startTimes": ["14:30"], "endTimes": ["15:15"], "days": [2], "locations": ["Chen Kou Bun Bldg 109"], "instructors": ["Professor ZHAO Ni"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}, "-T02-TUT (8056)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor ZHAO Ni"], "meetingDates": ["07/09/2021 - 30/11/2021"]}}}, "assessments": {"Essay test or exam": "0", "Lab reports": "0", "Others": "0", "Presentation": "0"}}, {"code": "4030", "title": "Nuclear Energy and Risk Assessment", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Mech & Automation Engg", "requirements": "Not for students who have taken ENER4030 or ESTR4404.", "description": "This course will introduce the basic nuclear physics - elementary quantum theory; nuclear forces; shell structure of the nucleus; alpha, beta, and gamma radioactive decays; nuclear reactions; fission and fusion. In addition, this course will discuss the nuclear power plant design - nuclear power plant layout; reactor dynamics; reactor start up and process control, waste treatment. Risk management - assessment and management of nuclear safety, radiation, exposure and environment, safety assessment will be introduced in this course.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4050", "title": "Energy Storage Devices and Systems", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Mech & Automation Engg", "requirements": "Pre-requisite(s): ENER2010 and ENER2020, or EEEN2020, or with the consent of the course instructor.;Not for students who have taken ENER4040, ENER4050, ESTR4406 or ESTR4422.", "description": "This course describes the fundamental principles, device and system design of energy storage technologies including electrochemical energy storage (batteries, supercapacitors, fuel cells etc.), thermal energy storage (phase change), mechanical energy storage (flywheel and compressed air energy storage), hydrogen storage. The applications of energy storage technologies in supporting renewable energy sources for smart grid, hybrid and all-electric vehicles, and green building applications will be discussed.", "outcome": "Upon completion of the course, students should have achieved the following outcomes:\r (1) be able to explain the role of energy and storage technology and quantitatively explain the fundamental working principles of major energy storage devices and systems; (2) be able to utilize various physical, chemical, electrochemical, and mathematical techniques in the modeling, and performance evaluation of energy storage devices and systems; (3) understand the functions of various analytical tools in characterizing the performance of various energy storage devices and systems;  (4) be able to use the impedance characterization tools and instruments for analysis and design; (5) be able to quantitatively evaluate the suitableness and the performance of various energy storage technologies for given an energy application purpose;  (6) be able to fabricate lab scale energy storage devices and conduct performance characterization and analysis; (7) design an energy storage system upon given an application with desired performance specifications; (8) be able to integrate experimental results and literature review into effective technical writing and oral presentation for communication.", "syllabus": "The details will be provided by the course instructor.", "required_readings": "", "recommended_readings": "(1) R. A. Huggins, Energy Storage, Springer, New York Heidelberg Dordrecht London, 2010.\r (2) A. J. Bard and L. R. Faulkner, Electrochemical Methods: Fundamentals and Applications, John Wiley & Sons New York, 2001.", "terms": {"2020-21 Term 1": {"--LEC (5441)": {"startTimes": ["10:30", "13:30"], "endTimes": ["11:15", "15:15"], "days": [5, 4], "locations": ["Y.C. Liang Hall G04", "Mong Man Wai Bldg 702"], "instructors": ["Professor LU Yi Chun", "Professor LU Yi Chun"], "meetingDates": ["11/9", "18/9", "25/9", "10/9", "17/9", "24/9"]}, "-L01-LAB (5440)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor LU Yi Chun"], "meetingDates": ["07/09/2020 - 30/11/2020"]}, "-T01-TUT (5442)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor LU Yi Chun"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}}, "assessments": {"Essay test or exam": "35", "Homework or assignment": "8", "Lab reports": "10", "Presentation": "20", "Report": "20", "Short answer test or exam": "7"}}, {"code": "4060", "title": "Energy Distribution", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Mech & Automation Engg", "requirements": "Pre-requisite(s): ELEG2202;Not for students who have taken ENER4040, ENER4060, ESTR4406 or ESTR4424", "description": "This course will introduce electric power system fundamentals, control, and operation. The course will discuss power system components and overview, review of basic circuit elements, AC circuit analysis and phasor representation, complex power, active and reactive power, power factor and power triangle, reactive power compensation, balanced 3-phase system analysis, Yconnection and delta-connection, transformer modelling and analysis, per-unit analysis, transient stability and analysis, voltage stability and control, frequency stability and control, power flow analysis, economic dispatching, optimal power flow problem, power plant planning, smart grid, energy storage system, renewable generation and utilization, and electric vehicle integration.\r", "outcome": "Upon completion of the course, students should have achieved the following outcomes:\r (1) understand the fundamental and principle of designing, controlling and operating power systems with energy generation, distribution, and consumption; (2) understand the power system control and operation techniques; (3) understand challenges and techniques of designing and operating smart grid with renewable energy integration; (4) be able to explain the basic concepts and working principles of power system; (5) be able to analyze and formulate basic power system, as well as selected systems with renewable energy and energy storage integration.", "syllabus": "The details will be provided by the course instructor.", "required_readings": "", "recommended_readings": "(1) J. D. Glover, M. S. Sarma, T. J. Overbye, Power System Analysis and Design (the 5th edition), Cengage Learning, 2011 \r (2) Allen J. Wood, Bruce F. Wollenberg, Gerald B. Sheblé, Power Generation, Operation and Control (the 3rd edition), Wiley-Interscience, 2013", "terms": {"2021-22 Term 2": {"--LEC (5259)": {"startTimes": ["13:30", "16:30"], "endTimes": ["14:15", "18:15"], "days": [2, 4], "locations": ["Mong Man Wai Bldg 707", "William M W Mong Eng Bldg 404"], "instructors": ["Professor XU Yunjian", "Professor XU Yunjian"], "meetingDates": ["11/1", "18/1", "25/1", "13/1", "20/1", "27/1"]}, "-L01-LAB (7705)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor XU Yunjian"], "meetingDates": ["11/01/2022 - 19/04/2022"]}, "-T01-TUT (6854)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor XU Yunjian"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Attendance": "10", "Essay test or exam": "70", "Homework or assignment": "20"}}, {"code": "4998", "title": "Final Year Project I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Dept of Mech & Automation Engg", "requirements": "Not for students who have taken ENER4998.", "description": "The course is designed to provide students with an opportunity to carry out, under the supervision of an academic staff, an independent project with research elements in engineering.\r", "outcome": "Upon completion of the course, students should have achieved the following outcomes:\r (1) be able to identify and have a basic understanding of the literature related to the project topic; (2) be able to define and complete a project that utilizes results in the literature; (3) be able to perform a critical review of the project; (4) develop technical writing skills.", "syllabus": "The course includes, but is not limited to, the following elements: literature review, modelling, system design and implementation, project evaluation.", "required_readings": "Literature review materials will be recommended by the project supervisor.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"-J01-PRJ (7623)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor ZHANG Weizhao"], "meetingDates": ["10/09/2020 - 03/12/2020"]}}, "2020-21 Term 2": {"-J01-PRJ (6884)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor ZHANG Weizhao"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-J01-PRJ (6168)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor ZHANG Weizhao"], "meetingDates": ["07/09/2021 - 30/11/2021"]}}, "2021-22 Term 2": {"-J01-PRJ (8175)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor ZHANG Weizhao"], "meetingDates": ["11/01/2022 - 19/04/2022"]}}}, "assessments": {"Essays": "0", "Presentation": "0"}}, {"code": "4999", "title": "Final Year Project II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Dept of Mech & Automation Engg", "requirements": "Not for students who have taken ENER4999. Pre-requisite: EEEN4998.", "description": "The course is designed to provide students with an opportunity to carry out, under the supervision of an academic staff, an independent project with research elements in engineering.\r", "outcome": "Upon completion of the course, students should have achieved the following outcomes:\r (1) be able to identify and have a basic understanding of the literature related to the project topic; (2) be able to define and complete a project that utilizes results in the literature; (3) be able to perform a critical review of the project; (4) develop technical writing skills.", "syllabus": "The course includes, but is not limited to, the following elements: literature review, modelling, system design and implementation, project evaluation.", "required_readings": "Literature review materials will be recommended by the project supervisor.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"-J01-PRJ (7607)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor ZHANG Weizhao"], "meetingDates": ["08/09/2020 - 01/12/2020"]}}, "2020-21 Term 2": {"-J01-PRJ (6885)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor ZHANG Weizhao"], "meetingDates": ["17/01/2021 - 25/04/2021"]}}, "2021-22 Term 1": {"-J01-PRJ (6166)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor ZHANG Weizhao"], "meetingDates": ["09/09/2021 - 02/12/2021"]}}, "2021-22 Term 2": {"-J01-PRJ (8176)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor ZHANG Weizhao"], "meetingDates": ["12/01/2022 - 20/04/2022"]}}}, "assessments": {"Essays": "0", "Presentation": "0"}}]