[{"code": "2270", "title": "Introduction to Environmental Science", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Environmental Science Pgm Comm", "requirements": "", "description": "This course deals with the relationships between living organisms, resources and environment. The basic multidisciplinary concepts of sustainable development, human population and health risk, conservation of resources, climate change, environmental degradation, pollution control, biodiversity, solid waste and waste water management, etc, will be introduced. Concepts of think globally, act locally will be introduced the importance of acting as a global citizen to help solving environmental problems with an innovative mind to design new policy or technology. Case studies and field trips are included to illustrate various environmental issues using a multidisciplinary approach with emphasis on how modern technology can have significant societal impacts and responsibility.", "outcome": "The students shall be able to understand the basic knowledge in current environmental problems, including natural conservation, pollution control, waste management and problems arisen from environmental deterioration, sustainable development, after taking this course.  完成本科後, 同學應可明白當代環境問題, 包括天然資源保育和污染控制, 廢物管理及環境降格的後續和可持續發展問題.   完成本科后, 同学应可明白当代环境问题, 包括天然资源保育和污染控制, 废物管理及环境降格的后续和可持续发展问题.", "syllabus": "Course Syllabus:  1. Sustainable Development 2. Population and Resources 3. Climate Change and Energy Policy 4. Environmental Pollution & Health 5. Group Presentations on RESOURCES 6. Environmental Monitoring & Assessment 7. Water Quality Control 8. Sewage Treatment 9. Green Chemistry 10. Biodiversity 11. Conservation 12. Environmental Protection (I): Solid Waste Treatment 13. Environmental Protection (II): Air Pollution and Control 14. Environmental Remediation and Biotechnology   1. 可持續發展 2. 人口和資源 3. 氣候轉變和能源政策 4. 環境污染和健康 5. 各種資源的分組報告 6. 環境的監控 7. 水質管制 8. 污水處理 9. 綠色化學 10. 生物多樣性 11. 保育 12. 環境保護(I): 固廢的處理 13. 環境保護(II): 空氣污染及其控制 14. 環境復育和生物技術  1. 可持续发展 2. 人口和资源 3. 气候转变和能源政策 4. 环境污染和健康 5. 各种资源的分组报告 6. 环境的监控 7. 水质管制 8. 污水处理 9. 綠色化学 10. 生物多样性 11. 保育 12. 环境保护(I): 固废的处理 13. 环境保护(II): 空气污染及其控制 14. 环境复育和生物技术", "required_readings": "    ENSC2270 Required Readings     1.     Cunningham WP, Cunningham MA, Saigo B (2008) Environmental Science-A Global Concern. 10th ed., McGraw-Hill, 618p. GE105.C86 2008 (RESERVED at UL) 2.     Cunningham WP, Cunningham MA (2009) Environmental Science-A Global Concern. 11th ed., McGraw-Hill, 618p. (Available from university bookstore)    ", "recommended_readings": "    ENSC2270 Recommended Readings     1.     Masters GM, Ela WP (2007) Introduction to Environmental Engineering and Science, 3rd ed. Prentice Hall, 720p. 145.M33 1998 (second edition available from UL, RESERVED) 2.     Miller Jr. GT, Spoolman SE (2009) Living in the Environment. Principles, Connections and Solutions. 16th ed., Brooks/Cole, Belmont, CA, USA GE105.M547 2009 (RESERVED at UL) 3.     Spiro, TG, Stigliani WM (2003) Chemistry of the Environment, 2nd Ed., Prentice Hall, New Jersey, 489p. TD193.S7 2003 (RESERVED at UL)    ", "terms": {"2020-21 Term 2": {"--LEC (7408)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. CHAN Ka Long Donald, \n\rProfessor Laura Jane FALKENBERG, \n\rProfessor TSANG Ling Ming"]}}}, "assessments": {"Fieldwork or field study": "5", "Homework or assignment": "15", "Report": "20", "Short answer test or exam": "50", "Selected response test or exam": "10"}}, {"code": "2515", "title": "Environmental Chemistry", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Environmental Science Pgm Comm", "requirements": "Prerequisite: ENSC2270 or permission of the instructor", "description": "This is a foundation course designed to equip students with a proper understanding of the fundamental aspects of environmental chemistry. It introduces the basic concept of chemical equilibrium and kinetics, the nature and characteristics of various common types of air and water pollution arising from industrial, agricultural and domestic sources. It outlines the principles of measurement for various parameters commonly used for air and water pollution studies, their significance and limitations. It also examines various types of aerial emission arising from combustion and industrial processes, and vehicles, and their chemical interaction leading to various global environmental issues such as the formation of photochemical smog, depletion of ozone layer and global warming effects.\r", "outcome": "Students who have finished this course are expected to understand:\r   1. some basic concepts in chemistry ranging from atomic structure and chemical bonding to the basic principle of coordination chemistry of the transition metals, and thermodynamics and kinetics.\r 2. aquatic chemistry which includes solubility, acid-base reactions, complexation equilibria, and redox reactions.\r 3. the chemistry of common pollutants in natural water systems. \r 4. atmospheric chemistry with emphasis on chemical and photochemical processes occurring in the atmosphere.\r 5. the chemistry of common air pollutants.\r 6. the chemistry of soil including its composition, essential nutrients in soil, the chemistry of fertilizers, and acid-base and ion-exchange reactions in soil.\r   Student will understand key ideas on these topics and understand various local and global environmental problems through a case-study approach.\r   完成修讀本科的學生應對下列課題具有一定程度的了解及認識： 1. 基本化學概念，包括原子結構、化學鍵、過渡金屬配位化學之基本原理、化學熱力學及動力學原理。\r 2. 水質化學，內容包括溶解度、酸鹼反應、錯合及螯合作用、水體中之氧化還原反應。\r 3. 自然水系中常見污染物的化學問題。\r 4. 大氣化學，重點包括大氣中的化學及光化學反應。\r 5. 大氣中的常見污染物及其化學。\r 6. 土壤化學，內容包括土壤的構造、土壤中的主要養分、肥料、酸鹼反應及離子交換。\r   學生將通過個案研究以了解相關內容，並探討本地及全球的環境問題。   完成修讀本科的学生应对下列课题具有一定程度的了解及认識： 1. 基本化学概念，包括原子结构、化学键、过渡金属配位化学之基本原理、化学热力学及动力学原理。\r 2. 水质化学，内容包括溶解度、酸碱反应、错合及螯合作用、水体中之氧化还原反应。\r 3. 自然水系中常见污染物的化学问题。\r 4. 大气化学，重点包括大气中的化学及光化学反应。\r 5. 大气中的常见污染物及其化学。\r 6. 土壤化学，内容包括土壤的构造、土壤中的主要养分、肥料、酸碱反应及離子交换。\r   学生将通过个案研究以了解相关内容，并探讨本地及全球的环境问题。", "syllabus": "Course Syllabus:\r  1. Some basic concepts in chemistry\r 2. Aquatic chemistry\r 3. Water pollution\r 4. Atmospheric chemistry\r 5. Air pollution\r 6. Environmental Geochemistry\r  1. 基本化學概念\r 2. 水質化學\r 3. 水污染\r 4. 大氣化學\r 5. 空氣污氣\r 6. 環境地球化學\r  1. 基本化学概念\r 2. 水质化学\r 3. 水污染\r 4. 大气化学\r 5. 空气污气\r 6. 环境地球化学", "required_readings": "1. Cunningham WP, Cunningham MA, Saigo B (2008) Environmental Science-A Global Concern. 10th ed., McGraw-Hill, 618p. GE105.C86 2008 (RESERVED at UL)\r  2. Cunningham WP, Cunningham MA (2009) Environmental Science-A Global Concern. 11th ed., McGraw-Hill,618p. (Available from university bookstore)", "recommended_readings": "1. Masters GM, Ela WP (2007) Introduction to Environmental Engineering and Science, 3rd ed. Prentice Hall,720p. 145.M33 1998 (second edition available from UL, RESERVED)\r  2. Miller Jr. GT, Spoolman SE (2009) Living in the Environment. Principles, Connections and Solutions. 16th ed., Brooks/Cole, Belmont, CA, USA GE105.M547 2009 (RESERVED at UL)\r  3. Spiro, TG, Stigliani WM (2003) Chemistry of the Environment, 2nd Ed., Prentice Hall, New Jersey, 489p. TD193.S7 2003 (RESERVED at UL)", "terms": {"2020-21 Term 1": {"--LEC (7578)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor LEE Hung Kay, \n\rProfessor YU Chai Mei"]}}}, "assessments": {"Homework or assignment": "15", "Short answer test or exam": "50", "Selected response test or exam": "35"}}, {"code": "2517", "title": "Environmental Chemistry Laboratory", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Environmental Science Pgm Comm", "requirements": "Corequisite: ENSC2515 or permission of the instructor.", "description": "This is a foundation chemistry laboratory course designed to accompany ENSC2515. This course illustrates the fundamental principles and basic techniques in general environmental chemistry. Laboratory work covers a range of experiments, including acid-base reactions, chemical thermodynamics and kinetics, complexation equilibria, coordination chemistry of the transition metals, and analysis of air pollutants. Students who finish this course are expected to be familiar with the general techniques in conducting chemistry experiments and the use of simple instruments such as IR and UV–Vis spectrophotometers. They will also learn how to design of experiments and report experimental data in scientific reports. The assessment scheme of this course is based on students' performance in conducting experiments and report writing.\r", "outcome": "Students who have finished this course are expected to:\r 1. be familiar with the general techniques in conducting chemistry experiments; 2. be familiar with the use of common instruments such as IR and UV-Vis spectrophotometers; 3. learn how to report and analyze scientific data, and write up scientific reports; 4. understand some basic principles of chemistry ranging from acid-base reactions, thermodynamics and kinetics, complexation equilibria, to coordination chemistry of the transition metals; 5. learn how to design and plan experiments,\r 6. acquire hands-on experience in analyzing common environmental pollutants. \r   完成修讀本課程的學生應具備以下能力： 1. 熟悉化學實驗一般操作技術；\r 2. 熟悉常用儀器的使用，例如紅外和紫外可見光分光光度計；\r 3. 能夠記錄和分析實驗資料，撰寫實驗報告；\r 4. 瞭解化學的一些基本原理，包括酸堿反應，熱力學和動力學，絡合平衡，以及過渡金屬的配位元化學; 5. 學會實驗設計和計畫；\r 6. 獲得分析常見環境污染物的實踐經驗。\r  完成修读本课程的学生应具备以下能力： 1. 熟悉化学实验一般操作技术；\r 2. 熟悉常用仪器的使用，例如红外和紫外可见光分光光度计；\r 3. 能够记录和分析实验数据，撰写实验报告；\r 4. 了解化学的一些基本原理，包括酸碱反应，热力学和动力学，络合平衡，以及过渡金属的配位化学; 5. 学会实验设计和计划；\r 6. 获得分析常见环境污染物的实践经验。", "syllabus": "Experiment List:\r 1. Synthesis of Alum Crystals from Scrap Metal\r 2. Rates of Chemical Reactions\r 3. Alkalinity of Water\r 4. Total Phosphorus Content in Polluted Water\r 5. Determination of the Iron Content in a Vitamin Tablet\r 6. (a) Tyndall Effect in Starch and Gelatin Colloids (b) Infra-Red Analysis of CuC12-DMSO Complex \r 7. Determination of Total Aldehydes in Indoor Environment with Impinger Sampling\r 8. Sampling of NOx (NO+NO2) and Particulates\r  實驗一覽表： 1. 從金屬廢料合成鋁鉀礬\r 2. 化學反應速率\r 3. 水體的鹼度\r 4. 污水樣本的總磷含量的測定\r 5. 維他命丸中鐵含量的測定\r 6. (a) 澱粉和明膠膠體的廷得耳效應\r  (b) CuCI2-DMSO 複合物的紅外光光譜及其分析\r 7. 採用衝擊瓶採樣法測量室內環境中總醛含量\r 8. 氮化物及空氣中微粒的取樣與分析\r  实验一览表：  1.从金属废料合成铝钾矾\r 2.化学反应速率\r 3.水体的碱度\r 4.污水样本的总磷含量的测定\r 5.维他命丸中铁含量的测定\r 6.（a）淀粉和明胶胶体的廷得耳效应\r  （b）CuCl 2 -DMSO复合物的红外光光谱及其分析\r 7.采用冲击瓶采样法测量室内环境中总醛含量\r 8.氮化物及空气中微粒的取样与分析", "required_readings": "\n   ENSC2517_Required_Reading     1. S. E. Manahan, Environmental Chemistry, 7th Ed., Lewis publishers, Boca Raton, 2000. 2. N. J. Bunce, Introduction to Environmental Chemistry, Wuerz Publishing, Winnipeg, 1993. 3. P. E. Buell and J. E. Girard, Chemistry: An Environmental Perspective, Prentice Hall, Englewood Cliffs, 1994.   ", "recommended_readings": "﻿           ", "terms": {"2020-21 Term 1": {"-L01-LAB (7577)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr. CHAN Ka Long Donald, \n\rProfessor LEE Hung Kay"]}}}}, {"code": "3230", "title": "Principles of Environmental Protection and Pollution Control", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Environmental Science Pgm Comm", "requirements": "1. Prerequisite: ENSC2270 or permission of the instructor.;2. Not for students who have taken GRMD3202.", "description": "This course discusses from a multidisciplinary viewpoint the anthropogenic causes of environmental degradation and the various approaches to environmental protection and pollution control. Students are introduced the concept of sustainability in environmental protection, economic measures and voluntary approach in environmental management, control and treatment technologies, and their comparative effectiveness in the abatement of various types of pollution. Management programmes and control strategies in tackling local environmental problems are illustrated.\r", "outcome": "Students are expected to understand the multidisciplinary nature of environmental management, learn the various measures (regulatory, economic, technological) available, and aware of different stakeholders' needs and the constraints in environmental protection. Students should be able to:\r   1. understand the socio-economic causes of environmental problems; 2. view environment as a site for conflict and environmental solutions for conflict resolution; 3. sustainability as the core conceptual principle of environmental protection; 4. appreciate that environmental protection can be achieved by changes in environmental attitudes and ethics; 5. sole use of technologies cannot eliminate environmental problems, but integration of technical and nontechnical measures (incl voluntary corporate environmental management) in environmental protection; 6. environmental protection strategies and their inadequacies in tackling local environmental problems.\r   學生預期將會認識環境管理多學科的特性，學會各種可用的環境管理(法律、經濟及技術)手段，及了解持份者不同的需求和環境保護的限制。學生應能：\r 1. 了解環境問題的社會經濟成因\r 2. 觀察環境為衝突的場所及解決矛盾的方法\r 3. 認識可持續發展作為環境保護的核心概念原則\r 4. 從社會改變看環境保護\r 5. 應用綜合技術及非技術手段保護環境\r 6. 明白本地環境管理計劃及其不足\r   学生预期将会认識环境管理多学科的特性，学会各种可用的环境管理(法律、经济及技术)手段，及了解持份者不同的需求和环境保护的限制。学生应能：\r 1. 了解环境问题的社会经济成因\r 2. 观察环境为冲突的场所及解决矛盾的方法\r 3. 认识可持续发展作为环境保护的核心概念原则\r 4. 从社会改变看环境保护\r 5. 应用综合技术及非技术手段保护环境\r 6. 明白本地环境管理计划及其不足", "syllabus": "1. Environmental crises – Trends and causes\r 2. Sustainable development\r 3. Environmental management – Elements and approaches\r 4. Air pollution control\r 5. Water pollution control\r 6. Solid waste management\r 7. Hazardous waste management\r  1. 環境危機 –趨勢與成因\r 2. 可持續發展\r 3. 環境管理 –要素與方法\r 4. 空氣污染控制\r 5. 水污染控制\r 6. 固體廢物管理\r 7. 有害廢物管理\r  1. 环境危机 –趋势与成因\r 2. 可持续发展\r 3. 环境管理 –要素与方法\r 4. 空气污染控制\r 5. 水污染控制\r 6. 固体废物管理\r 7. 有害废物管理", "required_readings": "1. Wright, R.T. and Boorse, D.F. (2017) Environmental Science. Towards a Sustainable Future (13th Ed.). Pearson Prentice Hall, Upper Saddle River, New Jersey\r 2. Enger, E.D. & Smith, B.F. (2013) Environmental Science: A Study of Interrelationships (13th Ed.). McGraw-Hill, Dubuque . \r 3. Withgott, J & Brennan, S. (2014) Environment. The Science Behind the Stories (5th Ed.). Benjamin Cummings, Boston.", "recommended_readings": "1. Cunningham, W.P. & Cunningham, M.A. (2015) Environmental Science: A Global Concern (13th Ed.). McGraw-Hill, Boston.. \r 2. Chiras, D.D. (2010) Environmental Science. Creating a Sustainable Future (8th Ed.). Jones and Barlett Publishers, Sudbury. \r 3. Davis, M.L. & Masten, S.J. (2014) Principles of Environmental Engineering and Science (3rd Ed.). McGraw Hill, New York. \r 4. Mines, R.O. Jr. (2014) Environmental Engineering: Principles and Practice. Wiley Blackwell, Hoboken, NJ.\r 5. Weiner, R.F. and Matthews, R.A. (2003) Environmental Engineering (4th Ed.). Butterworth- Heinemann, Amsterdam.\r 6. Mtchell, B. (2002) Resource and Environmental Management (2nd Ed.). Longman, Harlow.\r 7. O'Riordan, T. (2000) Environmental Science for Environmental Management (2nd Ed.). Prentice Hall, Essex.\r 8. Dryzek, J.S. & Schlosberg, D. (2005) Debating the Earth – The Environmental Politics Reader (2nd Ed.). Oxford University Press, Oxford.\r 9. Selected articles from webs", "terms": {"2020-21 Term 2": {"--LEC (5588)": {"startTimes": ["10:30", "11:30"], "endTimes": ["12:15", "12:15"], "days": [2, 4], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor CHU Lee Man", "Professor CHU Lee Man"]}}}, "assessments": {"Homework or assignment": "10", "Others": "10", "Presentation": "10", "Short answer test or exam": "40", "Selected response test or exam": "30"}}, {"code": "3415", "title": "Environmental Instrumentation Techniques", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Environmental Science Pgm Comm", "requirements": "Not for students who have taken CHEM2400 or CHEM3410. Prerequisite: ENSC2515.", "description": "This course aims to provide students with a basic understanding of the operational principles and applications of various instrumental techniques commonly used for the studies of air and water pollution. It is designed to cover atomic and molecular absorption and emission spectroscopy, mass spectrometry, gas chromatography, high-performance liquid chromatography, and electrochemical methods. Emphasis will be placed on the application of such techniques for pollution monitoring and preventive detection systems, especially with reference to the identification and determination of trace levels of toxic heavy metals, organic and organometallic compounds.\r", "outcome": "1. To allow students to gain fundamental knowledge of the principles of instrumental techniques. \r 2. To allow students to gain fundamental knowledge of mathematical techniques required in treatment of analytical data.\r 3. To allow students to gain the ability of recognizing key factors and applying appropriate assumption to formulate solutions for environmental analysis.\r 4. To allow students to acquire problem solving skills including ability to identify key issues and formulate feasible solutions of problems based on logical analysis and critical thinking.\r 5. To develop students’ critical evaluation of issues based on evidence and scientific logic.\r 6. To allow students to gain ability of analyzing issues quantitatively with the sense of level of uncertainty and reliability.\r 7. To enhance students’ awareness of impacts of instrumental analysis in environmental, social, economic, industrial, and technological aspects.\r 8. To enhance students’ confidence in ability of solving problems.\r  本課程應使學生獲得以下能力： 1. 掌握儀器基本原理。\r 2. 掌握資料處理所需的基礎數學知識。\r 3. 獲得識別關鍵因素的能力，並應用適當的假設來制定環境分析解決方案。\r 4. 掌握解決問題的能力，包括識別問題的關鍵，並根據邏輯分析和批判性思維制定可行的解決方案。\r 5. 根據證據和科學邏輯，培養學生對問題的辨證評價。\r 6. 能夠定量分析問題的不確定性和準確性。\r 7. 提高學生關於儀器分析對環境，社會，經濟，工業和技術方面的影響的認知。\r 8. 提高學生解決問題的信心\r   本课程应使学生获得以下能力： 1. 掌握仪器基本原理。\r 2. 掌握数据处理所需的基础数学知识。\r 3. 获得识别关键因素的能力，并应用适当的假设来制定环境分析解决方案。\r 4. 掌握解决问题的能力，包括识别问题的关键，并根据逻辑分析和批判性思维制定可行的解决方案。\r 5. 根据证据和科学逻辑，培养学生对问题的辨证评价。\r 6. 能够定量分析问题的不确定性和准确性。\r 7. 提高学生关于仪器分析对环境，社会，经济，工业和技术方面的影响的认知。\r 8. 提高学生解决问题的信心", "syllabus": "This course will be divided into the following parts:\r (1) Treatment of Analytical Data\r (2) Spectroscopic Techniques (UV-VIS, IR, AAS, ICP, MS and XRF)\r (3) Electrochemical Methods (Potentiometry, Coulometry and Voltammetry)\r (4) Chromatographic Techniques (GC and HPLC)\r (5) Environmental Sampling and Analysis\r  本科分為以下幾個部分:\r  (1)資料的處理和分析\r (2)光譜技術(可見-紫外光譜、紅外光譜、原子吸收光譜、ICP 法、質譜和X 射線螢光)\r (3)電化學分析法(電勢測定法、庫侖法和伏安法)\r (4)色譜技術(氣相色譜和高效液相色譜)\r (5)環境取樣及分析\r  本科分为以下几个部分:\r (1)数据的处理和分析\r (2)光谱技术(可见-紫外光谱、红外光谱、原子吸收光谱、ICP 法、质谱和X 射线荧光)\r (3)电化学分析法(电势测定法、库仑法和伏安法)\r (4)色谱技术(气相色谱和高效液相色谱)\r (5)环境取样及分析", "required_readings": "    ENSC3415_Required_Reading     D. A. Skoog, F. J. Holler and T. A. Nieman: Principles of Instrumental Analysis, 6th ed., Thomson, 2006.    ", "recommended_readings": "    ENSC3415_Recom_Reading     1. R. Reeve: Introduction to Environmental Analysis, Wiley, 2002. 2. G. Christian: Analytical Chemistry, 6th ed., Wiley, 2004.    ", "terms": {"2020-21 Term 2": {"--LEC (5434)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor CHAN Tak Wah Dominic"]}}}, "assessments": {"Homework or assignment": "30", "Short answer test or exam": "40", "Selected response test or exam": "30"}}, {"code": "3417", "title": "Environmental Instrumentation Techniques Laboratory", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Environmental Science Pgm Comm", "requirements": "Corequisite: ENSC3415 or permission of the instructor", "description": "This laboratory course provides students with hands-on experience in applying and operating various instrumental techniques that are commonly used in environmental analysis. In addition, this course also provides practical training to students in collecting, handling and treating the samples.\r", "outcome": "1. To allow students to gain experience on understanding and analyzing specified goals.\r 2. To allow students to gain experience on carrying out appropriate experiments for specified goals.\r 3. To allow students to be familiar with the use of resources of chemical literature and databases.\r 4. To develop students’ convergent thinking and convergent thinking.\r 5. To allow students to acquire experimental skills in different disciplines of analytical chemistry.\r 6. To allow students to strengthen their analytical chemistry background through performing experiments.\r 7. To allow students to gain experience on applying analytical chemistry knowledge onto experimental works.\r 8. To stimulate students’ creativity to solve for difficulties encountered in experiments, to suggest possible causes for undesirable results, and to summarize and analyze raw data for conclusions.\r 9. To enhance students’ written skills in presenting conclusion from raw data.\r 10. To enhance students’ professional communication skills with colleagues and supervisors.\r 11. To enhance students’ skills to collaborate with other people.", "syllabus": "This course aims to provide students with hands-on experience in applying different types of instrumental techniques in environmental analysis including spectroscopic, electrochemical and chromatographic techniques.", "required_readings": "    ENSC3417_Required_Reading     D. A. Skoog, F. J. Holler and T. A. Nieman: Principles of Instrumental Analysis, 6th ed., Saunders, 2006.    ", "recommended_readings": "    ENSC3417_Recom_Reading     Please refer to the laboratory manual for the references of each experiment.    ", "terms": {"2020-21 Term 2": {"-L01-LAB (5433)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Science Centre 130A"], "instructors": ["Dr. CHAN Ka Long Donald, \n\rProfessor CHAN Tak Wah Dominic"]}}}, "assessments": {"Lab reports": "60", "Others": "40"}}, {"code": "3520", "title": "Environmental and Biochemical Toxicology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Environmental Science Pgm Comm", "requirements": "Pre-requisite: BCHE2030 and BIOL2120, or permission of the instructor.", "description": "The first part of this course introduces the sources, chemical nature and environmental effects of major environmental toxicants. The second part covers the fundamental basis of toxic action of chemical substances including environmental toxicants on living systems. The third part provides students an understanding of the basic principles and biochemical mechanisms of toxicology. This course will also cover the basic concepts of biomonitoring and ecotoxicology.\r", "outcome": "Students will understand the sources and chemical nature of selected toxicants, and the carcinogenesis, hepatotoxicity and neurotoxicity caused by the toxicants. They will know how the toxicity of chemical substances including some common toxic metals, carcinogens, pesticides and natural toxins can be changed. They will also study the basic techniques in ecotoxicology, and able to plan and carry out environmental monitoring and ecotoxicological studies of the impacts of environmental pollutants on local organisms.\r     學生能夠瞭解到一般毒物包括金屬、致癌物、農藥和天然毒物的來源和其所引致的癌病，肝和神經系统中毒的原因，及導致生物中毒的因素。學生應學習生態毒理學的基本技術，並能夠計劃和進行環境監測，及針對環境污染物對本地生物的影響，進行生態毒理學研究。     学生能够了解到一般毒物包括金属、致癌物、农药和天然毒物的来源和其所引致的癌病，肝和神经系统中毒的原因，及导致生物中毒的因素。学生应学习生态毒理学的基本技术，并能够计划和进行环境监测，及针对环境污染物对本地生物的影响，进行生态毒理学研究。", "syllabus": "1. Sources and chemical nature of environmental toxicants\r 2. Environmental effects on the selected toxicants\r 3. Microbial bioassay and genotoxicity study\r 4. Biomonitoring, bioindicators and biomarkers\r 5. Ecological effects of the toxicants (Eco-toxicology)\r 6. Regulatory toxicology and risk assessment\r 7. Biochemical aspects of toxicology and dose-response relationship\r 8. Biological factors that influence toxicity (in vitro/ in vivo analyses, toxicant processing)\r 9. Chemical factors that influence toxicity (classes of toxicants)\r 10. Chemical carcinogenesis, mutagenesis and cellular sites of toxic actions \r 11. Hepatotoxicity and drug metabolisms (Phase I, II and III metabolism)\r 12. Reproductive and developmental toxicity (teratogenesis)\r 13. Neurotoxicity and natural toxins\r   1.環境毒物的來源和化學性質 \r 2.所選毒物對環境的影響 \r 3.微生物生物測定和遺傳毒性研究 \r 4.生物監測，生物指示劑和生物標記物 \r 5.有毒物質的生態影響（生態毒理學） \r 6.監管毒理學和風險評估 \r 7.毒理學的生化方面和劑量反應關係 \r 8.影響毒性的生物因素（體外/體內分析，毒物處理） \r 9.影響毒性的化學因素（毒物類別） \r 10.化學致癌作用，誘變和毒性作用引起的細胞改變部位 \r 11.肝毒性和藥物代謝（I期，II期和III期代謝） \r 12.生殖和發育毒性（致畸作用） \r 13.神經毒性和天然毒素\r  1.环境毒物的来源和化学性质 \r 2.所选毒物对环境的影响 \r 3.微生物生物测定和遗传毒性研究 \r 4.生物监测，生物指示剂和生物标记物 \r 5.有毒物质的生态影响（生态毒理学） \r 6.监管毒理学和风险评估 \r 7.毒理学的生化方面和剂量反应关系 \r 8.影响毒性的生物因素（体外/体内分析，毒物处理） \r 9.影响毒性的化学因素（毒物类别） \r 10.化学致癌作用，诱变和毒性作用引起的细胞改变部位 \r 11.肝毒性和药物代谢（I期，II期和III期代谢） \r 12.生殖和发育毒性（致畸作用） \r 13.神经毒性和天然毒素", "required_readings": "Hodgson, E. (ed) 2010. A Textbook of Modern Toxicology, 4th Ed., John Wiley & Sons, Inc. 648 p. RA1211.H62 2010.", "recommended_readings": "Klaassen, C. (ed) 2013. Casarett & Doull’s Toxicology: The Basic Science of Poisons, 8th Ed., McGraw Hill Education, 1423 p. QV600 615.9", "terms": {"2020-21 Term 2": {"--LEC (6661)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "11:15"], "days": [3, 5], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor LEE Sau Tuen Susanna, \n\rProfessor WONG Po Keung", "Professor LEE Sau Tuen Susanna, \n\rProfessor WONG Po Keung"]}}}, "assessments": {"Essay test or exam": "50", "Short answer test or exam": "50"}}, {"code": "3820", "title": "Environmental and Biochemical Toxicology Laboratory", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Environmental Science Pgm Comm", "requirements": "Co-requisite: ENSC3520.", "description": "Students will conduct practical work including multiple cytotoxicity assay, DNA damage assay, and biomarker assays in laboratory. The practical lab helps students understand the lecture taught in ENSC3520. Students will also be introduced with internationally recognized methods to study how chemicals can have biochemical and ecological impacts as a global citizen. Students are also encouraged to use innovative ideas to design new methods to test chemical toxicity.\r", "outcome": "Part 1: To understand how to conduct cytotoxicity assays on prokaryotic and eukaryotic cells. To know to to determinate LC50 using cultured cells. \r Part 2: To learn enzyme assays with EROD, and antibody study of gene expression, real-time PCR will also be used to study the mRNA levels of biomarker genes;, \r Part 3: To perform DNA damage analysis of comet assay.", "syllabus": "1. In vitro Toxicity Testing of Metal Ions\r 2. inhibition Study of Cholinesterase\r 3. Determination of Polycyclic Aromatic Hydrocarbon (PAH)-induced CYP1A1 Enzymatic Activity using EROD Assay and PAH-induced Hepatotoxicity Using ALT and AST Assays\r 4. Preparation of Microsomes and Determination of Total Proteins in Microsomes\r 5. Determination of CYP1A1 Induction Using EROD Assay and PAH-induced Hepatotoxicity Using Serum Aminotransferase Activities\r 6. Detection of CYPIA levels using ELISA\r 1. 體外金屬離子的毒性測試\r 2. 膽碱酯酶的抑制實驗\r 3. 測定多環碳氫化合物(PAH)誘導CYP1A1，用EROD 檢測相關酶的活性，用ALT, AST 檢測PAH 對肝所引起之毒性\r 4. 微粒體的制備與其蛋白的檢測\r 5. 用 EROD 檢測CYP1A1 誘導率及檢測血清中PAH 所導致的肝毒性和對轉氨酶的活性\r 6. 用酶聯免疫吸附試驗測定CYP1A 水平\r 1. 体外金属離子的毒性测试\r 2. 胆碱酯酶的抑制实验\r 3. 测定多环碳氢化合物(PAH)诱导CYP1A1，用EROD 检测相关酶的活性，用ALT, AST 检测PAH 对肝所引起之毒性\r 4. 微粒体的制备与其蛋白的检测\r 5. 用EROD 检测CYP1A1 诱导率及检测血清中PAH 所导致的肝毒性和对转氨酶的活性\r 6. 用酶聯免疫吸附试验测定CYP1A 水平", "required_readings": "", "recommended_readings": "Listed in laboratory manual for individual lab.", "terms": {"2020-21 Term 2": {"-L01-LAB (8549)": {"startTimes": ["14:30", "16:30"], "endTimes": ["16:15", "18:15"], "days": [2, 2], "locations": ["Lady Shaw Bldg LT1", "Science Centre 188"], "instructors": ["Dr. LO Fai Hang", "Dr. LO Fai Hang"]}}}, "assessments": {"Essay test or exam": "30", "Lab reports": "50", "Others": "10", "Selected response test or exam": "10"}}, {"code": "4240", "title": "Environmental Impact Assessment", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Environmental Science Pgm Comm", "requirements": "Prerequisite: ENSC2270 and BIOL2210.", "description": "This course discusses the techniques and procedures of evaluating environmental consequences arising from human activities, with focus on their application in Hong Kong as prescribed under the Hong Kong Environmental Impact Assessment Ordinance, and its Technical Memorandum. Students are encouraged to take the laboratory course (ENSC4242) together with the lecture in order to have a better integration of theories and practical experiences on the subject.\r", "outcome": "Students completing this course are expected to:\r 1. understand the theory and principles behind the methods and techniques used in environmental impact assessment (EIA); 2. appreciate the processes and requirements of EIA in Hong Kong; 3. become familiar with the protocols and procedures of EIA in Hong Kong. \r   完成本科的學生將：   1. 理解用於環境影響評估（環評）的方法和技術背後的理論和原則; 2. 賞識香港環境影響評估的過程和要求; 3. 熟悉香港環境影響評估的協議和程序。\r   完成本科的学生将：   1. 理解用于环境影响评估（环评）的方法和技术背后的理論和原则; 2. 赏識香港环境影响评估的过程和要求; 3. 熟悉香港环境影响评估的协议和程序。", "syllabus": "• Environmental Impact Assessment (EIA) – Principles and Concepts\r - Origin and Development of EIA\r • Overview of EIA in Hong Kong\r - EIA Ordinance\r - EIA Technical Memorandum\r • Procedure and Processes of EIA\r - Methods of Impact Analysis\r - Desirable Properties of EIA Methods\r • Methods for Identification of Impacts\r - Checklist and Matrix\r - Geographical Information System (GIS)\r • Methods for Prediction of Impacts\r - Simulation and Computer Modeling\r - Statistical and Environmental Data Analysis\r • Methods for Evaluation of Impacts\r - Cost-Benefit Analysis\r - Environmental Risk Assessment\r • Detailed Procedure and Requirements in Hong Kong EIA\r - Description of the Environmental Setting\r - Prediction, Evaluation and Mitigation of the Impact\r i. Air quality\r ii. Noise quality\r iii. Water quality\r iv. Waste management\r v. Ecology\r vi. Fisheries\r vii. Visual and landscape\r viii. Cultural Heritage\r ix. Socio-economic\r • Presentation and Review\r • Public Participation in EIA\r • Environmental Monitoring and Auditing\r • Strategic Environmental Assessment\r • Cumulative Impact Analysis\r  • 環境影響評估（環評）-原理和概念\r 環境影響評估的起源與發展 • 香港環境影響評估的概述 - 環境影響評估條例\r - 環境影響評估技術備忘錄\r • 環境影響評估的程序和進程 - 影響分析的方法\r - 環境影響評估方法的優良特性\r • 識別環境影響的方法 - 清單和矩陣\r - 地理信息系統（GIS）\r • 環境影響的預測方法 - 仿真與電腦模擬\r - 統計學應用和環境數據分析\r • 環境影響的評價方法 - 成本效益分析\r - 環境風險評價\r • 香港環境影響評估的詳細程序和要求 - 環境設定之描述\r - 預測、評價及緩和減輕環境影響的衝擊\r 一.空氣質量\r 二.噪音質量\r 三.水質\r 四.廢棄物管理\r 五.生態\r 六.漁業\r 七.視覺及景觀\r 八.文化遺產\r 九.社會經濟\r • 報告和評論 • 公眾在環境影響評估中的參與 • 環境監察及審核 • 戰略環境評價 • 累積影響分析  • 环境影响评估（环评）-原理和概念\r 环境影响评估的起源与发展 • 香港环境影响评估的概述 - 环境影响评估条例\r - 环境影响评估技术备忘錄\r • 环境影响评估的程序和进程 - 影响分析的方法\r - 环境影响评估方法的优良特性\r • 識别环境影响的方法 - 清单和矩阵\r - 地理信息系统（GIS）\r • 环境影响的预测方法 - 仿真与计算机仿真\r - 统计学应用和环境數据分析\r • 环境影响的评价方法 - 成本效益分析\r - 环境风险评价\r • 香港环境影响评估的详细程序和要求 - 环境设定之描述\r - 预测、评价及缓和减轻环境影响的冲击\r 一.空气质量\r 二.噪音质量\r 三.水质\r 四.废弃物管理\r 五.生态\r 六.渔业\r 七.视觉及景观\r 八.文化遗产\r 九.社会经济\r • 报告和评論 • 公众在环境影响评估中的參与 • 环境监察及审核 • 战略环境评价 • 累积影响分析", "required_readings": "    ENSC4240_Required_Reading     Hong Kong EIA Ordinance and Technical Memoradum, Environment Protection Department, Hong Kong SAR Government    ", "recommended_readings": "    ENSC4240_Recom_Reading     • Carroll Barbara, Turpin Trevor. 2002. Environmental Impact Assessment Handbook: A Practical Guide for Planners, Developers and Communities Thomas Telford, London. [TD194.68.G7 C377 2002] • Glasson John, Therivel Riki, Chadwick Andrew. 1999. Introduction to Environmental Impact Assessment: principles and procedures, process, practice and prospects. 2nd ed. UCL Press Limited, London. 342 pp. ISBN 1-85728-118-7 [TD 194.68 G7 G58 1999] • Hanna, Kevin S. (ed.) 2005. Environmental Impact Assessment: Practice and Participation. Oxford University press, Don Mills, Ont.; New York. [TD194.68.C3 E55 2005] • Morris Peter, Therivel Riki. (eds). 2001. Methods of Environmental Impact Assessment. 2nd ed. Spon Press, London and New York. [TD194.68 G7 M48 2001] P. 4 • Pastorok, Robert A.et al. (eds) 2002. Ecological modeling in Risk Assessment: Chemical Effects on Populations, Ecosystems, and Landscapes. Lewis Publishers, Boca Raton, Fla. [QH545.A1 E277] • Sadar, M.H. 1996. Environmental Impact Assessment. 2nd Ed. Carlton University Press, Ottawa. [TD194.6 S33 1996] • Suter, Glenn W. (ed.). 2007. Ecological Risk Assessment. CRC press/Taylor & Francis, Boca Raton. [QH541.15.R57 E25 2007] • Wood Christopher. 1995. Environmental Impact Assessment. A Comparative Review. Longman Scientific & Technical, Essex. ISBN 0-582-23696-7 [TD 194.6 W66 1995]    ", "terms": {"2020-21 Term 1": {"--LEC (7324)": {"startTimes": ["8:30", "9:30"], "endTimes": ["10:15", "10:15"], "days": [5, 1], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Dr. CHEUNG Ma Shan, \n\rDr. CHUI Pui Yi", "Dr. CHEUNG Ma Shan, \n\rDr. CHUI Pui Yi"]}}}, "assessments": {"Short answer test or exam": "60", "Selected response test or exam": "40"}}, {"code": "4242", "title": "Environmental Impact Assessment Laboratory", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Environmental Science Pgm Comm", "requirements": "Corequisite: ENSC4240", "description": "This laboratory course accompanies the lecture course ENSC4240 and provides hands-on exercises on selected techniques used in environmental impact assessment (EIA). Students will critically review a current EIA report with respect to its soundness in the application of EIA methodologies and the evaluation of assessment results. They will also gain first-hand experience on how to carry out an EIA by working on a small scale EIA project focusing on specific components of impact assessment.\r", "outcome": "Students completing this course are expected to:\r   1. obtain a first hand understanding of how Environmental Impact Assessment (EIA) works in Hong Kong by reviewing and critically evaluating existing Hong Kong EIA reports; 2. gain hands-on experiences on how some EIA protocols are carried out; 3. develop the practical skills of doing an EIA by getting involved in actual preparation of a project profile, study brief and by actually carrying out a small scale EIA project; 4. learn from the experiences of front-line practitioners of EIA in Hong Kong by engaging in sharing and discussion with them during guest presentations; 5. strengthen their communication skills through oral presentation and report writing.\r     完成本科的學生將：   1. 通過檢討和批判性評估香港現有的環境影響評估（EIA）報告，從而了解環境影響\r 評估報告之運作； 2. 了解環境影響評估的規則；\r 3. 通過實際編制工程項目簡介、研究概要和實際開展了小規模的環境影響評估項目，\r 培養實際進行環境影響評估的技巧； 4. 藉著和在香港從事環境影響評估的前線工作者的交流及討論，借鑒及學習他們的工\r 作經驗； 5. 通過口頭和書面報告，加強學生的溝通技巧。\r   完成本科的学生将：   1. 通过检讨和批判性评估香港现有的环境影响评估（EIA）报告，从而了解环境影响\r 评估报告之运作； 2. 了解环境影响评估的规则；\r 3. 通过实际编制工程项目简介、研究概要和实际开展了小规模的环境影响评估项目，\r 培养实际进行环境影响评估的技巧； 4. 借着和在香港从事环境影响评估的前线工作者的交流及讨論，借鉴及学习他们的工\r 作经验； 5. 通过口头和书面报告，加强学生的沟通技巧。", "syllabus": "•Review of Hong Kong EIA Reports\r •Preparation of Project Profile and Study Brief\r •Methods of EIA: Landscape and Visual Impact Assessment\r •Methods of EIA: Use of Statistics\r •Methods of EIA: Ecological Impact Assessment\r •Methods of EIA: Noise Impact Assessment\r •Methods of EIA: Air Impact Assessment\r •Field Trip: Ecological site of conservation value\r •Guest Speakers on various topics, including but not limited to Ecological Impact\r Assessment /Fisheries Impact Assessment, Water Quality Impact Assessment, Noise\r Impact Assessment, Environmental Monitoring and Audit, Public Engagement in\r Hong Kong EIA\r •Small scale EIA project, complete with oral presentation and EIA report writing.\r Course Syllabus(Chinese)\r   • 檢討香港環境影響評估報告 • 編制項目簡介及研究概要 • 環境影響評估方法：景觀及視覺影響評估 • 環境影響評估方法：統計學的使用 • 環境影響評估方法：生態影響評價 • 環境影響評估方法：噪音影響評估 • 環境影響評估方法：空氣影響評估 • 實地考察：具生態保育價值的地點 • 不同演講嘉賓，主題可能包括但不限於生態環境影響評估 /漁業影響評價，水質\r 影響評價，噪音影響評估，環境監測及審核，公眾在香港環境影響評估中的參 與程度 • 小規模的環境影響評估項目，需完成口頭報告和環評報告的撰寫  • 检讨香港环境影响评估报告 • 编制项目简介及研究概要 • 环境影响评估方法：景观及视觉影响评估 • 环境影响评估方法：统计学的使用 • 环境影响评估方法：生态影响评价 • 环境影响评估方法：噪音影响评估 • 环境影响评估方法：空气影响评估 • 实地考察：具生态保育价值的地点 • 不同演讲嘉宾，主题可能包括但不限于生态环境影响评估 /渔业影响评价，水质\r 影响评价，噪音影响评估，环境监测及审核，公众在香港环境影响评估中的參 与程度 • 小规模的环境影响评估项目，需完成口头报告和环评报告的撰写", "required_readings": "    ENSC4242_Required_Reading     1. S.E. Manahan, Environmental Chemistry, 7th Ed., Lewis publishers, Boca Raton, 2000. 2. N.J. Bunce, Introduction to Environmental Chemistry, Wuerz Publishing, Winnipeg, 1993. 3. P.E. Buell and J.E. Girard, Chemistry: An Environmental Perspective, Prentice Hall, Englewood Cliffs, 1994.     ", "recommended_readings": "    ENSC4242_Recom_Reading     Suggested on a case to case basis.    ", "terms": {"2020-21 Term 1": {"-L01-LAB (7325)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. CHUI Pui Yi"]}}}, "assessments": {"Attendance": "10", "Lab reports": "90"}}, {"code": "4250", "title": "Environmental Health", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Environmental Science Pgm Comm", "requirements": "Prerequisite: ENSC3520.", "description": "This course introduces the contemporary problems and issues in environmentally dependent aspects of health. Broad coverage of health effects of foodborne, airborne and waterborne pollutants, pesticides, and consumer product are considered.\r", "outcome": "This course is designed to give students an overview of the sources, modes of action, and health effects of the global and local important pollutants including pesticides, food additives, transgenes in genetically modified foods, environmental tobacco smoke, indoor air pollutants, water pollutants, peroxisome proliferators, environmental estrogens, and benzene. After the study, the student should be able to: \r 1. Describe the sources of the pollutants\r 2. Understand the modes of action of the pollutants\r 3. Familiar with the symptoms and human health effects resulting from exposure to the pollutants\r 4. Discuss ways to reduce our exposure to the pollutants\r   本科旨在給學生概述全球和本地重要的污染物之來源，動作模式和對健康的影響。 本科研討的污染物包括農藥，食品添加劑，轉基因食品內的轉基因，環境煙草煙霧 ，室內空氣污染物，水污染物，過氧化物酶體增殖物，環境雌激素和苯。學習結束 後，學員應該能夠： 1. 描述污染物的來源\r 2. 了解污染物的動作模式\r 3. 熟悉人類接觸到污染物後的症狀和對健康造成的影響\r 4. 討論我們如何減少接觸到污染物\r   本科旨在给学生概述全球和本地重要的污染物之來源，动作模式和对健康的影响。 本科研讨的污染物包括农药，食品添加剂，转基因食品内的转基因，环境烟草烟雾 ，室内空气污染物，水污染物，过氧化物酶体增殖物，环境雌激素和苯。学习结束 后，学员应该能够： 1. 描述污染物的來源\r 2. 了解污染物的动作模式\r 3. 熟悉人類接触到污染物后的症狀和对健康造成的影响\r 4. 讨論我们如何减少接触到污染物", "syllabus": "•Pesticides\r •Food additives\r •Genetic modified foods\r •Environmental tobacco smoke\r •Indoor air pollutants\r •Drinking water quality and health\r •Peroxisome proliferators\r •Environmental estrogens\r •Occupational chemical hazards\r  • 農藥 • 食品添加劑 • 轉基因食品 • 環境煙草煙霧 • 室內空氣污染物 • 飲用水質量和健康 • 過氧化物酶體增殖物 • 環境雌激素 • 職業化學危害  • 农药 • 食品添加剂 • 转基因食品 • 环境烟草烟雾 • 室内空气污染物 • 饮用水质量和健康 • 过氧化物酶体增殖物 • 环境雌激素 • 职业化学危害", "required_readings": "             ", "recommended_readings": "    ENSC4250_Recom_Reading     Pesticides: 1. F. P. Kaloyanova and M. A. El Batawi (eds.). Human Toxicology of Pesticides. CRC Press. 1991. (WA240K2781991) 2. K. A. Hassall (ed.). The Biochemistry & Uses of Pesticides. 2nd ed. Macmillan Press. 1990. (SB951H2771990) 3. M. A. Kamrin (ed.). Pesticides Profiles: Toxicity, Environmental Impact, and Fate. CRC Press. 1997. (SB951P3761997) 4. S. R. Baker and C. F. Wilkinson (eds.). The Effect of Pesticides on Human Health. Vol XVIII. Princeton Scientific Publishing Co., Inc. 1990. (WA670A38v.18c.2) Food additives and contaminants: 5. J. M. Concon. Food Toxicology: Part B. Contaminants and Additives. Marcel Dekker Inc., New York. 1988. (WA712.066.ptB) 6. L. M. Crawford and D. A. Franco (eds.). Animal Drugs and Human Health. Technomic Publishing Co. Inc., Lancaster. 1994. (WA707.A55.1994) 7. C. S. Creaser and R. Purchase (eds.). Food Contaminants: Sources and Surveillance. The Royal Society of Chemistry, Cambridge. 1991. (TX531.F56.1991) 8. J. A. Maga and A. T. Tu (eds.). Food Additive Toxicology. Marcel Dekker Inc., New York. 1995. (TX553.A3F563.1995) Genetically modified foods: 9. K. Roseboro (ed.). Genetically Altered Foods and Your Health. Basic health Publications, North Bergen, New Jersey. 2004. (WA695.R67.2004) 10. F. E. Ahmed (ed.). Testing of Genetically Modified Organisms in Foods. Food Products Press, New York. 2004. (WA701.T45.2004) Environmental tobacco smoke: 11. E. L. Wynder and J. Garland (eds.). The Biologic Effects of Tobacco. Little Brown and Company. Boston. 1995. (QP981.T6W9) 12. N. L. Benowitz (ed). Nicotine Safety and Toxicity. Oxford University Press, New York. 1998. (QV137N551998) 13. W. R. Martin, G. R. Van Loon, E. T. Iwamoto and L. Davis (eds.) Tobacco Smoking and Nicotine: A Neurobiological Approach. Plenum Press, New York and London. 1987. (QV137T62) Indoor air pollutants: 14. D. J. Hansen (ed.). The Work Environment. Vol. 3. Indoor Health Hazards. Ch. 3. Lewis Publishers, BoCa Ration. 1994. (WA400W671994). 15. J. E. Craig. Indoor Air Quality and Pollution. Ch. 3. In Pathology of Environmental and Occupational Diseases. Mosby, St. Louis. 1995. (WA30C761995). 16. H. Koren (ed.). Handbook of Environmental Health and Safety. Principles and Practices. Vol. II. 2nd ed. Lewis Publishers. National Environmental Health Association. 1991. (WA30K671991v.2). 17. A. M. Pope and D. P. Rall (eds.). Environmental Medicine: Integrating a Missing Element into Medical Education. National Academy Press. Washington, DC. 1995. (WA. 510.I567.1995) Drinking water quality and health: 18. W. Viessman, Jr. and M. J. Hammer (eds.). Water Supply and Pollution Control. 6th ed. Addison-Wesley Longman, Inc. California. 1998. (TD353V541998) 19. G. A. McFeters (ed.). Drinking Water Microbiology. Springer-Verlag. New York. 1990. (TD384D75) 20. J. E. Craighead. Pathology of Environmental and Occupational Disease. Mosby, St. Louis. 1995. (WA30C761995) 21. Guidelines for Drinking-Water Quality. 2nd ed. Vol. 2. World Health Organization. Geneva. 1996. (TD215W671993.v.2) Peroxisome proliferators: 22. S. S. T. Lee, T. Pineau, J. Drago, E. J. Lee, Jennie W. Owens, D. L. Kroetz, P. M. Fernandez-Salguero, H. Westphal and F. J. Gonzalez. Targeted Disruption of the Alpha Isoform of the Peroxisome Proliferator-Activated Receptor Gene in Mice Results in Abolishment of the Pleiotropic Effects of Peroxisome Proliferators. Molec. Cell. Biol. 15:3012-3022, 1995. 23. H. Keller, A. Mahfoudi, C. Dreyer, A. K. Hihi, J. Medin, K. Ozato and W. Wahli. Peroxisome Proliferator-Activated Receptors and Lipid Metabolism. Annals New York Academy of Sciences. 304:157-173, 1990. 24. J. K. Reddy, T. Suga, G. P. Mannaerts, P. B. Lazarow and S. Subramani (eds.). Peroxisomes: Biology and Role in Toxicology and Disease. Annals of the New York Academy of Sciences. New York. Volume 804. 1996. 25. J. M. Peters, R. C. Cattley and F. J. Gonzalez. Role of PPAR in the Mechanism of Action of the Nongenotoxic Carcinogen and Peroxisome Proliferator Wy 14,643. Carcinogenesis 18:2029-2033, 1997. Environmental estrogens: 26. J. A. McLachlan. Estrogens in the Environment. Elsevier/North-Holland. New York. 1979. (QV600.D48.v.5) 27. D. L. Davis, H. L. Bradlow, M. Wolff, T. Woodruff, D. G. Hoel and H. Anton-Culver. 28. Medical hypothesis: Xenoestrogens as Preventable Causes of Breast Cancer. Environ. 29. Health Perspect. 101:323-377, 1993. 30. S. H. Safe. Environmental and Dietary Estrogens and Human Health: Is Tthere a Problem? Environ. Health Perspect. 103:346-351, 1995. 31. J. A. McLachlan and S. F. Arnold. Environmental estrogens. American Scientist 84:452 461, 1996. (LJ.SB502. cc) Occupational chemical hazards - benzene: 32. M. Lippmann (ed.). Environmental Toxicants: Human Exposures and their Health Effects. Van Nostrand Reinhold, Mew York. 1992. (WA671E615) 33. A. Hricko. Rings of Controversy Around Benzene. Environmental Health Perspectives. 102:276-281, 1994. 34. J. E. Craighead. Pathology of Environmental and Occupational Disease. Mosby, St. Louis. 1995. (MDWA30C761995) 35. B. S. Levy and D. H. Wegman. Occupational Health: Recognizing and Preventing Work- Related Disease. 3rd ed. Little, Brown and Company, New York. 1995. (WA4400221995)    ", "terms": {"2020-21 Term 2": {"--LEC (7647)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "11:15"], "days": [1, 4], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor LEE Sau Tuen Susanna", "Professor LEE Sau Tuen Susanna"]}}}, "assessments": {"Homework or assignment": "15", "Short answer test or exam": "45", "Selected response test or exam": "40"}}, {"code": "4525", "title": "Advanced Environmental Chemistry", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Environmental Science Pgm Comm", "requirements": "Prerequisite: ENSC2515 or permission of the instructor", "description": "This course is designed to extend students’ understanding of and develop their ability in the application of various aspects of environmental chemistry in relation to the major types of air and water pollution associated with industrial and vehicle emissions. It outlines the basic processes in bleaching and dyeing, electroplating and food processing that give rise to water pollution and application of physico-chemical techniques in controlling such pollution. It also examines combustion processes and the associated applications and limitations of the absorption, adsorption, oxidation-reduction and catalytic conversion techniques in relation toaerial emissions from furnaces and vehicles. Site visits will be arranged where possible to enhance students’ ability in application.\r", "outcome": "Students will become familiar with air and water pollution associated with industrial and vehicle emissions. They will be able to evaluate the basic pollution control and prevention approaches in bleaching and dyeing, electroplating and food processing industries. \r   學生會了解工業和汽車所造成的環境污染，亦可以評價各種污染防治措施在漂染、電鍍及食品工業界的成效。   学生会了解工业和汽車所造成的环境污染，亦可以评价各种污染防治措施在漂染、电镀及食品工业界的成效。", "syllabus": "1. Clean Production\r 2. Metal Finishing Industry\r 3. Electronics Industry\r 4. Textile Industry\r 5. Field Trips HKPC\r 6. Air Pollution\r 7. The Energy Industry\r   1. 清潔生產\r 2. 金屬表面處理工業\r 3. 電子工業\r 4. 漂染業\r 5. 參觀香港生產力促進局\r 6. 空氣污染\r 7. 能源工業\r  1. 清洁生产\r 2. 金属表面处理工业\r 3. 电子工业\r 4. 漂染业\r 5. 參观香港生产力促进局\r 6. 空气污染\r 7. 能源工业\r  ", "required_readings": "             ", "recommended_readings": "    ENSC4525_Recom_Reading     (1) Cleaner Production for a better environment, http://www.hkpc.org/hkcpc/; (2) National Pollution Prevention Roundtable, http://www.p2.org;    ", "terms": {"2020-21 Term 1": {"--LEC (8972)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Dr. CHAN Ka Long Donald"]}}}, "assessments": {"Homework or assignment": "20", "Short answer test or exam": "50", "Selected response test or exam": "30"}}, {"code": "4535", "title": "Chemical Treatment Processes", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Environmental Science Pgm Comm", "requirements": "Prerequisite: ENSC2515 or permission of the instructor", "description": "This course introduces the principles and applications of various chemical and physiochemical processes applicable for treatment and control of air and water pollution. It studies the processes of neutralization, oxidation-reduction, chemical precipitation, coagulation, flocculation, physical separation, absorption, adsorption, filtration, chemical disinfection, solvent extraction, fractional distillation and incineration. It also examines the applicabilities and limitations of such processes with reference to the treatment and recovery of toxic and hazardous chemical wastes. Site visits will be arranged to enhance students’ ability in application.\r", "outcome": "Students will become familiar with various chemical and physico-chemical processes applicable for treatment and control of air and water pollution. They will be able to evaluate the applicabilities and limitations of such processes with reference to the treatment and recovery of toxic and hazardous chemical wastes. \r 學生會了解處理空氣及水污染的各種化學及物理化學程序的原理，亦可以評價這些程序的應用價值和限制。 学生会了解处理空气及水污染的各种化学及物理化学程序的原理，亦可以评价这些程序的应用价值和限制。", "syllabus": "1. Toxic Waste in Love Canal, New York\r 2. Chemical Contamination in Penny's Bay, Hong Kong\r 3. Hong Kong Dioxin Studies\r 4. Treatment of Dioxins\r 5. Emerging Technologies\r 6. Gas-Phase Chemical Reduction\r 7. Solvated\r 8. Molten Salt Oxidation\r 9. Field Trip to Chemical Waste Treatment Centre\r 10. Overview of Technologies\r 11. Water Treatment\r 12. Advanced Oxidation Treatment\r 13. Nanotech\r 14. Energy and Environment\r  1. 細約臘夫運河的有毒廢料\r 2. 香港竹篙灣化學污染\r 3. 香港二噁英研究\r 4. 二噁英的處理\r 5. 新興技術\r 6. 氣相化學還原\r 7. 溶劑化電子\r 8. 熔鹽氧化\r 9. 化學廢料處理中心考察\r 10. 技術概覧\r 11. 水處理\r 12. 深度氧化處理\r 13. 納米技術\r 14. 能源與環境\r  1. 细约臘夫运河的有毒废料\r 2. 香港竹篙湾化学污染\r 3. 香港二恶英研究\r 4. 二恶英的处理\r 5. 新兴技术\r 6. 气相化学还原\r 7. 溶剂化电子\r 8. 熔盐氧化\r 9. 化学废料处理中心考察\r 10. 技术概覧\r 11. 水处理\r 12. 深度氧化处理\r 13. 纳米技术\r 14. 能源与环境", "required_readings": "             ", "recommended_readings": "    ENSC4535_Recom_Reading     1. APEC Virtual Center for Environmental Technology Exchange, http://www.apec_vc.or.jp/e/ 2. Federal Remediation Technologies Roundtable, http://www.frtr.gov    ", "terms": {"2020-21 Term 2": {"--LEC (6400)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Mong Man Wai Bldg 703"], "instructors": ["Professor YU Chai Mei"]}}}, "assessments": {"Homework or assignment": "20", "Short answer test or exam": "50", "Selected response test or exam": "30"}}, {"code": "4901", "title": "Senior Experimental Project I", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Environmental Science Pgm Comm", "requirements": "Pre-requisite: ENSC3520.", "description": "In this course, students carry out an independent research project either provided by the supervisor or jointly decided with the student. To fulfill the course requirement, students are required to discuss their progress with their supervisors regularly and submit a research proposal.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4902", "title": "Senior Experimental Project II", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Environmental Science Pgm Comm", "requirements": "Pre-requisite: ENSC3520.", "description": "In this course, students carry out an independent laboratory research project either provided by the supervisor or jointly decided with the student. Students are required to discuss their progress with their supervisor(s) regularly and submit a progress report at the end of the term. For student who will not be enrolled in ENSC4903, a final report in the form of a manuscript and an oral presentation are assessed at the end of term for performance.\r", "outcome": "Students taken this course are expected to develop the following abilities:\r 1. Integrate the knowledge and skills learnt previously in other courses\r 2. Survey scientific literature relevant to their research project\r 3. Read scientific literature critically to identify the scientific questions or problems\r 4. Design independent research project to address the scientific questions\r 5. Acquire hands-on research techniques in conducting experiments\r 6. Develop problem-solving abilities\r 7. Develop data analysis and interpretation skills in a logical and scientific ways\r 8. Improve skills in scientific writing and oral presentation\r 9. Develop a sense of responsibility and team spirit\r   學生將會發展以下能力： 1) 應用在課堂中獲得的知識及技能\r 2) 搜尋相關文獻的技巧\r 3) 具批判性思維閱讀及分析文獻的內容，並認知及思考當中的科學問題\r 4) 就自己的專題研究題目，設計實驗去解說科學問題\r 5) 各式實驗的操作能力\r 6) 解決問題的能力\r 7) 數據分析，並合乎邏輯性和具科學角度地表述出來\r 8) 書寫合符標準的科技論文及口頭報告的能力\r 9) 有責任感及團體精神\r   学生将会发展以下能力： 1) 应用在课堂中获得的知识及技能\r 2) 搜寻相关文献的技巧\r 3) 具批判性思维阅读及分析文献的内容，并认知及思考当中的科学问题\r 4) 就自己的专题研究题目，设计实验去解说科学问题\r 5) 各式实验的操作能力\r 6) 解决问题的能力\r 7) 数据分析，并合乎逻辑性和具科学角度地表述出来\r 8) 书写合符标准的科技论文及口头报告的能力\r 9) 有责任感及团体精神", "syllabus": "Students should discuss the progress with their supervisors and submit a progress report in the end of the term. Students who do not continue to work on the research project in ENSC4903 should submit a final report and give an oral presentation.\r  學生需定期向教授匯報及討論研究所得的數據。於學期結束前遞交一份研究進展報告。如不修讀ENSC4903，學生須遞交一份書面報告及作口頭報告。\r  学生需定期向教授汇报及讨论研究所得的数据。于学期结束前递交一份研究进展报告。如学生不修读ENSC4903，于学期结束前要递交一份一份符合标准科技论文格式的书面总结报告报告及作口头报告。", "required_readings": "Relevant reference materials to the selected project will be provided by the supervisor", "recommended_readings": "Relevant reference materials to the selected project will be provided by the supervisor", "terms": {"2020-21 Term 1": {"-J01-PRJ (5073)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHU Ka Hou, \n\rProfessor Laura Jane FALKENBERG, \n\rProfessor NGAI Sai Ming"]}}}, "assessments": {"Others": "60", "Report": "40"}}, {"code": "4903", "title": "Senior Experimental Project III", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Environmental Science Pgm Comm", "requirements": "Pre-requisite: ENSC3520 and ENSC4902.", "description": "In this course, students continue to work on and complete the research project from ENSC4902. Relevant data analysis and conclusion formulation are performed after discussion with supervisors. A final report in the form of a manuscript and an oral presentation are assessed at the end of the term for assessment.\r", "outcome": "Students taken this course are expected to develop the following abilities:\r 1) Integrate the knowledge and skills learnt previously in other courses\r 2) Survey scientific literature relevant to their research project\r 3) Read scientific literature critically to identify the scientific questions or problems\r 4) Design independent research project to address the scientific questions \r 5) Acquire hands-on research techniques in conducting experiments\r 6) Develop problem-solving abilities\r 7) Develop data analysis and interpretation skills in a logical and scientific ways\r 8) Improve skills in scientific writing and oral presentation\r 9) Develop a sense of responsibility and term spirit\r   學生將會發展以下能力： 1) 應用在課堂中獲得的知識及技能\r 2) 搜尋相關文獻的技巧\r 3) 具批判性思維閱讀及分析文獻的內容，並認知及思考當中的科學問題\r 4) 就自己的專題研究題目，設計實驗去解說科學問題\r 5) 各式實驗的操作能力\r 6) 解決問題的能力\r 7) 數據分析，並合乎邏輯性和具科學角度地表述出來\r 8) 書寫符合標準科技論文格式的書面報告及口頭報告的能力\r 9) 有責任感及團體精神\r   学生将会发展以下能力： 1) 应用在课堂中获得的知识及技能\r 2) 搜寻相关文献的技巧\r 3) 具批判性思维阅读及分析文献的内容，并认知及思考当中的科学问题\r 4) 就自己的专题研究题目，设计实验去解说科学问题\r 5) 各式实验的操作能力\r 6) 解决问题的能力\r 7) 数据分析，并合乎逻辑性和具科学角度地表述出来\r 8) 书写符合标准科技论文格式的书面报告及口头报告的能力\r 9) 有责任感及团体精神", "syllabus": "The students should continue to work on the research project from ENSC4902. Students should discuss the progress with their supervisors and submit a final report in the form of manuscript and present orally at term end.\r  學生就ENSC4902的研究課題繼續進行研究，並定期向教授匯報及討論研究所得的數據。於學期結束前遞交一份科技論文並作口頭報告。\r  学生就ENSC4902的研究课题继续进行研究，并定期向教授汇报及讨论研究所得的数据。于学期结束前递交一份科技论文并作口头报告。", "required_readings": "Relevant reference materials to the selected project will be provided by the supervisor", "recommended_readings": "Relevant reference materials to the selected project will be provided by the supervisor", "terms": {"2020-21 Term 2": {"-J01-PRJ (5716)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHU Ka Hou, \n\rProfessor Laura Jane FALKENBERG, \n\rProfessor NGAI Sai Ming"]}}}, "assessments": {"Others": "20", "Presentation": "40", "Report": "40"}}, {"code": "4906", "title": "Internship", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Environmental Science Pgm Comm", "requirements": "Pre-requisite: ENSC3520.", "description": "In this course, students have the opportunity to gain working experience in the government, private companies or non-government organizations. Internship projects can be held either locally or overseas, and must be approved by the Programme. Students are required to serve at least 160 hours, deliver an oral presentation, and submit a written report for assessment.\r", "outcome": "Students taken this course are expected to acquire the following abilities:\r 1) Integrate the knowledge and skills learnt previously in other courses\r 2) Design, organize, schedule and execute individual or group projects \r 3) Acquire hands-on techniques in conducting experiments or special projects provided by the company where the interns join\r 4) Develop problem-solving abilities\r 5) Work cooperatively with a team in a laboratory or company setting\r 6) Develop a sense of responsibility\r 7) Obtain empirical experiences and out-of classroom experiences for career development\r 8) Improve skills in writing reports\r   學生將會發展以下能力： 1) 應用在課堂中獲得的知識及技能\r 2) 設計、安排、計劃及執行指定的個人或團體項目\r 3) 實驗或專題項目的操作能力\r 4) 解決問題的能力\r 5) 團體合作精神\r 6) 有責任感\r 7) 累積課堂以外的工作經驗\r 8) 書寫報告的能力\r  学生将会发展以下能力： 1) 应用在课堂中获得的知识及技能\r 2) 设计、安排、计划及执行指定的个人或团体项目\r 3) 实验或专题项目的操作能力\r 4) 解决问题的能力\r 5) 团体合作精神\r 6) 有责任感\r 7) 累积课堂以外的工作经验\r 8) 书写报告的能力", "syllabus": "Students should search for their own internship position and submit relevant documents to the Programme for approval. Each intern is required to work in the approved company or laboratory on a scientific project for at least 5 weeks (160 hours) in summer. The progress of each student will be monitored by a supervisor from the Programme. At the end of the internship, students should give an oral presentation and submit a written report.\r 學生須自行尋找本地或海外的專題實習機會，並提交相關資料以取得學系認可。實習生須在暑期時到認可之公司或機構工作或參與研究項目，為期最少五星期(160小時)。學生進度由學系導師監察。實習完結後，學生須作口頭報告並提交書面報告。\r 学生须自行寻找本地或海外的专题实习机会，并提交相关资料以取得学系认可。实习生须在暑期时到认可之公司或机构工作或參与研究项目，为期最少五星期(160小时)。学生进度由学系导师监察。实习完结后，学生须作口头报告并提交书面报告。", "required_readings": "Relevant reference materials to the selected project will be provided by the supervisor", "recommended_readings": "Relevant reference materials to the selected project will be provided by the supervisor", "terms": {"2020-21 Term 1": {"-J01-PRJ (8734)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor LEE Hung Kay"]}}}, "assessments": {"Others": "40", "Presentation": "30", "Report": "30"}}, {"code": "4907", "title": "Field Study", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Environmental Science Pgm Comm", "requirements": "Pre-requisite: ENSC3520.", "description": "This course gives students an opportunity to supplement what they have learnt from the major courses in the format of a local or overseas field trip during summer. Students are required to submit a proposal, participate actively in all activities throughout the field trip, submit an individual report and present a seminar for assessment. The field trip must be approved by the Programme. Students will learn as a global citizen how to learn from other countries’ experiences to act locally in environmental management and protection with innovative ideas and social responsibility. Students will also learn from social enterprise or non-government organizations how to work together with government officials and regular citizens to enhance conservation and environmental protection.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5101", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Environmental Science", "description": "Students are required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in environmental science and in-depth knowledge in a particular field of environmental sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors. ", "terms": {"2020-21 Term 1": {"-S01-SEM (1042)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}, "2020-21 Term 2": {"-S01-SEM (1060)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "5201", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Environmental Science", "description": "Students are required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in environmental science and in-depth knowledge in a particular field of environmental sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1043)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}, "2020-21 Term 2": {"-S01-SEM (1061)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "5301", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Environmental Science", "description": "Students are required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in environmental science and in-depth knowledge in a particular field of environmental sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1044)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}, "2020-21 Term 2": {"-S01-SEM (1062)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7101", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Environmental Science", "description": "Students are required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in environmental science and in-depth knowledge in a particular field of environmental sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1045)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}, "2020-21 Term 2": {"-S01-SEM (1063)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7201", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Environmental Science", "description": "Students are required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in environmental science and in-depth knowledge in a particular field of environmental sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1046)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}, "2020-21 Term 2": {"-S01-SEM (1064)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7301", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Environmental Science", "description": "Students are required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in environmental science and in-depth knowledge in a particular field of environmental sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors. ", "terms": {"2020-21 Term 1": {"-S01-SEM (1047)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}, "2020-21 Term 2": {"-S01-SEM (1065)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7401", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Environmental Science", "description": "Students are required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in environmental science and in-depth knowledge in a particular field of environmental sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1048)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}, "2020-21 Term 2": {"-S01-SEM (1066)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7501", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Environmental Science", "description": "Students are required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in environmental science and in-depth knowledge in a particular field of environmental sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1049)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7601", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Environmental Science", "description": "Students are required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in environmental science and in-depth knowledge in a particular field of environmental sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1050)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}, "2020-21 Term 2": {"-S01-SEM (1067)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7701", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Environmental Science", "description": "Students are required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in environmental science and in-depth knowledge in a particular field of environmental sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1051)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}, "2020-21 Term 2": {"-S01-SEM (1068)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "8003", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Environmental Science", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student's academic progress.", "outcome": "Development of research skills, including field and/or laboratory studies and data analysis as related to the students' thesis research.", "syllabus": "-    Identify a research topic-    Develop a research hypothesis-    Prepare a research proposal-    Develop research methodology and experimental design-    Conduct an original research with impact in a specific field or subject-    Analyze experimental results and make appropriate data interpretation-    Prepare a research dissertation/thesis and related manuscripts for publication", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-M01-TMC (3264)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN King Ming, \n\rProfessor TSANG Ling Ming, \n\rProfessor WONG Po Keung"]}}, "2020-21 Term 2": {"-M01-TMC (2362)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN King Ming, \n\rProfessor TSANG Ling Ming, \n\rProfessor WONG Po Keung"]}}}}, {"code": "8006", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "6.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Environmental Science", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student's academic progress.", "outcome": "Development of research skills, including field and/or laboratory studies and data analysis as related to the students' thesis research.", "syllabus": "-    Identify a research topic-    Develop a research hypothesis-    Prepare a research proposal-    Develop research methodology and experimental design-    Conduct an original research with impact in a specific field or subject-    Analyze experimental results and make appropriate data interpretation-    Prepare a research dissertation/thesis and related manuscripts for publication", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-M01-TMC (3265)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN King Ming, \n\rProfessor HUI Jerome Ho Lam, \n\rProfessor Laura Jane FALKENBERG, \n\rProfessor TSANG Ling Ming, \n\rProfessor WONG Po Keung"]}}, "2020-21 Term 2": {"-M01-TMC (2363)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN King Ming, \n\rProfessor HUI Jerome Ho Lam, \n\rProfessor Laura Jane FALKENBERG, \n\rProfessor TSANG Ling Ming, \n\rProfessor WONG Po Keung"]}}}}, {"code": "8012", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "12.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Environmental Science", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student's academic progress.", "outcome": "Development of research skills, including field and/or laboratory studies and data analysis as related to the students' thesis research.", "syllabus": "-    Identify a research topic-    Develop a research hypothesis-    Prepare a research proposal-    Develop research methodology and experimental design-    Conduct an original research with impact in a specific field or subject-    Analyze experimental results and make appropriate data interpretation-    Prepare a research dissertation/thesis and related manuscripts for publication", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-M01-TMC (3299)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor HUI Jerome Ho Lam, \n\rProfessor WONG Po Keung"]}}, "2020-21 Term 2": {"-M01-TMC (2364)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor HUI Jerome Ho Lam, \n\rProfessor WONG Po Keung"]}}}}]