[{"code": "5000", "title": "Basic Epidemiology and Health Statistics", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in MSc Health Services Management and PgD Health Services Management", "description": "This course serves as an introduction to epidemiology for students with health services or healthcare experience. The course gives a general overview of epidemiology and biostatistics, including theories and methodologies, and applications in health services management and other healthcare sectors. The course provides the basis for further studies.", "outcome": "Student should be able to:\r 1. appreciate the importance of epidemiology in public health and health services and its limitations\r 2. describe the various study designs, know their advantages and limitations and how to interpret their results\r 3. understand basic epidemiological theories, concepts, and methods as applied to health services\r 4. learn the valid methods for estimating the frequency of disease, and for comparing between groups and populations, learn possible biases and their control methods in the estimation and comparisons\r 5. apply quantitative methods to address practical public health and health services management issues\r 6. identify and appraise findings from health services research", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (2491)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor KIM Jean Hee, \n\rProfessor YIP Hon Kei"]}}}}, {"code": "5001", "title": "Introduction to Epidemiology", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health, PgD in Public Health, MSc in Epidemiology & Biostatistics or PgD in Epidemiology & Biostatistics", "description": "This course will introduce basic epidemiology to students including introduction to epidemiology, applied health research methods, designing and conducting epidemiological studies (descriptive, case-control, cohort, clinical trials and meta-analysis).", "outcome": "Student should be able to:\r 1. appreciate the importance of epidemiology in clinical medicine as well as in public health\r 2. describe the various study designs, know their advantages and limitations and how to interpret their results\r 3. understand basic epidemiological theories, concepts, and methods as applied to health conditions\r 4. learn the valid methods for estimating the frequency of disease, the effect of a cause or a treatment, and for comparing between groups and populations\r 5. learn possible biases and their control methods in the estimation and comparisons\r 6. apply epidemiological methods to address practical health issues and understand their limitations\r 7. identify and appraise findings from epidemiological research for application", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (2508)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor KIM Jean Hee, \n\rProfessor TANG Jinling, \n\rProfessor YANG Zuyao"]}}}}, {"code": "5002", "title": "Epidemiological Study Designs", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health, PgD in Epidemiology & Biostatistics or MSc in Epidemiology & Biostatistics", "description": "This is a follow up of course \"Epidemiology I\" to provide further concepts and application of epidemiology. Topics will include further concepts in epidemiological study designs and application of concepts to the planning and design of epidemiological studies.", "outcome": "To enable the students to:\r 1. learn more on study designs and their applications\r 2. apply epidemiological concepts and techniques in the planning of epidemiologic studies\r 3. apply epidemiological methods in public health programme planning and evaluation\r 4. be aware of the various problems and biases in epidemiological studies", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (3704)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor CHUNG Chi Ho, \n\rProfessor CHUNG Roger Yat Nork, \n\rProfessor HO Suzanne Sutying, \n\rProfessor TANG Jinling, \n\rProfessor YANG Zuyao"]}}}}, {"code": "5003", "title": "Analysis of Epidemiological Data", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health, PgD in Epidemiology & Biostatistics or MSc in Epidemiology & Biostatistics", "description": "This module prepares students to write a scientific protocol for an epidemiological study, create a data collection instrument for surveys, interpret statistical data and write up the results in a publishable format.", "outcome": "After the lectures, students should be able to:\r 1. Explain the basic concepts and plan the strategy for data analysis from an epidemiological study\r 2. Conduct simple analyses by hand \r 3. Compare pros and cons of different analytical methods for the same data with the same research objective\r 4. Chose, plan and perform different analyses given different study designs and/or objectives \r 5. Chose and draw tables and figures to present the results\r 6. Know the structure, format and contents of scientific reports of epidemiological studies", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 3": {"--LEC (1132)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["TBA"], "instructors": ["Professor CHUNG Chi Ho, \n\rProfessor HO Suzanne Sutying, \n\rProfessor KIM Jean Hee, \n\rProfessor YANG Zuyao, \n\rProfessor YIP Hon Kei"]}}}}, {"code": "6001", "title": "Appraisal of the Methods of Epidemiological Studies", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in MSc/PgD in Epidemiology and Biostatistics, MPhil in Public Health, PhD in Public Health, Master of Public Health, PgD in Public Health, MSc/PgD in Health Services Management, MSc/PgD in Health Promotion and Behavioural Health", "description": "The course will include a series of tutorials for appraising the methods of commonly used epidemiological study designs. In each tutorial, a published study of a specific design (e.g., randomized controlled trial) will be selected and presented and questions regarding the methods of the study will be asked. Students need to carefully read and discuss the questions beforehand and further discuss with the tutor and peers in the class.", "outcome": "After these tutorials, students are expected to:\r 1. have a good idea of what a real epidemiological study is like; 2. know how the methods are implemented in real setting; 3. appreciate compromises in the methods in real studies;  4. know how to appraise the results, validity and generalizability of a study.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (3084)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["Prince of Wales Hospital"], "instructors": ["Dr. FU Xiaohong, \n\rProfessor HO Suzanne Sutying, \n\rProfessor LAO Xiangqian, \n\rProfessor YANG Zuyao"]}}, "2020-21 Term 3": {"--LEC (1030)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["Prince of Wales Hospital"], "instructors": ["Dr. FU Xiaohong, \n\rProfessor HO Suzanne Sutying, \n\rProfessor LAO Xiangqian, \n\rProfessor YANG Zuyao"]}}}}, {"code": "6002", "title": "Selected Topics in Epidemiology", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health and MSc in Epidemiology & Biostatistics", "description": "The course involves a series of guest lecture seminars in which methodological aspects of various areas of epidemiological research are discussed and elaborated.", "outcome": "Students will become familiar with the methodological and substantive issues of conducting epidemiological investigations in various subject areas. The course is structured as a series of seminars with interactive discussion. Students will be asked to read scientific papers that illustrate concepts in class.", "syllabus": "", "required_readings": "Given in Class by lecturers. No required textbooks.", "recommended_readings": "None", "terms": {"2020-21 Term 2": {"--LEC (2540)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor KIM Jean Hee, \n\rProfessor LAO Xiangqian, \n\rProfessor SU Xuefen, \n\rProfessor YIP Hon Kei"]}}, "2020-21 Term 3": {"--LEC (1097)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor KIM Jean Hee, \n\rProfessor LAO Xiangqian, \n\rProfessor SU Xuefen, \n\rProfessor YIP Hon Kei"]}}}, "assessments": {"Essays": "50", "Others": "10", "Presentation": "40"}}, {"code": "6003", "title": "Nutritional Epidemiology", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health, MSc in Epidemiology & Biostatistics", "description": "In this course, you will learn about the methods used to assess dietary intakes and how to overcome limitations in assessing such a complex ‘exposure’. Nutrient intakes and dietary patterns in different population groups will be illustrated and key diet-disease associations will be presented. Finally, some of the challenges in interpreting nutritional epidemiology evidence and practical issues in communicating findings will be covered.", "outcome": "Student should be able to:\r 1. understand the different methods that are used to examine dietary intake\r 2. describe key limitations in estimating dietary intake and how these may be minimised in practice\r 3. explain current evidence relating to how dietary choices impact obesity, CVD and malnutrition\r 4. apply knowledge to design either an observational assessment of diet or a dietary intervention study\r  學院本課程之後，學生應該能夠： 1. 理解飲食攝入量的不同評估方法\r 2. 描述飲食攝入量評估的主要問題以及如何在實際研究中減少此類問題\r 3. 解釋現有的關於飲食選擇與肥胖、心血管疾病及營養不良的關係的證據\r 4. 運用所學知識設計一個有關飲食的的觀察性研究或干預研究", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 3": {"--LEC (1185)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [1], "locations": ["TBA"], "instructors": ["Dr. LO Ka Hei Kenneth"]}}}}, {"code": "6004", "title": "Practice in Systematic Review and Meta-analysis", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health, MSc in Epidemiology & Biostatistics", "description": "This course is an advanced module for students who are interested in conducting systematic review and meta-analysis. It emphasizes on practical knowledge and skills needed for doing this kind of research: performing exhaustive literature search to identify relevant studies, extracting data from eligible studies, assessing risk of bias, synthesizing data, including meta-analysis, presenting results graphically and tabularly, investigating heterogeneity and potential biases, and publishing manuscripts in peer-reviewed journals. Tutorial materials will be distributed to students for their in-class exercises. Students will be enabled to master the essential skills for doing systematic review and meta-analysis by the end of this module.", "outcome": "By the end of this module, student are expected to be able to:\r 1. formulate a structured research question and develop search strategies according to the question\r 2. retrieve relevant studies by exhaustive literature search and select eligible studies from them\r 3. extract data from eligible studies\r 4. assess risk of bias for randomized controlled trials using appropriate tools\r 5. synthesize data from eligible studies, including narrative summary and meta-analysis\r 6. do other related analyses, such as the investigation of publication bias\r 7. prepare systematic review manuscripts for publication according to relevant guidelines\r  希望學生學完本課程之後能夠： 1. 為系統綜述提出結構化的研究問題，并據此制定文獻檢索策略\r 2. 通過全面的文獻檢索，找出系統綜述所需的合格研究\r 3. 從合格研究中提取有關數據\r 4. 采用適合的工具，評估隨機對照試驗發生偏倚的風險\r 5. 合併各個合格研究的數據，包括敘述性總結和薈萃分析\r 6. 進行其他有關的分析，例如檢測發表偏倚\r 7. 根據有關指引撰寫可用於發表的系統綜述論文", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 3": {"--LEC (1058)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [5], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor Anna LEE, \n\rProfessor CHUNG Chi Ho, \n\rProfessor YANG Zuyao"]}}}}]