[{"code": "1010", "title": "Anatomy of an Entrepreneur", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "EPIN Minor Pgm Comm", "requirements": "", "description": "(UGED1796 is double-coded with EPIN1010.) This course is an introduction to the mindset and values of an entrepreneur. The primary objective is to make students appreciate and adapt to change in the world of entrepreneurship. Whether a student takes the entrepreneurial path or chooses to become a manager in the corporate world upon graduation, the entrepreneurial spirit as inspired by the journey of a successful entrepreneur will help produce out-of-the-box ideas and the ability to cope with challenges in the business world.In this course, prominent figures and seasoned entrepreneurs will be invited to share their real stories and experiences regarding creativity, innovation, problem-solving and entrepreneurship in different situations. As “fail early fail fast” has become the unofficial mantra in the Silicon, guest speakers are encouraged to give an honest account of their devastating failures and reveal how they survive, adapt, and achieve eventual success.", "outcome": "    Gain basic knowledge of the startup process and understand the key obstacles in building a successful new venture    Acquire new and diverse perspectives in identifying opportunities and solving problems on both local and global levels    Appreciate the values of the entrepreneurial spirit and essential traits of an entrepreneur    Enhance analytical skills to evaluate new innovative ventures and creative ideas ", "syllabus": "  1.       Introduction of the course   a.       Outline the course content and structure   b.       How to be an entrepreneur   c.       Entrepreneurs as leaders: From Employees to Business Owner   d.       The entrepreneurs’ startup journey: From idea generation to reality     Generate a killer idea    Writing the business plan    Building the team    Executing the plan    Validating the market    Adapt and move forward                                                                                                                    2.       Generating business ideas   a.       Where good innovative ideas come from   b.       How to become creative again   c.       How to spot market trends and identify opportunities   d.       Conduct brainstorming session in the class to generate business ideas       3.       Taking risk, The Entrepreneurial Mindset vs The Professional Mindset   4.       Industry Veterans vs Outsider disrupter   5.       Bootstrapping a startup with minimal resources   a.       How to form a company   b.       The basic resources requirements of running a company   c.       The basics of managing a company   6.       David vs Goliath   7.       Managing a startup   a.       Understanding user experience   b.       Service/ Product prototyping   c.       Market validation   d.       Growth hacking   e.       Recruiting and managing talents   8.       The enablers   a.       Government incubator   b.       Private accelerators   c.       Coworking space   9.       Pitching to investors   10.   Overcoming the startup challenges   a.       Financing   b.       Team dynamic   c.       Market situation   d.       Value proposition and more.   11.    Endurance and Dedication", "required_readings": " Reading list: Part 1 - 3 Entrepreneurship - Successfully Launching New Ventures - Fourth Edition by Bruce R. Barringer and R. Duane Ireland (Pearson)", "recommended_readings": "    “Start-up Nation” by Dan Senor and Saul Singer    “The Lean Startup” by Eric Ries    “Zero to One” by Blake Masters and Peter Thiel    “Rich Dad Poor Dad” by Robert Kiyosaki and Sharon Lechter    “Lean in” by Sheryl Sandberg    “Elon Musk: Tesla, SpaceX, and the Quest for a Fantastic Future” by Ashlee Vance    “The Innovator's Dilemma” by Clayton M. Christensen    The 4-Hour Workweek by Tim Ferriss    The Virgin Way: If It's Not Fun, It's Not Worth Doing by Richard Branson ", "terms": {"2020-21 Term 1": {"--LEC (8989)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor CHAN Chi Bong Dominic"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}}, "2021-22 Term 1": {"--LEC (4613)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Lee Shau Kee Archi Bldg G03"], "instructors": ["Professor AU Yuk Fai Kevin"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}}, {"code": "1020", "title": "Design Thinking and Practice", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "EPIN Minor Pgm Comm", "requirements": "", "description": "The course aims to develop \"T-shaped\" characters who can develop the depth of expertise in a single field (one's major as represented by the vertical bar of the T shape) while acquiring the ability to communicate and collaborate with others from different disciplines (the horizontal bar of the T) to address challenges. The ability to connect horizontally is \"Design Thinking\", which is the bridge between creativity and innovation, combining divergent and convergent modes of problem discovery and problem solving to integrate user-experience, technology tools, and business models to create values.By acquiring a designer's perspective in looking at the world, students can learn to appreciate what it means to \"think out of a box\" --- the thinking style that transcends traditional management control and disciplinary mindset. They can create more alternatives beyond one’s own disciple to foster more systemic and holistic implementation. This course is for students who not only know how to solve problems but know what problems to solve.", "outcome": "1. Identify research questions (i.e. 3W and 2H --- who, what, why, how, and how much) used in design thinking to define value proposition. 2. Form interdisciplinary team to collaborate and to build maker work habits. 3. Conduct empathetic inquiries in real context to collect artifacts, stories, and data to discover insightful behavioral patterns. 4. Practice ideation through brainstorming, visual mapping, sketching, and story telling.  5. Understand various prototyping methods (e.g. paper/cardboard, digital/interactive, audio-visual narrative, role playing, and 3D models) to be used in realizing design ideas for iterative development. 6. Analyze and synthesize user research, market analytics, prototype testing, and business model validation to generate solutions. 7. Evaluate alternative solutions to define a minimum viable product. 8. Present a minimum viable product proposal (including a 3 min. video) to acquire resources for further development. 9. Acquire the mindset, basic knowledge and skills to combine UX, technology tools, and business model to innovate.", "syllabus": "1. Overview of the Course  (a) What do 21st century talents need to survive and excel? (b) Why ”Design Thinking”? (c) How does Design Thinking work (Examples from 2 Case Studies)? (d) Explanation of class format, lab time, online participation, and course assessment criteria. (e) 1st home assignment: Online self-introduction (The information will be used for team formation in the 2nd lesson)  2. Interdisciplinary Team Formation and Facilitation (a) Form interdisciplinary team to get started with the class project. (b) In-class Design Thinking exercise on reframing problem and developing a point of view (POV) on existing users, stakeholders, context, artifacts, and activities (e.g. user journey).  (c) Brainstorming and team facilitation rules explained.  (d) Guest speaker from industry presents existing product and service challenges and opportunities.  (e) Present contextual inquiry guidelines to students to prepare them for upcoming visit to the guest speaker’s work place. 3. Contextual Inquiry and Visual Mapping  (a) Visit guest speaker’s work place to begin contextual inquiry.  (b) Student updates visual journal to document the visit. (c) In-class sharing of observation and visual mapping (e.g. empathy map and user journey map with photographs taken during the visit) and grouping (e.g. affinity diagram) of critical items.  (d) Inform students with further guidelines for subsequent user and market researches. (e) Online sharing of group’s observation and findings. 4. Sketching and Visualization Lab  (a) Introduction to 2D and 3D sketching (b) In-class exercise in 2D and 3D sketching (c) Basic graphics design principles (d) In-class exercise in graphic design (e) Project presentation next week (with problem statement and value proposition defined) 5. Ideation for Alternatives  (a) Present problem statement and value proposition (b) Understand the big picture (stakeholder relationships, competitive landscape, and business eco-system) and how the offering fits in.  (c) Brainstorming with post-it notes supplemented with photos, sketches, and user/customer journey as the backdrop for generating alternative solutions. (d) Identify key assumptions to be validated through prototype building and testing. (e) Scripting and storyboarding key scenes related to offering/user interactions (script/storyboard to be used in role-play presentation next week). 6. Prototyping Lab I  (a) Build paper/cardboard prototypes to be used in role play. (b) Role play presentation by each team.  (c) Additional digital tools for virtual walkthrough, 3D modeling and printing.  7. Prototyping Lab II  (a) Develop site map and wireframes for making paper prototypes. (b) Introduce basic web technology for turning paper prototype into interactive prototype. (c) Introduce front-end and back-end frameworks for MVC based Restful API/JSON application implementation (optional for advanced high-fidelity prototype deployment). 8. Prototyping Lab III  (a) Data driven design for IoT and cloud-based solutions.  (b) Hardware prototyping in Adruino (optional for advanced high-fidelity prototype deployment) (c) Data exchange with backend database through Restful API/JSON (optional for advanced high-fidelity prototype deployment). 9. Preparation for Field Validation  (a) Business model canvas: key assumptions to be validated (b) Qualitative method: Think aloud protocol and usability studies (c) Quantitative method: A/B test and web analytics.  (d) Develop script, questionnaire, and user instruction guide to be used by field investigators. 10. Field Validation  (a) Conduct field validation with prototype  (b) Record validation session with user signed approval. (c) Collect artifacts and data to prepare for final presentation 11. Video Story Telling  (a) The Kickstarter way to pitch: story telling with videos. (b) The 3 stages of video production (pre-production, production, and post-production)  (c) Use shots, angles, camera movement, dialogue, sound, music, and effects to develop your narrative for a compelling pitch.  (d) Demonstrate how the prototype can be transformed into a minimum viable product given the required resources can be acquired according to the assumptions made in the business model. 12. Final Class Presentation (a) Student teams are given 15 minutes each to present prototype, video narrative, and business model in front of the class.", "required_readings": "• Andreessen, Marc (2011) Why Software is Eating The World. The Wall Street Journal, August 20, 2011. • Blank, S. (2013) Why the Lean Start-up Changes Everything. Harvard Business Review May 6. 2013. • Buytaert, Dries (2015) No, Data is Eating the World. Recode.net, Jan 7, 2015. • Gibbons, Sarah (2016) Design Thinking 101. Nielsen Norman Group. July 31, 2016.", "recommended_readings": "• Edelman, Gil (2015) How to Choose your Technology Stack, SV/SG Blog.  • Gaffney G. (1999) What is a Contextual Inquiry  • Gaffney G. (2004) Contextual Inquiry - A Primer  • Hong Kong Design Centre (2009), Designing Public Services. July 2009  • Neilsen. J. (2010). Mental Models, Alert Box October 18, 2010  • Nielsen. J. (2010) Interviewing Users, Alert Box July 26. 2010 • Nielsen. J. (2000) Why You Only Need to Test with 5 Users. Alert Box March 2000 • Nielsen, J., (2012) Usability 101: Introduction to Usability, Alert Box", "terms": {"2020-21 Term 1": {"--LEC (7449)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Cheng Yu Tung Building 203"], "instructors": ["Mr. NG Chi Ho"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2021-22 Term 1": {"--LEC (4614)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 301"], "instructors": ["Mr. NG Chi Ho"], "meetingDates": ["8/9", "15/9"]}}}, "assessments": {"Homework or assignment": "10", "Others": "10", "Online discussion or forum": "10", "Project": "50", "Participation": "20"}}, {"code": "1030", "title": "The Psychology of Creativity and Innovation", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "EPIN Minor Pgm Comm", "requirements": "", "description": "(UGED1797 is double-coded with EPIN1030.) Creativity and Innovation is something that is crucial for entrepreneurs, but are often perceived as mysterious and attainable only by a few. The main purpose of this course is for you to have a breath of understanding in the field of creativity, innovation, and entrepreneurship using psychological principles. To achieve this goal, the course will use evidence based research in psychological sciences to help student understand what creativity is at an individual, team and global level, and how to use psychological tools to enhance their own creativity. Students will also understand how creativity is applied in innovation and entrepreneur settings. Through classroom learning, case analysis, team work and field work, students will have a good understanding on the foundations of the above topics, and be able to apply psychological tools to understand current issues such as social innovation, social entrepreneurship, and everyday problems. ", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2010", "title": "Toolkit for Entrepreneurs", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "EPIN Minor Pgm Comm", "requirements": "Prerequisite: EPIN1010(UGED1796)/1020/1030(UGED1797) or other equivalents or exempted by the instructor if students can show a substantive entrepreneurial experience or knowledge.;Co-requisite: at least any 2 other 2000 (EPIN/non-EPIN) level courses.", "description": "The course aims to prepare students with skills essential for “pursuing opportunity without regard to resources currently at hand.” It will develop in students several key entrepreneurial skills rather than covering comprehensive topics as in an introductory course. Since pursuing an entrepreneurial endeavour has to overcome obstacles and deal with challenges in novel and uncertain situations, we must transform and give new emphasis to skills commonly used in other problem-solving situations. Indeed, a number of new processes and accompanying languages have to be invented for entrepreneurial practices. Additionally, because changes happen fast, the skill sets essential for entrepreneurial success must be matched with the latest technological and societal development, and to the needs of different student cohorts. By the end of the course, students should become more effective and confident in implementing their entrepreneurial plan or innovation project. ", "outcome": "a. To pick up skills essential for entrepreneurial success; b. To demonstrate the ability to plan and work out specifics of an entrepreneurial endeavor; and\r c. To present and defend with confidence on their own entrepreneurial or innovative projects.", "syllabus": "Given the above considerations, this course will cover four areas of skills spanning across go-to-market, competences for operations, teamwork and communication, and resource planning and exit in an entrepreneurial context suitable for students from different disciplines including arts, social science, business, engineering and science.\r  1. Go-to-Market\r a. Business Model\r b. Lean startup approach\r c. Customer discovery\r d. Finding a beachhead market \r  2. Competences for operations\r a. Data analytics basics\r b. Market competitiveness analysis\r c. Essential on-line and mobile tools\r  3. Teamwork and Communications\r a. Team process e.g. formation, splitting etc.\r b. Seeking and receiving mentorship\r c. Improvisation – making choices while in action and sense-making through reflection\r d. Maintaining passion and discipline\r  4. Resource Planning and Exit\r a. Resource planning and financial projection\r b. Story telling and pitching\r c. Planning for exit\r  Component/ method\r Participation 10%\r Class work and tutorial exercises 30%\r Quizzes  20%\r Final Presentation/ group reports 40%\r Total 100%", "required_readings": "Aulet (2013). Disciplined Entrepreneurship: 24 Steps to a Successful Startup. Wiley.", "recommended_readings": "Blank & Engel. 2015. The National Science Foundation Innovation Crops: Teaching Handbook. [https://venturewell.org/wp-content/uploads/NSF_Handbook_Web.pdf]\r  Gelobter, M. 2015. Lean startups for social change: the revolutionary path to big impact. CA: Berrett-Koehler Publishers.\r  Osterwalder, A., & Pigneur, Y. (2013). Business Model Generation: A Handbook for Visionaries, Game Changers, and Challengers.\r  Read, Stuart (2011). Effectual Entrepreneurship. New York: Routledge.", "terms": {"2020-21 Term 1": {"--LEC (6965)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor AU Yuk Fai Kevin"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}}, "2021-22 Term 1": {"--LEC (4615)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Wu Ho Man Yuen Bldg 404"], "instructors": ["Professor CHAN Chi Bong Dominic"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}, "assessments": {"Essay test or exam": "30", "Others": "20", "Participation": "10", "Report": "40"}}, {"code": "2900", "title": "Internship in Entrepreneurship and Innovation I", "career": "Undergraduate", "units": "1.00", "grading": "Pass (P)/Fail (U)", "components": "DiscussionOthersPracticum", "campus": "Main Campus", "academic_group": "EPIN Minor Pgm Comm", "requirements": "", "description": "A short-term internship allows students to transfer their classroom learning to workplace activities and provides them with valuable exposure to different industry sectors and startup companies. At a minimum, students are required to complete 6 weeks of internship experience to fulfill the course requirement. The educational objectives can be achieved through industry activities that are either operational based and/or project based. All internship experiences must be approved by the EPIN Minor Program and the course coordinator.", "outcome": "• To provide students real-world experience in an innovation startup company and understanding of the basic operation of a startup.\r • To enhance learning of entrepreneurship and innovation theories and principles by practicing in a real-world setting.\r • To strengthen and build character as well as instill professional attitude and passion in students towards creating and building new ventures.", "syllabus": "The overarching principle of the EPIN education is to learn by practice. Students are encouraged to apply learnings from lectures and readings in a real-world working environment to deepen their understanding and enhance long-term retention of knowledge. Students may either apply for internship opportunities provided by the EPIN program, or solicit similar opportunities at companies that focus on entrepreneurship and innovation. Tech startups, innovation venture capitals, and social enterprises are prime examples of potential employers who provide relevant internship experience for fulfillment of this course. When students solicit internship on their own, they must obtain approval from the EPIN program and the course coordinator if they intend to use the internship for course fulfillment.\r  Enrollment Procedure\r 1. Attend the pre-internship briefing session\r 2. Invite a teaching staff in CUHK as adviser for nomination\r 3. Submit an application form to state the job nature of the internship\r 4. Internship starts\r 5. Submit reference letter and performance evaluation provided by the employer after completion\r 6. Pre-assign in this course in the subsequent semester\r 7. Presentation\r  Assessment Methods\r Presentation 60%\r Employer performance evaluation 40%\r Total: 100%", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"-D01-DIS (8088)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["07/09/2020 - 30/11/2020"]}, "-O01-OTH (9061)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["07/09/2020 - 30/11/2020"]}, "-P01-PRA (8164)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-D01-DIS (8571)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["11/01/2021 - 19/04/2021"]}, "-O01-OTH (8650)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["13/01/2021 - 21/04/2021"]}, "-P01-PRA (8572)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-D01-DIS (8036)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["12/09/2021 - 05/12/2021"]}, "-O01-OTH (4977)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["06/09/2021 - 29/11/2021"]}, "-P01-PRA (8037)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-D01-DIS (6958)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["10/01/2022 - 18/04/2022"]}, "-O01-OTH (7074)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["10/01/2022 - 18/04/2022"]}, "-P01-PRA (6995)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["15/01/2022 - 23/04/2022"]}}}, "assessments": {"Others": "40", "Presentation": "60"}}, {"code": "3010", "title": "Business Model Innovation for Startups", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "EPIN Minor Pgm Comm", "requirements": "", "description": "A business model is a logical and internally consistent representation of the design and operations of a business, capturing the essence of how it will be focused and demonstrating how an interrelated set of decision variables will be addressed to create, deliver and capture value. By one definition, a business model consists of four interlocking elements: • The customer value proposition (how does the firm create value for a customer)\u2028• The profit formula (how does the firm capture value for itself while providing value to the customer) • The key resources required to deliver the value proposition to the targeted customer\u2028• The key processes that allow a firm to deliver value in a repeatable and scalable manner. Business model innovation is focused on the design and development of new and unique business models that, by definition, challenge accepted conventions in a given industry about how to create and deliver customer value while making sustainable profits for the entrepreneur and his investors. This course will explore the range and diversity of existing perspectives about business models and the tools of analysis essential to their understanding. We will learn to analyze and evaluate existing business models and pursue a logical and internally consistent approach to the choice and/or development of an appropriate business model for a new enterprise. The application of the course frameworks, tools and techniques will be illustrated with case studies and evaluated in a semester project involving the development of an innovative business model for an entrepreneurial venture.\r", "outcome": "Upon completion of this course, students should:\r • Understand and be able to explain the purpose, role and importance of business models, including the key elements of a business model and the interactions and interdependencies among the elements. \u2028\r • Demonstrate the ability to analyze existing business models utilizing the course frameworks, tools and techniques, evaluate their strengths and limitations, and make recommendations for improvement. \u2028\r • Demonstrate the ability to evaluate, design, and recommend innovative business models for entrepreneurial new ventures or businesses experiencing significant changes in their external environments. \u2028", "syllabus": "Key topics cover:\r • Definition and typology of business models\r • Major tools and techniques to design and build business models\r • Various revenue and pricing models\r • The interaction between customer value proposition and design of business models\r • Implementation of new business models", "required_readings": "Johnson, Mark W., 2018, Reinvent Your Business Model: How to Seize the White Space for Transformative Growth. Harvard Business School Press.", "recommended_readings": "Amit, R. and C. Zott, 2001, “Value Creation in e-Business,” Strategic Management Journal, 22(6/7): 493-520. \r  Christensen, Clayton M. and Michael E. Raynor, 2003, The Innovator's Solution: Creating and Sustaining Successful Growth, Boston, Mass: Harvard Business School Press.\r  Kaplan, Sual, 2012, The Business Model Innovation Factory: How to Stay Relevant When the World is Changing, Wiley.\r  Kim, W.Chan, and Renée Mauborgne, 2015, Blue Ocean Strategy, Expanded Edition: How to Create Uncontested Market Space and Make the Competition, Harvard Business Review Press.\r  Mullins, John, and Randy Komisar, 2009, Getting to Plan B: Breaking Through to a Better Business Model, Harvard Business Press. \r  Osterwalder, Alexander, and Yves Pigneur, 2010, Business Model Generation: a Handbook for Visionaries, Game Changers, and Challengers, Hoboken, N.J: Wiley.", "terms": {"2020-21 Term 2": {"--LEC (7535)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor WONG Ka Chat Andrew"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}}, "2021-22 Term 2": {"--LEC (4818)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Wong Foo Yuan Bldg 401"], "instructors": ["Professor WONG Ka Chat Andrew"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Discussion": "25", "Project": "35", "Participation": "15", "Short answer test or exam": "25"}}, {"code": "3020", "title": "Innovation Bootcamp", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "EPIN Minor Pgm Comm", "requirements": "Prerequisite: EPIN2010 or other equivalents. Prerequisites are exempted by the instructor if students can show a substantive entrepreneurial experience or knowledge.\nCo-requisite: at least any 2 other 2000 (EPIN/non-EPIN) courses.", "description": "This course inculcates multi-disciplinary problem-solving ability and experiences through intensive exchange and project work in a few weekdays. It involves teaching teams and students from different disciplines targeting at problems or challenges whose solutions required cross-fertilization of knowledge and innovative ideas. Students will participate in hands-on learning to come up with innovative solutions for challenges in a specific domain, problem, or industry.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3021", "title": "Innovation Bootcamp - Inclusive and affordable medicine", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Others", "campus": "Main Campus", "academic_group": "EPIN Minor Pgm Comm", "requirements": "Prerequisite: EPIN2010 or other equivalent or exempted by the instructor if students can show a substantive entrepreneurial experience or knowledge.;Co-requisite: at least any 2 other 2000 (EPIN/non-EPIN) courses.", "description": "Advances in technology and communication devices will change how medicine is being practices. We will no longer beholden to an impersonal and paternalistic system in which hospitals and doctors dictate decisions for patients. Medicine has been digitized; it will be democratized together with a change in social roles and cost structures. This course aims to inculcate multi-disciplinary problem-solving ability and experiences through intensive exchange and project work in a few weekdays. Students will participate in hands-on learning to come up with innovative solutions for delegating choices and providing affordable solutions to patients and promoting inclusive health care.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3022", "title": "Innovation Bootcamp - Pivot to Succeed", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "EPIN Minor Pgm Comm", "requirements": "Prerequisite: EPIN2010 or other equivalents. Prerequisites are exempted by the instructor if students can show a substantive entreprenuerial experience or knowledge.", "description": "Advances in technology and entrepreneurship require continual adaptation and pivot at strategic juncture. The environment is uncertain and changes all the time; competitors emerge over time unexpectedly; learning from customers leads to new ideas. This course aims to inculcate multi-disciplinary problem-solving ability and experiences through intensive exchange and project work in a few weekdays. Students will participate in hands-on learning to find and develop solutions for startup, R&D, or corporate venturing teams to pivot at their critical juncture. ", "outcome": "a. To work effectively on intellectural and practical challenges in a multi-disciplinary team and high uncertainty; b. Able to translating real-life problems into an approach for problem-solving;  c. To apply knowledge and generate possible solutions, and testing out these solutions interactively with stakeholders/ customers/ patients; d. To creatively combine knowledge, technology, and insight for novel, practical solutions for startup, R&D, or corporate venturing teams; e. To communicate the solutions and lay out possible implementation plan.", "syllabus": "• Lean startup is a methodology* for developing businesses and products, with the aims to (1) shorten product development cycles* and (2) swiftly discover if a proposed business model* is viable. (3) Iterative product releases and validated learning are the key to this method. (4) Pivot refers to structured corrections to change the “plan” after testing.\r  • This course serves to discuss and apply the lean startup approach to a few ventures that the instructor will identify. A group of multi-disciplinary students will work on creative, concrete solutions with the ventures and implement a pivot plan for venture. \r  *Methodology: https://en.wikipedia.org/wiki/Methodology \r *Development cycles: https://en.wikipedia.org/wiki/Software_development_process \r *Business model: https://en.wikipedia.org/wiki/Business_model \r  Assessment Type\r Attendance 20%\r Case studies 30%\r Short answer test or exam 20%\r Presentation and Report 30%\r Total 100%", "required_readings": "Van Der Pijl, Lokitz, Solomon, van Lieshout, and van Lieshout. Design a Better Business : New Tools, Skills, and Mindset for Strategy and Innovation. John Wiley & Sons.", "recommended_readings": "Au, Kevin. 2019. Hong Kong EV Power: Raising Fund to Charge China’s Electric Vechicle Market. \r  Liedtka, Ogilvie, & Brozenske. 2014. The Designing for growth field book: A step-by-step project guide. Columbia Business School Publishing. \r  Osterwalder, A., & Pigneur, Y. 2013. Business Model Generation: A Handbook for Visionaries, Game Changers, and Challengers.", "terms": {"2020-21 Term 2": {"--LEC (8581)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["No Room Required"], "instructors": ["Professor AU Yuk Fai Kevin"], "meetingDates": ["12/1", "19/1"]}}, "2021-22 Term 2": {"--LEC (6996)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor AU Yuk Fai Kevin"], "meetingDates": ["11/01/2022 - 19/04/2022"]}}}, "assessments": {"Attendance": "20", "Others": "30", "Presentation": "30", "Short answer test or exam": "20"}}, {"code": "3040", "title": "Entrepreneurship Practicum", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "EPIN Minor Pgm Comm", "requirements": "Prerequisite: EPIN1010(UGED1796)/1020/1030(UGED1797) or other equivalencs. Prerequisites are exempted by the instructor if students can show a substantive entrepreneurial experience or understanding.", "description": "The Entrepreneurship Practicum course is an interactive and hands-on experience for students who want to participate in the entrepreneurial start-up business process. It is designed for students enrolled in the EPIN Minor Programme, although those with adequate background will also be allowed. Students will participate in an internship or be a part-time employee with a start-up. Through the active participation and field work, students should acquire professional knowledge and practical experience in a new venture.\r", "outcome": "a. Able to find and define real-life problems in entrepreneurial ventures and integrate diverse knowledge/ skills to solve them\r b. Able to work together with a diverse group of teammates in uncertain environment under time pressure\r c. Gaining self-confidence and recognition from entrepreneurs and professionals in getting their hands dirty to solve real-life problems", "syllabus": "The instructor will seek projects from new business ventures or corporate ventures in collaboration with accelerators and other entrepreneurship programs. These projects may include problems such as user experience design, go-to-market, business model refinement, fund raising, etc. Student teams will first receive intensive preparation through lecture, exercises, and visits with the instructor and invited guests from accelerators and angel groups. Then, they will under the supervision of the instructor try to work with the ventures over an intensive period of time of, say, two weeks. The class will conclude in a presentation day.\r  Assessment Type\r Participation 30%\r Progress of Practicum & Final Presentation 50%\r Quiz 20%\r Total:100%\r  It is essential that the student team participate in working with the venture and receive good feedback from the venture and their peers (30%). Their learning results will be reflected in the final presentation after they work with the venture. The instructor will also give continuous evaluations over the supervision as well as on the final presentation (50%). To ensure the students pick up the knowledge preparing themselves, a quiz is necessary to gauge their standard and allow the instructor to give timely feedback before they go to work with the venture (20%). It also gives some weight on individual performance for the assessment.", "required_readings": "Aulet (2013). Disciplined Entrepreneurship: 24 Steps to a Successful Startup. Wiley.", "recommended_readings": "Blank & Engel. 2015. The National Science Foundation Innovation Crops: Teaching Handbook. [https://venturewell.org/wp-content/uploads/NSF_Handbook_Web.pdf]\r  Liedtka, Ogilvie, & Brozenske. 2014. The Designing for growth field book: A step-by-step project guide. Columbia Business School Publishing. \r  Osterwalder, A., & Pigneur, Y. 2013. Business Model Generation: A Handbook for Visionaries, Game Changers, and Challengers.\r  Thiel & Masters. 2014. Zero to One. Crown Books.", "terms": {"2020-21 Term 2": {"--LEC (8582)": {"startTimes": ["13:30"], "endTimes": ["16:15"], "days": [3], "locations": ["Hui Yeung Shing Bldg LG04"], "instructors": ["Professor AU Yuk Fai Kevin"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (6997)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor AU Yuk Fai Kevin"], "meetingDates": ["12/01/2022 - 20/04/2022"]}}}, "assessments": {"Presentation": "50", "Participation": "30", "Short answer test or exam": "20"}}, {"code": "3050", "title": "Media Production and Presentation", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "EPIN Minor Pgm Comm", "requirements": "Prerequisite: At least 1 EPIN-coded course or equivalents.", "description": "Startups and Entrepreneurs are often required to communicate their innovative ideas, such as new products and services, through multi-media. Crowdfunding websites such as Kickstarter.com have numerous examples of effective video communications that lead to successful product launches and funding goal completion. Photography and videography have also become a language to engage the new generations on social media such as YouTube and Instagram. This course is designed for innovators who want to translate their ideas into compelling audio and video works. Through pre-production, filming, to post-production, students will learn the visual-audio language, basic skills and techniques of filmmaking, including production by using Adobe Premiere and After Effect, etc. It consists of lectures, readings, screenings and consultations, hands-on visual projects and mini- workshops; it helps students to explore and develop their conceptual and aesthetic styles.", "outcome": "Upon completion of this course, students should: Understand how audio and video communication supports entrepreneurial activities including but not limited to demonstrating new product and service concepts, soliciting funders, and brand building. Understand storytelling in audio and visual productions. Acquire basic knowledge of film genres and language. Gain or improve the skills associated with audio and video production, including writing, producing, directing, shooting, and editing. Understand how to spread and distribute audio and video works.", "syllabus": "Key topics cover:1. Stages of production process2. Understanding of time-based medium, concept of time and space3. Visual structure, expression and communication4. Sound design, effects, and recording5. Camera operation, shot composition and movement,6. Location and location shooting7. Direct cinema and other styles of shooting approach8. Basic lighting knowledge and technique: three point lightings9. Basic picture editing10. Post-sound: from editing to final mix ", "required_readings": "Required Readings: 1.      Bazin, André. What Is Cinema. Translated by Hugh Gray. Berkeley: University of California Press, 1971.2.      Bordwell, David and Kristin Thompson 著, 曾偉禛譯. Film Art: An Introduction. 《電影藝術:形式與風格》. 台北: 美商麥格羅希爾, 2001.3.      D. Giannetti, Louis. Understanding Movies. London: Pearson, 20174.      D. Katz, Steven. Film Directing Shot by Shot: Visualizing From Concept to. Screen. Calif.: Michael Wiese Productions, 1991.5.      Pulizzi,Joe. Content Inc.: How Entrepreneurs Use Content to Build Massive Audiences and Create Radically Successful Businesses. New York: McGraw-Hill, 20156.      Vaynerchuk, Gary. Jab, Jab, Jab, Right Hook: How to Tell Your Story in a Noisy Social World. New York: Harper Business, an imprint of Harper Collins Publishers, 2013.7.      Jarboe, Greg. YouTube and Video Marketing: An Hour a Day. Indianapolis: Wiley Pub, 20128.      Worlds Most Creative TV Advertisements Commercials: https://www.youtube.com/watch?v=COiDyubnYOw9.      The BMW film series The Hire: https://www.youtube.com/watch?v=vhZ-bMXH3S8", "recommended_readings": "Recommended Readings: 1.      Brown, William. Non-Cinema: Global Digital Film-making and the Multitude (Thinking Cinema). London: Bloomsbury Academic, 20182.      Bordwell, David. Film Art: An Introduction. New York: McGraw-Hill Education, 2015.3.      Cook, David A. A History of Narrative Film. Third edition. New York, London: W.W. Norton, 1996.4.      Lehman, Peter. Defining Cinema. New Brunswick, N.J.: Rutgers University Press, 1997.5.      McGrath, Declan. Editing & Post-production. Boston: Focal Press, 2001.6.      Hayward, Susan. Cinema Studies: The Key Concepts. London: Routledge, 20067.      Siapera, Eugenia. Understanding New Media. London: SAGE Publications Ltd, 20128.      Smith, Jerron. Adobe Premiere Pro CC Digital Classroom. Indianapolis: John Wiley & Sons, 2013.9.      Berger, Jonah. Contagious: Why Things Catch On. New York: Simon & Schuster. 201310.  Du Gay, Paul.Doing Cultural Studies: The Story of the Sony Walkman. London : SAGE, 201311.  Goorevich,Emily. 7 Types of Advertising (+How They're Used). Learning Hub, https://learn.g2.com/types-of-advertising. 201912.  Making a Movie with your iPhone or iPad. Learn about Film: https://www.learnaboutfilm.com/making-a-film/iphone-filmmaking/13.  How to Shoot a Short Film with a Smartphone.YouTube: https://www.youtube.com/watch?v=cQvpcoI9QQw", "terms": {"2021-22 Term 1": {"--LEC (5296)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["TBA"], "instructors": ["Dr. LI Tiecheng"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Project": "80", "Participation": "10", "Report": "10"}}, {"code": "3900", "title": "Internship in Entrepreneurship and Innovation II", "career": "Undergraduate", "units": "2.00", "grading": "Pass (P)/Fail (U)", "components": "DiscussionLecturePracticum", "campus": "Main Campus", "academic_group": "EPIN Minor Pgm Comm", "requirements": "Prerequisite: At least 1 EPIN-coded course.", "description": "A short-term internship allows students to transfer their classroom learning to workplace activities and provides them with valuable exposure to different industry sectors and startup companies. Students are required to complete 12 to 24 weeks of internship experience to fulfill the course requirement. The educational objectives can be achieved through industry activities that are either operational based and/or project based. All internship experiences must be approved by the EPIN Minor Program and the course coordinator. ", "outcome": "• To provide students real world experience in an innovation startup company and understanding of the basic operation of a startup.\r • To enhance learning of entrepreneurship and innovation theories and principles by practicing in a real world setting.\r • To strengthen and build character as well as instill professional attitude and passion in students towards creating and building new ventures.", "syllabus": "The overarching principle of the EPIN education is to learn by practice. Students are encouraged to apply learning from lectures and readings in a real-world working environment to deepen their understanding and enhance long-term retention of knowledge. Students may either apply for internship opportunities provided by the EPIN program, or solicit similar opportunities at companies that focus on entrepreneurship and innovation. Tech startups, innovation venture capitals, and social enterprises are prime examples of potential employers who provide relevant internship experience for fulfillment of this course. When students solicit internship on their own, they must obtain approval from the EPIN program and the course coordinator if they intend to use the internship for course fulfillment.\r  Enrollemnt Procedure\r 1. Attend the pre-internship briefing session\r 2. Invite a teaching staff in CUHK as adviser for nomination\r 3. Submit an application form to state the job nature of the internship\r 4. Internship starts\r 5. Submit reference letter and performance evaluation provided by the employer after completion\r 6. Pre-assign in this course in the subsequent semester\r 7. Presentation\r 8. Submit self-reflection paper or progress report\r  Assessment Methods\r Presentation 30%\r Self-reflection paper or progress report; can be in multi-media format 30%\r Employer performance evaluation 40%\r Total: 100%", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (9062)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["07/09/2020 - 30/11/2020"]}, "-D01-DIS (8165)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["07/09/2020 - 30/11/2020"]}, "-P01-PRA (8166)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"--LEC (8651)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["11/01/2021 - 19/04/2021"]}, "-D01-DIS (8583)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["11/01/2021 - 19/04/2021"]}, "-P01-PRA (8584)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"--LEC (8121)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["06/09/2021 - 29/11/2021"]}, "-D01-DIS (4979)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["06/09/2021 - 29/11/2021"]}, "-P01-PRA (8038)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"--LEC (7075)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["10/01/2022 - 18/04/2022"]}, "-D01-DIS (6998)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["10/01/2022 - 18/04/2022"]}, "-P01-PRA (6999)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["16/01/2022 - 24/04/2022"]}}}, "assessments": {"Others": "40", "Presentation": "30", "Report": "30"}}, {"code": "4000", "title": "EPIN Project", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "EPIN Minor Pgm Comm", "requirements": "Prerequisite: EPIN2010 or other equivalents.", "description": "The EPIN Project provides an opportunity for students to integrate their knowledge and experience gained in formal coursework and co-curricular activities, and put them into practice by developing an innovative idea and implementation plan. Students in groups of no more than 6 students comprising of different disciplines and background will pursue independent projects in technological innovation, social innovation, or other kinds of entrepreneurial endeavors. With the guidance of a faculty mentor and external experts of related fields, each group will deliver an innovative idea that is both feasible and impactful to the society and/or the market.Students are encouraged to pursue a project in which they have some competence based on their academic training or practical experience. Within a multidisciplinary group, members will complement each other with their respective strengths and expertise. They are also strongly recommended to pursue an idea initiated in other courses and/or occasions such as competitions and internship. It is ideal that an idea is conceived, developed and eventually realized throughout the EPIN journey. The EPIN Project offers an opportunity to push an idea to a mature stage and be ready for implementation. Outstanding performers in entrepreneurship and innovation competitions, for examples, will be invited to participate in this credit-bearing course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4010", "title": "Special Topic in Entrepreneurship and Innovation", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "EPIN Minor Pgm Comm", "requirements": "Prerequisite: Any one of the 1000- or 2000-level of EPIN-coded course, or with special permission granted by the instructor", "description": "Entrepreneurial and innovative endeavors usually involve cutting-edge technologies and ground-breaking ideas, which help solve evolving problems in a highly volatile and uncertain environment. The purpose of the Special Topic course is to raise awareness of emerging trends and solutions in different areas, and equip students with knowledge in the field yet to be covered by existing courses. \r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4900", "title": "Internship in Entrepreneurship and Innovation III", "career": "Undergraduate", "units": "3.00", "grading": "Pass (P)/Fail (U)", "components": "DiscussionLecturePracticum", "campus": "Main Campus", "academic_group": "EPIN Minor Pgm Comm", "requirements": "Prerequisite: At least 1 EPIN-coded course.", "description": "A short-term internship allows students to transfer their classroom learning to workplace activities and provides them with valuable exposure to different industry sectors and startup companies. At a minimum, students are required to complete 24 weeks of internship experience to fulfill the course requirement. The educational objectives can be achieved through industry activities that are either operational based and/or project based. All internship experiences must be approved by the EPIN Minor Program and the course coordinator. ", "outcome": "• To provide students real world experience in an innovation startup company and understanding of the basic operation of a startup.\r • To enhance learning of entrepreneurship and innovation theories and principles by practicing in a real world setting.\r • To strengthen and build character as well as instill professional attitude and passion in students towards creating and building new ventures.", "syllabus": "The overarching principle of the EPIN education is to learn by practice. Students are encouraged to apply learnings from lectures and readings in a real-world working environment to deepen their understanding and enhance long-term retention of knowledge. Students may either apply for internship opportunities provided by the EPIN program, or solicit similar opportunities at companies that focus on entrepreneurship and innovation. Tech startups, innovation venture capitals, and social enterprises are prime examples of potential employers who provide relevant internship experience for fulfillment of this course. When students solicit internship on their own, they must obtain approval from the EPIN program and the course coordinator if they intend to use the internship for course fulfillment.\r  Enrollemnt Procedure\r 1. Attend the pre-internship briefing session\r 2. Invite a teaching staff in CUHK as advisor for nomination\r 3. Submit an application form to state the job nature of the internship\r 4. Internship starts\r 5. Submit reference letter and performance evaluation provided by the employer after completion \r 6. Pre-assign in this course in the subsequent semester\r 7. Presentation\r 8. Submit self-reflection paper or progress report and essay \r  Assessment methods\r Presentation 20%\r Self-reflection paper or progress report; can be in multi-media format 20%\r Employer performance evaluation 30%\r Case study on outlook of the industry/sector in which the employer operates and the role of the employer plays in the industry* 30%\r Total: 100%\r  * upon completion of a 24-week (or longer) internship, students should develop an indepth understanding of the nature of the employer’s business and/or services, and the environments in which the organization operates. Students should be able to produce an original case by outlining the key challenges that the organization faces, the value proposition to which the organization is committed in response to the challenges, and the solutions (e.g., new products, services or proprietary technologies under development, a new business model, a new organizational structure, etc) that the organization is developing to support the value proposition. Having taken part in the team and process, students should summarize their learnings and experience, document them in 5 to 10-page report, which will be shared with fellow students and the employer as an exchange of knowledge.", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (9063)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["07/09/2020 - 30/11/2020"]}, "-D01-DIS (8167)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["07/09/2020 - 30/11/2020"]}, "-P01-PRA (8168)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"--LEC (8652)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["11/01/2021 - 19/04/2021"]}, "-D01-DIS (8586)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["11/01/2021 - 19/04/2021"]}, "-P01-PRA (8585)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"--LEC (8122)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["06/09/2021 - 29/11/2021"]}, "-D01-DIS (8039)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["06/09/2021 - 29/11/2021"]}, "-P01-PRA (8040)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"--LEC (7076)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["10/01/2022 - 18/04/2022"]}, "-D01-DIS (7001)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["10/01/2022 - 18/04/2022"]}, "-P01-PRA (7000)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Kam Fai William"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Others": "30", "Presentation": "20", "Project": "30", "Report": "20"}}]