[{"code": "6101", "title": "History, Professional Issues and Ethical Practice in Educational Psychology", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "This course explores the history of psychology, with an emphasis on the history of the science and practice of educational psychology, so as to offer EP Trainees important perspectives about the past, present, and future of the field. In addition, ethical principles of psychologists and codes of conduct, including standards of practice that are core to professional educational psychology, as well as relevant legal issues are reviewed and discussed. This course also examines current trends and issues salient to professional educational psychology in Hong Kong and worldwide, such as the evolving roles of professional educational psychologists in response to changing societal and individual needs. ", "outcome": "At the end of the course, EP Trainees will be able to :\r 1. State legal standards, professional standards and ethical guidelines in the educational psychology profession practice.\r 2. Demonstrate the knowledge, abilities and skills on integrating, applying and evaluating the legal standards, professional standards and ethical guidelines on diagnosis, assessment and intervention activities.\r 3. Perform as scientist-practitioner by developing professional relationship with clients in the light of legal, professional standards and evidence-based practices.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "Code of Professional Conduct, Hong Kong Psychological Society (HKPS) \r Code of Professional Conduct of the American Psychological Association (APA), British Psychological Society (BPS) and National Association of School Psychologists (NASP).\r Core competency of educational psychology, Hong Kong Psychological Society (HKPS) \r Education Bureau (2016). School-based Educational Psychology Service Guide.\r Knapp, S.J., VandeCreek, L.D., & Fingerhut, R. (2017). Practical ethics for psychologists: A positive approach. Washington, DC, US: American Psychological Association.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Fisher, C. B. (2010). Decoding the ethics code: A practical guide for psychologists. Thousand Oaks, CA: Sage. \r Gambrill, E. (2012). Critical thinking in clinical practice: Improving the quality of judgements and decisions. NJ: John Wiley & Sons.\r Jacob, S., Decker, D.M., & Hartshome, T.S. (2011). Ethics and law for school psychologists. Hoboken, NJ: John Wiley & Sons.\r Nagy, T. F. (2011). Essential ethics for psychologists: A primer for understanding and mastering core issues. Washington, DC: American Psychological Association.\r Perfect, M.M., & Morris, R.J. (2011). Delivering school-based mental health services by psychologists: Education, training and ethical issues. Psychology in the Schools, 48, 1049-1063.\r Pope, K.S., & Vanspuez, M.J.T. (2010). Ethics in psychotherapy and counseling: A practical guide. NJ: John Wiley & Sons.\r Tribe, R., & Morrissey, J. (2015). Handbook of Professional and ethical practice for psychologists, counsellors, and psychotherapists. New York, NY: Routledge.\r Relevant ordinance in Hong Kong, such as Personal Data Privacy Ordinance:https://www.elegislation.gov.hk/hk/cap486!en-zh-Hant-HK.pdf?FROMCAPINDEX=Y\r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2021-22 Term 2": {"--LEC (2449)": {"startTimes": ["13:30"], "endTimes": ["16:15"], "days": [3], "locations": ["Lee Shau Kee Archi Bldg G01"], "instructors": ["Dr. WONG Pak Ho"], "meetingDates": ["12/1", "19/1", "26/1"]}}}}, {"code": "6102", "title": "Children and Adolescents with Special Needs (I)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "Professional educational psychologists play an important role in supporting children with special needs in both regular and special school settings. This two-course series on special needs is designed to enhance the professional capacity of EP Trainees in collaborating with teachers and parents to facilitate the personal, social and educational development of students with diverse needs. Drawing on recent research developments, these courses attempt to demystify misconceptions in findings related to special needs. They show how the latest research improves our understanding of the mechanisms underlying different kinds of special needs and discuss the implications of these empirical studies for developing effective interventions. In this course, we introduce the contextual foundation for understanding students with diverse needs by looking at their families and schools. We then focus on the needs and characteristics of children and adolescents with different intellectual and learning abilities or disabilities. In particular, we examine topics related to global cognitive impairment, developmental delay, specific learning difficulties, and individuals who are gifted and talented.", "outcome": "Upon completion of the Course, EP Trainee will be able to: \r 1. Display knowledge of theory and research on the origins, characteristics, identification, classification and intervention for children and adolescents with intellectual disability, developmental delay, learning disabilities, and giftedness. \r 2. Demonstrate abilities and skills on effective use of assessments for identification and interventions for children and adolescents with a range of special needs.\r 3. Design, develop and implement Evidence-Based intervention strategies at school, family and/or integrated settings for children and adolescents with a range of special needs.\r 4. Demonstrate awareness of community support and resources for children and adolescents with a range of special needs.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "Bryant, D. P., Bryant, B. R., & Smith, D. D. (2017). Teaching students with special needs in inclusive classrooms.\r Cowne, E., Frankl, C., Gerschel, L. (2015). The SENCO Handbook. New York, NY: Routledge.\r Duchesne, S., & McMaugh, A. (2015). Educational psychology for learning and teaching. New York, NY: Cengage.\r Galloway, D. (2018). Schools, pupils and special educational needs. New York, NY: Routledge.\r Hodkinson, A. (2015). Key issues in special educational needs and inclusion. Thousand Oaks, CA: Sage.\r Liebenberg, L., Theron, L., Sanders, J., Munford, R., van Rensburg, A., Rothmann, S., & Ungar, M. (2016). Bolstering resilience through teacher-student interaction: Lessons for school psychologists. School Psychology International, 37(2), 140-154.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Bryant, D.P. (2016). Teaching Students With Special Needs in Inclusive Classrooms + Teaching Students With Special Needs in Inclusive Classrooms, Interactive Ebook Student Version. Thousand Oaks, CA: Sage.\r Cline, T. (2018). The Assessment of Special Educational Needs: International Perspective. New York, NY: Routledge.\r Conoley, J.C., & Gutkin, T.B. (2017). 14 School Psychology: A Reconceptualization of Service Delivery Realities. The delivery of psychological services in schools: Concepts, processes, and issues. New York, NY: Routledge. \r Fletcher J. M., & Lyon, G. R. et al. (2007). Learning disabilities: From identification to intervention. New York, NY: Guilford.\r Gargiulo, R.M. (2006). Special education in contemporary society: An introduction to exceptionality. (2nd ed.). Singapore: Wadsworth Cengage Learning.\r Garrote, A., Dessemontet, R. S., & Opitz, E. M. (2017). Facilitating the social participation of pupils with special educational needs in mainstream schools: A review of school-based interventions. Educational Research Review, 20, 12-23.\r Gascoigne, E. (2014). Working with Parents: As Partners in Special Educational Needs. New York, NY: Routledge.\r Hornby, G. (2015). Inclusive special education: development of a new theory for the education of children with special educational needs and disabilities. British Journal of Special Education, 42(3), 234-256.\r Reis, S. M., & Small, M. (2005). The varied and unique characteristics exhibited by diverse gifted and talented learners. In F. A. Karnes, & S. M. Bean. (Eds.), Methods and materials for teaching the gifted. Waco, TX: Prufrock Press, pp.3-32.\r Rupp, A.A., Lesaux, N.K., & Siegel, L.S. (2006). Meeting expectations? An empirical investigation of a standards-based reading assessment. Educational Evaluation and Policy Analysis, 28, 315-333.\r Wallander, J. L., Dekker, M. C., & Koot, H. M. (2003). Psychopathology in children and adolescents with intellectual disability: Measurement, prevalence, course, and risk. In L. M. Glidden (Ed.), International Review of Research in Mental Retardation, Vol. 26, (pp. 93-134). New York, NY: Academic Press.\r Wenar, C., & Kerig, P. (2007). Developmental Psychopathology. NY: McGraw Hill.\r 香港心理學會 教育心理學部《教育心理手冊》(香港特別行政區: 香港心理學會, 2004). [Chinese original manuscript, entitled: Division of Educational Psychology (2004). Educational psychology handbook (for professional practice). Hong Kong Special Administrative Region: Hong Kong Psychological Society.]\r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2021-22 Term 1": {"--LEC (2389)": {"startTimes": ["13:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Wu Ho Man Yuen Bldg 508"], "instructors": ["Dr. LUK Sau Ha"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}}, {"code": "6103", "title": "Children and Adolescents with Special Needs (II)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology;Pre-requisite: EPSY6102", "description": "Building upon the analytic framework developed in EPSY 6102, the course focuses on two broad areas of special needs: emotional and behavioral challenges, and physical and sensory disabilities. Emotional and behavioral challenges addressed include but are not limited to attention deficit/ hyperactivity disorder, conduct problems, affective disorders, and autism spectrum disorders. We also look into the special needs arising from hearing and/ or visual impairments and examine the complex nature of physical disabilities and their subsequent impact on student development. EP trainees will be introduced to how the latest research improves our understanding of the mechanisms underlying different kinds of special needs and discuss the implications of these empirical studies for developing effective interventions in working with school children.", "outcome": "Upon completion of the Course, EP Trainees will be able to: \r 1. Display knowledge of theory and research on the origins, characteristics, identification, classification and intervention for children and adolescents with emotional and behavioral challenges, and physical and sensory disabilities.\r 2. Demonstrate abilities and skills on effective use of screening tools and assessments and understand the diagnostic mechanism of other professional disciplines (e.g. psychiatrist, audiologist or ophthalmologist). \r 3. Design, develop and implement/ deliver Evidence-Based intervention strategies and instructional support at school, family and/ or integrated settings for children and adolescents with emotional and behavioral challenges, and physical and sensory disabilities.\r 4. Demonstrate awareness of community support and resources for children and adolescents with emotional and behavioral challenges, physical and sensory disabilities to improve learning and student outcomes. \r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "Bryant, D. P., Bryant, B. R., & Smith, D. D. (2017). Teaching students with special needs in inclusive classrooms. Thousand Oaks, CA: Sage. \r Cowne, E., Frankl, C., Gerschel, L. (2015). The SENCO Handbook. London: Routledge.\r Durlak, J. A., Weissberg, R. P., Dymnicki, A. B., Taylor, R. D., & Schellinger, K. B. (2011). The impact of enhancing students’ social and emotional learning: A meta‐analysis of school‐based universal interventions. Child Development, 82(1), 405-432.\r Whitcomb, S. A. (2013). Behavioral, social, and emotional assessment of children and adolescents. London: Routledge.\r Whitcomb, S. A. (2017). Social–Emotional Assessment and Cultural Diversity. In Behavioral, Social, and Emotional Assessment of Children and Adolescents (pp. 31-67). London: Routledge.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Cohen, J. (2006). Social, emotional, ethical, and academic education: Creating a climate for learning, participation in democracy, and well-being. Harvard Educational Review, 76(2), 201-237.\r Cole, C.L., & Shapiro. E.S. (2005). Perceptions of trainers and practitioners regarding assessment and intervention for students with low incidence disabilities. Psychology in the Schools, 42(7), 677-689.\r Duckworth, A. L., & Yeager, D. S. (2015). Measurement matters: Assessing personal qualities other than cognitive ability for educational purposes. Educational Researcher, 44(4), 237-251.\r Harris, K., & Farrell, P. (2004). Educating children and young people with medical needs: Effective provision and practice. Support for Learning, 19(1), 13-18.\r Garber, J., Frankel, S. A., & Herrington, C. G. (2016). Developmental demands of cognitive behavioral therapy for depression in children and adolescents: cognitive, social, and emotional processes. Annual Review of Clinical Psychology, 12, 181-216.\r Greenberg, M. T., Weissberg, R. P., O'Brien, M. U., Zins, J. E., Fredericks, L., Resnik, H., & Elias, M. J. (2003). Enhancing school-based prevention and youth development through coordinated social, emotional, and academic learning. American Psychologist, 58(6-7), 466-474.\r Lenzi, M., Dougherty, D., Furlong, M. J., Sharkey, J., & Dowdy, E. (2015). The configuration protective model: Factors associated with adolescent behavioral and emotional problems. Journal of Applied Developmental Psychology, 38, 49-59.\r Schonert-Reichl, K. A., Oberle, E., Lawlor, M. S., Abbott, D., Thomson, K., Oberlander, T. F., & Diamond, A. (2015). Enhancing cognitive and social–emotional development through a simple-to-administer mindfulness-based school program for elementary school children: A randomized controlled trial. Developmental Psychology, 51(1), 52-66.\r Swearer, S. M., & Hymel, S. (2015). Understanding the psychology of bullying: Moving toward a social-ecological diathesis–stress model. American Psychologist, 70(4), 344-353.\r Whitcomb, S. A. (2017). Direct Behavioral Observation. In Behavioral, Social, and Emotional Assessment of Children and Adolescents (pp. 94-125). London: Routledge.\r 香港心理學會 教育心理學部《教育心理手冊》(香港特別行政區: 香港心理學會, 2004). [Chinese original manuscript, entitled: Division of Educational Psychology (2004). Educational psychology handbook (for professional practice). Hong Kong Special Administrative Region: Hong Kong Psychological Society.]\r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2021-22 Term 2": {"--LEC (2423)": {"startTimes": ["13:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Hui Yeung Shing Bldg G03"], "instructors": ["Dr. LUK Sau Ha"], "meetingDates": ["10/1", "17/1", "24/1"]}}}}, {"code": "6201", "title": "Psychoeducational Assessment (I)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "This is part one of the two courses in psycho-educational assessment aiming at equipping students with the necessary knowledge and skills in the administration and interpretation of standardized assessment instruments, and the use of comprehensive assessment data to assist in making decisions on the delivery services to individuals with special needs. This course covers the basic concepts of intelligence and intellectual assessment. There will be administration, scoring, interpretation and report writing on some of the widely used instruments in Hong Kong. This course will also enable students to develop knowledge and skills to use academic-based achievement measures in school settings for students with specific learning difficulties or exceptional abilities, and discusses curriculum issues that are closely linked to the choice of measures and understanding of test scores. Overall, this course emphasizes the importance of collecting and using comprehensive data on individual’s cognitive functioning to make evidence-based decisions for effective intervention. ", "outcome": "At the end of the course, EP trainees will be able to:\r 1. Show an understanding on the major concepts, theories and diagnostic instruments of intelligence, adaptive functioning and academic achievement and the principles, strengths and limitations of various assessment tools.\r 2. Demonstrate fluency and accuracy in administrating, scoring and interpreting results on various instruments in the light of the legal standards and professional code of practice.\r 3. Integrate sources of evidence to make data-informed decision for academic, social-emotional and behavioral intervention and consultation.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "Hass, M. (2018). Interviewing For Assessment: A Practical Guide for School Psychologists and School Counselors. New York: John Wiley & Sons.\r Sattler, J. M. (2008). Assessment of children: Cognitive foundations. San Diego: J.M. Sattler.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Cipani, E. (2017). Functional Behavioral Assessment, Diagnosis, and Treatment: A Complete System for Education and Mental Health Settings. New York, NY: Springer.\r Cohen, L.G., & Spenciner, L.J. (2010). Assessment of Children and Youth with Special Needs. New York, NY: Pearson. \r Colyar, M.R. (2011). Assessment of the school-age child and adolescent. New York, NY: F.A. Davis Company.\r Farrall, M.L. (2012). Reading Assessment: Linking Language, Literacy, and Cognition. NJ: Wiley.\r Kaufman, A.S., & Raiford, S.E. (2015). Intelligent testing with the WISC-V. New York, NY: John Wiley & Sons.\r Lipson, M.Y. (2012). Assessment of Reading and Writing Difficulties: An Interactive Approach. New York, NY: Pearson.\r Miller, D.C. (2013). Essentials of School Neuropsychological Assessment. New York, NY: John Wiley & Sons.\r Morrison, J., & Flegel, K. (2017). Interviewing children and adolescents: Skills and strategies for effective DSM-5 Diagnosis. NJ: Guilford.\r Sattler, J. M. (2014). Foundations of behavioral, social, and clinical assessment of children. San Diego: J.M. Sattler.\r Tuber, S. (2018) Using Projective Methods with Children: The Selected Works. London, UK: Routledge.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2021-22 Term 1": {"--LEC (2390)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Lee Shau Kee Building 210"], "instructors": ["Dr. WONG Pak Ho"], "meetingDates": ["8/9", "15/9"]}}}}, {"code": "6202", "title": "Psychoeducational Assessment (II)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology;Pre-requisite: EPSY6201", "description": "This course focuses on behavioral, social and emotional assessment. EP trainees will learn to administer, score and interpret behavioral and personality measures including objective assessment tools and projective measures. Different measures with respect to their purposes and appropriate use will be discussed, and their impact of cultural, language and socioeconomic factors will be examined. Building upon the foundations acquired from Psychoeducational Assessment (I), this course discusses ways to integrate data from measures of cognitive abilities, academic performance as well as those from social and behavioral ones to obtain an overall understanding of students’ psychological functioning.", "outcome": "At the end of the course, EP trainees will be able to:\r 1. Show understanding on the major concepts and theories of formal and informal instruments on behavioral, social and emotional domains and the principles, strengths and limitations of various assessment methods.\r 2. Demonstrate fluency and accuracy in administrating, scoring and interpreting results on various formal and informal instruments in the consideration of the legal standards, professional code of practice and diversity of the students’ background.\r 3. Integrate sources of evidence to make data-informed decision for academic, social-emotional and behavioral intervention in individuals and groups and system consultation.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "Sattler, J. M. (2014).Foundations of behavioral, social, and clinical assessment of children. Jerome M. Sattler, Publisher Inc. \r Whitcomb, S.A. (2012). Behavioral, Social, and Emotional Assessment of Children and Adolescents. London: Routledge.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Cipani, E. (2017). Functional behavioral assessment, diagnosis, and treatment: A complete system for education and mental health settings. New York, NY: Springer. \r Cohen, L.G., & Spenciner, L.J. (2010). Assessment of children and youth with special needs. New York, NY: Pearson.\r Cohen, R.J., & Swerdlik, M.E. (2017). Psychological testing and assessment. New York, NY: McGraw-Hill Education\r Colyar, M.R. (2011). Assessment of the school-age child and adolescent. New York, NY: F.A. Davis Company.\r Groth-Marnat, G., & Davis, A. (2013). Psychological report writing assistant. NJ: Wiley. \r Morrison, J., & Flegel, K. (2017). Interviewing children and adolescents: Skills and strategies for effective DSM-5 Diagnosis. New York, NY: The Guilford Press. \r Oster, G.D. (2016). Using drawings in clinical practice: Enhancing intake interviews and psychological testing. London: Routledge. \r Smith, S.R., & Handler, L. (2015). The clinical assessment of children and adolescents: A practitioner's handbook. London: Routledge.\r Tuber, S. (2018) Using Projective methods with children: The selected works. London: Routledge.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2021-22 Term 2": {"--LEC (2424)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 304"], "instructors": ["Dr. WONG Pak Ho"], "meetingDates": ["12/1", "19/1", "26/1"]}}}}, {"code": "6203", "title": "Skills Training Seminar (I)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "This course equips students with practical knowledge and skills in assessment and intervention when working as an educational psychologist in a variety of education and social service settings. It also covers skills and strategies in conducting interviews, observing behaviors, administrating tests of various types, writing reports, and making recommendations to individual cases. Site visits and guest lectures will be arranged to widen EP Trainees’ perspective in their roles as an educational psychologist in school-related settings.", "outcome": "At the end of the course, EP Trainees will be able to:\r 1. Elaborate the roles of educational psychologist in various potential placement/ job settings.\r 2. Demonstrate the competence in conducting interviews, observation skills, administering a variety of assessment measures, and making relevant recommendations and intervention plan to individual cases.\r 3. Be a reflective-practitioner as an educational psychologist. \r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "Test manuals of various standardized assessments, including but not limited to: WISC-IV(HK), WPPSI-IV, Stanford-Binet, Merrill-Palmer-Revised, WAIS-IV (HK), HKT-P(III), HKT-JS (II), HKCAS-P, NEPSY-II, TEA-Ch. \r  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Groth-Marnat, G., & Davis, A. (2013). Psychological Report Writing Assistant. New York, NY: Wiley.\r Neukrug, E.S., & Fawcett, R.C. (2014). Essentials of Testing and Assessment: A Practical Guide for Counselors, Social Workers, and Psychologists. New York, NY: Cengage.\r Oster, G.D. (2016). Using Drawings in Clinical Practice: Enhancing Intake Interviews and Psychological Testing. London: Routledge. \r Smith, S.R., & Handler, L. (2015). The Clinical Assessment of Children and Adolescents: A Practitioner's Handbook. London: Routledge.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2021-22 Term 1": {"-S01-SEM (2328)": {"startTimes": ["13:30"], "endTimes": ["16:15"], "days": [3], "locations": ["Chen Kou Bun Bldg UG05"], "instructors": ["Dr. LAM Wing Chi, \n\rDr. WONG Pak Ho, \n\rMr. LUI Wan Hap"], "meetingDates": ["8/9", "15/9"]}}}}, {"code": "6301", "title": "Psychoeducational Intervention with Children and Adolescents (I)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "This course examines intervention strategies and programs for meeting the needs of students with educational, emotional, behavioral and social adjustment difficulties. Students learn how to use instructional, behavioral and inter-disciplinary approaches as theoretical backdrops to design, deliver, and evaluate psychoeducational programs in school and community settings. Issues related to curriculum-based evaluation and curriculum designs are also discussed.", "outcome": "Upon completion of the Course, EP Trainee will be able to: \r 1. Demonstrate the knowledge on various forms of direct and indirect interventions, including direct remediation, school or/ and family, organization consultation and development of intervention program to cater the diverse needs of students. \r 2. Demonstrate the ability and skills to provide professional consultation, to design developmentally appropriate behavioral management strategies and counseling to enhance personal well-being and development of students. \r 3. Demonstrate the ability to effectively contribute to school-wide or class-wide curricular design, instructional practices and classroom management strategies to enhance academic, social-emotional and behavioral needs of students. \r 4. Be a reflective-practitioner by using and collecting evidence in evaluating the effectiveness of direct and indirect intervention.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "Conoley, J. C., & Gutkin, T. B. (2017). School Psychology: A Reconceptualization of Service Delivery Realities. The delivery of psychological services in schools: Concepts, processes, and issues. London: Routledge. \r Corey, G (2017). Theory and practice of counselling and psychotherapy (10th ed.). Belmont, Calif. : Thomson Brooks/Cole.\r Egan, G. (2013). The skilled helper: A problem-management and\r opportunity- development approach to helping. (10th ed.). Belmont, CA: Thomson/Brooks/Cole.\r Hill, C. E., & O'Brien, K. M. (2014). Helping skills: Facilitating exploration, insight, and action. Washington, DC: American Psychological Association.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Akin-Little, A. E., Little, S. G., Bray, M. A., & Kehle, T. J. (2009). Behavioral interventions in schools: Evidence-based positive strategies. Washington, DC: American Psychological Association.\r Berns, R.M. (2007). Child, family, school, community: Socialization and support. (7th ed.). Singapore: Wadsworth Cengage Learning.\r Grogg, K., Meyers, A. B., & Meyers, J. (2017, September). Prevention through consultation: A model to guide future developments in the field of school psychology. In The Future of School Psychology Conference (pp. 257-276). London: Routledge.\r Hartmann, L. (2006). Psychosocial treatments for child and adolescent disorders: Empirically based strategies for clinical practice. American Journal of Psychiatry, 163(7), 1302-1303.\r Hong Kong Psychological Society (2009). Revised code of professional conduct. The Hong Kong Special Administrative Region: China. Document retrievable at: http://www.hkps.org.hk\r Kazdin, A. E. (2001). Behavior modification in applied settings. (6thed.). Singapore: Wadsworth Cengage Learning.\r Kelly, B., Woolfson, L. & Boyle, J. (2008). Frameworks for practice in educational psychology: A textbook for trainees and practitioners. London: Jessica Kingsley.\r Langley, A. K., Gonzalez, A., Sugar, C. A., Solis, D., & Jaycox, L. (2015). Bounce back: Effectiveness of an elementary school-based intervention for multicultural children exposed to traumatic events. Journal of consulting and clinical psychology, 83(5), 853.\r Roth, R. A., Suldo, S. M., & Ferron, J. M. (2017). Improving middle school students' subjective well-being: Efficacy of a multicomponent positive psychology intervention targeting small groups of youth. School Psychology Review, 46(1), 21-41.\r Shoshani, A., & Steinmetz, S. (2014). Positive psychology at school: A school-based intervention to promote adolescents’ mental health and well-being. Journal of Happiness Studies, 15(6), 1289-1311.\r Simon, D. J. (2016). School-centered interventions: Evidence-based strategies for social, emotional, and academic success. Washington, DC: American Psychological Association.\r Slavin, R.E. (2018). Educational psychology: Theory and practice. (12th ed). Baltimore: Pearson. \r Wasserman, D., Hoven, C. W., Wasserman, C., Wall, M., Eisenberg, R., Hadlaczky, G., & Bobes, J. (2015). School-based suicide prevention programmes: the SEYLE cluster-randomised, controlled trial. The Lancet, 385(9977), 1536-1544.\r Woolfolk, A. (2012). Educational psychology. (12th ed). Baltimore: Pearson.\r 香港心理學會 教育心理學部《教育心理手冊》(香港特別行政區: 香港心理學會 (2004). [Chinese original manuscript, entitled: Division of Educational Psychology (2004). Educational psychology handbook (for professional practice). Hong Kong Special Administrative Region: Hong Kong Psychological Society.]\r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2021-22 Term 1": {"--LEC (2391)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Wong Foo Yuan Bldg UG01"], "instructors": ["Professor LAM Yu Hin"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}}, {"code": "6302", "title": "Psychoeducational Intervention with Children and Adolescents (II)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology;Pre-requisite: EPSY6301", "description": "This course aims to introduce to students a broad array of theories and perspectives that are foundational to psychological interventions for children and adolescents. We will evaluate major theories in working with school-age youngsters and their families, including cognitive-behavioral approaches, solution-focused brief counseling, systems and ecological approaches, family counseling, creative arts therapies, mindfulness, and career and vocational counseling. Strategies in working with children and adolescents with special issues (e.g., depression and suicidality) are also addressed. Throughout the course, students are encouraged to (1) adopt theory-based practice, and (2) examine relevant literature and use a scientist-practitioner model to evaluate the effectiveness of different approaches in working with clients from a wide range of backgrounds. ", "outcome": "Upon the completion of the Course, EP trainees will be able to:\r 1. Display basic knowledge of various approaches/theories of counselling and guidance, psychotherapy, helping skills and models of problem solving. Display knowledge to develop various school-based mental health prevention programs . \r 2. Demonstrate abilities and skills on effective use of therapeutic intervention with individuals and groups. \r 3. Demonstrate the ability to effectively contribute to crisis intervention practices. To collaborate with the school, government and community to conduct and assist crisis intervention.\r 4. Be a reflective-practitioner by using and collecting evidence in evaluating the effectiveness of prevention, psychological intervention and crisis intervention.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "Henderson, D.A. , & Thompson, C.L. (2015). Counseling Children. Belmont, CA: Cengage Learning. \r Hess, R.S., & Magnuson, S. (2011). Counseling children and Adolescents in Schools. Thousand Oaks, CA: Sage. \r  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Alexander, J. F., Waldron, H. B., Robbins, M. S., & Neeb, A. A. (2013). Functional family therapy for adolescent behavior problems. American Psychological Association.\r Barker, P. (2007). Basic family therapy (5th ed.). Oxford, UK ; Ames, Iowa: Blackwell Pub. \r Cleary, T. E. (2015). Self-regulated learning interventions with at-risk youth: Enhancing adaptability, performance, and well-being. Washington, DC: American Psychological Association.\r Cook-Cottone, C. P. (2017). Mindfulness and Yoga in Schools: A Guide for Teachers and Practitioners. New York, NY: Springer. \r Diamond, G. S., Diamond, G. M., & Levy, S. A. (2014). Attachment-based family therapy for depressed adolescents. Washington, DC: American Psychological Association.\r Geldard, K., & Geldard, D. (2015). Counselling adolescents: The proactive approach for young people. Thousand Oaks, CA: Sage. \r Midgley, N., Ensink, K., Lindqvist, K., Malberg, N., & Muller, N. (2017). Mentalization-based treatment for children: A time-limited approach. Washington, DC: American Psychological Association.\r Murphy, J. J. (2015). Solution-Focused Counseling in Schools. Washington, DC: American Counseling Association. \r Reddy, L. A. (2012). Group play interventions for children: Strategies for teaching prosocial skills. Washington, DC: American Psychological Association.\r Reddy, L. A., Files-Hall, T. M., & Schaefer, C. E. (2016). Empirically based play interventions for children. (2nd ed.). Washington, DC: American Psychological Association.\r Stauffer, M., & Capuzzi, D. (2011). Career Counseling: Foundations, Perspectives, and Applications. London: Routledge. \r Thompson, C.L., Henderson, L.B.R., & Henderson, D.A.A. (2007). Counseling Children: A developmental approach. Singapore: Wadsworth Cengage Learning.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2021-22 Term 2": {"--LEC (2425)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Chen Kou Bun Bldg UG04"], "instructors": ["Professor LAM Yu Hin"], "meetingDates": ["10/1", "17/1", "24/1"]}}}}, {"code": "6303", "title": "Skills Training Seminar (II)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology;Pre-requisite: EPSY6201, EPSY6202, EPSY6203", "description": "This course is the second part for skills training. It provides a platform for students to further polish their micro-skills that are required in their practicum. In addition to basic assessment skills, other skills to be covered include crisis management, inter-disciplinary collaboration, working with the 3-tier support at school, counseling, and systems-intervention. Guest lectures and mini-workshops will be arranged to further equip students with practical skills in conducting interventions with individuals and in group settings. EP Trainees are expected to be actively engaged in small group practice and role play exercises throughout the course. ", "outcome": "Upon completion of the Course, EP Trainees will be able to: \r 1. Demonstrate knowledge and skills in the effective use of various assessment tools, report test results, and use results for intervention and support. \r 2. Demonstrate knowledge and skills to constructively deliver system, family and school consultation and 3-tier intervention.\r 3. Demonstrate knowledge in using appropriate helping skills and specific counselling approaches with individual, family and groups. \r 4. Demonstrate the ability and skills in home-school-community collaboration and inter-disciplinary collaboration to promote the well-being and development of students.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "Bram, A. D., & Peebles, M. J. (2014). Psychological testing that matters: Creating a road map for effective treatment. Washington DC: American Psychological Association.\r Kaplan, R. M., & Saccuzzo, D. P. (2018). Psychological testing: Principles, applications, and issues (9th Ed.). Boston, MA: Cengage Learning.\r Loewenthal, K., & Lewis, C. A. (2018). An introduction to psychological tests and scales (3rd Ed.). New York, NY: Routledge.\r Sattler, J. M. (2014). Assessment of children: Cognitive applications. (6th Ed.). San Diego, CA: Jerome M. Sattler Publisher.\r Urbina, S. (2014). Essentials of psychological testing. Hoboken, NJ: Wiley.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Birley, G., & Moreland, N. (2014). A practical guide to academic research. New York, NY: Routledge.\r Breiger, D., Bishop, K., & Benjamin, G. A. H. (2014). Educational evaluations of children with special needs: Clinical and forensic considerations. Washington DC: American Psychological Association.\r British Psychological Society (BPS). (2018). Code of ethics and conduct. Retrieved September 9, 2018, from the BPS Web site: https://www.bps.org.uk/news-and-policy/bps-code-ethics-and-conduct\r Chraif, M. (2015). Considerations Regarding Psychological Testing. Romanian Journal of Cognitive Behavioral Therapy and Hypnosis, 2(2), 1-4.\r Division of Educational Psychology, Hong Kong Psychological Society (2008). Standards for the training of professional educational psychologists in Hong Kong. The Hong Kong Special Administrative Region: China. Document retrievable at: http://www.hkps.org.hk/dep\r Lane, S., Raymond, M. R., & Haladyna, T. M. (Eds.). (2015). Handbook of test development. New York, NY: Routledge.\r Norcross, J.C., Beutler, L.E., & Levant, R.F. (Eds.). (2005). Evidence-based practices in mental health: Debate and dialogue on the fundamental questions. Washington, DC: American Psychological Association.\r Ormrod, J. (2014). Educational psychology: Developing learners (8th Ed.). Boston, MA: Pearson.\r Revelle, W. R. (Photographer). (2017). psych: Procedures for Personality and Psychological Research. Software.\r Rothe, J. P. (2017). The scientific analysis of personality. New York, NY: Routledge.\r Rust, J., & Golombok, S. (2014). Modern psychometrics: The science of psychological assessment. New York, NY: Routledge.\r Schon, J., Shaftel, J., & Markham, P. (2008). Contemporary Issues in the Assessment of Culturally and Linguistically Diverse Learners. Journal of Applied School Psychology, 2, 163-189.\r Slavin, R.E. (2014). Educational psychology: Theory and practice. (10th Ed.). Harlow, UK: Pearson.\r 香港心理學會 教育心理學部《教育心理手冊》(香港特別行政區: 香港心理學會 , 2004). [Chinese original manuscript, entitled: Division of Educational Psychology (2004). Educational psychology handbook (for professional practice). Hong Kong Special Administrative Region: Hong Kong Psychological Society.]\r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 1": {"-S01-SEM (9229)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [1], "locations": ["Esther Lee Bldg 203"], "instructors": ["Dr. LAM Wing Chi, \n\rDr. WONG Pak Ho, \n\rMr. LUI Wan Hap"], "meetingDates": ["2/11", "9/11"]}}}}, {"code": "6304", "title": "Consultation in Schools and Community: Theory and Practice", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "This course examines the role of educational psychologists as consultants and systems-change agents, whose charge is to strengthen the capacity of various interlocking systems (e.g., school and family) that have an impact on students’ well-being and development. Consultation theory, problem-solving models, and a variety of sequential consultation strategies to facilitate systems-change are explored, including data-based decision-making and target identification, solution generation, and solution implementation. The role of educational psychologists as external consultants in schools to facilitate crisis management and prevention is discussed.", "outcome": "Upon completion of the Course, EP Trainees will be able to: \r 1. Display knowledge of school system and other settings (family and community), and use consultation theory and problem-solving models to create and promote a healthy and supportive learning environment for students. \r 2. Demonstrate abilities and skills to support and provide consultation to schools and communities based on the developmental needs of students, data-informed decision and the outcomes of evidence-based interventions. \r 3. Demonstrate abilities and skills in the transfer of knowledge and provide mentoring/ coaching to teachers regrading various prevention, intervention strategies and crisis management. \r 4. Demonstrate knowledge and skills to promote home-school-community collaboration and effectively engage in multi-discipline professional collaboration to promote the well-being of the students. \r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "Berninger, V.W. (2015). Interdisciplinary frameworks for schools: Best professional practices for serving the needs of all students. Washington DC: American Psychological Association.\r Cox, D.D. (2005). Evidence-based interventions using home-school collaboration. School Psychology Quarterly, 20, 473-497.\r Forman, S.G. (2015). Implementation of mental health programs in schools: A change agent's guide. Washington DC: American Psychological Association.\r Orpinas, P., & Horne, A.M. (2006). Bullying prevention: Creating a positive school climate and developing social competence. Washington DC: American Psychological Association.\r Scorgie, K., & Sobsey, D. (2017). So you think we can trust? (Re)-building Home-School Collaboration with families of children with disability. In K. Scorgie, D. Sobsey (Ed.), Working with families for inclusive education: Navigating identity, opportunity and belonging (pp. 255-271). Bingley, UK: Emerald Publishing Limited. \r Thornberg, R. (2014). Consultation barriers between teachers and external consultants: A grounded theory of change resistance in school consultation. Journal of Educational and Psychological Consultation, 24, 183-210.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Brown, J.A., & Jimerson, S.R. (2015). Toward understanding school psychology around the globe: Economical, educational, and professional factors. International Journal of School & Educational Psychology, 3, 73-84.\r Clare, M.M., Ardron-Hudson, E.A., & Grindell, J. (2015). Fat in school: Applied interdisciplinarity as a basis for consultation in oppressive social context. Journal of Educational and Psychological Consultation, 25, 45-65. \r Dowdy, E., Furlong, M., Raines, T.C., Bovery, B., Kauffman, B., Kamphaus, R.W., Dever, B.V., Price, M., & Murdock, J. (2015). Enhancing school-based mental health services with a preventive and promotive approach to universal screening for complete mental health. Journal of Educational and Psychological Consultation, 25, 178-197. \r Garbacz, S.A., Cariveau, T., & Barrett, E. (2016). Examining the Treatment Validation Consultation Model. Journal of Educational and Psychological Consultation, 26, 200-211. \r Gelbar, N.W., Jaffery, R., Stein, R., & Cymbala, H. (2015) Case study on the implementation of school-wide positive behavioral interventions and supports in an alternative educational setting. Journal of Educational and Psychological Consultation, 25, 287-313. \r Goldberg, A.E., Beemyn, G., & Smith, J.Z. (in press). What is needed, what is valued: Trans-students’ perspectives on trans-inclusive policies and practices in higher education. Journal of Educational and Psychological Consultation. https://doi.org/10.1080/10474412.2018.1480376 \r Newman, D.S., Hazel, C.E., Barrett, C.A., Chaudhuri, S.D., & Fetterman, H. (2018). Early career school psychologists' perceptions of consultative service delivery: The more things change, the more they stay the same. Journal of Educational and Psychological Consultation, 28, 105-136. \r Song, S.Y., & Swearer, S.M. (2016). The cart before the horse: The challenge and promise of restorative justice consultation in schools. Journal of Educational and Psychological Consultation, 26, 313-324. \r Sundqvist, C., & Ström, K. (2015). Special Education teachers as consultants: Perspectives of Finnish teachers. Journal of Educational and Psychological Consultation, 25, 314-338. \r Truscott, S.D., Lopez, E., Fish, M.C., & Margolis, H. (2015) The Journal of Educational and Psychological Consultation: A quarter century of contribution, A future of challenge and optimism. Journal of Educational and Psychological Consultation, 25, 2-15. \r Tyre, A.D., & Feuerborn, L.L. (2017). The Minority Report: The concerns of staff opposed to schoolwide positive behavior interventions and supports in their schools. Journal of Educational and Psychological Consultation, 27, 145-172. \r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 1": {"--LEC (1873)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Lee Shau Kee Archi Bldg G01"], "instructors": ["Dr. WONG Pak Ho"], "meetingDates": ["19/10"]}}}}, {"code": "6401", "title": "Research seminar in Professional Educational Psychology", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "This course introduces a number of ways in which research in educational psychology are commonly conducted, with special attention being paid to the role of the scientist-practitioner. The focus will be on evaluating a range of statistical softwares (such as SPSS, MPlus, AMOS) and research methods used by educational psychology researchers to inform decision making within a multi-tier system. Both quantitative and qualitative methods will be discussed. The translation of research findings into the professional practice of educational psychology is emphasized. ", "outcome": "At the end of the course, EP Trainees will be able to:\r 1. Enhance knowledge and skills in using a variety of statistical measurement and research methods to design evidence-based studies in the areas on educational psychology. \r 2. Evaluate programs and policies within the school and education context.\r 3. Acquire skills and professional competencies in communicating evaluation findings to researchers, school personnel, parents and community.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "(Required readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "recommended_readings": "Chen, H.T. (2014). Practical program evaluation: Theory-driven evaluation and the integrated evaluation perspective. Thousand Oaks, CA: Sage. \r Gay, L.R., Mills, G.E., Airasian, P.W. (2008). Educational research: competencies for analysis and applications. New York, NY: Prentice Hall. \r Goodwin, C.J., & Goodwin, K.A. (2018). Research In psychology: Methods and design. New York, NY: Wiley. \r Heath, W. (2018). Psychology research methods: Connecting research to students' Lives. London: Cambridge University Press. \r Ledford, J.R., & Gast, D.L. (2018). Single case research methodology: Applications in special education and behavioral sciences. London: Routledge.\r Mertens, D.M. (2014). Research and evaluation in education and psychology: Integrating diversity With quantitative, qualitative, and mixed methods. Thousand Oaks, CA: Sage. \r Mills, G.E., & Gay, L.R. (2018). Educational research: Competencies for analysis and applications. New York, NY: Pearson.\r Morrison, J.Q., & Harms, A.L. (2018). Advancing evidence-based practice through program evaluation: A practical guide for school-based professionals. UK: Oxford University Press. \r Royse, D., & Thyer, B.A. (2015). Program evaluation: An introduction to an evidence-based approach. New York, NY: Cengage.\r Rubin, A., Bellamy, J. (2018). Practitioner's guide to using research for evidence-based practice. NJ: John Wiley & Sons. \r Stangor, C. (2014). Research methods for the behavioral sciences. New York, NY: Cengage. \r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2021-22 Term 3": {"-S01-SEM (1092)": {"startTimes": ["9:30", "9:30"], "endTimes": ["12:15", "12:15"], "days": [3, 1], "locations": ["Chen Kou Bun Bldg 706C", "Wong Foo Yuan Bldg 405"], "instructors": ["Professor LAM Yu Hin", "Professor LAM Yu Hin"], "meetingDates": ["18/5", "25/5", "1/6", "8/6", "15/6", "22/6", "16/5", "23/5", "30/5", "6/6", "13/6", "20/6", "27/6"]}}}}, {"code": "6402", "title": "Dissertation Research (I)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "This seminar is the first course in a two-course dissertation sequence. EP trainees participate in individual or small group tutorials that guide them in utilizing knowledge and skills in research methods and statistics to conduct a dissertation research project. Emphasis will also be on helping students appreciate the need for evidence-based practice, supported by program evaluation of efficacy and effectiveness as indicated by intervention research relevant to professional practice in educational psychology. This course will guide EP Trainees toward completion of a dissertation proposal.", "outcome": "After taking this course, EP Trainees will be able to:\r 1. Demonstrate ability to critically evaluate research evidence in one area of Educational Psychology.\r 2. Identify research gaps and formulate research questions which can be addressed using appropriate research and analytical methods.\r 3. Write up a detailed research proposal for their final year dissertation.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "Mertens, D.M. (2014). Research and evaluation in education and psychology. Thousand Oaks: SAGE\r  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Field, A (2013). Discovering statistics using IBM SPSS Statistics. London: Sage.\r Pallant, J. (2013). SPSS survival manual. New York: McGraw Hill.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 2": {"--LEC (1123)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LUK Sau Ha, \n\rDr. WONG Pak Ho, \n\rProfessor LAM Yu Hin, \n\rProfessor SIU Fung Ying Angela"], "meetingDates": ["11/01/2021 - 26/04/2021"]}}, "2020-21 Term 3": {"--LEC (1212)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SIU Fung Ying Angela"], "meetingDates": ["17/05/2021 - 26/07/2021"]}}}}, {"code": "6403", "title": "Dissertation Research (II)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "This seminar is the second course in a two-course dissertation sequence. Tutorial is conducted on an individual or small group basis to guide EP Trainees toward the completion of their dissertations. ", "outcome": "At the end of the course, EP Trainees will demonstrate ability to:\r 1. Conduct and complete an independent and ethically sound piece of research on one area in educational psychology.\r 2. Make an original contribution to Educational Psychology literature. \r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "Mertens, D.M. (2005). Research and evaluation in education and psychology. Thousand Oaks: SAGE\r  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "(Recommended readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 3": {"--LEC (1012)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LUK Sau Ha, \n\rDr. WONG Pak Ho, \n\rProfessor LAM Yu Hin, \n\rProfessor SIU Fung Ying Angela"], "meetingDates": ["17/05/2021 - 26/07/2021"]}}, "2021-22 Term 1": {"--LEC (1786)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. WONG Pak Ho, \n\rProfessor SIU Fung Ying Angela"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}}}, {"code": "6501", "title": "Practicum (I)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology;Pre-requisite: EPSY6201, EPSY6203", "description": "Practicum provides opportunities for students to develop their abilities and competence in integrating theory and practice under professional supervision. Each EP Trainee is expected to have fieldwork training of a minimum of 1200 hours, with at least 600 hours in educational settings, for the whole practicum. The first practicum provides hands-on experience in relation to individual work and group work. It should include experiences in working with students, families and/ or teachers. The placement sites/ collaborating parties can include, but not limited to, the educational psychology service unit of the Faculty, and mentorship scheme under the MA(EP) program. In the second and third practicum, EP trainees are supervised closely and regularly by qualified educational/ clinical psychologists in the field. The placements provide hands-on experience in relation to individual work, group work, and systems work, encompassing a wide range of student/ school needs, and they should include experiences in working with students, families, teachers, and improving the school system. The practicum settings include, but not limited to, preschools, primary schools, secondary schools, tertiary institutions and government departments.", "outcome": "At the end of the course, EP Trainees will be able to:\r 1. Gain experience in observing professional practices from experienced practitioners in the field.\r 2. Demonstrate basic professional knowledge and skills in a broad array of assessment and intervention activities under supervision to facilitate individual or group changes. \r 3. Widen the exposure in the role of educational psychologist in providing systems support in schools. \r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "(Required readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "recommended_readings": "Baird, B. (2013). Internship, Practicum, and Field Placement Handbook. New York, NY: Routledge. \r Grapin, S.L., & Kranzler, J.H. (2018). School Psychology: Professional Issues and Practices. New York, NY: Springer. \r Peacock, G.G., & Ervin, R.A. (2012). Practical Handbook of School Psychology: Effective Practices for the 21st Century. New York, NY: Guilford. \r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 1": {"-P01-PRA (1266)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LAM Wing Chi, \n\rDr. LUK Sau Ha, \n\rDr. WONG Pak Ho, \n\rMr. LUI Wan Hap"], "meetingDates": ["07/09/2020 - 14/12/2020"]}}, "2021-22 Term 3": {"-P01-PRA (1087)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LAM Wing Chi, \n\rMr. LUI Wan Hap"], "meetingDates": ["16/05/2022 - 27/06/2022"]}}}}, {"code": "6502", "title": "Practicum (II)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "Practicum provides opportunities for students to develop their abilities and competence in integrating theory and practice under professional supervision. Each EP Trainee is expected to have fieldwork training of a minimum of 1200 hours, with at least 600 hours in educational settings, for the whole practicum. The first practicum provides hands-on experience in relation to individual work and group work. It should include experiences in working with students, families and/ or teachers. The placement sites/ collaborating parties can include, but not limited to, the educational psychology service unit of the Faculty, and mentorship scheme under the MA(EP) program. In the second and third practicum, EP Trainees are supervised closely and regularly by qualified educational/ clinical psychologists in the field. The placements provide hands-on experience in relation to individual work, group work, and systems work, encompassing a wide range of student/ school needs, and they should include experiences in working with students, families, teachers, and improving the school system. The practicum settings include, but not limited to, preschools, primary schools, secondary schools, tertiary institutions and government departments.", "outcome": "At the end of the course, EP Trainees will be able to:\r 1. Demonstrate adequate professional knowledge, abilities and skills in a broad array of assessment and intervention activities to facilitate individual or systems changes.\r 2. Provide educational psychological services consistent with legal and professional standards. \r 3. Effectively engage in home-school-community collaboration to promote students’ well-being. \r 4. Polish skills in professional report writing and record keeping for inform service and intervention decision.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "(Required readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "recommended_readings": "Baird, B. (2013). Internship, Practicum, and Field Placement Handbook. New York, NY: Routledge. \r Grapin, S.L., & Kranzler, J.H. (2018). School Psychology: Professional Issues and Practices. New York, NY: Springer. \r Peacock, G.G., & Ervin, R.A. (2012). Practical Handbook of School Psychology: Effective Practices for the 21st Century. New York, NY: Guilford. \r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 2": {"-P01-PRA (1124)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LAM Wing Chi, \n\rDr. WONG Pak Ho, \n\rMr. LUI Wan Hap"], "meetingDates": ["11/01/2021 - 26/04/2021"]}}, "2020-21 Term 3": {"-P01-PRA (1217)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. WONG Pak Ho"], "meetingDates": ["17/05/2021 - 26/07/2021"]}}}}, {"code": "6503", "title": "Practicum (III)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Professional Educational Psychology", "description": "Practicum provides opportunities for students to develop their abilities and competence in integrating theory and practice under professional supervision. Each EP Trainee is expected to have fieldwork training of a minimum of 1200 hours, with at least 600 hours in educational settings, for the whole practicum. The first practicum provides hands-on experience in relation to individual work and group work. It should include experiences in working with students, families and/ or teachers. The placement sites/ collaborating parties can include, but not limited to, the educational psychology service unit of the Faculty, and mentorship scheme under the MA(EP) program. In the second and third practicum, EP Trainees are supervised closely and regularly by qualified educational/ clinical psychologists in the field. The placements provide hands-on experience in relation to individual work, group work, and systems work, encompassing a wide range of student/ school needs, and they should include experiences in working with students, families, teachers, and improving the school system. The practicum settings include, but not limited to, preschools, primary schools, secondary schools, tertiary institutions and government departments.", "outcome": "At the end of the course, EP Trainees will be able to:\r 1. Demonstrate adequate professional knowledge, abilities and skills in a broad array of assessment and intervention activities to facilitate individual or systems changes.\r 2. Provide educational psychological services consistent with legal and professional standards. \r 3. Effectively engage in home-school-community collaboration to promote students’ well-being. \r 4. Polish skills in professional report writing and record keeping for inform service and intervention decision.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "(Required readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "recommended_readings": "Baird, B. (2013). Internship, Practicum, and Field Placement Handbook. New York, NY: Routledge. \r Grapin, S.L., & Kranzler, J.H. (2018). School Psychology: Professional Issues and Practices. New York, NY: Springer. \r Peacock, G.G., & Ervin, R.A. (2012). Practical Handbook of School Psychology: Effective Practices for the 21st Century. New York, NY: Guilford.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 3": {"-P01-PRA (1013)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LAM Wing Chi, \n\rDr. WONG Pak Ho, \n\rMr. LUI Wan Hap"], "meetingDates": ["17/05/2021 - 26/07/2021"]}}, "2021-22 Term 1": {"-P01-PRA (2608)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LAM Wing Chi, \n\rMr. LUI Wan Hap"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}}}]