[{"code": "5001", "title": "Earth System Science", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Earth Sys & Geoinfo Sci", "requirements": "For students in MSc Geo-survey and Public Management, and MPhil-PhD Earth System and GeoInformation Science", "description": "This course introduces the concept of the Earth System Science - the study of the Earth as a system consisting of many inter-related and interacting components. The topics of lectures include individual components of the Earth System and their respective roles in the changing system. The emphasis is on interactions among different components of the system-atmosphere, hydrosphere, cryosphere, lithosphere, biosphere, and anthrosphere.", "outcome": "This course will contribute to understanding of Earth system science, including atmosphere, hydrosphere, biosphere, lithosphere, cryosphere, and anthrosphere, and the interactions between and among these spheres. The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner.", "syllabus": "1. Introductions2. Radiation Balance3. Atmosphere4. Hydrosphere 5. Cryosphere6. Biosphere & Lithosphere7. Geodesy and GNSS8. Climate Change", "required_readings": " Mackenzie, Fred T., 2010: Our Changing Planet – An Introduction to Earth System Science and Global Environmental Changes. 4rd Edition, Pearson Education, Inc., Upper Saddle River, NJ 07458. Skinner, Brian J., Stephen C. Porter, and Daniel B. Botkin, 1999: The Blue Planet – An Introduction to Earth System Science. 2nd Edition, John Wiley and Sons, Inc. Wallace, John M., and Peter V. Hobbs, 2006: Atmospheric Science: An Introductory Survey. 2nd Edition, Academic Press. Peixoto, José P., and Abraham H. Oort, 1992: Physics of Climate. Springer-Verlag New York, Inc.", "recommended_readings": "Our Changing Climate AMS Climate Studies: introduction to climate science by Chad M. Kauffman.  http://www.ametsoc.org/amsedu/online/climateinfo/textbook.htmlhttp://bookstore.ametsoc.org/subject/climate-studies  ", "terms": {"2020-21 Term 1": {"--LEC (2909)": {"startTimes": ["14:30"], "endTimes": ["16:30"], "days": [6], "locations": ["No Room Required"], "instructors": ["Dr. Adam Thomas DEVLIN, \n\rDr. LI Gang, \n\rProfessor MA Peifeng"]}, "-T01-TUT (2910)": {"startTimes": ["16:30"], "endTimes": ["17:30"], "days": [6], "locations": ["No Room Required"], "instructors": ["Dr. Adam Thomas DEVLIN, \n\rDr. LI Gang, \n\rProfessor MA Peifeng"]}}}, "assessments": {"Examination": "50", "Homework or assignment": "20", "Project": "30"}}, {"code": "5002", "title": "Special Topics in GeoInformation Science", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Earth Sys & Geoinfo Sci", "requirements": "For students in MSc Geo-survey and Public Management, and MPhil-PhD Earth System and GeoInformation Science", "description": "This course discusses the principles, structures and applications of geographic information systems. It emphasizes on the use of GIS in organizing and managing spatial data, and how to perform spatial analysis with GIS. Topics include hardware/software components, raster and vector data structures, spatial database, spatial analysis and application issues.", "outcome": "This course discusses the concepts, theories, techniques, and applications of geographic information sciences with special topics on geographic information systems, virtual geographic environments, and their applications.   It emphasizes on the use of GIS in organizing and managing spatial data, and how to perform spatial analysis with GIS. Topics include hardware/software components, raster and vector data structures, spatial database, spatial analysis and application issues.", "syllabus": "1. Introduction to geoinformation science2. Nature of geographic data and geocoding3. Map projection and coordinate system4. Data models & structure – vector & raster Data5. Web GIS – Mashup web maps using ArcGIS online and Esri’s Story Map 6. Database issues7. Spatial Analysis - Raster GIS capabilities and Vector GIS capabilities8. GIS Application - Network Analysis and 3D GIS9. Virtual Geographic Environment (VGE)10. GIS for humanities and Social Science11. Big Data and GIS", "required_readings": "Chang, Kang-tsung, 2016, Introduction to Geographic Information Systems, 8th Edition, McGrew Hill International Edition. [G70.212 .C4735 2016]", "recommended_readings": " Burrough, P. A., McDonnell, R., McDonnell, R. A., & Lloyd, C. D. (2015). Principles of geographical information systems. Oxford University Press. [G70.212 .B87] Haklay, M. M. (Ed.). (2010). Interacting with geospatial technologies. John Wiley & Sons. [G70.212 .H34] Konecny, G. (2014). Geoinformation: remote sensing, photogrammetry and geographic information systems. cRc Press. [G70.212 .K65]   Gold, C. (2016). Spatial Context: An Introduction to Fundamental Computer Algorithms for Spatial Analysis (Vol. 12). CRC Press. [G70.217.G46 G65] O'sullivan, D., & Unwin, D. (2014). Geographic information analysis. John Wiley & Sons. [G70.212 .O85] Kennedy, M. D. (2013). Introducing geographic information systems with ARCGIS: a workbook approach to learning GIS. John Wiley & Sons. [G70.212 .K47] Haklay, M. M. (Ed.). (2010). Interacting with geospatial technologies. John Wiley & Sons. [G70.212 .H34] Chun, Y., & Griffith, D. A. (2013). Spatial statistics and geostatistics: theory and applications for geographic information science and technology. Sage. [G70.217.G46 C58] Fu, P., & Sun, J. (2010). Web GIS: principles and applications. Esri Press. [G70.212 .F8] Yang, C., & Huang, Q. (2013). Spatial cloud computing: a practical approach. CRC Press. [G70.217.G46 Y36]", "terms": {"2020-21 Term 1": {"--LEC (3925)": {"startTimes": ["18:30"], "endTimes": ["20:30"], "days": [2], "locations": ["No Room Required"], "instructors": ["Dr. MAK Shuk Han"]}, "-T01-TUT (4011)": {"startTimes": ["20:30"], "endTimes": ["21:30"], "days": [2], "locations": ["No Room Required"], "instructors": ["Dr. MAK Shuk Han"]}}}, "assessments": {"Examination": "40", "Lab performance": "30", "Project": "30"}}, {"code": "5003", "title": "Transportation Applications of GIS", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSc Geo-survey and Public Management, and MPhil-PhD Earth System and GeoInformation Science", "description": "This course provides an overview and hands-on experience in the design, use, and interpretation of Geographic Information Systems for Transportation. Topics covered include transportation layers, transportation related referencing systems, data structures, network structures, urban transportation planning models and other spatial models. At the end of the course, students will have a sound working knowledge of transportation GIS and an ability to work directly with real-life problems.", "outcome": "Upon successful completion of this course, students are expected to: 1. Understand concepts central to the study of transportation systems. 2. Understand how GIS is revolutionizing transportation practice.  3. Be able to solve various transportation problems using analytical methods discussed in class and applied in labs. 4. Understand issues that impact the performance of transportation systems.", "syllabus": " Overview of GIS and Transportation Basic Elements of Transportation Networks Mobility and Accessibility Introduction to GIS-T GIS-T Data Representations Shortest Path Problem Travelling Salesman Problem (TSP) Vehicle Routing Problem (VRP) Linear Referencing Systems (LRS) & Dynamic Segmentation (DS) Network Flows and Facility Location Problems Travel Demand Analysis Intelligent Transportation System (ITS)", "required_readings": "Loo, P.Y., Lai, P.C. and Lin, H. (2006). Integrating Transportation and Geographic Information Systems: A Problem-Solving Approach. Hong Kong: Institute of Space and Earth Information Science, The Chinese University of Hong Kong.", "recommended_readings": " Miller, H. and Shaw, S.L. (2001). Geographic Information Systems for Transportation: Principles and Applications. New York: Oxford University Press. Ivan, I., Benenson, I., Jiang, B., Horák, J., Haworth, J. and Inspektor, T. (2015). Geoinformatics for Intelligent Transportation. Switzerland:  Springer International Publishing. Rodrigue, J.-P., Comtois, C. and Slack, B. (2009) The Geography of Transport Systems. New York: Routledge Shaw, S.L. (2010). Geographic information systems for transportation: from a static past to a dynamic future, Annals of GIS, 16(3):  pages 129-140.", "terms": {"2020-21 Term 1": {"--LEC (4355)": {"startTimes": ["19:00"], "endTimes": ["21:00"], "days": [5], "locations": ["No Room Required"], "instructors": ["Dr. LI Rongrong"]}, "-T01-TUT (4356)": {"startTimes": ["21:00"], "endTimes": ["21:30"], "days": [5], "locations": ["No Room Required"], "instructors": ["Dr. LI Rongrong"]}}}, "assessments": {"Examination": "30", "Lab reports": "40", "Project": "30"}}, {"code": "5006", "title": "Principles of Hydrology", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LecturePracticum", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSc Geo-survey and Public Management, and MPhil-PhD Earth System and GeoInformation Science", "description": "Water is a major formative factor and driving force of the physical and biological environment. Water also provides a logical link between biophysical environment and the society. This course introduces the hydrologic concepts, principles, and techniques that are necessary to understand the occurrence, distribution, and circulation of water that pervades, links, and drives various components and processes of the Earth System. Emphasis will be placed on the various components in the land phase of the hydrologic cycle, including precipitation, evaporation and transpiration, infiltration and soil physics, and surface and subsurface flow to streams. Special topics on hydrologic modeling and impact studies will also be addressed.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5009", "title": "Research Methods", "career": "Postgraduate - Research", "units": "2.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Earth Sys & Geoinfo Sci", "requirements": "For students in MPhil-PhD Earth Sys & Geo Sci", "description": "This couse will be combined with lectures and group discussion on research proposal prepration, literture review and compilation, academic paper writing, academic report preparation, the organzation and management of academic meetings. Popular academic themes will be discussed in the lectures and discussions.", "outcome": "After taking this course, students are expected to understand how to review journal papers, book chapters, advanced development news or reports. They are also expected to learn how to identify research questions from their review and figure out their own solutions to these research questions. Additionally, they are expected to prepare a research proposal on one research topic they selected.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (3275)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [4], "locations": ["Fok Ying Tung RS Sci. Bldg 303"], "instructors": ["Professor MA Peifeng"]}}}}, {"code": "5010", "title": "Terrain analysis and digital terrain modelling", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSc Geo-survey and Public Management, and MPhil-PhD Earth System and GeoInformation Science", "description": "Digital terrain modelling is important component of modern geo-spatial information technology. Natural terrain surface can be modelled using digital terrain models to form digital data sets that can further be used for terrain parameter derivation and feature interpretation, This subject aims to introduce students the basic concept of digital terrain modelling and analysis. Methods and techniques will be introduced for digital representation of 3-dimensional terrain surface and data structure of digital terrain data. The analytical tools and methods will also be introduced to derive terrain parameters and to extract geomorphic or terrain features from the terrain data. Applications of digital terrain modelling to hydrology soil, ecology and environment will also be discussed.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5011", "title": "Introduction to Geo-survey and Public Management", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSc Geo-survey and Public Management, and MPhil-PhD Earth System and GeoInformation Science", "description": "This course provides an overview and hands-on experience in the surveying, mapping, use, and interpretation of geo-survey for supporting the public management, which greatly depend on public policy analysis. Although the study of public management and public policy addresses two subjects that are often treated separately academically, but which in practice are closely inter-related. The course topics covered the both sides: the principles, techniques and methodologies of geo-survey, as well as the foundations of public management which has crucial relationship with policy-making. At the end of the course, students will have a comprehensive knowledge of national geo-survey for supporting the public policy analysis and evaluation, hence the rational and efficient public management.", "outcome": "After taking this course, students will be able to: 1. Grasp the foundations of both national geo-survey and public management 2. Recognize the relationships between national geo-survey and public management, and the relationship between public management and public policy 3. Structure the right policy problem armed by geo-survey methods for sophisticated and efficient public management 4. Select proper techniques for data collection, processing and analysis of geo-survey in connection with: - What is a public management organization doing? Or what has a public management organization done? - Why? and - What are the consequences by doing so? 5. Adopt reasonable methodologies to present results provided by national geo-survey techniques and interpret their policy implications 6. Explore and perform the public policy analysis using national geo-analysis methods comprehensively", "syllabus": "1-Introduction: Geo-survey and Public Management 2-Understanding Public Management 3-Briefing: Geo-survey in Public Management Analysis  4-Structuring Policy Problems 5-GeoSurvey in Public Management Evaluation 6-Comprehensive Application: Learning from Cases 7-Course Review", "required_readings": "GIS in Public Policy : Using Geographic Information for More Effective Government, by R. W. Greene, ESRI Press, 2000.", "recommended_readings": "GIS for Decision support and Public Policy Making, by Christopher Thomas Jou, Nancy Humenik-Sappington, ESRI Press, 2009.  Studies in Applied Geography and Spatial Analysis: Addressing Real World Issues. Edited by Robert Stimson, The University of Melbourne, Australia and Kingsley E. Haynes, Professor of Public Policy and Director, Institute of Public Policy, George Mason University, US. 2012.", "terms": {"2020-21 Term 1": {"--LEC (4354)": {"startTimes": ["18:30"], "endTimes": ["20:30"], "days": [3], "locations": ["No Room Required"], "instructors": ["Dr. LI Rongrong"]}, "-T01-TUT (4353)": {"startTimes": ["20:30"], "endTimes": ["21:30"], "days": [3], "locations": ["No Room Required"], "instructors": ["Dr. LI Rongrong"]}}}, "assessments": {"Discussion": "5", "Essays": "15", "Presentation": "25", "Project": "30", "Short answer test or exam": "25"}}, {"code": "5012", "title": "Introduction to Earth Environmental Simulations and the Applications", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSc Geo-survey and Public Management, and MPhil-PhD Earth System and GeoInformation Science", "description": "The course introduces the basic knowledge of earth environmental model simulations. Numerical models serve as important tools for earth environmental research and operations. While the topic of earth environmental modelling is broad, this course will focus on the fundamental concepts of numerical modelling, such as temporal and spatial discretizations, parameterizations, model uncertainty and evaluation. Various components of earth system model will be introduced, including atmospheric general circulation model, regional climate model, weather prediction and land surface model, oceanic general circulation model, air quality model, health assessment model and integrated assessment model. In addition, this course will discuss numerical model design, application and testing. Practical exercises such as weather forecast and air quality prediction are also provided for students to gain technical skills and hands-on experience in modelling.", "outcome": "After taking this course, students are expected to • understand basic concepts and theories of earth environmental modelling, • learn numerical model design, application and testing, • gain technical skills and practical experiences of earth environmental modelling, • select appropriate models for solving given earth environmental problems, and • apply the knowledge of numerical modelling on their research and career.", "syllabus": "This course will introduce numerical simulation theories and technologies on earth systems which include abiotic complexes of atmosphere, hydrosphere, pedosphere and biotic elements of growth processes and population dynamics. The lectures and tutorials will provide students with basic knowledge on use of High Performance Computing simulations of the earth system dynamics, in particular, the global climate change and the adaptation and risk management.", "required_readings": " Philip J. Rasch, Climate Change Modeling Methodology: Selected Entries from the Encyclopedia of Sustainability Science and Technology, Springer; 2012 edition, 2012. Eugenia Kalnay, Atmospheric Modeling, Data Assimilation and Predictability, Cambridge University Press, 2002. Martin Beniston, From Turbulence to Climate: Numerical Investigations of the Atmosphere with a Hierarchy of Models, Springer, 1997.", "recommended_readings": "1) Luca Bonaventura, René Redler, Reinhard Budich. Earth System Modelling - Volume 2 [electronic resource]: Algorithms, Code Infrastructure and Optimisation. Berlin, Heidelberg : The Authors 2012. 2) Jonathan L. Bamber and Antony J. Payne. Mass balance of the cryosphere: observations and modelling of contemporary and future changes. Cambridge ; New York : Cambridge University Press 2004. 3) Mark Z. Jacobson, Fundamentals of atmospheric modelling. Cambridge ; New York : Cambridge University Press 1999. 4) Philip W Mote; Alan O'Neill. Numerical modelling of the global atmosphere in the climate system. Dordrecht ; Boston : Kluwer Academic Publishers c2000. 5) John H. Seinfeld, Spyros N. Pandis. Atmospheric chemistry and physics : from air pollution to climate change. New York : John Wiley c1998. 6) Asante-Duah, Kofi. Public Health Risk Assessment for Human Exposure to Chemicals. Dordrecht: Springer 2017.", "terms": {"2020-21 Term 2": {"--LEC (3635)": {"startTimes": ["14:30"], "endTimes": ["16:30"], "days": [1], "locations": ["Fok Ying Tung RS Sci. Bldg 303"], "instructors": ["Professor YIM Hung Lam Steve"]}, "-T01-TUT (3634)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Fok Ying Tung RS Sci. Bldg 303"], "instructors": ["Professor YIM Hung Lam Steve"]}}}, "assessments": {"Examination": "40", "Lab reports": "40", "Project": "20"}}, {"code": "5015", "title": "Spatial Analysis for Public Management", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSc Geo-survey and Public Management, and MPhil-PhD Earth System and GeoInformation Science", "description": "This course provides an introduction to a wide selection of spatial analytics and their applications in different aspects of public management. The course has two major aims. On the technical front, this course aims to teach students fundamental concepts and recent progress of spatial analysis. On the substantive front, this course integrate the introduction to spatial analytics with their applications in public policies and management, ranging from mapping the inequality among economic and health outcomes, to land use choices, and innovative census from remote sensing and locational based service.", "outcome": "Upon successful completion of this course, students will be able to: • understand concepts central to spatial data analysis • be aware of the progress and challenges of GIS and spatial analysis in policy studies and public management • present and interpret spatial data in the context of public management • identify geographic patterns, understand underlying spatiotemporal processes, and make spatially-explicit prediction/simulation under different decision scenarios • critically assess management decisions and draw policy implications by virtue of geo-spatial modeling and geo-analysis techniques discussed in class and applied in labs", "syllabus": "Lectures Lecture 1: Introduction: Geography, urbanization, and public policy Lecture 2: Spatial data and spatial data analysis Lecture 3: Revealing inequalities (focus: mapping and geo-visualization) Lecture 4: Taking advantage of special structure (focus: spatial sampling and interpolation) Lecture 5: Identifying determinants (focus: spatial regression and GWR) Lecture 6: Allocating resources (focus: spatial optimization) Lecture 7: Forecasting the future (focus: geo-simulation)  Lecture 8: Governing mega-city region (focus: spatial and social network analysis) Lecture 9: Census from the sky (focus: remote sensing analysis) Lecture 10: Citizen as sensors (focus: location-based service and PPGIS) Lecture 11: Review of spatial analysis for public policy  Laboratories Lab 1: Mapping and geo-visualization Lab 2: Spatial sampling and interpolation Lab 3: Spatial regression and GWR Lab 4: Spatial optimization Lab 5: Geo-simulation Lab 6: Network analysis Lab 7: Remote sensing analysis (image processing and data analysis) Lab 8: Location-based service (mobile mapping)", "required_readings": "Greene RW. 2000. GIS in Public Policy: Using Geographic Information for More Effective Government. Redland, CA: ESRI Press.", "recommended_readings": "Applied Spatial Analysis and Policy: http://link.springer.com/journal/12061  Stillwell JCH and Clarke GP. 2004. Applied GIS and Spatial Analysis. Chichester, West Sussex, England; Hoboken, NJ: Wiley.   Wang F. 2006. Quantitative Methods and Applications in GIS. Boca Raton, FL: CRC Press. [王法辉. 基于GIS 的数量方法与应用. 江世国, 藤俊华译. 北京: 商务印书馆, 2009.]", "terms": {"2020-21 Term 2": {"--LEC (4442)": {"startTimes": ["18:30"], "endTimes": ["20:30"], "days": [2], "locations": ["Fok Ying Tung RS Sci. Bldg 303"], "instructors": ["Dr. LI Rongrong"]}, "-T01-TUT (4441)": {"startTimes": ["20:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Fok Ying Tung RS Sci. Bldg 303"], "instructors": ["Dr. LI Rongrong"]}}}, "assessments": {"Lab reports": "40", "Others": "30", "Short answer test or exam": "30"}}, {"code": "5016", "title": "Urban Networks", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSc Geo-survey and Public Management, and MPhil-PhD Earth System and GeoInformation Science", "description": "This course introduces the practice of network theory and applications of social networks analysis tools in understanding urban issues and supporting decision-making of public policy. Facilitated the development of telecommunication and transportation technologies, a city is increasingly organized as connections between and within it. Such connections can take various forms – economic, social, cultural, physical and political. Therefore this course looks at how network theory makes the positive contribution to explain the realities of urban affairs, and how social network analysis tools (such as UCINET and NetDraw) can be used to interpret and address a number of urban issues related to local-global positioning. Both efforts are supposed to support decision-making of public policy.", "outcome": "After taking this course, students will be able to: 1. Understand the concept and characteristics of urban networks. 2. Recognized the major forms of urban networks in terms of different aspects and scales. 3. Perform urban network analysis using GIS analysis tools. 4. Explore network approaches to urban issues. 5. Extend the policy implication of analysis results to facilitate the decision-making of public policy.", "syllabus": " Introduction: Urban networks Micro-urban networks: Networks of actors Meso-urban networks: City as a network of networks Macro-urban networks: Networks of cities", "required_readings": " Zachary P Neal, 2013. The Connected City: How Networks Are Shaping the Modern Metropolis. New York: Routledge. (HM741. N43 2013) Urban Studies. Special issue in Nov 2010. UK: University of Glasgow. (e-Journal online)", "recommended_readings": " Peter J Taylor, 2004. World City Network: A Global Urban Analysis. New York: Routledge. (HT119 T39 2004; e-Book online) Stephen P Borgatti, Martin G Everett and Jeffrey C Johnson, 2013. Analyzing Social Networks. London: SAGE Publication Ltd. (HM741 B67 2013) Louis Albrechts and Seymour J Mandelbaum, 2005. The Network Society: A New Context for Planning? New York: Routledge. (HT166 N425 2005) Sean F Evertion, 2012. Disrupting Dark Networks. UK: Cambridge University Press. (HM711 E94 2012) Manuel Castells, 2002. The Rise of the Network Society (2nd Ed). UK: Oxford University Press. (HC799 I55 C373) User’s Guide and Tutorials of UCINET and NetDraw software packages   at http://www.analytictech.com/", "terms": {"2020-21 Term 2": {"--LEC (3677)": {"startTimes": ["14:30"], "endTimes": ["16:30"], "days": [6], "locations": ["Fok Ying Tung RS Sci. Bldg 303"], "instructors": ["Professor YIM Hung Lam Steve"]}, "-T01-TUT (3676)": {"startTimes": ["16:30"], "endTimes": ["17:30"], "days": [6], "locations": ["Fok Ying Tung RS Sci. Bldg 303"], "instructors": ["Professor YIM Hung Lam Steve"]}}}, "assessments": {"Essays": "30", "Lab reports": "30", "Others": "40"}}, {"code": "5017", "title": "Geoinformation Technologies for Risk and Crises Management", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSc Geo-survey and Public Management, and MPhil-PhD Earth System and GeoInformation Science", "description": "This course is to inform, explain, analyze, interpret and communicate the role of Geoinformation technologies in risk and crises situations (tsunamis, earthquakes, fires, landslides, anthropogenic disasters) and improvement of their use in adequate operations with aim to show their till now under-evaluated potentials and way how to integrate knowledge of cartographic and geographic community to risk and crises management into wide decision making process.", "outcome": "After taking this course, students are expected to understand fundamental knowledge about risk and crises management, to gain basic and general geoinformation technology framework for risk and crises management, to get technical skills of using remote sensing and GIS for early warning and emergency response, and to understand the assessment of damage and recovery from crises.", "syllabus": " Introduction to Natural Disasters Science Disaster Management Framework (DMF) Geographic Information Science (GIS) for Disaster Management (I): Theory & Technology Geographic Information Science (GIS) for Disaster Management (II): Good Practice Data Preparedness and Data Sharing Risk Assessment and Early Warning Emergence Response Recovery and Post Disaster Remote Sensing (RS) of Natural Disasters ", "required_readings": " Haimes, H, Y. 2009, Risk Modeling, Assessment, and Management, 3rd  ed., Wiley, New York Marvin Rausand. 2010, Risk assessment : theory, methods, and applications. Wiley, New York Milan Konecny, Sisi Zlatanova, Temenoujka L. Bandrova. 2010, Geographic Information and Cartography for Risk and Crisis Management: Towards Better Solutions. Springer-Verlag Berlin Heidelberg", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (3678)": {"startTimes": ["18:30"], "endTimes": ["20:30"], "days": [3], "locations": ["Fok Ying Tung RS Sci. Bldg 303"], "instructors": ["Professor MA Peifeng"]}, "-T01-TUT (3679)": {"startTimes": ["20:30"], "endTimes": ["21:30"], "days": [3], "locations": ["Fok Ying Tung RS Sci. Bldg 303"], "instructors": ["Professor MA Peifeng"]}}}, "assessments": {"Lab reports": "30", "Others": "30", "Short answer test or exam": "40"}}, {"code": "5018", "title": "Environmental Remote Sensing Technology", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSc Geo-survey and Public Management, and MPhil-PhD Earth System and GeoInformation Science", "description": "The course helps students to understand remote sensing principles and basic skills in remote sensing image processing and analysis. The students will develop the capability to solve practical problems in the Earth System Science by using remote sensing methods. The theory, methods, and applications of environmental remote sensing are taught in the course. The lectures cover the principles of electromagnetic radiation, satellite observation sensors, digital image processing, Earth target classifications, and the remote sensing applications in land and ocean. ERDAS Imagine software will be used for lab practices.", "outcome": "The course helps students to understand remote sensing principles and basic skills in remote sensing image processing and  analysis. The students will develop the capability to solve practical problems in the Earth System Science by using remote sensing methods.", "syllabus": "The theory, methods, and applications of environmental remote sensing are taught in the course. The lectures cover the principles of electromagnetic radiation, satellite observation sensors, digital image processing, Earth target classifications, and the remote sensing applications in land and ocean. ERDAS Imagine software will be used for lab practices.", "required_readings": " Mather, Paul M. and Magaly Koch, 2011, Computer processing of remotely-sensed images: an introduction, 4th Ed., Chichester, West Sussex, UK ; Hoboken, NJ : Wiley-Blackwell, 434 pages. Jensen, John R., 2007, Remote Sensing of the Environment: An Earth Resource Perspective, 2nd Ed., Upper Saddle River, NJ: Prentice Hall, 592 pages. Jensen, John R., 2004. Introductory Digital Image Processing, 3rd Ed. Upper Saddle River, NJ: Prentice Hall, 544 pages.", "recommended_readings": " ERDAS Field Guide.  ERDAS Tour Guide.", "terms": {"2020-21 Term 1": {"--LEC (3399)": {"startTimes": ["18:30"], "endTimes": ["20:30"], "days": [1], "locations": ["No Room Required"], "instructors": ["Professor MA Peifeng"]}, "-T01-TUT (3400)": {"startTimes": ["20:30"], "endTimes": ["21:30"], "days": [1], "locations": ["No Room Required"], "instructors": ["Professor MA Peifeng"]}}}, "assessments": {"Examination": "40", "Lab reports": "30", "Project": "30"}}, {"code": "5019", "title": "Global Navigation Satellite System (GNSS) and Sensor Network for Environmental Monitoring", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSc Geo-survey and Public Management, and MPhil-PhD Earth System and GeoInformation Science", "description": "This course describes broad principles of Environmental Sensor Network (SN), the integration with positioning technologies and its roles in contemporary environmental studies and smart cities developments. The integration of SN and positioning technologies offers a powerful combination of distributed sensing capacity, real time data visualization and spatial analysis and integration with remote sensing data sources. The combined technologies are greatly needed in large-scale environmental monitoring and Smart Cities developments. Another half of the course introduces the Global Navigation Satellite System (GNSS) and other indoor positioning technologies. It covers the basic principles, advanced techniques as well as their applications in Earth System Sciences and urban management. With the background knowledge and the practical skills, students shall be able to integrate GNSS and SN in their future research and studies.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5060", "title": "Seminars in GeoInformation Science", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSc Geo-survey and Public Management, and MPhil-PhD Earth System and GeoInformation Science", "description": "Earth System Science is a study of the Earth as an integrated system with its major components of atmosphere, hydrosphere lithosphere and biosphere. This seminar course is an open forum which aims at making students acquire up-to-date knowledge and techniques of the Earth system and Geoscience. Well-known scholars, professionals, rescarchers and officals from local institutions and from overseas will be inivited to present their latest research and timely topics relevant to Earth system science.", "outcome": "Students will acquire up-to-date knowledge and techniques of the Earth system and Geoscience, and develop a deeper appreciation of the research and topics relevant to the Earth system science.", "syllabus": "This seminar course is an open forum which aims at making students acquire up-to-date knowledge and techniques of the Earth system and Geoscience. Well-known scholars, professionals, researchers and officials from local institutions and from overseas will be invited to present their latest research and timely topics relevant to Earth system science. The course is open to all students and staff. The seminar language will be English or Chinese", "required_readings": "NIL", "recommended_readings": "", "terms": {"2020-21 Term 1": {"-S01-SEM (4352)": {"startTimes": ["15:30"], "endTimes": ["17:00"], "days": [5], "locations": ["No Room Required"], "instructors": ["Dr. LI Rongrong"]}}, "2020-21 Term 2": {"-S01-SEM (4427)": {"startTimes": ["15:30"], "endTimes": ["17:00"], "days": [5], "locations": ["Fok Ying Tung RS Sci. Bldg 303"], "instructors": ["Dr. LI Rongrong, \n\rProfessor MA Peifeng"]}}}, "assessments": {"Participation": "30", "Report": "70"}}, {"code": "6061", "title": "Project in Geo-Survey and Public Management", "career": "Postgraduate - Taught", "units": "4.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSc Geo-survey and Public Management", "description": "Each student is required to carry out an independent research project under the supervision of a teacher.", "outcome": "Each student is required to carry out an independent research project under the supervision of a professor.", "syllabus": "To be negotiated by student and supervisor", "required_readings": "NIL", "recommended_readings": "", "terms": {"2020-21 Summer Session": {"-J01-PRJ (1136)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LI Gang, \n\rDr. LI Rongrong, \n\rProfessor MA Peifeng, \n\rProfessor YIM Hung Lam Steve"]}}}}, {"code": "8003", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "6.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Earth Sys & Geoinfo Sci", "requirements": "For students MPhil-PhD Earth Sys & Geo Sci", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student's academic progress.", "outcome": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student's academic progress.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"-M01-TMC (3591)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor HUANG Bo, \n\rProfessor KWAN Mei Po, \n\rProfessor MA Peifeng"]}}, "2020-21 Term 2": {"-M01-TMC (3705)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor HUANG Bo, \n\rProfessor KWAN Mei Po, \n\rProfessor MA Peifeng"]}}}}, {"code": "8006", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "6.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Earth Sys & Geoinfo Sci", "requirements": "For students in MPhil-PhD Earth Sys & Geo Sci", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student's academic progress.", "outcome": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student's academic progress.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"-M01-TMC (3592)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor HUANG Bo, \n\rProfessor KWAN Mei Po, \n\rProfessor MA Peifeng"]}}, "2020-21 Term 2": {"-M01-TMC (3706)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor HUANG Bo, \n\rProfessor KWAN Mei Po, \n\rProfessor MA Peifeng"]}}}}, {"code": "8012", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "12.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Earth Sys & Geoinfo Sci", "requirements": "For students in MPhil-PhD Earth Sys & Geo Sci", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student's academic progress.", "outcome": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student's academic progress.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"-M01-TMC (3593)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor HUANG Bo, \n\rProfessor KWAN Mei Po, \n\rProfessor MA Peifeng"]}}, "2020-21 Term 2": {"-M01-TMC (3707)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor HUANG Bo, \n\rProfessor KWAN Mei Po, \n\rProfessor MA Peifeng"]}}}}]