[{"code": "1000", "title": "Introduction to Engineering Design", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureProjectInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ENGG1100.", "description": "This is a hands-on project-based course which introduces the basic engineering concepts, experimental skills and design methodology needed for the design and construction of a hardware based system. Students will work in small groups on a practical project in which they will apply the design methodology introduced to them in lectures in a design project. The project work will involve defining milestones, identifying the constraints and requirements, defining the requirement specifications of the design, making and evaluating different possible designs by carrying out experiments to obtain data for refining the design, prototyping of the final design and testing of the system built in the project.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1002", "title": "Problem Solving By Programming", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken CSCI1020, CSCI1030, CSCI1110, CSCI1120, CSCI1130, CSCI1510, CSCI1520, CSCI1530, CSCI1540, ENGG1110, ESTR1100 or ESTR1102.", "description": "This is a computer-programming course to equip students with software knowledge and skills to solve engineering problems. Students will learn fundamental programming concepts in C, such as data representation and variables, operators and expressions, flow-control statements, functions, arrays, structures, pointer basics, input/ output handling, etc. In addition to lectures and e-learning, students will work in labs to practise solving problems and complete an engineering software project. The course will cover various problem solving methods such as incremental development, divide-and-conquer, debugging technique, finite-state machine, etc. Through practices, students will acquire skills to define problems and specifications, to perform modelling and simulation, to develop software system prototypes, to carry out verification, validation, and performance analysis.\r", "outcome": "At the end of the course of studies, students are expected to acquire the ability to\r 1. understand basic structural programming constructs in building a working software; 2. apply computer programming to solve engineering problems; 3. model a system on a computer to meet specifications and performance goals.", "syllabus": "According to the course teacher in the respective teaching term.", "required_readings": "", "recommended_readings": "1. C How to Program, Deitel & Deitel, 8th ed.\r 2. Other references provided by the instructor.", "terms": {"2020-21 Term 1": {"--LEC (8547)": {"startTimes": ["14:30", "15:30"], "endTimes": ["16:15", "16:15"], "days": [1, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor FU Chi Wing", "Professor FU Chi Wing"]}, "-L01-LAB (8548)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor FU Chi Wing"]}}}, "assessments": {"Essay test or exam": "40", "Lab reports": "30", "Project": "20", "Short answer test or exam": "10"}}, {"code": "1003", "title": "Engineering Physics: Electromagnetics, Optics and Modern Physics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ENGG1310 or ENGG2520 or ESTR2006.", "description": "This is an introductory calculus-based engineering physics course covering topics in electromagnetics, optics and modern physics. Topics in electromagnetics include: electric and magnetic properties, Coulomb’s law, Gauss’ law, electromagnetic energy and forces, Biot-Savart law, electromagnetic fields and Maxwell’s equations, propagation of plane electromagnetic waves. Topics in optics include: optical interference, interferometers, optical diffraction. Topics in modern physics include: wave-particle duality, momentum and energy of photons and electrons, electronic states and energy bands, electrical conduction in metals and semiconductors. Contents will be supplemented by discussions on applications relevant to engineering.\r", "outcome": "By the end of the course, students should be able to \r • Perform qualitative and quantitative analysis of problems in electromagnetics, optics and modern physics \r • Recognize the physical properties of particles and waves \r • Understand the origins and the properties of electrical conduction in metals and semiconductors \r • Understand the key physical parameters and the fundamental laws in electromagnetism and wave propagation", "syllabus": "According to the course teacher in the respective teaching term.", "required_readings": "", "recommended_readings": "1.“Principles of Physics”, 9th edition international student version, Halliday, Resnick and Walker (Wiley 2010).\r  2.“Fundamentals of Engineering Electromagnetics”, David K. Cheng, (Prentice-Hall 1992)", "terms": {"2020-21 Term 2": {"--LEC (5540)": {"startTimes": ["16:30", "14:30"], "endTimes": ["17:15", "16:15"], "days": [4, 2], "locations": ["Lady Shaw Bldg LT2", "Lady Shaw Bldg LT5"], "instructors": ["Professor HU Guohua", "Professor HU Guohua"]}, "-T01-TUT (7819)": {"startTimes": ["17:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Lady Shaw Bldg LT2"], "instructors": ["Professor HU Guohua"]}}}, "assessments": {"Essay test or exam": "50", "Lab reports": "10", "Others": "12", "Short answer test or exam": "28"}}, {"code": "1004", "title": "Linear Algebra and Vector Calculus for Engineers", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ENGG1410.;Pre-requisite: MATH1510.", "description": "Linear algebra: matrices, matrix addition, matrix multiplication, inverses, special matrices; vector spaces, basis and dimension, linear independence, rank, determinants; linear transformations, projection, orthogonality, systems of linear equations, Gaussian elimination; eigenvalues and eigenvectors. Vector calculus: 3-D vector space and algebra; vector differential calculus, gradient, divergence, curl; vector integral calculus, Green's theorem, Gauss's theorem, Stoke's theorem.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1005", "title": "Linear Algebra for Engineers", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ENGG1120 or ENGG1410 or ESTR1004 or MATH1030", "description": "This course aims at introducing students to the fundamental concepts and methods in linear algebra, which are key to many fields of engineering. Topics include systems of linear equations, Gauss elimination, matrix factorization, matrices and their operations, determinants, eigenvalues and eigenvectors, diagonalization, vector space, the Gram-Schmidt process, and linear transformation.\r", "outcome": "At the conclusion of the course, students should be able to\r 1. demonstrate knowledge and understanding of the basic elements of linear algebra\r 2. apply results and techniques from linear algebra to solve simple engineering problems", "syllabus": "Provided by the course teacher(s) in the respective teaching term.", "required_readings": "", "recommended_readings": "1. Erwin Kreyszig, Advanced Engineering Mathematics, Wiley, 10th Edition, 2011.\r 2. Bernard Kolman, David R.Hill, Introductory Linear Algebra, an Applied First Course, Pearson/Prentice Hall, 8th Edition, 2005.\r 3. Steven J. Leon, Linear Algebra with Applications, Pearson/Prentice Hall, 7th Edition, 2006.", "terms": {"2020-21 Term 2": {"--LEC (6945)": {"startTimes": ["9:30", "9:30"], "endTimes": ["11:15", "10:15"], "days": [1, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor LONG Zhuoyu", "Professor LONG Zhuoyu"]}, "-T01-TUT (6969)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor LONG Zhuoyu"]}}}, "assessments": {"Essay test or exam": "65", "Homework or assignment": "25", "Others": "10"}}, {"code": "1006", "title": "Multivariable Calculus for Engineers", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Pre-requisite: MATH1510;Not for students who have taken ENGG1130 or ENGG1410 or ESTR1004 or MATH2010 or MATH2020", "description": "This course aims at introducing students to fundamental concepts and methods in multivariable calculus, which provide tools for solving engineering problems. Topics include functions of several variables, curves and surfaces, partial derivatives, Taylor’s formula, method of Lagrange multipliers, multiple integrals, line and surface integrals, Green’s theorem, Stokes’ theorem and divergence theorem\r", "outcome": "At the conclusion of the course, students should be able to\r 1. demonstrate knowledge and understanding of the basic elements of multivariable calculus\r 2. apply results and techniques from multivariable calculus to solve simple engineering problems", "syllabus": "Provided by the course teacher(s) in the respective teaching term.", "required_readings": "", "recommended_readings": "1. Erwin Kreyszig, Advanced Engineering Mathematics, Wiley, 10th Edition, 2011.\r 2. Maurice D. Weir and Joel Hass, Thomas’ Calculus, Pearson, 12th Edition, 2010.\r 3. James Stewart, Calculus - Multivariable Calculus, CENGAGE Learning, 8th Edition, 2016.", "terms": {"2020-21 Term 2": {"--LEC (8389)": {"startTimes": ["16:30", "14:30"], "endTimes": ["18:15", "15:15"], "days": [2, 4], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Dr. HAN Dongkun", "Dr. HAN Dongkun"]}, "-T01-TUT (8390)": {"startTimes": ["15:30"], "endTimes": ["16:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr. HAN Dongkun"]}}}, "assessments": {"Essay test or exam": "65", "Homework or assignment": "25", "Others": "10"}}, {"code": "1100", "title": "Introduction to Computing Using C++", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken CSCI1020, CSCI1110, CSCI1120, CSCI1130, CSCI1510, CSCI1520, CSCI1530, CSCI1540 or ESTR 1102.", "description": "This course introduces the computer-oriented problem-solving methods and algorithm development; object oriented programming concepts; concepts of abstract data types; simple data structures; illustrative applications. The C++ programming language will be used.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1102", "title": "Introduction to Computing Using Java", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken CSCI1030, CSCI1110, CSCI1120, CSCI1130, CSCI1510, CSCI1520, CSCI1530, CSCI1540 or ESTR1100.", "description": "This course aims at providing students with the basic knowledge of computer programming. In particular, programming methodologies such as object-oriented programming and structured programming, and the use of abstract data types will be illustrated using high-level programming languages such as Java.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2000", "title": "Complex Analysis and Differential Equations for Engineers", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ENGG2420, ENGG2460 or ESTR2010.", "description": "Complex analysis: analytic functions and Cauchy Riemann; complex integration, Cauchy principal value; elementary complex valued functions: exponential functions, Euler’s formula, trigonometric and hyperbolic functions, logarithm and general powers; power series, Taylor series and convergence tests.ODE: classification of differential equations; 1st order ordinary differential equations; 2nd order ordinary differential equations. Partial differential equations.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2002", "title": "Probability and Statistics for Engineers", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ENGG2430 or ENGG2450 or ESTR2005 or ESTR2362 or MIEG2440.", "description": "Fundamental probability concepts: probability and events; expectation, variance, moments, characteristic functions, moment generating functions; single variate distributions. Multivariate probability: conditional probability, joint probability; Bayes’ Theorem; conditional expectation, covariance; multivariate distributions, functions of random variables. Central limit theorems, law of large number. Random process: definition, stationary and ergodic random processes, Gaussian random processes, white noise. Statistics: estimation, sample size and applications.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2004", "title": "Discrete Mathematics for Engineers", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken CSCI2110 or ENGG2440 or ENGG2460 or ESTR2010 or ESTR2362 or MIEG2440.", "description": "Set theory, functions, relations, combinatorics, graph theory, algebraic systems, propositional and predicate logic.", "outcome": "Learning Outcomes: 1. be familiar with basic mathematical concepts, e.g. sets, functions, graphs 2. be familiar with formal mathematical reasoning, e.g. logic, proofs 3. be able to see the connections between discrete mathematics and computer science", "syllabus": "According to the course teacher in the respective teaching term.", "required_readings": "To be provided by course instructor.", "recommended_readings": "Recommended Reading List:  1. Discrete Mathematics with Applications, by Susanna S. Epp. 2. Course notes of \"mathematics for computer science\" in MIT.", "terms": {"2020-21 Term 1": {"--LEC (5094)": {"startTimes": ["13:30", "10:30"], "endTimes": ["14:15", "12:15"], "days": [3, 1], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor SO Man Cho", "Professor SO Man Cho"]}, "-T01-TUT (5826)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor SO Man Cho"]}}}, "assessments": {"Others": "40", "Short answer test or exam": "60"}}, {"code": "2005", "title": "Probability and Statistics for Engineers", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ENGG2430 or ENGG2450 or ESTR2002.", "description": "Probability theory: population, sample spaces and events, counting, axioms of probability, conditional probability, Bayes' Theorem, discrete distributions, continuous distributions, joint distributions, expectation and decision making, random processes. Statistical inference: sampling distributions, point estimation, confidence interval, hypothesis testing, chi-square goodness-of-fit test. Introduction to regression analysis: linear regression.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2012", "title": "Probability for Engineers", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ENGG2430, ENGG2440, ENGG2450, ENGG2460, ENGG2470, ESTR2002, ESTR2004, ESTR2005, ESTR2010, ESTR2362 or MIEG2440.", "description": "The course will cover the following topics:Sets, relations, proof methods, combinatorics, probability and events: expectation, variance, moments, moment generating functions, single variate distributions. Multivariate probability: conditional probability, joint probability, Bayes’ Theorem, conditional expectation, covariance, multivariate distributions. Functions of random variables. Central limit theorem, law of large numbers.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2014", "title": "Complex Variables for Engineers", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ENGG2420 or ENGG2460 or ENGG2720 or ESTR2000 or ESTR2010", "description": "A first course in complex numbers and the calculus of functions of one complex variable. Topics include complex numbers, complex differentiation, analytic functions and Cauchy–Riemann equations, elementary complex functions, complex integration, series, and residues integration.\r", "outcome": "At the conclusion of the course, students should be able to\r 1. demonstrate knowledge and understanding of the basic elements of complex analysis\r 2. identify simple engineering problems that can be formulated and solved using complex analytic techniques", "syllabus": "Provided by the course teacher(s) in the respective teaching term.", "required_readings": "", "recommended_readings": "1. Erwin Kreyszig, Advanced Engineering Mathematics, Wiley, 10th Edition, 2011\r 2. James Ward Brown and Ruel V. Churchill, Complex Variables and Applications, McGraw-Hill, 8th Edition, 2009", "terms": {"2020-21 Term 1": {"--LEC (8515)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor CHEN Benmei"]}, "-T01-TUT (8516)": {"startTimes": ["10:30", "15:30"], "endTimes": ["12:15", "16:15"], "days": [4, 2], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor CHEN Benmei", "Professor CHEN Benmei"]}}}, "assessments": {"Essay test or exam": "65", "Homework or assignment": "25", "Others": "10"}}, {"code": "2016", "title": "Differential Equations for Engineers", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ENGG2420 or ENGG2460 or ENGG2740 or ESTR2000 or ESTR2010", "description": "A first course in the theory and applications of ordinary and partial differential equations. Topics include classification of differential equations, linear ordinary differential equations, Fourier series, and partial differential equations.\r", "outcome": "At the conclusion of the course, students should be able to\r 1. demonstrate knowledge and understanding of the basic elements of ordinary and partial differential equations\r 2. model simple engineering problems using differential equations and solve them", "syllabus": "Provided by the course teacher(s) in the respective teaching term.", "required_readings": "", "recommended_readings": "1. Erwin Kreyszig, Advanced Engineering Mathematics, Wiley, 10th Edition, 2011\r 2. William E. Boyce, Richard C. DiPrima, and Douglas B. Meade, Elementary Differential Equations and Boundary Value Problems, Wiley, 11th Edition, 2017", "terms": {"2020-21 Term 2": {"--LEC (4755)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. LI Yiyang"]}, "-T01-TUT (4757)": {"startTimes": ["9:30", "TBA"], "endTimes": ["11:15", "TBA"], "days": [3, "TBA"], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Dr. LI Yiyang", "Dr. LI Yiyang"]}}}, "assessments": {"Essay test or exam": "65", "Homework or assignment": "25", "Others": "10"}}, {"code": "2018", "title": "Probability for Engineers", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ENGG2430 or ENGG2450 or ENGG2470 or ENGG2760 or ESTR2002 or ESTR2005 or ESTR2012 or ESTR2308 or ESTR2362 or IERG2470 or MIEG2440.", "description": "A first course in the fundamentals of probability theory and their applications in engineering. Topics include sample space and events, counting, axioms of probability, conditional probability, independence of events, discrete and continuous distributions, random variables, joint distributions, and limit theorems.", "outcome": "At the conclusion of the course, students should be able to 1. define and understand the fundamental concepts in probability  2. identify, formulate, and solve simple engineering problems involving randomness", "syllabus": "Provided by the course teacher(s) in the respective teaching term.", "required_readings": "To be provided by course instructor.", "recommended_readings": "1. Dimitri P. Bertsekas and John N. Tsitsiklis, Introduction to Probability, Athena Scientific, 2nd Edition, 2008 2. Sheldon M. Ross, A First Course in Probability, Pearson, 9th Edition, 2014 3. Richard A. Johnson, Irwin Miller, and John E. Freund, Miller and Freund’s Probability and Statistics for Engineers, Pearson, 9th Edition, 2017", "terms": {"2020-21 Term 1": {"--LEC (5304)": {"startTimes": ["14:30", "14:30"], "endTimes": ["16:15", "15:15"], "days": [1, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor Andrej BOGDANOV", "Professor Andrej BOGDANOV"]}, "-T01-TUT (5266)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor Andrej BOGDANOV"]}, "-T02-TUT (5538)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor Andrej BOGDANOV"]}, "-T03-TUT (5539)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor Andrej BOGDANOV"]}, "-T04-TUT (5540)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor Andrej BOGDANOV"]}, "-T05-TUT (9257)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor Andrej BOGDANOV"]}}}, "assessments": {"Essay test or exam": "65", "Homework or assignment": "25", "Others": "10"}}, {"code": "2020", "title": "Statistics for Engineers", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ENGG2430 or ENGG2450 or ENGG2780 or ESTR2002 or ESTR2005", "description": "A first course in the fundamentals of statistics and their applications in engineering. Topics include populations and samples, point estimation, confidence intervals, hypothesis testing, and basics of linear regression.\r", "outcome": "At the conclusion of the course, students should be able to\r 1. define and understand the fundamental concepts in statistics \r 2. identify, formulate, and solve simple statistical problems in engineering and data science application", "syllabus": "Provided by the course teacher(s) in the respective teaching term.", "required_readings": "", "recommended_readings": "1. Jay L. Devore, Probability and Statistics for Engineering and the Sciences, CENGAGE, 9th Edition, 2016\r 2. Richard A. Johnson, Irwin Miller, and John E. Freund, Miller and Freund’s Probability and Statistics for Engineers, Pearson, 9th Edition, 2017", "terms": {"2020-21 Term 2": {"--LEC (4758)": {"startTimes": ["12:30", "14:30"], "endTimes": ["14:15", "15:15"], "days": [1, 1], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor Andrej BOGDANOV", "Professor Andrej BOGDANOV"]}, "-T01-TUT (4756)": {"startTimes": ["12:30"], "endTimes": ["14:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor Andrej BOGDANOV"]}}}, "assessments": {"Essay test or exam": "65", "Homework or assignment": "25", "Others": "10"}}, {"code": "2100", "title": "Embedded System Design", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken CENG2400. Pre-requisite: ENGG2020 or ENGG2120 or ESTR2104.", "description": "This course introduces the techniques for building embedded systems such as the use of microprocessors, interfacing memory systems and timing control of digital signals. It also discusses peripheral input/output interfacing methods such as: timer, serial and parallel interfaces, analog-to-digital conversion, polling, interrupt and device driver developments. Assembly language programming will also be introduced: concepts of addressing modes, data manipulation, control flow instructions, programme linkage and relation to high level languages.\r", "outcome": "Students will be able to\r 1. design, implement, program and debug microprocessor-based embedded systems to solve real life problems.\r 2. write assembly language programs.\r 3. interface an embedded system with other devices such as integrated circuit devices and displays.", "syllabus": "This course introduces the techniques for building embedded systems such as the use of microprocessors, interfacing memory systems and timing control of digital signals. It also discusses peripheral input/output interfacing methods such as: timer, serial and parallel interfaces, analog-to-digital conversion, polling, interrupt and device driver developments. Assembly language programming will also be introduced that includes: concepts of addressing modes, data manipulation, control flow instructions, programme linkage and relation to high level languages.", "required_readings": "", "recommended_readings": "1. Furber, ARM System-on-Chip Architecture, 2000\r 2. Web-based data sheets and teaching materials", "terms": {"2020-21 Term 1": {"--LEC (9023)": {"startTimes": ["16:30", "16:30"], "endTimes": ["18:15", "17:15"], "days": [1, 2], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor XU Qiang", "Professor XU Qiang"]}, "-L01-LAB (9022)": {"startTimes": ["17:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Ho Sin-Hang Engg Bldg 102"], "instructors": ["Professor XU Qiang"]}}}, "assessments": {"Essay test or exam": "50", "Lab reports": "20", "Presentation": "5", "Short answer test or exam": "25"}}, {"code": "2102", "title": "Data Structures", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken CSCI2100 or CSC2520.;Pre-requisite: CSCI1110 or 1120 or 1130 or 1510 or 1520 or 1530 or 1540 or ENGG1110 or ESTR1002 or ESTR1100 or ESTR1102 or its equivalent. For senior-year entrants, the pre-requisite will be waived.", "description": "This course introduces the concept of abstract data types and the advantages of data abstraction. Various commonly used abstract data types including vector, list, stack, queue, tree, and set and their implementations using different data structures (array, pointer based structures, linked list, 2-3 tree, B-tree, etc.) will be discussed. Sample applications such as searching, sorting, etc., will also be used to illustrate the use of data abstraction in computer programming. Analysis of the performance of searching and sorting algorithms. Application of data structure principles.\r", "outcome": "1. To be able to implement the following data structures as abstract data types in a high level programming language: stack, queue, hash table, list, binary search tree (including AVL tree, red black tree and splay tree), B-tree, trie, disjoint set, graph (including minimum spanning tree and shortest path); 2. To be able to use appropriate data structures in different applications; 3. To be able to implement abstract data types; 4. To be able to analyse the complexity of simple algorithms (such as searching and sorting).", "syllabus": "This course introduces the concept of abstract data types and the advantages of data abstraction. Various commonly used abstract data types including vector, list, stack, queue, tree, and set and their implementations using different data structures (array, pointer based structures, linked list, 2-3 tree, B-tree, etc.) will be discussed. Sample applications such as searching, sorting, etc., will also be used to illustrate the use of data abstraction in computer programming. Analysis of the performance of searching and sorting algorithms. Application of data structure principles.", "required_readings": "", "recommended_readings": "1. Horowitz, Sahni and Freed, Fundamentals of Data Structures in C\r 2. Weiss, Data Structures and Algorithm Analysis in C++\r 3. Goodrich and Tamassia, Data Structures and Algorithms in Java\r 4. Roberts, Programming Abstractions in C: A Second Course in Computer Science", "terms": {"2020-21 Term 1": {"--LEC (5971)": {"startTimes": ["12:30", "9:30"], "endTimes": ["14:15", "10:15"], "days": [2, 1], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor TAO Yufei", "Professor TAO Yufei"]}, "-T01-TUT (6015)": {"startTimes": ["16:30", "13:30"], "endTimes": ["17:15", "14:15"], "days": [3, 4], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor TAO Yufei", "Professor TAO Yufei"]}, "-T02-TUT (6016)": {"startTimes": ["12:30", "13:30"], "endTimes": ["13:15", "14:15"], "days": [4, 4], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor TAO Yufei", "Professor TAO Yufei"]}}, "2020-21 Term 2": {"--LEC (5913)": {"startTimes": ["16:30", "14:30"], "endTimes": ["17:15", "16:15"], "days": [1, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor KING Kuo Chin Irwin", "Professor KING Kuo Chin Irwin"]}, "-T01-TUT (5911)": {"startTimes": ["17:30", "17:30"], "endTimes": ["18:15", "18:15"], "days": [3, 1], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor KING Kuo Chin Irwin", "Professor KING Kuo Chin Irwin"]}, "-T02-TUT (5912)": {"startTimes": ["17:30", "17:30"], "endTimes": ["18:15", "18:15"], "days": [4, 1], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor KING Kuo Chin Irwin", "Professor KING Kuo Chin Irwin"]}}}, "assessments": {"Essay test or exam": "50", "Others": "25", "Short answer test or exam": "25"}}, {"code": "2104", "title": "Digital Logic and Systems", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ExerciseLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ELEG2120 or ENGG2020", "description": "This course introduces the digital concepts; number systems; operations and codes; logic gates; Boolean algebra and logic simplification; combinational logic; functions of combinational logic; flip-flops and related devices; counters; finite state machines; programmable logic devices - programming and sequential logic applications; memory and storage; integrated circuit technologies.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2200", "title": "Introduction to Biomedical Engineering", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "LectureProjectInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken BMEG1130, BMEG2000, BMEG2001, BMEG2130 or ESTR2201.", "description": "This course covers the definition, scope, basic principles and problems in biomedical engineering, introduction to the enabling technologies for biomedical engineering. It provides the overview of various topics in biomedical engineering, e.g., biomedical sensors, bioinstrumentation, bio-signal processing, biomechanics, biomaterials, molecular engineering, tissue engineering, bio-nanotechnology, medical imaging and rehabilitation engineering, etc. It covers the applications of engineering principles to selected medical and biological problems and contemporary roles and challenges of biomedical engineering.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2201", "title": "Introduction to Biomedical Engineering", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken BMEG1130, BMEG2000, BMEG2001, BMEG2130 or ESTR2200.", "description": "This course covers the definition, scope, basic principles and problems in biomedical engineering, introduction to the enabling technologies for biomedical engineering. It provides the overview of various topics in biomedical engineering, e.g., biomedical sensors, bioinstrumentation, bio-signal processing, biomechanics, biomaterials, molecular engineering, tissue engineering, bio-nanotechnology, medical imaging and rehabilitation engineering, etc. It covers the applications of engineering principles to selected medical and biological problems and contemporary roles and challenges of biomedical engineering.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2202", "title": "Biomedical Engineering Laboratory", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "LaboratoryLectureProject", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken BMEG1130, BMEG2010, BMEG2011, BMEG2130 or ESTR2203. Co-requisite: ELEG2202 or with the consent of the instructor.", "description": "This course provides a hands-on experience in various aspects of biomedical engineering. It covers the introduction to basic electronics, chemistry, molecular biology, microbiology, and electrophysiology laboratory techniques, laboratory skills, experimental design, interpretation of data, technical writing and ethical issues relevant to laboratory work. It concludes with a student-driven design project.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2203", "title": "Biomedical Engineering Laboratory and Hospital Experience", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "LaboratoryLectureProject", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken BMEG1130, BMEG2010, BMEG2011, BMEG2130 or ESTR2202.;Co-requisite(s): ELEG2202 or with the consent of the instructor.", "description": "This course provides hands-on experience in various aspects of biomedical engineering, introduction to basic electronics, chemistry, molecular biology, microbiology, electrophysiology laboratory techniques and hospital visits. Laboratory skills, experimental design, interpretation of data, technical writing and safety and ethical issues relevant to laboratory work. It concludes with a student-driven design project.", "outcome": "By the end of the course, students should be able to\r   - Undertake laboratory experiments using basic techniques in electronics, chemistry, molecular biology, microbiology and electrophysiology to support the study and solution of biomedical engineering problems; and\r   - Apply engineering design process to the conceptual design of a biomedical engineering device; and\r   - Document through a written report and an oral presentation the results of an engineering design project performed as part of a team of student engineers; and\r   - Exhibit good safety and teamwork skills and serve as effective members of multidisciplinary project teams; and\r  - Understand the fundamentals and daily operation of various medical instruments from the perspectives of end-users, (doctors, technicians, nurses) and recipients (patients) through observation and work shadowing; and\r  - Appreciate the role of biomedical engineers in hospitals, the importance of disinfection and aseptic techniques, experience the daily operation, information flow and logistics in the running of a hospital; and\r  - Relate theory and engineering knowledge to practicing in a real-world setting\r  This course meets the Course Learning Outcomes to the BEng (BME) Programme Outcomes 1 – 8.", "syllabus": "This course provides hands-on experience in various aspects of biomedical engineering, introduction to basic electronics, chemistry, molecular biology, microbiology, electrophysiology laboratory techniques and hospital visits. Laboratory skills, experimental design, interpretation of data, technical writing and safety and ethical issues relevant to laboratory work. It concludes with a student-driven design project.", "required_readings": "N/A", "recommended_readings": "1. John D. Enderle, Susan M. Blanchard, Joseph D. Bronzino (Ed.). Introduction to biomedical engineering. Elsevier Academic Press, 3rd edition, c2011. (ISBN: 978-0123749796)\r 2. S. N. Sarbadhikari. A short introduction to biomedical engineering. CRC Press, 2007. (ISBN: 978-1420060119)\r 3. Michael M. Domach. Introduction to biomedical engineering. Pearson/Prentice Hall, c2004. (ISBN: 978-0136020035)\r 4. John G., Webster. Medical instrumentation: application and design. John Wiley & Sons, c2008. (ISBN: 978-0471676003)", "terms": {"2020-21 Term 2": {"--LEC (7466)": {"startTimes": ["9:30", "TBA"], "endTimes": ["10:15", "TBA"], "days": [5, "TBA"], "locations": ["Lee Shau Kee Building LT1", "TBA"], "instructors": ["Professor DUAN Liting, \n\rProfessor HO Ho Pui", "Professor DUAN Liting, \n\rProfessor HO Ho Pui"]}, "-L01-LAB (7468)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [2], "locations": ["William MW Mong Eng Bldg 1102"], "instructors": ["Professor DUAN Liting, \n\rProfessor HO Ho Pui"]}, "-L02-LAB (7467)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [4], "locations": ["William MW Mong Eng Bldg 1102"], "instructors": ["Professor DUAN Liting, \n\rProfessor HO Ho Pui"]}}}, "assessments": {"Lab reports": "30", "Presentation": "10", "Project": "35", "Participation": "10", "Short answer test or exam": "15"}}, {"code": "2204", "title": "Orthopaedic Biomechanics and Musculoskeletal Injury", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken BMEG2210 or MAEG2020", "description": "This course covers biostatics, biodynamics, and biosolid mechanics and their applications to the human musculoskeletal systems and the clinical practice of orthopaedics. Topics include: force and moment vectors, equations of equilibrium, moments of inertia, kinematics of particles, Newton’s second law, kinematics of rigid bodies, dynamics of rigid bodies, stress-strain relations, linear elasticity, loading and deformation, shear forces and bending moments, multi-body kinematics and application to skeletal system, musculoskeletal injury mechanisms associated with musculoskeletal biology (aging, gender, diseases, adverse effects of treatments) and external forces (sports and traffic accidences), basic principles for designing medical devices and implants for prevention and treatment of musculoskeletal injuries.Clinical scenarios will be presented with open-ended questions. Relevant laboratory sessions on musculoskeletal force analysis, human movement studies, animal tissue testing will be synergized with the corresponding lectures to enhance learning. Students are expected to have prior knowledge on the basic principles of Newtonian mechanics at secondary school level.\r", "outcome": "By the end of the course, students should be able to:\r - Explain the basic principles of biomechanics; - Apply the above principles to facilitate quantitative understanding of the normal functions of the musculoskeletal system for locomotion, postural control, and other daily activities;  - Apply the above principles to analyze the biomechanical consequences of the pathological conditions of the musculoskeletal system, its injury mechanisms, how the system can adapt itself to meet its functional demands, and how clinical orthopaedic interventions may facilitate the healing of its derangements.", "syllabus": "This course covers biostatics, biodynamics, and biosolid mechanics and their applications to the human musculoskeletal systems and the clinical practice of orthopaedics. Topics include: force and moment vectors, equations of equilibrium, moments of inertia, kinematics of particles, Newton’s second law, kinematics of rigid bodies, dynamics of rigid bodies, stress-strain relations, linear elasticity, loading and deformation, shear forces and bending moments, multi-body kinematics and application to skeletal system, musculoskeletal injury mechanisms associated with musculoskeletal biology (aging, gender, diseases, adverse effects of treatments) and external forces (sports and traffic accidences), basic principles for designing medical devices and implants for prevention and treatment of musculoskeletal injuries.\r Clinical scenarios will be presented with open-ended questions. Relevant laboratory sessions on musculoskeletal force analysis, human movement studies, animal tissue testing will be synergized with the corresponding lectures to enhance learning. Students are expected to have prior knowledge on the basic principles of Newtonian mechanics at secondary school level. \r  More details will be provided when available.", "required_readings": "N/A", "recommended_readings": "1. Ozkaya N, Nordin M: Fundamentals of Biomechanics – Equilibrium, Motion & Deformation. 3rd Edition, NY Springer. 2011. (CC: WE103.O95 1999, 2nd) (TEXTBOOK)\r 2.Buckwalter JA, Einhorn T, Simon SR eds.: Basic Science in Orthopaedics. ISBN 0-89203-177-8, American Academy of Orhopaedic Surgeons, 2000. (MD: WE102.O77 2000)\r 3.Nigg BM, Herzog W. Biomechanics of the Musculoskeletal System. Wiley. 2007. (UL: WE103.B562 2007)\r 4.Nordin M, Frankel VH. Basic Biomechanics of the Musculoskeletal System. Lippincott-Raven Publishers. 2001. (CC: WE103.B374 2001)\r  5.Whiting W, Zernicke R. Biomechanics of Musculoskeletal Injury. ISBN-13: 9780736054423 Human Kinetics Publishers, 2008. (UL: WE140.W484 2008)", "terms": {"2020-21 Term 1": {"--LEC (4822)": {"startTimes": ["10:30", "10:30"], "endTimes": ["12:15", "11:15"], "days": [3, 5], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Dr. LOU Wutao, \n\rProfessor CHEUNG Wing Hoi, \n\rProfessor CHOW Kwoon Ho Simon, \n\rProfessor HO Yi Ping, \n\rProfessor LEONG Hio Teng", "Dr. LOU Wutao, \n\rProfessor CHEUNG Wing Hoi, \n\rProfessor CHOW Kwoon Ho Simon, \n\rProfessor HO Yi Ping, \n\rProfessor LEONG Hio Teng"]}, "-T01-TUT (4844)": {"startTimes": ["TBA", "9:30"], "endTimes": ["TBA", "10:15"], "days": ["TBA", 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Dr. LOU Wutao, \n\rProfessor CHEUNG Wing Hoi, \n\rProfessor CHOW Kwoon Ho Simon, \n\rProfessor HO Yi Ping, \n\rProfessor LEONG Hio Teng", "Dr. LOU Wutao, \n\rProfessor CHEUNG Wing Hoi, \n\rProfessor CHOW Kwoon Ho Simon, \n\rProfessor HO Yi Ping, \n\rProfessor LEONG Hio Teng"]}}}, "assessments": {"Essay test or exam": "50", "Homework or assignment": "15", "Lab reports": "5", "Short answer test or exam": "30"}}, {"code": "2206", "title": "Signals and Systems", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ENGG2030 or ESTR2302 or IERG2051.", "description": "This course introduces the concepts of signals and systems and teaches the mathematical and computational tools for the analysis of engineering signals and systems. The course content covers Fourier representations of continuous-time and discrete-time signals, frequency spectrum, linear and time-invariant systems, impulse response, convolution sum and convolution integral, frequency response, Laplace transform and z-transform representations of signals and systems. Sampling theorem and the relation between continuous-time and discrete-time signals will be discussed. This course includes mandatory laboratory modules.\r", "outcome": "Upon successful completion of the course, students will be able to:\r 1. explain the meanings of signals and systems from engineering perspectives and with connection to real-world applications; 2. demonstrate how signals and systems can be represented by mathematical expressions; 3. explain the concepts of frequency and frequency spectrum; 4. describe and explain the types and properties of systems, with an emphasis on linear time-invariant systems; 5. use Laplace transform or z-transform to represent a linear system; 6. analyze and explain the behavior of a linear system; 7. explain the sampling theorem and its physical implications.", "syllabus": "Representations of signals and systems; Concepts of time and frequency; Linear time-invariant systems (LTI); impulse response and transfer function; Convolution sum and integral; continuous-time Fourier series and transform; Frequency spectrum and response; Laplace transform and Z-transform; Sampling theorem; Linear feedback; Discrete-time Fourier Transform; Block diagram representation of linear systems.\r  The course content covers basics of signals and systems; continuous-time and discrete-time signals and systems; Fourier series and Fourier transform for analysis of signals and systems; characterization of systems; linear time-invariant systems and their characteristics; sampling; Laplace transform; and z transform.", "required_readings": "N/A", "recommended_readings": "Textbooks\r 1. A.V. Oppenheim and A.S. Willsky, Signals and Systems, 2nd Edition, Prentice-Hall, Inc., 1996\r  References\r 1. E.W. Kamen and B.S. Heck, Fundamentals of Signals and Systems Using MATLAB, Prentice Hall, Inc., 2006\r 2. J.R. Buck, M.M. Daniel and A.C. Singer, Computer Explorations in Signals and Systems, Prentice Hall, Inc. , 2001", "terms": {"2020-21 Term 2": {"--LEC (6143)": {"startTimes": ["11:30", "9:30", "14:30"], "endTimes": ["12:15", "11:15", "15:15"], "days": [3, 5, 3], "locations": ["Online Teaching", "Online Teaching", "Online Teaching"], "instructors": ["Ms. NGAN Lai Yin", "Ms. NGAN Lai Yin", "Ms. NGAN Lai Yin"]}, "-L01-LAB (7405)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Ms. NGAN Lai Yin"]}, "-T01-TUT (5981)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Ms. NGAN Lai Yin"]}, "-T02-TUT (5982)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Ms. NGAN Lai Yin"]}, "-T03-TUT (5983)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Ms. NGAN Lai Yin"]}, "-T04-TUT (5984)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Ms. NGAN Lai Yin"]}}}, "assessments": {"Essay test or exam": "40", "Homework or assignment": "20", "Lab reports": "20", "Short answer test or exam": "20"}}, {"code": "2300", "title": "Principles of Communication Systems", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ENGG2310 or IERG2310 or ELEG2310. Pre-requisite: ENGG2030 or ESTR2302 or ESTR2360 or IERG2051 or MIEG2051", "description": "This is a foundation course on telecommunication and related technologies. It describes the essential elements of a modern communication system. Students will learn the basic concepts in electrical communication, the operation principles and the performance requirements for a real-world communication system. The course content include signal representation and properties, amplitude modulation, angle modulation, analogue-to-digital signal conversion, demodulation and detection, pulse modulation, multiplexing, baseband transmission, passband transmission, inter-symbol interference, system performance evaluation and other topics. The course is the basis of various advanced courses on electrical and optical communications.", "outcome": "Upon successful completion of the course, students will be able to: 1. describe the architecture of a communication system and explain the functions of each system component 2. describe how the signal is generated, demodulated and detected in a communication system 3. describe how noise, interference and channel distortion affect communication 4. describe the major analog modulation techniques and state their advantages and limitations 5. state the basic principles of digital transmission and describe different pulse modulation schemes 6. carry out basic system performance evaluation of a communication system", "syllabus": "Overview on Communication Systems; Review of Fourier Transform; Concepts of Power, Spectrum and Bandwidth; Amplitude Modulation; Angle Modulation; Generation and Detection; Digital Representation of Analog Signals; Pulse Modulation; Multiplexing; Pulse Shaping and Inter-Symbol Interference (ISI), Digital Baseband Transmission; Digital Passband Transmission; Examples of Communication Systems.", "required_readings": "1. Simon Haykin and Michael Moher, Communication Systems, 5th Edition, Wiley, 2013. 2. B. P. Lathi, Zhi Ding, Modern Digital and Analog Communication Systems, 4th Edition, Oxford University Press, 2010", "recommended_readings": "1. Leon W. Couch II, Digital & Analog Communication Systems, 8th Edition Prentice-Hall, 2013. 2. J. G. Proakis et al, Communication Systems Engineering, 2nd edition, Prentice-Hall, 2002. 3. H. Taub et al, Principles of Communication Systems, 3rd edition, McGraw-Hill, 2008. 4. F. G. Stremler, Introduction to Communication Systems, 3rd edition Prentice-Hall, 1990.", "terms": {"2020-21 Term 2": {"--LEC (6325)": {"startTimes": ["12:30", "9:30"], "endTimes": ["14:15", "11:15"], "days": [3, 5], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor ZHANG Yingjun", "Professor ZHANG Yingjun"]}, "-T01-TUT (6326)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor ZHANG Yingjun"]}}}, "assessments": {"Essay test or exam": "50", "Homework or assignment": "30", "Short answer test or exam": "20"}}, {"code": "2302", "title": "Signals and Systems", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Pre-requisite: MATH1510.\nNot for students who have taken ENGG2030 or ESTR2206 or ESTR2360 or IERG2051 or MIEG2051.", "description": "Linear time-invariant systems. Fourier analysis of continuous-time and discrete-time signal and systems. Laplace transform. z-transform. Feedback systems. Applications such as processing of communication signals and images, control of disk drive systems, and analysis of the stock market.", "outcome": "Upon successful completion of the course, the students will have acquired the ability to:  1. appreciate that concepts of signals and systems can be used in a wide variety of disciplines and applications; 2. recognize the power of working in transform domains; to take advantage of the complementary insights and tools that these  different perspectives provide; 3. recognize system properties such as causality, stability, linearity, and time invariance; 4. perform time-domain analysis of linear time-invariant (LTI) systems; in particular performing convolution in continuous and  discrete time; 5. analyze LTI systems and their properties through determination and examination of the impulse response; 6. use and compute Fourier series to analyze periodic signals and the response of LTI systems to such signals; 7. use Fourier transform methods to analyze general signals, including both aperiodic and periodic signals; 8. use frequency domain methods to analyze the effects of LTI filters on signals; 9. understand the sampling theorem and, more generally, the impact in both the time and frequency domains of sampling; 10. analyze signals and LTI systems using Laplace transforms; and 11. analyze signals and LTI systems using z-transforms.", "syllabus": "Linear time-invariant systems. Fourier analysis of continuous-time and discrete-time signal and systems. Laplace transform. z-transform. Feedback systems. Applications such as processing of communication signals and images, control of disk drive systems, and analysis of the stock market. The course syllabus may be updated from year to year.", "required_readings": "To be provided by course instructor.", "recommended_readings": "1. Textbook: A. V. Oppenheim and A. S. Willsky, \"\"Signals and Systems\"\", 2nd edition, Prentice Hall, 1997  2. A course web page will be provided for the dissemination of course-related announcements, documents (course outlines,   marking schemes), lecture notes, tutorial notes, assignments, and lists of recommended / supplementary readings and   online learning resources.", "terms": {"2020-21 Term 1": {"--LEC (6013)": {"startTimes": ["11:30", "10:30"], "endTimes": ["13:15", "11:15"], "days": [3, 5], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor LOK Tat Ming", "Professor LOK Tat Ming"]}, "-T01-TUT (6014)": {"startTimes": ["TBA", "9:30"], "endTimes": ["TBA", "10:15"], "days": ["TBA", 5], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor LOK Tat Ming", "Professor LOK Tat Ming"]}}}}, {"code": "2304", "title": "Basic Analog and Digital Circuits", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ELEG2202 or ELEG2201 or ELEG1110 or ENGG2020 or ESTR2104 or IERG2060.", "description": "This course introduces the basic analysis of analog and digital electronic circuits, as well as the basic principles of communication circuits. The analog circuit analysis includes: basic circuit laws and theorems; mesh and nodal analysis; resonant circuits, steady-state and small signal analyses; electrical amplifiers. The digital logic circuit analysis includes Boolean algebra; logic gates; combinational logic circuit and sequential logic circuit design; synchronous and asynchronous sequential machine design. Overview of the computer architecture will be introduced. Examples of common electronic circuits will be discussed as case studies.", "outcome": "Upon successful completion of the course, the students will have acquired the ability to: 1. understand the basic principles of analog electronic circuits and digital logic systems 2. analyze and characterize simple analog or digital systems  3. understand the principles of common electronic circuits", "syllabus": "This course introduces the basic analysis of analog and digital electronic circuits, as well as the basic principles of communication circuits. The analog circuit analysis includes: basic circuit laws and theorems; mesh and nodal analysis; resonant circuits, steady-state and small signal analyses; electrical amplifiers. The digital logic circuit analysis includes Boolean algebra; logic gates; combinational logic circuit and sequential logic circuit design; synchronous and asynchronous sequential machine design. Overview of the computer architecture will be introduced. Examples of common electronic circuits will be discussed as case studies. The course syllabus may be updated from year to year.", "required_readings": "1. Principles of Electric Circuits: Conventional, by Thomas L. Floyd , Prentice Hall 2009. 2. Fundamentals of Logic Design, by C.H. Roth and L. K. Kinney, Cengage, 2013.", "recommended_readings": "1. Principles of Electric Circuits: Conventional, by Thomas L. Floyd , Prentice Hall 2009. 2. Fundamentals of Logic Design, by C.H. Roth and L. K. Kinney, Cengage, 2013.", "terms": {"2020-21 Term 1": {"--LEC (4615)": {"startTimes": ["12:30", "11:30"], "endTimes": ["14:15", "13:15"], "days": [1, 2], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Dr. HO Marco", "Dr. HO Marco"]}, "-T01-TUT (4616)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Dr. HO Marco"]}}}, "assessments": {"Lab reports": "25", "Others": "10", "Selected response test or exam": "65"}}, {"code": "2306", "title": "Introduction to Systems Programming", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Pre-requisite: ENGG1110 or ESTR1002.;Not for students who have taken CSCI1140 or CSCI1510 or IERG2080.", "description": "This course introduces the C programming language with applications to systems programming. Topics include fundamentals of the C programming language, software development tools, and system programming principles.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2308", "title": "Probability Models and Applications", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ENGG2430 or ENGG2450 or ENGG2460 or ENGG2470 or ESTR2002 or ESTR2005 or ESTR2010 or ESTR2012 or ESTR2362 or IERG2470 or MIEG2440.", "description": "The course introduces the fundamental principles of probability models and their engineering applications. It includes the topics in basic probability theory, random variables, common distributions and probability functions, moment generating function, inequalities, limit theorems, basic random processes, and basic Markov chains and Poisson processes. This is the foundation course to prepare the students for courses in communications and networking.", "outcome": "Upon completion of this course, students should be able to  1. Understand and use the concepts including probability model, random variables, independence, conditioning, probability distribution, expectation, variance, and correlation. 2. Understand the process of using probability model and random variables to model situations with uncertainty. 3. Demonstrate a basic understanding and skill of solving relevant problems using the learned probability concepts based on the models. 4. Demonstrate a basic understanding and skill of using Law of Large Numbers and Central Limit Theorem to abstract and model systems and solve relevant problems. 5. Demonstrate a basic understanding of random processes and Markov processes, as well as the engineering applications.", "syllabus": "The course introduces the fundamental principles of probability models and their engineering applications. It includes the topics in basic probability theory, random variables, common distributions and probability functions, moment generating function, inequalities, limit theorems, basic random processes, and basic Markov chains and Poisson processes. This is the foundation course to prepare the students for courses in communications and networking.", "required_readings": "Lecture notes or slides presented in class.", "recommended_readings": "Introduction to Probability, 2nd Edition by Dimitri P. Bertsekas and John N. Tsitsiklis, Athens Scientific Ross, First Course in Probability, A, 9th Edition - Pearson", "terms": {"2020-21 Term 2": {"--LEC (5704)": {"startTimes": ["16:30", "13:30"], "endTimes": ["18:15", "15:15"], "days": [4, 5], "locations": ["Lee Shau Kee Building LT2", "Lee Shau Kee Building LT2"], "instructors": ["Professor Chandrasekhar MADHAVAN NAIR", "Professor Chandrasekhar MADHAVAN NAIR"]}, "-T01-TUT (5728)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Chandrasekhar MADHAVAN NAIR"]}}}, "assessments": {"Essay test or exam": "50", "Homework or assignment": "20", "Short answer test or exam": "30"}}, {"code": "2360", "title": "Fourier Analysis with Engineering Applications", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Pre-requisite: MATH1510. Not for students who have taken ENGG2030 or ESTR2206 or ESTR2302 or IERG2051 or MIEG2051.", "description": "The course covers Linear-time Invariant Systems, Convolution, Dirac delta functions, Fourier Analysis of Continuous and Discrete-time Systems, Sampling Theorem, Fast-Fourier Transform, Laplace Transform, Z-Transform, and Fourier uncertainty principle. There will be emphasis on the interplay between mathematical ideas in MATH courses and engineering applications. Ideas such as inner product spaces, Contour integration, Cauchy-Schwartz inequality, Spectral decomposition, etc. will be employed for obtaining various results.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2362", "title": "Discrete Structures and Probability", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Pre-requisite: MATH1050. Not for students who have taken CSCI2110, ENGG2430, ENGG2440, ENGG2450, ENGG2460, ENGG2470, ENGG2760, ESTR2002, ESTR2004, ESTR2005, ESTR2010, ESTR2012, ESTR2018, ESTR2308, IERG2470, MATH3280 or MIEG2440.", "description": "The course covers the following two related topics. Discrete Structures: Graphs, Combinatorics - sums and asymptotics, recurrences, countingProbability: Random Variables and Probability density functions, conditional probability, independence, expectations, Markov and Chebychev inequalities, laws of large numbers, Random Walks, basic Markov Chains.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2400", "title": "Engineering Mechanics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken MAEG2020", "description": "This course provides an introduction to the statics and dynamics. You will be introduced to and become familiar with all relevant physical properties and fundamental laws governing the behavior of particles and rigid bodies, and you will learn how to solve a variety of problems in terms of kinematics, kinetics, energy, and momentum of particles and rigid bodies. The emphasis is on the physical understanding of why particles or rigid bodies behave the way they do in both the statics and the dynamics.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2402", "title": "Thermodynamics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken MAEG2030.", "description": "This course will cover fundamental topics in thermodynamics including basic concepts, heat and work, pure substance, ideal gas, first law and second law of thermodynamics, entropy, gas and vapor power cycles, and refrigeration cycles.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2404", "title": "Building Service Engineering and Green Building", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken EEEN2040", "description": "This course introduces the primary Building Services, including heating, ventilation, and air-conditioning (HVAC), electrical distribution, lighting, fire protection, plumbing and drainage, vertical transportation, security, telecommunication, and building automation systems. This course also introduces Green Buildings based on BEAM Plus, one of the most widely-used green building labelling schemes in Hong Kong, including site aspects, materials aspects, energy use, water use, indoor environmental quality, innovations and additions for both new and existing buildings. This course also introduces the U.S. green building labelling scheme Leadership in Energy and Environmental Design (LEED).", "outcome": "Upon completion of the course, students should have achieved the following outcomes:\r (1) understand the introduced primary building services including their components and working principles;  (2) be able to analyze the primary building services according to the basic working principles; (3) understand the basic concepts of green buildings from engineering, design, and management perspectives;  (4) be able to analyze the energy and environmental design of a building according to the green building labelling schemes.\r  This course contributes to the following EEEN Programme Learning Outcomes:\r (1) E1: Acquired basic knowledge related to energy and environmental engineering, including physics, mathematics, thermodynamics, energy technologies, power systems, environmental economics, building control and assessment, air pollution, etc. (K,S);  (2) E3: Developed the ability to design and build engineering components, structures, processes or systems to meet targeted needs in specific energy and environmental applications (K,S);  (3) E4: Acquired the ability to function as a member of an interdisciplinary team (S,V);  (4) E5: Acquired the ability to identify, formulate and solve real-life engineering problems and tradeoffs related to energy system and optimization, environmental monitoring and control, and green building technologies (K,S); (5) E7: Developed proficiency in technical communication (both oral and written) (S); (6) E11: Acquired the ability to use the techniques, skills and tools to practice in the energy and environmental engineering discipline and be aware of entrepreneur opportunities (K,S);  (7) E12: Acquired the ability to use the computer/IT tools relevant to the discipline along with an understanding of their processes and limitations (K,S,V); (8) E13: Established a good understanding and vision of the energy and environmental industries in terms of technologies, tradeoffs and impacts (K).\r  K = Knowledge outcomes; S = Skills outcomes; V = Values and attitude outcomes.", "syllabus": "The details will be provided by the course instructor.", "required_readings": "", "recommended_readings": "(1) David V. Chadderton, Building Services Engineering 6th Edition. Routledge. \r (2) BEAM Plus for New Buildings Version 1.2. available at: http://www.beamsociety.org.hk/files/download/download-20130724174420.pdf\r (3) BEAM Plus for Existing Buildings Version 1.2. available at: http://www.beamsociety.org.hk/files/download/download-20130724174504.pdf \r (4) U.S. Green Building Council, LEED Reference Guide for Building Design and Construction v4 2013. ISBN-10: 1932444181.", "terms": {"2020-21 Term 2": {"--LEC (9094)": {"startTimes": ["11:30", "10:30"], "endTimes": ["13:15", "11:15"], "days": [3, 5], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor CHEN Chun", "Professor CHEN Chun"]}, "-T01-TUT (9095)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHEN Chun"]}}}, "assessments": {"Essay test or exam": "50", "Homework or assignment": "10", "Presentation": "10", "Report": "10", "Selected response test or exam": "20"}}, {"code": "2500", "title": "Engineering Economics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken SEEM2440 or SEEM2510.", "description": "Principles of engineering economy. Value and cost; cash flows. Economic analysis of alternatives, technological, social and human factors. Models involving allocation and scheduling of resources. Analytical techniques for evaluating industrial projects. Relationship between economics of technical choice and industrial productivity. Basic financial accounting concepts; accounting cycle; financial statements.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2520", "title": "Optimization Methods", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken FTEC2101", "description": "This course introduces the essentials of optimization methods, including models, solution methods, and programming techniques. Topics cover linear programming, integer linear programming, nonlinear programming, and convex programming. It will highlight applications of these methods in Fintech, such as asset allocation, portfolio management, and data analysis.\r", "outcome": "At the completion of this course, students should \r  1. Have fundamental knowledge of the art of modeling problems arising from FinTech with linear programming, integer programming, nonlinear programming and convex programming. \r 2. Be familiar with solution methods for solving linear programming, integer programming, nonlinear programming and convex programming. \r 3. Be able to solve linear programming, integer programming, nonlinear programming and convex programming with the assistance of computer.", "syllabus": "This course introduces the essentials of optimization methods, including models, solution methods, and programming techniques. Topics cover linear programming, integer linear programming, nonlinear programming, and convex programming. It will highlight applications of these methods in Fintech, such as asset allocation, portfolio management, and data analysis.", "required_readings": "F.S. Hillier and G.J. Lieberman, Introduction to Operations Research, 9th Edition, McGraw-Hill, 2010\r S. Boyd and L. Vandenberghe, Convex Optimization, Cambridge University Press, 2004", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (8042)": {"startTimes": ["9:30", "15:30"], "endTimes": ["11:15", "16:15"], "days": [5, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor WAI Hoi To", "Professor WAI Hoi To"]}, "-T01-TUT (8043)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor WAI Hoi To"]}}}, "assessments": {"Essay test or exam": "70", "Others": "30"}}, {"code": "2540", "title": "Introduction to Data Science", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken SEEM2460.", "description": "This course presents an introductory roadmap into the newly emerged and rapidly evolving field of data science, with the objective of introducing the problem-solving mindset in a data-intensive context.The course projects data science as a productive synthesis of its parent disciplines, including mathematics, statistics, computing, data mining, system science and data visualization, etc. Such a productive synthesis is applicable across many fields to bring about scientific discovery through data-intensive, analytical methods. This course aims to help navigate students in taking more advanced courses in its parent disciplines to build up their expertise in data science. We cover topics including:History and impact of Data Science.Collecting Data: sources, types and categorization of data.Visualising Data: summary statistics, data display, data dictionaries, schema and graphical visualization.Analysing Data: pattern recognition, correlations and relationships, hypotheses testing, statistical significance.Investigating Data: data mining, machine learning, inference, meta-data, modeling, eliciting meaning and validation.Applicational contexts: Examples of useful applications from case studies.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2601", "title": "Circuits and Signals for Biomedical Engineering", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ELEG2202 or ENGG2030 or ESTR2206 or BMEG2300.", "description": "This required course covers basic circuit theory that are needed for understanding the operation, as well as design, of many biomedical devices. It also provides a theoretical and mathematical foundation for analyzing and processing of electrical signals. Students will learn the parametric concepts commonly used for the representation, analysis and transformation of continuous-time and discrete-time signals, and the principles of processing time-varying signals in linear systems. This course emphasizes on using mathematical methods to analyze and to solve engineering problems.Specific topics of this course are: basic circuit laws and theorems, mesh and nodal analysis, superposition and source transformation; analysis of operational amplifier circuits and their biomedical applications; concept of phasor and impedance; AC analysis, introduction to transient analysis; inductors and transformers for biomedical devices; Basics of biomedical signals; continuous-time and discrete-time signals and systems; Fourier series and Fourier transform for analysis of signals and systems; convolutions/filters; sampling.\r", "outcome": "Upon completing this course students will have the ability to:\r - State terminologies and concepts which are important in the field of circuit analysis and design.\r - Apply circuit laws to analyze a linear circuit that contains resistors, capacitors, inductors, dependent and independent sources.\r - Apply calculus and linear algebra in circuit analysis- Be able to simplify circuits for analysis using circuit theorems and transforms.\r - Apply complex numbers and Laplace transform in AC circuit analysis\r - Carry out circuit experiments independently and appreciate the importance of connecting theories to the real world through experiments\r - Analyze experimental results critically\r - understand the physical meanings of signals, and how they are mathematically represented and processed.\r - understand the concept of frequency, and the frequency domain analysis of signals.\r - understand the sampling theorem and its physical implications.\r - understand how to use the Fourier transform, filtering and convolution processes.", "syllabus": "This course covers basic circuit laws and theorems, mesh and nodal analysis, superposition and source transformation; analysis of operational amplifier circuits and their biomedical applications; concept of phasor and impedance; AC analysis; introduction to transient analysis; inductors and transformers for biomedical devices; basics of biomedical signals; continuous-time and discrete-time signals and systems; Fourier series and Fourier transform for analysis of signals and systems; convolutions/filters; biosignal sampling.", "required_readings": "Discrete-Time Signal Processing, 3rd Edition, Alan V. Oppenheim, Ronald W. Schafer, 2009\r  Fundamentals of Electric Circuits, 6e, Alexander & Sadiku, McGraw Hill, Fitzgerald & Kingsley, Electric Machinery, 7e, McGraw-Hill.", "recommended_readings": "N/A", "terms": {"2020-21 Term 2": {"--LEC (7782)": {"startTimes": ["9:30", "11:30"], "endTimes": ["11:15", "12:15"], "days": [1, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Dr. LOU Wutao, \n\rProfessor HO Ho Pui", "Dr. LOU Wutao, \n\rProfessor HO Ho Pui"]}, "-T01-TUT (7781)": {"startTimes": ["TBA", "12:30"], "endTimes": ["TBA", "13:15"], "days": ["TBA", 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Dr. LOU Wutao, \n\rProfessor HO Ho Pui", "Dr. LOU Wutao, \n\rProfessor HO Ho Pui"]}}}, "assessments": {"Essay test or exam": "50", "Homework or assignment": "25", "Short answer test or exam": "25"}}, {"code": "2602", "title": "Biomedical Engineering Laboratory", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "LaboratoryLectureProject", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken BMEG1130 or BMEG2010 or BMEG2011 or BMEG2012 or BMEG2130 or ESTR2202 or ESTR2203.", "description": "This course provides hands-on experience in various aspects of biomedical engineering, including introduction to basic electronics, chemistry, molecular biology, microbiology, electrophysiology laboratory techniques. Students will gain exposure to biological and chemical safety and other general safety issues. Students will also receive training on laboratory skills, design of experiments, interpretation of data and technical writing. This course concludes with a student-driven design project.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3100", "title": "Rapid Prototyping of Digital Systems", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken CENG3430. Pre-requisite: CSCI2510 or ENGG2020 or ENGG2120 or ESTR2104 or its equivalent. For senior-year entrants, the pre-requisite will be waived.", "description": "This course introduces digital prototyping techniques such as the use of a hardware description language for hardware system development, and the methods for interfacing field programmable devices to memory systems and microprocessors. Techniques to build reliable digital systems in the presence of power supply variation, high frequency effects, transmission line effects and noise are also discussed.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3102", "title": "Introduction to Operating Systems", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken CSCI3150. Pre-requisite: CSCI2100 or CSCI2520 or ESTR2102. For senior-year entrants, the pre-requisite will be waived. Co-requisite: AIST3020 or CSCI2510 or CENG3420 or IERG3060 or equivalent.", "description": "This course introduces the various internal components of an operating system, including process and thread management, memory management, file system, security, and synchronization.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3104", "title": "Design and Analysis of Algorithms", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken CSCI3160 or CSCI3190. Pre-requisite: CSCI2100 or CSCI2520 or ESTR2102, AND CSCI2110 or ENGG2440 or ESTR2004.", "description": "This course introduces the basics of algorithm analysis: correctness and time complexity. Techniques for designing efficient algorithms: greedy method, divide and conquer, and dynamic programming. Fundamental graph algorithms: graph traversals, minimum spanning trees and shortest paths. Introduction to complexity theory: polynomial-time reductions and NP-completeness.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3106", "title": "Principles of Programming Languages", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken CSCI3180. Pre-requisite: CSCI2100 or CSCI2520 or ESTR2102. For senior-year entrants, the pre-requisite will be waived.", "description": "This course introduces, analyses and evaluates the important concepts found in current programming languages. The concepts are illustrated by contrasting their appearances in different languages. Major topics include: concepts, paradigms and implementation techniques.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3108", "title": "Fundamentals of Artificial Intelligence", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken CSCI3230. Pre-requisite: CSCI2100 or CSCI2520 or ESTR2102 or equivalent.", "description": "This course introduces the basic concepts and techniques of artificial intelligence. Knowledge representation: predicate logic and inference, semantic networks, scripts and frames, and object-oriented representation. Searching: such as A*, hill-climbing, minimax and alpha-beta pruning. Planning: the frame problem and the STRIPS formalism, representation schemes and planning strategies. Neural networks: learning algorithms, neural architecture and applications. Natural language processing. Knowledge acquisition and expert systems: properties, techniques and tools of expert systems", "outcome": "Students will be able to:  1. Use agents to model AI problems 2. Use search techniques such as A* to search for optimal solutions for AI problems and to play games. 3. Use various logics to represent knowledge and to do reasoning and build expert systems. 4. Use computer learning techniques to acquire real life knowledge in an appropriate representation model (e.g. decision tree and neural networks). 5. Derive learning rules from first principle. 6. Solve real life problems (e.g.classifications and prediction) by such models. 7. Estimate complexity of AI algorithms and prove theorems by contradiction and other techniques. 8. Use computer vison techniques such edge detection to extract features.", "syllabus": "This course introduces the basic concepts and techniques of artificial intelligence. Knowledge representation: predicate logic and inference, semantic networks, scripts and frames, and object-oriented representation. Searching: such as A*, hill-climbing, minimax and alpha-beta pruning. Planning: the frame problem and the STRIPS formalism, representation schemes and planning strategies. Neural networks: learning algorithms, neural architecture and applications. Natural language processing. Knowledge acquisition and expert systems: properties, techniques and tools of expert systems.", "required_readings": "-", "recommended_readings": "1. “Artificial Intelligence­ A Modern Approach” Stuart Russell and Peter Norvig, Prentice Hall, 2003(2nd edition). (main)  2. “Artificial Intelligence” George F. Luger,(5th edition), Addison­Wesley, 2005  3. “Artificial Intelligence” Patrick Henry Winston, Addison­Wesley, 1992.  4. “Artificial Intelligence­ A Guide to Intelligent Systems”,(2nd Edition) Michael Negnevitsky, Addison Wesley, 2005", "terms": {"2020-21 Term 1": {"--LEC (6732)": {"startTimes": ["14:30", "11:30", "15:30"], "endTimes": ["15:15", "12:15", "16:15"], "days": [2, 3, 2], "locations": ["Online Teaching", "Online Teaching", "Online Teaching"], "instructors": ["Professor LEUNG Kwong Sak", "Professor LEUNG Kwong Sak", "Professor LEUNG Kwong Sak"]}, "-T01-TUT (5042)": {"startTimes": ["9:30", "13:30"], "endTimes": ["10:15", "14:15"], "days": [5, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor LEUNG Kwong Sak", "Professor LEUNG Kwong Sak"]}, "-T02-TUT (6993)": {"startTimes": ["9:30", "16:30"], "endTimes": ["10:15", "17:15"], "days": [5, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor LEUNG Kwong Sak", "Professor LEUNG Kwong Sak"]}, "-T03-TUT (6994)": {"startTimes": ["9:30", "14:30"], "endTimes": ["10:15", "15:15"], "days": [5, 4], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor LEUNG Kwong Sak", "Professor LEUNG Kwong Sak"]}}}, "assessments": {"Essay test or exam": "55", "Others": "45"}}, {"code": "3200", "title": "Microelectronic Devices and Circuits", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ELEG3201. Pre-requisite: ELEG2202 or BMEG2300 or with the consent of the instructor.", "description": "This course provides the basic knowledge of semiconductor physics, including electrons and holes, energy band diagram, Fermi energy, intrinsic and doped semiconductors, drift and diffusion currents. The principles of P-N junctions, bipolar and MOS transistors will be explained. The device performance measures, namely current efficiency, transit frequency and intrinsic gain, will be introduced. Other topics covered include frequency response of transistor amplifiers, filters, feedback, stability, frequency compensation, and oscillators. This course includes mandatory laboratory modules.\r", "outcome": "Upon successful completion of the course, students will be able to:\r 1. explain the operating principles of major semiconductor devices, namely, p-n junction diode, BJT transistor and MOS transistor\r 2. evaluate the performance of a semiconductor device\r 3. analyze a transistor circuit across different frequency ranges\r 4. design a simple transistor circuit to meet given specifications\r 5. explain the principle of feedback and the properties of different feedback topologies\r 6. apply feedback in circuit design and perform stability analysis of a feedback circuit\r 7. design simple oscillators\r 8. carry out experiments on microelectronic circuits independently and analyze the experimental results", "syllabus": "Semiconductor physics; Electrons and holes; Energy band diagram; Fermi Energy; Intrinsic and doped semiconductors; Drift and diffusion currents; Principles of P-N junctions; Bipolar and MOS transistors; Device performance measures: current efficiency, transit frequency, intrinsic gain; Frequency response of transistor amplifiers; Filters; Feedback; Stability; Frequency compensation; Oscillators.", "required_readings": "N/A", "recommended_readings": "Textbooks\r  1. Jaeger and Blalock, Microelectronic Circuit Design, 3rd Edition, McGraw Hill, 2007.\r 2. Sedra and Smith, Microelectronic Circuits (Oxford Series in Electrical & Computer Engineering), 5th Edition, Oxford, 2004.\r  References\r  1. Streetman and Banerjee, Solid-State Electronic Devices, 7th edition, Pearson, 2015\r 2. Fonstad, Microelectronic Devices and Circuits, 2006 Electronic Edition.", "terms": {"2020-21 Term 2": {"--LEC (7966)": {"startTimes": ["12:30", "12:30"], "endTimes": ["14:15", "13:15"], "days": [1, 2], "locations": ["Lee Shau Kee Building LT4", "Lee Shau Kee Building LT3"], "instructors": ["Professor PUN Kong Pang", "Professor PUN Kong Pang"]}, "-L01-LAB (7971)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor PUN Kong Pang"]}, "-T01-TUT (7967)": {"startTimes": ["11:30", "TBA"], "endTimes": ["12:15", "TBA"], "days": [2, "TBA"], "locations": ["Basic Med Sci Bldg LT", "TBA"], "instructors": ["Professor PUN Kong Pang", "Professor PUN Kong Pang"]}, "-T02-TUT (7968)": {"startTimes": ["11:30", "TBA"], "endTimes": ["12:15", "TBA"], "days": [2, "TBA"], "locations": ["Y.C. Liang Hall 106", "TBA"], "instructors": ["Professor PUN Kong Pang", "Professor PUN Kong Pang"]}, "-T03-TUT (7969)": {"startTimes": ["11:30", "TBA"], "endTimes": ["12:15", "TBA"], "days": [2, "TBA"], "locations": ["Y.C. Liang Hall 101", "TBA"], "instructors": ["Professor PUN Kong Pang", "Professor PUN Kong Pang"]}, "-T04-TUT (7970)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor PUN Kong Pang"]}}}, "assessments": {"Essay test or exam": "40", "Homework or assignment": "20", "Lab reports": "20", "Short answer test or exam": "20"}}, {"code": "3202", "title": "Wireless Technology and Systems", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ELEG3214 or ELEG3204.", "description": "This course is designed for electronic engineering students to learn how to design basic antennas for wireless terminals and to understand the wireless systems from radio propagation perspectives. It starts with the review of Maxwell's equations and their solutions for far fields. The course discusses the basic concepts for various electrical small and resonant type antennas, antenna array and teacheshow to design practical antennas for wireless terminals. The basic characteristics of radio propagation are studied for a better understanding of modern wireless communication systems, for examples, satellite communications and mobile technology. This course includes mandatory laboratory modules.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3204", "title": "Principles of Semiconductor Devices", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ELEG2510 and ELEG3301.", "description": "The course teaches the physical principles behind semiconductor devices. It starts by reviewing the particle-wave properties of electrons and photons. The problems of electrons in a 1-D potential well and electron scattering in potential barriers are addressed. Fundamental concept and theories of semiconductor devices are introduced: hydrogen atoms, bonds, crystal structures, band theory of solids, effective mass, and the Fermi energy. Electric conductions in semiconductors are taught: intrinsic and extrinsic, drift, mobility, diffusion, recombination, Hall effect. Properties and structures of metal-semiconductor junction, p-n junction and MOS capacitor are analyzed, and their breakdown effects are described. Semiconductor transistors, including MOSFET and JFET, are briefly introduced. Integrated circuits fabrication is also described: layer formation, photolithography and layout.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3206", "title": "Introduction to Optical Communications", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ELEG3303 or ELEG3320.", "description": "This course covers the physics, technology, and engineering applications of optical communications. The topics include overview on the development of fiber communications, optical fibers and their properties, LED and Laser sources, optical power launching and coupling, optical detectors and receivers, repeaters, regenerators, and optical amplifiers, introduction to optical communication systems, modulation and multiplexing technologies, optical networks, and nonlinear fiber optics. Recent developments in optical communication technology will also be discussed.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3208", "title": "Biomaterials and Tissue Engineering", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken BMEG3430.", "description": "This course introduces the fundamentals in design, fabrication and selection of biomaterials for medical applications. Topics include physical, chemical and mechanical properties and bio-compatibility of different types of biomaterials (e.g. natural, synthetic, inorganic and composite, etc), introduction to tissue engineering, principles of tissue engineering for medical application and physical and biological considerations of biomaterials applications in clinical indications.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3210", "title": "Medical Instrumentation and Sensors", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ELEG3101 or ELEG3240 or BMEG3101.", "description": "In view of the prevalence of the aging population and accompanying chronic illnesses, demands for medical instrumentation and design have been escalating worldwide. This course aims at enabling students to master design-thinking skills and by applying it to the broad medical fields. Laboratory sessions will be arranged to train students in developing prototypes and enrich their understanding of the fundamental design concepts covered in lectures.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3212", "title": "Biofluids", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken MAEG3030 or BMEG3210.", "description": "This course introduces the fundamental knowledge in fluid mechanics, including nature of fluids, integral and differential equations of fluid flows, conservation of mass, momentum and energy, basic mass transfer, inviscid flow, viscous-dominated flows, navier-stokes equation, dimensional analysis, internal and external flows and reynolds number. It covers micro-fluidic devices and biological applications. It also describes fluids in human body and blood flow, including blood velocity, blood vessel geometry and respiratory mechanics.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3214", "title": "Fundamentals of Applied Electromagnetics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ELEG3213 or ELEG3203.", "description": "This course is designed to prepare electronic engineering students with the foundation knowledge for learning radio and optical communication technologies. It starts with the review of vector differential operators. The course content cover time-varying fields, Maxwell's equations, electromagnetic wave propagation, reflection and transmission, transmission line theory, Smith Chart, microwave and optical waveguides, transients on transmission lines, antenna radiation, and basic concepts of wireless and optical communications. This course includes mandatory laboratory modules.\r", "outcome": "Upon successful completion of the course, students will be able to:\r 1. apply mathematical methods to explain and analyze electromagnetic field and wave propagation problems; 2. explain the working principles of common microwave and optical transmission lines and devices; 3. design a simple antenna and a matching network, and conduct relevant measurement using a vector network analyzer; 4. describe key practical issues and technical challenges in radio and optical communication systems.", "syllabus": "Review of vector calculous; Maxwell’s equations; Complex power conservation; Boundary conditions and uniqueness theorem; Scalar and vector potential functions; Fundamentals of electromagnetic wave radiation and antennas; Plane wave solution, wave reflection and refraction; Transmission line theory and impedance matching; Smith Chart; Microwave waveguides and resonators in wireless communication systems; Optical waveguides and devices in communication systems.", "required_readings": "N/A", "recommended_readings": "Textbooks\r Fundamentals of Applied Electromagnetics, by F. T. Ulaby, E. Michielessen and U. Ravaioli, 1996\r  References\r Simon Ramo, J. R. Whinnery and T. V Duzer, Fields and Waves in Communication Electronics, 3rd Edition (February 9, 1994), Wiley.", "terms": {"2020-21 Term 1": {"--LEC (8812)": {"startTimes": ["9:30", "9:30", "TBA"], "endTimes": ["10:15", "11:15", "TBA"], "days": [1, 2, "TBA"], "locations": ["Online Teaching", "Online Teaching", "Online Teaching"], "instructors": ["Professor WU Ke Li", "Professor WU Ke Li", "Professor WU Ke Li"]}, "-L01-LAB (8815)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WU Ke Li"]}, "-T01-TUT (8813)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor WU Ke Li"]}, "-T02-TUT (8814)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor WU Ke Li"]}, "-T03-TUT (8816)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor WU Ke Li"]}}}, "assessments": {"Essay test or exam": "50", "Homework or assignment": "10", "Lab reports": "20", "Selected response test or exam": "20"}}, {"code": "3216", "title": "Robotic Perception and Intelligence", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Pre-requisite: ENGG2030 or with the consent of the instructor;Not for students who have taken ELEG3103 or ESTR3408 or MAEG3060", "description": "This course is an introduction to robotics, perception, and artificial intelligence, with concentration on robotic systems empowered with perception and intelligence for real-world applications. We start with the fundamentals of robotics and artificial intelligence. The technical topics include electronic and mechanical components of robots, sensors and robotic vision, sensor data fusion and evaluation, signal and image processing. The knowledge areas cover robotics, machine learning and artificial intelligence, robot motion and task planning, robotic programming, and human-robot interaction. It aims to help students establish a wide-spectrum understanding about the principles and the fundamental knowledge of robotics, perception and intelligence in a real-world context.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3300", "title": "Digital Communications", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken IERG3010. Pre-requisite: ENGG2310 or ESTR2300 or IERG2310.", "description": "This course introduces the principles of digital communications. Topics include source and channel models, modulation and detection, intersymbol interference and equalization coding, multipath fading, spread spectrum and synchronization.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3302", "title": "Networks: Technology, Economics, and Social Interactions", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken IERG3280.", "description": "This course introduces various networking technologies we use each day and the fundamental ideas behind them. Different from many \"theory-based\" networking courses, this course is organized around a list of intriguing questions about the technological, social, and economical aspects of modern networks. The course will broadly cover topics on wireless networks, Internet, social networks, and network economics. We will introduce various methodologies such as graph theory, optimization theory, game theory, and pricing theory. The intended audience of this course includes undergraduates with majors in Information Engineering, Computer Science and Engineering and Electronic Engineering. It is also suitable for interested undergraduate students from Mathematics, and other Social Science majors. Advisory: Students are expected to have taken Advanced Engineering Math course covering multivariate calculus and linear algebra.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3304", "title": "Introduction to Stochastic Processes", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken IERG3300, IERG4140, IERG5300 or ENGG5302 or MATH4240.", "description": "This course starts with the topic of Markov chain. It includes the Chapman-Kolmogorov equations, random walk, classification of states, limiting probabilities, and time reversibility. The second topic in the course is stopping time and martingales. This includes Wald's equation, the concept of martingale, and the martingale stopping theorem. The third topic is exponential distribution, Poisson distribution, and Poisson process. This includes the unique memoryless property of the exponential distribution, combining and splitting a Poisson random variable, method of randomization, various equivalent definitions for a Poisson process, and M/M/1 queue. Throughout the course, many examples of applications are related to communications and computers. Advisory: Students are expected to have basic background in probability.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3306", "title": "Social Media and Human Information Interaction", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken IERG3320.", "description": "Social media is one of the main sources of big data. This course aims to enable students to understand about social media and the interaction between human and information. It (1) examines the social and human dimensions of social media; (2) introduces the theories, models, and analysis techniques related to social media and human information interaction; and (3) discusses how to integrate theories and concepts in social media and human information interaction into the analytics and visualization of big data. Topics include: foundations of social media, human cognition and information behavior, online communities and social interactions, as well as infographic and big data visualization.\r", "outcome": "Upon completion of this course, students will:\r 1. gain conceptual knowledge in the social and human dimensions of social media;  2. gain conceptual as well as practical knowledge in social media modeling and analysis; 3. be able to integrate theories and concepts in human information interaction into the analytics and visualization of large scale social media.", "syllabus": "Social media is one of the main sources of big data. This course aims to enable students to understand about social media and the interaction between human and information. It (1) examines the social and human dimensions of social media; (2) introduces the theories, models, and analysis techniques related to social media and human information interaction; and (3) discusses how to integrate theories and concepts in social media and human information interaction into the analytics and visualization of big data. Topics include: foundations of social media, human cognition and information behavior, online communities and social interactions, as well as infographic and big data visualization.\r  The course syllabus may be updated from year to year.", "required_readings": "• Lecture notes; and\r • List of cases and additional reference materials", "recommended_readings": "Recommended textbooks:\r • J. Golbeck, Analyzing the Social Web. Waltham, MA: Morgan Kaufmann, 2013.\r Recommended reference materials:\r 1. R. Fidel. Human Information Interaction: An Ecological Approach to Information Behavior. Cambridge, MA: The MIT Press, 2012.\r 2. D. Weinberger, Too Big to Know. New York, NY: Basic Books, 2011.\r Plus additional recourses provided by the teacher in class and course website.", "terms": {"2020-21 Term 1": {"--LEC (6728)": {"startTimes": ["13:30", "13:30"], "endTimes": ["14:15", "15:15"], "days": [2, 5], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor CHAN Yuen Yan", "Professor CHAN Yuen Yan"]}, "-T01-TUT (4564)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHAN Yuen Yan"]}}}, "assessments": {"Essay test or exam": "50", "Others": "50"}}, {"code": "3308", "title": "Information and Software Engineering Practice", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken CSCI3100 or ENGG3820 or IERG3080.", "description": "Software Engineering practice such as requirement analysis and specifications, system design and integration, object-oriented designs and development, software testing and maintenance, software quality and performance metrics, documentation, CASE tools, project planning and management. Information engineering practice concerning software intellectual property rights, privacy, Internet commerce, entrepreneurship and public policies.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3310", "title": "Computer Networks", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken CSCI4430 or ESTR4120 or IERG3310.", "description": "OSI reference model. Overview of TCP/IP. Local area networks and wide area networks. Network layer and protocols. Transport layer and protocols. Examples of application layer protocols such as HTTP. Network security: firewall, SSL, and private and public keys encryption systems. One term project on client-server programming to create a web server and proxy.\r", "outcome": "Upon successful completion of the course, the students will have acquired the ability to:\r  1. demonstrate knowledge and understanding of the basic principles of computer networks, including local-area networks, \r  wide-area networks, and Internet;  2. analyze and compare the performance of simple computer network technologies, protocols and possible application \r  configurations; and\r  3. write simple network applications via socket programming.", "syllabus": "OSI reference model. Overview of TCP/IP. Local area networks and wide area networks. Network layer and protocols. Transport layer and protocols. Examples of application layer protocols such as HTTP. Network security: firewall, SSL, and private and public keys encryption systems. One term project on client-server programming to create a web server and proxy.\r The course syllabus may be updated from year to year.", "required_readings": "1. James F. Kurose and Keith W. Ross, \"Computer Networking: A Top-down approach featuring the Internet, 5th Edition,\r  Addison Wesley, 2010.", "recommended_readings": "1. S. Keshav, \" An Engineering Approach to Computer Networking :ATM Networks, the Internet and the Telephone Network\", \r  Addison Wesley, 1997.\r  2. Radia Perlman, \"Interconnections: Bridges, Routers, Switches and Internetworking Protocols\", 2nd Edition,\r  Addison Wesley, 1999.", "terms": {"2020-21 Term 1": {"--LEC (9217)": {"startTimes": ["13:30", "12:30"], "endTimes": ["15:15", "14:15"], "days": [3, 1], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor LIEW Soung Chang", "Professor LIEW Soung Chang"]}, "-T01-TUT (9218)": {"startTimes": ["19:30", "TBA"], "endTimes": ["20:15", "TBA"], "days": [4, "TBA"], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor LIEW Soung Chang", "Professor LIEW Soung Chang"]}}, "2020-21 Term 2": {"--LEC (7292)": {"startTimes": ["12:30", "12:30"], "endTimes": ["14:15", "14:15"], "days": [2, 4], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor XING Guoliang", "Professor XING Guoliang"]}, "-T01-TUT (7291)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor XING Guoliang"]}}}, "assessments": {"Essay test or exam": "60", "Others": "40"}}, {"code": "3400", "title": "Energy Utilization and Human Behaviour", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ENER3020 or EEEN3020.", "description": "This course emphasizes the intersection between energy consumption and human/corporate/economic activities. The course follows a grid structure in its organisation. The grid’s horizontal lines are about energy consumption, involving electricity use, and direct burning of fuels including combustion engines, boilers, stoves, etc. The vertical lines are about human activities, involving major economic sectors including the industrial, transport, commercial, and residential ones. The intersections between the grid’s horizontal lines and vertical lines are the lecture topics. Each lecture has discussion over three aspects: (1) how energy is utilized; (2) what factors are affecting energy consumption in intensity and in total; and (3) how human behaviour could be changed for energy conservation and pollution control.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3402", "title": "Engineering Materials", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ENER3030 or EEEN3030.", "description": "This course introduces fundamentals of materials including atomic bonding; crystal structures, defects; mechanical properties of materials, phase diagram; overview of metals, alloys, ceramics, polymers, semiconductors and composites; electrical, optical, magnetic, and thermal properties of materials; materials selection and design considerations for engineering technologies. Applications of materials to energy and environmental engineering, mechanical engineering, medical engineering, and others will be discussed.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3404", "title": "Manufacturing Technology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken MAEG3020.", "description": "This course provides students with fundamental background of manufacturing technologies. It covers the following topics: overview of manufacturing technologies, engineering materials, metal forming processes, plastic forming processes, 3D printing processes, machining processes, micro-manufacturing and fabrication. A number of industrial visits and hands-on labs are also included.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3406", "title": "Introduction to Control Systems", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken MAEG3050.", "description": "This course provides students with fundamental knowledge of control systems. It covers the following topics: mathematical modelling and linear approximation of engineering systems, Laplace transform, transfer function and block diagram representation, characteristics of feedback systems, performance specifications, Routh-Hurwitz stability criterion, root locus design, frequency response design and Nyquist criterion. The utilization of computer-aided analysis and design software is also included.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3408", "title": "Introduction to Robotics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken MAEG3060 or ELEG3103.", "description": "The course covers the basic and fundamentals to the study of robotic manipulators, including: classification of robots, robot sensors and actuators, coordinate frames and homogeneous transformations, Denavit-Hartenberg notation, forwards and inverse kinematics, Jacobians and statics, singularity and workspace analysis, and trajectory generation. The course includes a creative project component for students to apply robot manipulators for a new and innovative application. This requires the students to design a new application for robot manipulators that would be useful to the community and globally. By using the introduction to the state-of-the-art in robotics around the world, and fundamentals learnt in the course, the students have to innovatively design and present the idea as a mock start-up company project. \r", "outcome": "Upon completion of the course, students should have achieved the following outcomes:\r (1) solve the forward and inverse kinematics problems in robot manipulators; (2) generate and analyse the Jacobian matrix, singularities and workspace in robot manipulators; (3) perform trajectory generation and motion planning in robot manipulators; (4) formulate the dynamics of robot manipulators; (5) understand the use and the significance of sensors and actuators in robotics; (6) apply fundamental knowledge of kinematics and motion planning on real robot hardware; (7) appreciate the significance of robotics to the society.", "syllabus": "The details will be provided by the course instructor.", "required_readings": "", "recommended_readings": "(1) John J. Craig: Introduction to Robotics, 3rd Edition, Prentice Hall, 2005.\r (2) Bruno Siciliano et. Al.: Robotics: Modelling Planning and Control, Springer, 2009", "terms": {"2020-21 Term 2": {"--LEC (7146)": {"startTimes": ["16:30", "9:30", "TBA"], "endTimes": ["17:15", "11:15", "TBA"], "days": [3, 1, "TBA"], "locations": ["Sino Building UG06", "Sino Building UG06", "TBA"], "instructors": ["Professor LAU Tat Ming", "Professor LAU Tat Ming", "Professor LAU Tat Ming"]}, "-L01-LAB (7150)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor LAU Tat Ming"]}}}, "assessments": {"Classwork": "10", "Essay test or exam": "50", "Project": "30", "Short answer test or exam": "10"}}, {"code": "3410", "title": "Building Automation and Control", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken EEEN3010. Pre-requisite: MAEG2030 / ESTR2402 or with the consent of the course instructor.", "description": "This course introduces various mechanical systems of modern buildings: heating, ventilation, and air-conditioning (HVAC), lighting, electrical, plumbing, fire, security, and elevator, and presents the physical principles, signals and functions of the instrumentations, and control equipments involved. This course also includes the building automation systems (BAS), which ensure the proper configuration, operations, troubleshooting, and performance of the overall building based on gathered information and control strategies. Basic concepts of control system, communication network and protocols will also be presented.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3500", "title": "Operations Research II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken SEEM3440.", "description": "Non-linear programming: convex sets and functions; local and global optima; Lagrange multipliers; optimality conditions for unconstrained problems; descent methods; constrained optimization; Karush-Kuhn-Tucker conditions; solution methods. Non-differentiable optimization: integer programming models; formulations; cutting-plane methods; branch-and-bound. Dynamic programming: models and formulation; Bellman's equations; solution methods.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3502", "title": "Engineering Innovation and Entrepreneurship", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken SEEM3450.", "description": "Factors that drive continuous creative product innovation. Study of processes of creating, assessing and pursuing product opportunities. Evaluation of new product ideas and risk assessment of commercialization. Product development strategies in industrial marketing. Understanding the behaviour of buyer. Formulation and implementation of innovative marketing strategy and business plan.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3504", "title": "Computer Processing Systems Concepts", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken SEEM3460. Pre-requisite: CSCI1110 or CSC1510 or ENGG1110 or ESTR1002 or with the approval of the course instructor.", "description": "Principles of operating system functions. Introduction to linkers, loaders, memory management and process management. Performance analysis of scheduling algorithm. Applications based on systems such as UNIX, Cloud computing concepts and their evaluation and selection based on application needs.", "outcome": "1. Able to understand how computer works  2. Able to understand the basic principle of operating systems  3. Able to design and develop software to solve problems", "syllabus": "According to the course teacher in the respective teaching term.", "required_readings": "According to the course teacher in the respective teaching term.", "recommended_readings": "Operating Systems Internals and Design Principles, William Stallings, Prentice Hall.", "terms": {"2020-21 Term 1": {"--LEC (6523)": {"startTimes": ["13:30", "11:30"], "endTimes": ["15:15", "12:15"], "days": [2, 4], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor LAM Wai", "Professor LAM Wai"]}, "-T01-TUT (6524)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor LAM Wai"]}}}, "assessments": {"Essay test or exam": "60", "Others": "25", "Selected response test or exam": "15"}}, {"code": "3506", "title": "Fundamentals in Information Systems", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken SEEM3550.", "description": "Basic elements of information systems, their concepts and interrelations. Database systems: database models, relational database, database application programming. Information retrieval: models, indexing, performance evaluation. Expert systems: knowledge and data engineering, expert system shell, application studies.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3508", "title": "Stochastic Models", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken SEEM3570. Pre-requisite: SEEM2430 or ENGG2430 or ENGG2450 or ESTR2002 or ESTR2005 or with the approval of the course instructor.", "description": "Review of basic probability. Probabilistic dynamic programming. Stochastic processes and Markov chains. Birth-and-death processes and queuing models. Stochastic inventory models: single and multiple periods. Forecasting and time series. Markov decision processes.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3509", "title": "Investment Science", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken SEEM3590.", "description": "Basic theory of interests, fixed income securities, the term structure of interest rates, valuation of a firm, decision making under uncertainty, mean-variance portfolio theory, capital asset pricing model, models and data, basics of forward and futures contracts, basic options theory.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3510", "title": "Service Management", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken SEEM3630.", "description": "Overview of the operations functions of service organizations. Examination of methods for designing and operating service delivery systems in the health care, financial, hospitality, telecommunication, and logistics industry. Discussion on service strategy, services for individual and corporate customers, service technologies, process and facility design, management of waiting lines, demand forecasting, demand and supply management, service quality, staffing and scheduling.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3512", "title": "Technology, Consulting and Analytics in Practice", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ESTR4504, SEEM3680 or SEEM4680.", "description": "This course presents students with a broad overview of the latest technologies, e.g. cloud computing, social media, mobile applications, etc. that are impacting the business world everyday. Students are presented with case studies to illustrate how advanced technologies are used in solutions to real-world problems. Students will be presented with opportunities to adopt design thinking techniques to come up with innovative ideas for problem-solving, and optionally create pilot implementations of their design. The SEEM department will invite participation by industry leaders and practitioners to share their insights in this course.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3514", "title": "Introduction to Logistics and Supply Chain Management", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ESTR4500 or ESTR4502 or SEEM3620 or SEEM4600 or SEEM4610.", "description": "Logistics and Supply Chain Management involves various flows (e.g., materials flow and information flow) among all of the entities that contribute value to a product, from the source of raw materials to end customers. This course will focus on the basic concepts, models and techniques for effective strategic management of an integrated and coordinated supply chain. The emphasis is on recognizing key tradeoffs, analyzing system characteristics, and understanding effectiveness of tactics such as risk pooling, inventory policies, collaboration, and information sharing.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3516", "title": "Fundamentals in Decision and Data Analytics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "1. Pre-requisites:\n(a) ENGG1110/ESTR1002, ENGG1120/ESTR1005, ENGG1130/ESTR1006, ENGG2440/ESTR2004, ENGG2760/ESTR2018, ENGG2780/ESTR2020 & MATH1510; or (b) with course instructor's approval.\n2. Not for students who have taken SEEM3650 or SEEM4480.", "description": "This course introduces the basic concepts of decision and data analytics from a statistical and probability view. Topics include linear regression, classification, sampling techniques, model selection, decision trees, principal component analysis, clustering, and their applications in decision making.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3601", "title": "Medical Instrumentation and Design", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureProjectInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ELEG3101 or ESTR3210 or BMEG3101.", "description": "In view of the prevalence of the aging population and accompanying chronic illnesses, demands for medical instrumentation and design have been escalating worldwide. This course aims at enabling students to master design-thinking skills and by applying it to the broad medical fields. Laboratory sessions will be arranged to train students in developing prototypes and enrich their understanding of the fundamental design concepts covered in lectures.\r", "outcome": "Upon completing this course, students should be able to:\r 1. Give an overview of the origins of certain selected biological and physiological signals; 2. Understand the design process of various medical devices; 3. Evaluate the different classes of medical instruments and measurement principles; 4. Master some common medical instruments;  5. Foresee the future trend in related topics; 6. Design at least one new medical device that meets health demand;  7. Demonstrate ability to design new medical devices in a dynamic group setting; and \r 8. Have acquired design-thinking skills in producing prototypes that meet specific design goals.", "syllabus": "This course covers the fundamental concepts of design of medical instrumentation and sensors; origins and measurements of bioelectric and ultrasonic signals; electrical safety and hazard; and application examples including electrocardiography (ECG) measurements, pulse oximetry, biosensors cochlear implant devices, functional electric stimulators and drug delivery systems, etc.\r Students have to form groups to produce a medical device prototype that fulfills a list of design goals. Upon completing this course, students should have acquired basic engineering design skills and practical problem-solving skills that are directly transferable to further design work in their future careers.", "required_readings": "N/A", "recommended_readings": "1. Medical Instrumentation, 4th Edition, Ed. by John Webster.\r 2. Biodesign: The Process of Innovating Medical Technologies by Zenios, Makower and Yock.\r 3. Biomedical Transducers and Instruments by Togawa, Tamura, and Oberg.\r 4. Introduction to Biomedical Equipment Technology, 3rd Edition, by Carr and Brown.", "terms": {"2020-21 Term 1": {"--LEC (4834)": {"startTimes": ["9:30", "13:30"], "endTimes": ["11:15", "14:15"], "days": [1, 2], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor GAO Zhaoli, \n\rProfessor LI Zheng", "Professor GAO Zhaoli, \n\rProfessor LI Zheng"]}, "-T01-TUT (4847)": {"startTimes": ["14:30", "TBA"], "endTimes": ["15:15", "TBA"], "days": [2, "TBA"], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor GAO Zhaoli, \n\rProfessor LI Zheng", "Professor GAO Zhaoli, \n\rProfessor LI Zheng"]}, "-T02-TUT (4835)": {"startTimes": ["14:30", "TBA"], "endTimes": ["15:15", "TBA"], "days": [2, "TBA"], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor GAO Zhaoli, \n\rProfessor LI Zheng", "Professor GAO Zhaoli, \n\rProfessor LI Zheng"]}, "-T03-TUT (4836)": {"startTimes": ["14:30", "TBA"], "endTimes": ["15:15", "TBA"], "days": [2, "TBA"], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor GAO Zhaoli, \n\rProfessor LI Zheng", "Professor GAO Zhaoli, \n\rProfessor LI Zheng"]}}}, "assessments": {"Essay test or exam": "50", "Others": "5", "Presentation": "25", "Short answer test or exam": "20"}}, {"code": "3602", "title": "Neuroengineering", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureProjectInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken BMEG3330.", "description": "This course discusses the introduction of neuroengineering: the past, the current status and the future. The topics cover Neural system and neuron activity; Neural modeling and computation; Neural information processing, Neuromuscular systems and Electromyography (EMG); Brain-computer interface (BCI) and neuroprosthesis: functional electrical stimulation, retina and cochlea; Electric and magnetic field of human brain (EEG and MEG), transcranial magnetic stimulation (TMS); Transcranial direct-current stimulation (tDCS); biopotential electrode and amplifier; Mechanisms underlying neurological disorders (stroke, Parkinson's disease or epilepsy); optogenetic technology, principles and applications of neuroimaging such as functional magnetic resonance imaging (fMRI). Selected state-of-the-art topics in a highly interdisciplinary field that combines neuroscience, electrophysiology, neural activity imaging, optics and engineering technologies. Other selected topics of recent research interests.\r", "outcome": "• Able to describe how to meet standards and regulatory requirements of medical devices in US, Europe and Asia.\r • Able to handle regulatory tasks included classification, risk management and product registration.\r • Design at least one new project that meets medical device regulatory requirements;  • Demonstrate ability to design new project in a dynamic group setting; and \r • Have acquired design-thinking skills in producing the project that meet specific regulatory goals.", "syllabus": "This course discusses the introduction of neuroengineering: the past, the current status and the future. The topics cover Neural system and neuron activity; Neural modeling and computation; Neural information processing, Neuromuscular systems and Electromyography (EMG); Brain-computer interface (BCI) and neuroprosthesis: functional electrical stimulation, retina and cochlea; Electric and magnetic field of human brain (EEG and MEG), transcranial magnetic stimulation (TMS); Transcranial direct-current stimulation (tDCS); biopotential electrode and amplifier; Mechanisms underlying neurological disorders (stroke, Parkinson's disease or epilepsy); optogenetic technology, principles and applications of neuroimaging such as functional magnetic resonance imaging (fMRI). Selected state-of-the-art topics in a highly interdisciplinary field that combines neuroscience, electrophysiology, neural activity imaging, optics and engineering technologies. Other selected topics of recent research interests.\r  A design project of an EEG device to enhance students engineering design skills and problem solving skills. A design project of an EEG device aims at enabling students to master design-thinking and, by following a problem-based group approach. Students have to form groups to produce a medical device prototype that fulfills a list of design goals. Upon completing this course, students should have acquired basic engineering design skills and practical problem-solving skills that are directly transferable to further design work in their future careers.", "required_readings": "1. Medical devices - Quality management systems - Requirements for regulatory purposes ISO13485:2003, 2003\r 2. Medical devices - Application of risk management to medical devices ISO14971:2007, 2007\r 3. Council directive 93/42/EEC concerning medical devices, 2007 \r 4. Handbook of medical device regulatory affairs in Asia, Jack Wong and Raymond Tong, Pan Stanford Publishing, 2013\r 5. Biodesign: The Process of Innovating New Medical Technologies, Stefanos A Zenios; Josh Makower; Paul G Yock , Cambridge University Press, 2010", "recommended_readings": "N/A", "terms": {"2020-21 Term 2": {"--LEC (7628)": {"startTimes": ["16:30", "16:30"], "endTimes": ["18:15", "17:15"], "days": [2, 4], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Dr. LOU Wutao, \n\rProfessor DUAN Liting, \n\rProfessor TONG Kai Yu", "Dr. LOU Wutao, \n\rProfessor DUAN Liting, \n\rProfessor TONG Kai Yu"]}, "-T01-TUT (7630)": {"startTimes": ["17:30", "TBA"], "endTimes": ["18:15", "TBA"], "days": [4, "TBA"], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Dr. LOU Wutao, \n\rProfessor DUAN Liting, \n\rProfessor TONG Kai Yu", "Dr. LOU Wutao, \n\rProfessor DUAN Liting, \n\rProfessor TONG Kai Yu"]}}}, "assessments": {"Essay test or exam": "50", "Others": "5", "Presentation": "25", "Short answer test or exam": "20"}}, {"code": "3603", "title": "Medical Instrumentation and Design", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "LectureProjectInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken BMEG3101 or BMEG3111 or ELEG3101 or ESTR3210 or ESTR3601.", "description": "In view of the prevalence of the aging population and accompanying chronic illnesses, demands for medical instrumentation and design have been escalating worldwide. This course aims at enabling students to master design-thinking skills and by applying them to the broad medical fields. Laboratory sessions and design project modules are arranged to train students in developing prototypes, enrich their understanding of the fundamental design concepts and microcontroller programme coding skills.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3604", "title": "Molecular and Cellular Engineering Laboratory", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken BMEG3140.", "description": "The course topics include biological and cellular laboratory safety and bioethics, basic molecular cloning skills (restriction enzyme cutting, ligation, and E Coli transformation) and mammalian cell culture techniques (cell culture maintenance, observation of cell growth and proliferation, analysis of cell death, genetic modification, cell staining)", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4104", "title": "Distributed and Parallel Computing", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken CSCI4160. Pre-requisite: CSCI3150 or ESTR3102", "description": "This course introduces concepts, models, and implementations related to distributed and parallel computing. Topics include parallel and distributed programming, system architectures, synchronization, and concurrency control techniques.", "outcome": "1) Understand key distributed and parallel concepts including consistency, clock, commit, replication, synchronization, and consensus 2) Hands-on programming experience in distributed and parallel programming 3) Hands-on system experience in distributed systems and parallel hardware", "syllabus": "This course introduces concepts, models, and implementations related to distributed and parallel computing. Topics include SIMD, OpenMP, GPGPU, MPI, Roofline Analysis, Amdahl's law, Parallel Algorithms, Time & Order, Consensus, Byzantine Fault, Replicated State Machine, Leader Election, Consistency Model.", "required_readings": "", "recommended_readings": "1) Tanenbaum, Andrew, and Maarten van Steen. Distributed Systems: Principles and Paradigms. Upper Saddle River, NJ: Prentice Hall, 2002. ISBN: 9780130888938. 2) Distributed Systems: Concepts and Design (5th Edition) 5th Edition by George Coulouris (Author), Jean Dollimore (Author), Tim Kindberg (Author), Gordon Blair (Author) 3) An introduction to Parallel Programming. Peter Pacheco. Morgan Kaufmann.", "terms": {"2020-21 Term 2": {"--LEC (7888)": {"startTimes": ["10:30", "16:30"], "endTimes": ["12:15", "17:15"], "days": [4, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor LO Chi Lik Eric", "Professor LO Chi Lik Eric"]}, "-T01-TUT (7891)": {"startTimes": ["15:30", "14:30"], "endTimes": ["16:15", "15:15"], "days": [3, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor LO Chi Lik Eric", "Professor LO Chi Lik Eric"]}}}, "assessments": {"Essay test or exam": "40", "Homework or assignment": "30", "Project": "30"}}, {"code": "4106", "title": "Introduction to Cloud Computing and Storage", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken CSCI4180. Pre-requisite: CSCI3150 or CENG3150 or ESTR3102.", "description": "This course introduces concepts and principles of cloud computing and storage. Subjects include: cloud computing models (SaaS, PaaS, IaaS), distributed and parallel data processing (MapReduce, Hadoop, multicore technologies), virtualization technologies (hypervisor, virtual machines, full virtualization, paravirtualization), data storage (cloud storage architectures, data centers, data deduplication), security/privacy issues, and case studies of real-world cloud services (Amazon EC2, Windows Azure). This course emphasizes applied methodologies of using cloud computing and storage for solving practical engineering problems.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4120", "title": "Data Communication and Computer Networks", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken IERG3310 or CSCI4430 or ESTR3310. Pre-requisite: CSCI3150 or CENG3150 or ESTR3102.", "description": "This course aims to introduce fundamental concepts and technologies in computer networking. The course adopts a top-down approach introducing the TCP/IP networking stack. The design of the contemporary communication applications will be studied. The fundamental concepts in implementing the reliable transport protocols, such as TCP, will be taught in this course. Design issues of TCP, such as the sliding window protocol and the congestion control, will also be included. This course will also focus on the IP network and the routing algorithms used in the Internet. Last, the design issues in the data link layer (e.g., Ethernet), including the medium access control, will be introduced.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4200", "title": "Biomedical Imaging Applications", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLaboratoryLectureProjectInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken BMEG4320. Pre-requisite: BMEG3320 or with the consent of the course instructor.", "description": "This course provides knowledge and technical background on the current available bio-imaging technologies developed for assessment of quality of musculoskeletal tissues. The emphasis lies on their application for bone and cartilage (e.g. QCT, pQCT, microCT for animals and human, nano-CT, MRI, ultrasound, and other advanced imaging modalities). Contrast-enhancement media for musculoskeletal and vascular applications, use of above bioimaging modalities for evaluation of scaffold biomaterials developed for enhancement of repair of musculoskeletal tissues. It also covers applications of biomedical imaging in diagnosis, prevention and treatment of aging related disorders of musculoskeletal, cardiovascular and other relevant living systems.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4201", "title": "Advanced Imaging and Spectroscopy Techniques in Biomedicine", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureProjectInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken BMEG4330. Pre-requisite: BMEG3320.", "description": "This course introduces and discusses medical imaging and treatment techniques which make use of sound and electromagnetic waves (e.g., ultrasound, laser, terahertz, etc.) for biomedical imaging and spectroscopy. The lectures will be divided into the following three main topics: (1) Ultrasound imaging techniques and applications: wave propagation theory (wave equation, transmission andreflection coefficients, attenuation, instrumentation and therapeutics), sonography design aspects, and medically relevant examples; (2) Optical imaging and spectroscopy basics and techniques; and (3) Laser techniques for medical treatments: photodynamic therapy, laser surgery.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4202", "title": "Bionanotechnology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureProjectInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken BMEG4450.", "description": "This course consists of two parts. The first half covers basic concepts in nanotechnology (e.g., length scales (less than 100 nm) effect on properties of materials and devices), and introduces techniques and tools for fabricating nanostructured and bioengineered materials: quantum dots, DNA, self-assembly and templating, surface patterning, and functionalization. The second half introduces three key applications of nanotechnology in biomedical research (i.e., diagnostics, in vivo imaging, and targeted drug delivery), and briefly discusses the process of translating laboratory discoveries to therapies applicable in clinical trials.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4203", "title": "BioMEMS", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLaboratoryLectureProjectInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken BMEG4410.", "description": "BioMEMS is the application of MEMS (Microelectromechanical Systems) technology in the fields of biomedical and health sciences. Due to their small size (1 μm ~ 1 mm), BioMEMS have the advantages of low weight, low cost, quick response, high throughput, high efficiency, requiring much less sample/reagent, and easy system integration. BioMEMS has found broad applications in disease diagnosis, prevention, and treatment. Various bioMEMS products have been developed, such as microfluidic devices, neural interface devices, μTAS (micro Total Analysis Systems), Lab-on-a-Chip, DNA Chips, micro drug delivery system, microsurgical tools, biosensors. This course covers the introduction of BioMEMS, techniques used in constructing the devices, patterning biomolecules, biomedical problems that can be addressed by the BioMEMS technology, as well as the associated engineering challenges.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4204", "title": "Biomolecular Engineering", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken BMEG4510. Pre-requisite: SBMS1440 or with the consent of the course instructor.", "description": "This course consists of two parts. The first half covers basic concepts in biomolecular engineering, including structure and properties of biomolecules (e.g., nucleic acid, protein, lipid, and sugar), the central dogma of molecular biology, and regulation of gene expression. Building on the theoretical framework from the first half, the second half introduces experimental tools involved in biomolecular engineering research, including synthesis and characterization of DNA and protein, gene recombination, and basic genomics. Set at the advanced undergraduate level, the course focuses on developing students’ ability to analyze research data and critique the scientific literature.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4206", "title": "Radio Frequency Electronics", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ELEG4203 or ELEG4213 or ELEG4214 or ESTR4220.", "description": "This course gives an overall picture of the design and implementation of RF circuits which provides the understanding of the basic microwave theories and concepts (e.g. transmission line, microstrip, Smith chart, impedance matching, microwave network analysis, scattering-parameters and measurement technique); the operating principles of RF devices and circuits (e.g. power divider, RF switch, etc); as well as hands-on experience in RF circuit realization (e.g. simulation, fabrication, characterization).\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4210", "title": "Physics and Technology of Semiconductor Devices", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "LaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ELEG4301 or ELEG4311 or ELEG4510 or ESTR4216.", "description": "This course first review the fundamental knowledge about semiconductor physics and MOSFET transistors and go through various advanced silicon based devices and technologies, including NMOS, CMOS, CCD, TFT and SOI. Junction devices, namely bipolar junction transistors, tunnel diodes, heterojunction and quantum-well devices, and quantum dots, are introduced. Silicon based memory technologies, including DRAM, floating gate MOSFET, flash memory, are covered. The course also gives introduction to photonic devices, for examples, light emitting devices (LEDs), semiconductor lasers, photodetectors, and solar cells. Organic electronics, including organic light emitting diodes (OLEDs) and organic thin film transistors, and flexible electronic devices are described.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4212", "title": "Digital Signal Processing and Applications", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "LaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ELEG4410 or ELEG4501 or ELEG4511 or ESTR4218. Pre-requisite: ELEG3503 or consent of the instructor.", "description": "This course focuses on applications of signal processing in different domains such as audio and speech processing, biomedical signal processing, communications, data science, to name a few. The course will first introduce advanced signal processing methods such as filter designs, spectral estimation, time-frequency analysis, statistical signal processing, adaptive signal processing, and principal component analysis. Their applications to various real-life problems will then be studied.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4214", "title": "Musculoskeletal Tissue Engineering", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken BMEG4530. Pre-requisite: BMEG3430 or with the consent of the instructor.", "description": "This course introduces the application of the principles of biology and engineering to the development of viable substitutes which restore, maintain, or improve the function of musculoskeletal tissues. Topics include musculoskeletal tissues: tissue engineering of tendon/ligament, cartilage and bone. It focuses on the understanding the interactions between extracellular matrices and cells, mechanobiological responses of cells/tissues. It also discusses musculoskeletal biomaterials including the development of bioactive, biomimetic advanced biological materials for replacement of aged and diseased musculoskeletal tissues.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4216", "title": "Physics and Technology of Semiconductor Devices", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ELEG4301 or ELEG4311 or ELEG4510 or ESTR4210. Pre-requisite: ELEG3301 or ESTR3204 or consent of the instructor.", "description": "This course first review the fundamental knowledge about semiconductor physics and MOSFET transistors and go through various advanced silicon based devices and technologies, including NMOS, CMOS, CCD, TFT and SOI. Junction devices, namely bipolar junction transistors, tunnel diodes, heterojunction and quantum-well devices, and quantum dots, are introduced. Silicon based memory technologies, including DRAM, floating gate MOSFET, flash memory, are covered. The course also gives introduction to photonic devices, for examples, light emitting devices (LEDs), semiconductor lasers, photodetectors, and solar cells. Organic electronics, including organic light emitting diodes (OLEDs) and organic thin film transistors, and flexible electronic devices are described.", "outcome": "By the end of the course, students should be able to\r - Gain the fundamental knowledge and skills in understanding the operation principles of field-effect transistor and junction device, and note the scope and limitation of solid state electronics.\r - Apply the learned knowledge and skills in solid state devices for analyses in various types of devices and basic functionalities, basic device measurement techniques, and advanced device fabrication technologies.\r - Understand the technological impact of solid state electronics to the society.\r - Understand the basic physical principles and the engineering know-how of advanced semiconductor devices for further specialization in areas related to IC design, display technologies, solid state lighting technologies, photovoltaic technologies, and photonics.", "syllabus": "This course first review the fundamental knowledge about semiconductor physics and MOSFET transistors and go through various advanced silicon based devices and technologies, including NMOS, CMOS, CCD, TFT and SOI. Junction devices, namely bipolar junction transistors, tunnel diodes, heterojunction and quantum-well devices, and quantum dots, are introduced. Silicon based memory technologies, including DRAM, floating gate MOSFET, flash memory, are covered. The course also gives introduction to photonic devices, for examples, light emitting devices (LEDs), semiconductor lasers, photodetectors, and solar cells. Organic electronics, including organic light emitting diodes (OLEDs) and organic thin film transistors, and flexible electronic devices are described.", "required_readings": "N/A", "recommended_readings": "Text:\r Sima Dimitrijev, Principles of Semiconductor Devices, Oxford, 2006\r  Reference book:\r Calvin C. Hu, Modern Semiconductor Devices for Integrated Circuits, 2010\r S. M. Sze, Semiconductor Devices – Physics and Technology (2nd Edition), John Wiley & Sons, 2002\r S. O. Kaspa, Principle of Electronic Materials and Devices, McGraw Hill, 3rd Ed., 2006\r Sima Dimitrijev, Understanding Semiconductor Devices, Oxford, 2000\r D. Neamen, Semiconductor Physics and Devices, McGraw Hill 3rd, 2003\r  Internet resources:\r Web book [http://ece-www.colorado.edu/~bart/book/]\r Organic semiconductor research [http://www.orgworld.de/]", "terms": {"2020-21 Term 2": {"--LEC (8807)": {"startTimes": ["14:30", "11:30"], "endTimes": ["16:15", "12:15"], "days": [1, 4], "locations": ["Lee Shau Kee Building LT4", "Lee Shau Kee Building LT4"], "instructors": ["Professor HU Guohua", "Professor HU Guohua"]}, "-T01-TUT (8808)": {"startTimes": ["12:30", "14:30"], "endTimes": ["13:15", "15:15"], "days": [4, 5], "locations": ["Lady Shaw Bldg LT4", "Mong Man Wai Bldg 703"], "instructors": ["Professor HU Guohua", "Professor HU Guohua"]}, "-T02-TUT (8884)": {"startTimes": ["12:30", "14:30"], "endTimes": ["13:15", "15:15"], "days": [4, 5], "locations": ["Mong Man Wai Bldg 703", "Mong Man Wai Bldg 703"], "instructors": ["Professor HU Guohua", "Professor HU Guohua"]}, "-T03-TUT (8885)": {"startTimes": ["TBA", "14:30"], "endTimes": ["TBA", "15:15"], "days": ["TBA", 5], "locations": ["No Room Required", "Mong Man Wai Bldg 703"], "instructors": ["Professor HU Guohua", "Professor HU Guohua"]}}}, "assessments": {"Essay test or exam": "50", "Lab reports": "10", "Project": "15", "Short answer test or exam": "25"}}, {"code": "4218", "title": "Digital Signal Processing and Applications", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ELEG4501 or ELEG4511 or ESTR4212. Pre-requisite: ELEG3503 or consent of the instructor.", "description": "This course focuses on applications of signal processing in different domains such as audio and speech processing, biomedical signal processing, communications, data science, to name a few. The course will first introduce advanced signal processing methods such as filter designs, spectral estimation, time-frequency analysis, statistical signal processing, adaptive signal processing, and principal component analysis. Their applications to various real-life problems will then be studied. \r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4220", "title": "Radio Frequency Electronics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ELEG4203 or ELEG4213 or ELEG4214 or ESTR4206", "description": "This course gives an overall picture of the design and implementation of RF circuits which provides the understanding of the basic microwave theories and concepts (e.g. transmission line, microstrip, Smith chart, impedance matching, microwave network analysis, scattering-parameters and measurement technique); the operating principles of RF devices and circuits (e.g. power divider, RF switch, etc); as well as hands-on experience in RF circuit realization (e.g. simulation, fabrication, characterization).\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4222", "title": "RF Circuits for Wireless Systems", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Pre-requisite: ELEG3203 or ELEG3213 or ESTR3214 or consent of the instructor.;Not for students who have taken ELEG4203 or ELEG4204 or ELEG4213 or ELEG4214 or ESTR4206 or ESTR4208 or ESTR4220.", "description": "This course is for electronic engineering students to lay the essential foundation for learning the design of radio frequency circuits. It provides the system perspectives of wireless communication. The course starts with the review of transmission line theory and covers basic passive and active RF circuits, including impedance matching circuits, couplers, power divider, filters, amplifiers, etc. The basic concepts of wireless system design are discussed. This course includes mandatory laboratory modules.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4300", "title": "Web-scale Information Analytics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken CSCI5510 or ENGG4030 or IERG4300.", "description": "The course discusses data-intensive analytics, and automated processing of very large amount of structured and unstructured information. We focus on leveraging the MapReduce paradigm to create parallel algorithms that can be scaled up to handle massive data sets such as those collected from the World Wide Web or other Internet systems and applications. We organize the course around a list of large-scale data analytic problems in practice. The required theories and methodologies for tackling each problem will be introduced. As such, the course only expects students to have solid knowledge in probability, statistics, linear algebra and computer programming skills. Topics to be covered include: the MapReduce computational model and its system architecture and realization in practice ; Finding Frequent Item-sets and Association Rules ; Finding Similar Items in high-dimensional data ; Dimensionality Reduction techniques ; Clustering ; Recommendation systems ; Analysis of Massive Graphs and its applications on the World Wide Web ; Large-scale supervised machine learning; Processing and mining of Data Streams and their applications on large-scale network/ online-activity monitoring.Advisory: Basic hands-on operating system configuration and software installation skills covered in lab courses like IERG2602 and IERG3800 are required.\r", "outcome": "Upon successful completion of the course, the students will have acquired the ability to:\r  1. Model and formulate a wide range of large-scale data analytic problems in practice.\r  2. Design and implement scalable software to tackle large-scale data analytic problems.", "syllabus": "The course discusses data-intensive analytics, and automated processing of very large amount of structured and unstructured information. We focus on leveraging the MapReduce paradigm to create parallel algorithms that can be scaled up to handle massive data sets such as those collected from the World Wide Web or other Internet systems and applications. We organize the course around a list of large-scale data analytic problems in practice. The required theories and methodologies for tackling each problem will be introduced. As such, the course only expects students to have solid knowledge in probability, statistics, linear algebra and computer programming skills. Topics to be covered include: the MapReduce computational model and its system architecture and realization in practice ; Finding Frequent Item-sets and Association Rules ; Finding Similar Items in high-dimensional data ; Dimensionality Reduction techniques ; Clustering ; Recommendation systems ; Analysis of Massive Graphs and its applications on the World Wide Web ; Large-scale supervised machine learning; Processing and mining of Data Streams and their applications on large-scale network/ online-activity monitoring. The course syllabus may be updated from year to year.", "required_readings": "1. Anand Rajaraman, Jure Leskovec and Jeff D. Ullman, Mining Massive Data Sets, Cambridge University Press, 2012.\r Latest version of this book can be downloaded from: http://infolab.stanford.edu/~ullman/mmds/book.pdf\r 2. Srinath Perea, Thilina Gunarathne, Hadoop MapReduce Cookbook, Packt Publishing, 2013.\r 3. Peter Flach, Machine Learning: The Art and Science of Algorithms that Make Sense of Data, Cambridge University Press, 2012.", "recommended_readings": "1. Tom White, Hadoop: The Definitive Guide, O'Reilly Publisher, 2012.\r 2. Eric Sammer, Hadoop Operations, O'Reilly Publisher, 2012\r 3. Ian H. Witten, Eibe Frank, Mark A. Hall, Data Mining: Practical Machine Learning Tools and Techniques, Third Edition, Morgan Kaufmann Publisher, 2011.\r 4. Jonathan R. Owens, Brian Femiano, Jon Lentz, Hadoop Real World Solutions Cookbook, Packt Publishing, 2013.", "terms": {"2020-21 Term 1": {"--LEC (5972)": {"startTimes": ["9:30", "9:30"], "endTimes": ["11:15", "11:15"], "days": [5, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor LAU Wing Cheong", "Professor LAU Wing Cheong"]}, "-T01-TUT (6012)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor LAU Wing Cheong"]}}}, "assessments": {"Others": "50", "Short answer test or exam": "50"}}, {"code": "4302", "title": "Networking Protocols and Systems", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken IERG4090. Pre-requisite: IERG3310.", "description": "This is a second course on computer networking protocols and systems. The introductory course, IERG 3310 Computer Networks, covers the basic principles of networks, the protocol stack, and network programming. This course covers additional topics related to the operation and management of the Internet as well as new and emerging network technologies. A major topic in this course is Internet routing and traffic engineering which studies the operational model of transit ISPs and local ISPs, and their peering agreements. The course covers new technologies and protocols including, for example, support for multimedia applications, streaming, VoIP, IPTV services, and architectures for content delivery and data center networking. The emerging issues covered in this course may include the support for mobility, convergence of different types of wired and wireless networks, and the design of next generation Internet protocols as well as the issues in the transition to these protocols.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4304", "title": "Wireless Communication Systems", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken IERG4100 or IEMS5701. Pre-requisite: ENGG2310 or ESTR2300 or ESTR3300 or IERG2310 or IERG3010.", "description": "This course introduces the principles of wireless communication systems. Topics include digital cellular systems, physical characteristics of radio channels, fading channel, advanced digital modulation, spread spectrum and OFDM technology, diversity techniques, multiple access schemes, mobile network control and management, 4G and 5G technologies.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4306", "title": "Introduction to Cyber Security", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken IERG4130 or IEMS5710 or CSCI4130.", "description": "Cyber Security is an important topic in modern information and communication technology. This course introduces students to major areas of Cyber Security, including introductions to cryptography, network security, computer security, and web security.Advisory: Basic knowledge on Computer Networks are suggested.\r", "outcome": "Upon successful completion of the course, the students will have acquired the ability to:\r  1. obtain an introductory level of understanding of major areas of cyber security, including cryptography, network security, \r  system security, and web security;  2. gain experiences in wireless network security and web security; and\r  3. able to apply the learning outcomes of this course towards a potential career in the governance of system, network, and \r  websites. \r  This course also paves the foundation to deeper studies in cyber security.", "syllabus": "Cyber Security is an important topic in modern information and communication technology. This course introduces students to major areas of Cyber Security, including introductions to cryptography, network security, computer security, and web security.\r The course syllabus may be updated from year to year.", "required_readings": "", "recommended_readings": "1. A. Kahate, “Network Security and Cryptography.”, Tata McGraw-Hill Education, 2008", "terms": {"2020-21 Term 2": {"--LEC (8628)": {"startTimes": ["11:30", "13:30"], "endTimes": ["12:15", "15:15"], "days": [1, 5], "locations": ["Lee Shau Kee Building LT5", "T.Y.Wong Hall LT"], "instructors": ["Professor ZHANG Kehuan", "Professor ZHANG Kehuan"]}, "-T01-TUT (8629)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor ZHANG Kehuan"]}}}, "assessments": {"Essay test or exam": "64", "Others": "36"}}, {"code": "4308", "title": "Network Software Design and Programming", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken IERG4180.", "description": "This is a project-oriented course that teaches the development of network applications. Subject areas include object-oriented programming (C++ and Java); message-driven programming (windows); client-server systems design; interprocess communication; sockets: blocking and nonblocking I/O; multithreaded process; iterative and concurrent server designs; system-throughput bottlenecks; multimedia over network. Case studies: FTP, RPC, Web.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4312", "title": "Building Scalable Internet-based Services", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken IERG4080. Pre-requisite: IERG3080.", "description": "Mobile devices has greatly increased the demand of Internet-based services. Large-scale online services such as Pinterest and Instagram must be designed in a way such that they can be scaled up and scaled out in a rapid and seamless manner. This course will teach students how to build scalable online services and applications. In particular, the design principles and engineering considerations for different core components, including the front-end system, the load-balancer, performance monitoring, content-delivery networking, fault-tolerant mega data store, distributed messaging services, backend big data processing/ analytics will be discussed. As a course project, the students will prototype a scalable Internet service by leveraging industrial-strength component offerings from leading infrastructure and platform service providers.Advisory note: Students are expected to have background in object oriented programming.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4314", "title": "Hands-on Wireless Communication", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken IERG4110. Pre-requisite: ENGG2310 or ESTR2300 or IERG2310.", "description": "The focus of this course will be on the design, implementation, and evaluation of a digital wireless communication link. Software-defined wireless communication platforms, e.g., USRP (universal software radio peripheral), will be used as a teaching tool. A two-hour laboratory period will complement the usual two-hour lecture period each week.The students will learn how to transmit, receive, analyze, and process RF wireless signals. The main topics may include: Introduction to SDR, USRP, and common programming software (GNU Radio and NI LabVIEW); Baseband QAM Modulation and Demodulation; Channel Estimation; Synchronization; Frequency Offset Estimation and Correction; OFDM Modulator and Demodulator; OFDM Synchronization, Frequency Offset Compensation, Channel Tracking, and etc.Advisory note: It is advisable for students to have had digital communications background or take digital communications course (IERG3010) at the same time as this course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4316", "title": "Programming Big Data Systems", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken IERG4330 or IEMS5730. Co-/Pre-requisite(s): ENGG4030 or ESTR4300 or IERG4300.", "description": "This course aims to provide students with the hands-on experience needed for a successful career in Big Data in the information technology industry. Many of the assignments will be completed on massive publicly available data sets giving them appropriate experience with the algorithms, mainstream platforms, and software tools needed to master programming for Big Data. The students will develop a solid background in provisioning, programming and applying Big Data systems and software.\r", "outcome": "Upon successful completion of the course, the students will have acquired the ability to:\r 1. Understand the operating principles and be familiar with the tools to provision and manage data-center infrastructure at scale. \r 2. Understand and apply design patterns when programming for mainstream Big Data computational frameworks.\r 3. Understand the operating principles of different components and software tools in a Big Data processing stack. \r 4. Design and develop Big Data processing/ analytic applications using common open-source platforms and software tools.", "syllabus": "This course gives students a practical understanding of using open-source platforms and tools, e.g. those in the Apache Hadoop and Spark ecosystems, to perform Big Data processing and analytics. The focus is to provide hands-on training in managing, programming and applying Big Data platforms/ technologies. Topics to be covered include: \r  - Provision and manage data-center infrastructure at scale using tools such as OpenStack and Mesos.\r - Design patterns, performance optimization and the implementation of common algorithms under mainstream computational frameworks/ abstractions such as Hadoop/MapReduce, Spark/RDD and Storm. \r - Programming for Big Data collection, ingestion, transformation and migration using tools such as Apache Flume, Sqoop, Pig and Avro.\r - Application programming/ interfacing with distributed Big Data stores such as Redis, Cassandra, MongoDB and HBase. \r - Programming for batched and real-time Big Data queries using systems such as Hive, Impala, BigQuery/Drill and Spark SQL. \r - Workflow coordination for Big Data Processing, e.g. using Oozie. \r - Performing complex analytics using application libraries/ engines such as Mahout, MLib and GraphCreate. \r  The course syllabus and the specific set of Big Data programming tools and platforms to be covered may be updated from year to year.", "required_readings": "1. Learning Spark, by Holden Karau, Andy Konwinsky, Patrick Wendell, Matei Zaharia, O'Reilly Media, 2015\r 2. Hadoop: The Definitive Guide, 4th Edition, by Tom White, O'Reilly Media/Yahoo Press, 2015. \r 3. Advanced Analytics with Spark: Patterns for Learning from Data at Scale, by Sandy Ryza, Uri Laserson, Sean Owen, Josh Wills, O’Reilly Media, 2015.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (8297)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor LAU Wing Cheong"]}, "-T01-TUT (8312)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor LAU Wing Cheong"]}}}, "assessments": {"Others": "60", "Short answer test or exam": "40"}}, {"code": "4400", "title": "Kinetic Energy Harvesting Devices and Systems", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ENER4010 or EEEN4010. Pre-requisite: MAEG3030 or with the consent of the course instructor.", "description": "In this course, we will discuss kinetic energy harvesting devices and systems, from basic mechanisms to applications. The first half semester of this course will start with talking about the fundaments of kinetic energy harvesting, including mechanisms of electromagnetic, piezoelectric, triboelectric, electrostatic, and others. And then it will cover basic device designs and energy transfer; physics and circuit models; electromechanical modeling and analysis; simulation methods and practice; and interfacing circuits. The second half semester will cover the applications of kinetic energy harvesting in various situations, including power plants, wind turbine, vibrations, hydro system, ocean waves, body motions and others, and ends with discussions on kinetic energy harvesting technology in the future. The evaluation will be based on final project, midterm exam, homework, lab report, and participation in class.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4402", "title": "Solar Energy and Photovoltaic Technology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureProjectInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ENER4020 or EEEN4020. ;Pre-requisite: ;1. ELEG2202 and ENER2020/EEEN2020, or ;2. ELEG2202 and ELEG3201/ESTR3200.", "description": "This course provides students with knowledge of solar energy and photovoltaic technologies. It covers the following topics: introduction to solar energy technologies, semiconductors for photovoltaics; working principle and performance evaluation of photovoltaic cells (PVs); photovoltaic technologies (crystalline PVs, thin film PVs, and organic and nanostructure based PVs), solar panel system design, cost aspects, and market development and environmental impact of photovoltaic industry.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4404", "title": "Nuclear Energy and Risk Assessment", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ENER4030 or EEEN4030.", "description": "This course will introduce the basic nuclear physics - elementary quantum theory; nuclear forces; shell structure of the nucleus; alpha, beta, and gamma radioactive decays; nuclear reactions; fission and fusion. In addition, this course will discuss the nuclear power plant design - nuclear power plant layout; reactor dynamics; reactor start up and process control, waste treatment. Risk management - assessment and management of nuclear safety, radiation, exposure and environment, safety assessment will be introduced in this course.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4408", "title": "Computer-integrated Manufacturing", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken MAEG4010.", "description": "This course provides students with a solid background in the fundamentals of computer-integrated manufacturing technology. It covers the following topics: concurrent engineering, computer-integrated manufacturing models and concepts, rapid prototyping, computer-aided manufacturing, control of manufacturing systems (numerical control and computer numerical control), programmable logic controller, computer aided process planning and manufacturing scheduling, and quality assurance. The hands-on experiments and projects are included.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4410", "title": "Finite Element Modelling and Analysis", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken MAEG4020.", "description": "The purpose of this course is to learn the mathematical and computational method for finite element analysis. Students will learn the computational procedure, basic elements, shape functions and the method for imposing boundary conditions. The numerical implementation for finite element analysis will also be learned. Finite element analysis software will be used in project to solve engineering applications.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4412", "title": "Heat Transfer", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken MAEG4030.", "description": "This course will cover fundamental topics in heat transfer including physical origins of three heat transfer modes and their rate equations, heat diffusion equation, boundary and initial conditions, steady-state and transient conduction, numerical methods, boundary layer equation, external and internal forced convection, free convection, and thermal radiation.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4414", "title": "Mechatronic Systems", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken MAEG4040.", "description": "Mechatronics is at the intersection of mechanical, electronic, control, and software engineering. This course will cover the technologies involved in developing and designing intelligent electro-mechanical systems. Specific topics include physical system modelling and analysis, measurement and manipulation principles, sensors, actuators, data acquisition and conversion, microcontrollers and interface, control system design and tuning. The course includes a significant lab component with a course project in mechatronics system design. Students will involve in hands-on programming project to reinforce the basic principles developed in lectures as well as develop control algorithm implementation skillsets.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4416", "title": "Modern Control Systems Analysis and Design", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken MAEG4050.", "description": "This course provides students with the knowledge of modern control systems analysis and design. It covers the following topics: continuous and discrete domain state space representations (including transition matrix, stability, controllability and observability, pole placement control, state estimator), emulation design, and discrete design. Case studies are also included. \r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4418", "title": "Engineering Optimization", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken MAEG4070.", "description": "The course will introduce basic concepts of engineering optimization methods as applied to engineering problems. The theory and application of optimization techniques will be presented, including unconstrained and constrained optimization, Lagrange multiplier, necessary and sufficient conditions for optimality and dynamical programming.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4420", "title": "Introduction to Combustion", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken MAEG4080. Pre-requisite: MAEG2030 or ESTR2402 and MAEG3030.", "description": "Combustion and its control are essential to our daily life and more than 80% of the energy used nowadays is from combustion sources. This course starts with the basic principles that govern combustion phenomena such as conservation of mass, the first and second laws of thermodynamics, and the momentum principle. Then students will learn the new applications of these basic principles to account for the chemical transformations. We will discuss the basic concepts of chemical kinetics and the forms of reaction rate laws that apply in combustion processes, as well as mass transport phenomena. These laws will be applied to a variety of combustion phenomena, including spontaneous ignition of combustible mixtures, pollutant formation, internal combustion engine and fire safety.\r", "outcome": "Upon completion of the course, students should have achieved the following outcomes:\r (1) be able to use the principles of thermochemistry, fluid dynamics, and chemical kinetics to understand the basic combustion process; (2) be able to calculate flame temperature for an idealized fuel-air mixture; (3) be able to understand qualitatively how non-ideal factors affect flame temperature; (4) be able to understand the difference between the basic types of internal combustion engines; (5) be able to analyze an ideal engine cycle using thermodynamic diagrams and analyze the system performance of ideal Otto, Diesel and Brayton thermodynamic cycles; (6) be able to analyze how CO, NO, unburned hydrocarbons and soot emissions are formed in engines and solutions to minimize them.", "syllabus": "The details will be provided by the course instructor.", "required_readings": "", "recommended_readings": "(1) Stephen Turns, “An Introduction to Combustion: Concepts and Applications: 3rd Edition”, Jan 2011, McGraw-Hill Companies,Inc. ( ISBN: 0073380199)\r (2) John B. Heywood, “Internal Combustion Engine Fundamentals”, April 1988, McGraw-Hill Companies,Inc. (ISBN: 007028637X)\r (3) Sara McAllister, Jyh-Yuan Chen, A. Carlos Fernandez-Pello, “Fundamentals of Combustion Processes”, April 2011, Springer-Verlag New York, LLC. (ISBN: 1441979425)", "terms": {"2020-21 Term 2": {"--LEC (5242)": {"startTimes": ["16:30", "14:30"], "endTimes": ["17:15", "16:15"], "days": [1, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor REN Wei", "Professor REN Wei"]}, "-T01-TUT (5243)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor REN Wei"]}}}, "assessments": {"Homework or assignment": "35", "Short answer test or exam": "25", "Selected response test or exam": "40"}}, {"code": "4422", "title": "Energy Storage Devices and Systems", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ENER4040, ENER4050 or ESTR4406 or EEEN4050. Pre-requisite: ENER2010 AND ENER2020 or EEEN2020 or with the consent of the course instructor.", "description": "This course describes the fundamental principles, device and system design of energy storage technologies including electrochemical energy storage (batteries, supercapacitors, fuel cells etc.), thermal energy storage (phase change), mechanical energy storage (flywheel and compressed air energy storage), hydrogen storage. The applications of energy storage technologies in supporting renewable energy sources for smart grid, hybrid and all-electric vehicles, and green building applications will be discussed.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4424", "title": "Energy Distribution", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ENER4040, ENER4060, ESTR4406 or EEEN4060. Pre-requisite: ELEG2202 or equivalent.", "description": "This course will introduce electric power system fundamentals, control, and operation. The course will discuss power system components and overview, review of basic circuit elements, AC circuit analysis and phasor representation, complex power, active and reactive power, power factor and power triangle, reactive power compensation, balanced 3-phase system analysis, Yconnection and delta-connection, transformer modelling and analysis, per-unit analysis, transient stability and analysis, voltage stability and control, frequency stability and control, power flow analysis, economic dispatching, optimal power flow problem, power plant planning, smart grid, energy storage system, renewable generation and utilization, and electric vehicle integration.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4500", "title": "Logistics Management", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ESTR3514 or ESTR4510 or SEEM3620 or SEEM4600 or SEEM4750.", "description": "The integrated logistics management concept. Customer service. Channels of distribution. Transportation; vehicle routing and scheduling; freight consolidation. Facility location and network planning. Storage and material handling systems. Information systems for order processing and inventory tracking. Purchasing and supply scheduling. Business process re-engineering.Third-party logistics. Global logistics.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4502", "title": "Supply Chain Management", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ESTR3514 or ESTR4510 or SEEM3620 or SEEM4610 or SEEN4750.", "description": "Management of moving raw materials, in-process inventory and finished-goods; transferring information and payment. Topics include: distribution; inventory management; purchasing and supplier management; the value of information and information technology; supply chain integration and strategic partnering; product design for supply chain management.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4504", "title": "Technology, Consulting and Analytics in Practice", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ESTR3512, SEEM3680 or SEEM4680.", "description": "This course aims to equip students with an overview of the latest technologies, e.g. cloud computing, social media, mobile applications, etc. that are impacting the business world every day. It also enable students to learn how some of the latest technology solutions are applied to the business world to solve real-life problems.Students will be given ample opportunity to apply what they have learned in class through participations in facilitated class discussions and sharing, and possibly with pilot technological implementations. The SEEM department will invite participation by industry leaders and practitioners to share their insights in this course.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4506", "title": "Computational Finance", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken SEEM4720. Pre-requisite: SEEM2520 or SEEM3570 or SEEM3590 or ESTR3508 or ESTR3509.", "description": "In depth examination of numerical methods and their implementation for finance and risk management problems: Linear and Nonlinear Equation solutions, Unconstrained and constrained optimization, Monte Carlo Simulation, Finite difference for PDEs. Other related financial applications.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4508", "title": "Statistics Modeling and Analysis in Financial Engineering", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken SEEM4730.", "description": "Financial data are undoubtedly rich from stock markets and many websites and sources such as Bloomberg and Reuters. This course studies empirical research methods in financial engineering, i.e., deriving intelligence from data through data analysis and statistical inference. In particular, this course addresses important issues of a statistical nature such as: use of different financial market data models, estimation of model parameters, simplification of models, and elaboration of models. The key objective of this course is to address how the prices of stocks and other financial assets behave.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4510", "title": "Advances in Logistics and Supply Chain Management", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken ESTR4500 or ESTR4502 or SEEM4600 or SEEM4610 or SEEM4750", "description": "This course covers the advanced topics in logistics and supply chain management. In particular, it uses comprehensive models to describe, and hence explore the optimal strategies in, various important logistics and supply chain management problems. The topics include customer service, channels of distribution, transportation, vehicle routing and scheduling, freight consolidation, facility location and network planning, storage. This course also introduces important practice in logistics and supply chain management, such as material handling systems, information systems for order processing and inventory tracking, purchasing and supply scheduling, business process re-engineering, third-party logistics, and global logistics.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4512", "title": "Stochastic Models for Decision Analytics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "1. Pre-requisites:\n(a) ENGG1110/ESTR1002, ENGG1120/ESTR1005, ENGG1130/ESTR1006, ENGG2440/ESTR2004, ENGG2760/ESTR2018, ENGG2780/ESTR2020, MATH1510 and SEEM2420; or (b) with course instructor's approval.\n2. Not for students who have taken SEEM4760.", "description": "This course introduces the concepts of stochastic models and their applications in decision analytics. It covers the topics of Markov chains, Markov decision processes, and various approximate dynamic programing techniques.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4601", "title": "Global Medical Device Regulatory Affairs", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken BMEG5850 or BMEG4010.", "description": "This course provides an overview on global medical device regulation. Regulatory affairs refer to how to get a medical product registered in different countries’ health authorities. A registered product would demand a lot of technical documentation to prove its efficacy, safety, and quality. To successfully and smoothly register a product, knowledge and skills are required to deal with various key stakeholders in governments, testing centers, hospitals, and medical doctors. The course is characterized by its unique international focus. In addition to learning Hong Kong, Chinese Mainland and Asia regulatory affairs, students would learn European and US medical device regulatory system to facilitate the medical device to be marketed around the world.\r", "outcome": "• Able to describe how to meet standards and regulatory requirements of medical devices in US, Europe and Asia.\r • Able to handle regulatory tasks included classification, risk management and product registration.", "syllabus": "This course provides an overview on global medical device regulation. Regulatory affairs refer to how to get a medical product registered in different countries’ health authorities. A registered product would demand a lot of technical documentation to prove its efficacy, safety, and quality. To successfully and smoothly register a product, knowledge and skills are required to deal with various key stakeholders in governments, testing centers, hospitals, and medical doctors. The course is characterized by its unique international focus. In addition to learning Hong Kong, Chinese Mainland and Asia regulatory affairs, students would learn European and US medical device regulatory system to facilitate the medical device to be marketed around the world. \r This course aims to give both factual and practical experiences on what is regulatory requirement and how to handle future regulatory tasks, included classification, risk management, product registration and commercial materials review. \r Students would form teams from different disciplines and each team would tackle a particular medical device of their choices to go through the processes of the regulatory requirements. The project ideas will be put into the reality and through public channels.", "required_readings": "1. Medical devices - Quality management systems - Requirements for regulatory purposes ISO13485:2003, 2003\r 2. Medical devices - Application of risk management to medical devices ISO14971:2007, 2007\r 3. Council directive 93/42/EEC concerning medical devices, 2007 \r 4. Handbook of medical device regulatory affairs in Asia, Jack Wong and Raymond Tong, Pan Stanford Publishing, 2013\r 5. Biodesign: The Process of Innovating New Medical Technologies, Stefanos A Zenios; Josh Makower; Paul G Yock , Cambridge University Press, 2010", "recommended_readings": "N/A", "terms": {"2020-21 Term 2": {"--LEC (7316)": {"startTimes": ["10:30", "9:30"], "endTimes": ["11:15", "11:15"], "days": [5, 2], "locations": ["Lee Shau Kee Building LT1", "Lee Shau Kee Building LT2"], "instructors": ["Professor TONG Kai Yu", "Professor TONG Kai Yu"]}, "-T01-TUT (7317)": {"startTimes": ["TBA", "11:30"], "endTimes": ["TBA", "12:15"], "days": ["TBA", 2], "locations": ["TBA", "Lee Shau Kee Building LT2"], "instructors": ["Professor TONG Kai Yu", "Professor TONG Kai Yu"]}}}, "assessments": {"Others": "60", "Short answer test or exam": "40"}}, {"code": "4998", "title": "Graduation Thesis I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken BMEG4998 or CENG4998 or CSCI4998 or FTEC4998 or ELEG4998 or EEEN4998 or IERG4998 or MAEG4998 or SEEM4998.", "description": "The course is designed to provide students with an opportunity to carry out, under the supervision of an academic staff, an independent, systematic and rigorous study with research elements in engineering.", "outcome": "1) Be able to identify and have a basic understanding of the literature related to the research topic. 2) Be able to identify research issues and define research objectives. 3) Be able to develop and execute a research plan for achieving the research objectives. 4) Develop technical writing skills.", "syllabus": "The course includes, but are not limited to, the following elements: literature review, development of theories, theoretical analysis, modelling, system design and implementation.", "required_readings": "Literature review materials will be recommended by the thesis supervisor.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"AAJ1-PRJ (5083)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor Andrej BOGDANOV"]}, "ABJ1-PRJ (8438)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHAN Lai Wan"]}, "ACJ1-PRJ (5120)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor DOU Qi"]}, "ADJ1-PRJ (8439)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor FU Chi Wing"]}, "AEJ1-PRJ (5874)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHENG James"]}, "AFJ1-PRJ (7915)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor LEE Pak Ching"]}, "AGJ1-PRJ (8157)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor LEUNG Ho Fung"]}, "AHJ1-PRJ (7913)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor LEUNG Kwong Sak"]}, "AIJ1-PRJ (7750)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor LYU Rung Tsong Michael"]}, "AJJ1-PRJ (8437)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor SHAO Zili"]}, "AKJ1-PRJ (7916)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor WONG Tien Tsin"]}, "ALJ1-PRJ (5084)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor YU Bei"]}, "BAJ1-PRJ (7917)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor LI Hongsheng"]}, "BBJ1-PRJ (5085)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor LEE Tan"]}, "CAJ1-PRJ (8541)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN He"]}, "CBJ1-PRJ (8169)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor LIEW Soung Chang"]}, "CCJ1-PRJ (8809)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor Pascal Olivier VONTOBEL"]}, "CDJ1-PRJ (7487)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor ZHANG Yingjun"]}, "CEJ1-PRJ (7740)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor ZHOU Bolei"]}, "EAJ1-PRJ (6017)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHENG Hong"]}}}, "assessments": {"Essays": "75", "Presentation": "25"}}, {"code": "4999", "title": "Graduation Thesis II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Fac Office of Engineering", "requirements": "Not for students who have taken BMEG4999 or CENG4999 or CSCI4999 or FTEC4999 or ELEG4999 or EEEN4999 or IERG4999 or MAEG4999 or SEEM4999. Pre-requisite: ESTR4998.", "description": "The course is designed to provide students with an opportunity to carry out, under the supervision of an academic staff, an independent, systematic and rigorous study with research elements in engineering.", "outcome": "1) Be able to identify and have a basic understanding of the literature related to the research topic. 2) Be able to identify research issues and define research objectives. 3) Be able to develop and execute a research plan for achieving the research objectives. 4) Develop technical writing skills.", "syllabus": "The course includes, but are not limited to, the following elements: literature review, development of theories, theoretical analysis, modelling, system design and implementation.", "required_readings": "Literature review materials will be recommended by the thesis supervisor.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"AAJ1-PRJ (7547)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor Andrej BOGDANOV"]}, "ABJ1-PRJ (5260)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHAN Lai Wan"]}, "ACJ1-PRJ (8943)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor DOU Qi"]}, "ADJ1-PRJ (5261)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor FU Chi Wing"]}, "AEJ1-PRJ (8944)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHENG James"]}, "AFJ1-PRJ (5036)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor LEE Pak Ching"]}, "AGJ1-PRJ (8945)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor LEUNG Ho Fung"]}, "AHJ1-PRJ (5664)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor LEUNG Kwong Sak"]}, "AIJ1-PRJ (5262)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor LYU Rung Tsong Michael"]}, "AJJ1-PRJ (5263)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SHAO Zili"]}, "AKJ1-PRJ (5890)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Tien Tsin"]}, "ALJ1-PRJ (7507)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor YU Bei"]}, "AMJ1-PRJ (5264)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor YANG Ming Chang"]}, "BAJ1-PRJ (7898)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor LI Hongsheng"]}, "BBJ1-PRJ (7508)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor LEE Tan"]}, "CAJ1-PRJ (8926)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN He"]}, "CBJ1-PRJ (4730)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor LIEW Soung Chang"]}, "CCJ1-PRJ (8313)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Pascal Olivier VONTOBEL"]}, "CDJ1-PRJ (7293)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor ZHANG Yingjun"]}, "CEJ1-PRJ (8743)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor ZHOU Bolei"]}, "EAJ1-PRJ (8314)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHENG Hong"]}}}, "assessments": {"Essays": "75", "Presentation": "25"}}]