[{"code": "(4907)", "title": "Nutrition Practicum\n\n** available as of 2023-07-01", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "Pre-requisite: FNSC4906", "description": "This course is specifically designed for final-year Nutritionist Stream students in FNS Programme. Students should have completed FNSC4906 Internship prior to taking this course. The course aim is to reinforce experiential learning experience and further equip students with skills necessary to enter the workplace in the field of nutrition. The students are required to perform 2 to 3 different nutritional tasks, on campus or off campus, in more than one setting. These tasks may include, but not limit to, giving nutritional talks to the public, organizing nutrition activities for specific groups, communicating health to the general population, etc.Students are expected to apply scientific evidence-based nutrition knowledge and to carry out the task with the demonstration of professional behavior and the compliance in the code of ethics and standards of professional conduct. All experiential learning activities must be executed and scrutinized under the supervision of a registered dietitian or a registered nutritionist.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2001", "title": "Introduction to Food Science and Technology", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "Co-requisite: BCHE2030 & BIOL2120.", "description": "This course will provide an overview of various topics in food science and technology. Lectures will include discussions of general areas of interest chosen to stimulate and foster students' interest in both food science and food technology. The course will cover topics that include basic food chemistry, food processing and preservation, food microbiology and fermentation, food safety and toxicology, food engineering, food biotechnology, food evaluation and product development, etc. Relevant examples will be cited to strengthen the basic understanding of the principles in each topic. Local issues related to food will also be discussed.\r", "outcome": "-Define Food Science and Food Technology\r -Understand the dimensions of food processing and preservation\r -Grasp the basic information in food chemistry, food microbiology and food product development, and be able to utilize them in the preparation of safe and high quality food products\r -Tell the current trends and advancements in Food Science and Technology", "syllabus": "-Introduction and Food Science and Technology\r -Food categories and composition\r -Food chemistry\r -Food additives\r -Food processing and preservation\r -Food microbiology and fermentation\r -Food safety and toxicology\r -Food biotechnology\r -Sensory evaluation and food product development", "required_readings": "", "recommended_readings": "-Brown, Amy. 2008. Understanding Food: Principles & Preparation. (3rd ed.), Wadsworth Cengage Learning, Belmont, CA, USA (TX354.B684 2008).\r -Murano, Peter S. 2003. Understanding Food Sciences and Technology. Thomas Learning, Belmont, CA, USA (TP370 M87 2003).", "terms": {"2020-21 Term 1": {"--LEC (6269)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Dr. LAM Yiu Man, \n\rMr. CHU Kin Kan Astley, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor CHUNG Hau Yin"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2021-22 Term 1": {"--LEC (5709)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Science Centre L1"], "instructors": ["Dr. LAM Yiu Man, \n\rMr. CHU Kin Kan Astley, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor CHUNG Hau Yin"], "meetingDates": ["8/9", "15/9"]}}}}, {"code": "2002", "title": "Nutrition for Health", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "Pre-requisite: FNSC2001.", "description": "This course provides an overview of the basic concepts and principles of nutrition science and how to apply the principles of good nutrition in everyday life to the planning of healthy eating for optimal health, performance and disease prevention. Students will also be able to identify some common Hong Kong nutrition problems and the role of nutrition in their origins, prevention and therapy. The course will also expose the students to some additional nutritional issues of current health or research significance.\r", "outcome": "-Define the science of nutrition, and discuss the importance of nutritional adequacy and balance for optimal growth and health\r -Identify the dietary sources, functions and key roles in health protection of the major nutrients\r -Discuss the health effects of the major nutrients in terms of deficiency and excess\r -Identify some common Hong Kong nutritional problems and some current nutritional issues of health or research significance\r -Interpret the common media presentations of nutrition information-valid or flawed?\r -Apply the principles of good nutrition in their own lives to the planning of healthy eating for optimal performance and disease prevention", "syllabus": "-Nutrition Recommendation\r -Macro- & Micro-nutrients\r -Nutrition & Non-communicable Diseases\r -Healthy Eating", "required_readings": "", "recommended_readings": "-Gibney M.J. et al. 2009. Introduction to Human Nutrition (2nd ed.), Wiley-Blackwell, Ames, Iowa, USA (UL QU145I665 2009).", "terms": {"2020-21 Term 2": {"--LEC (7113)": {"startTimes": ["12:30"], "endTimes": ["14:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. WONG Tsz Yan, \n\rMs. YIP Pui Sze, \n\rProfessor CHEN Zhenyu, \n\rProfessor LEUNG Lai Kwok, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 2": {"--LEC (7797)": {"startTimes": ["12:30"], "endTimes": ["14:15"], "days": [2], "locations": ["Science Centre L1"], "instructors": ["Dr. WONG Tsz Yan, \n\rMs. YIP Pui Sze, \n\rProfessor CHEN Zhenyu, \n\rProfessor CHOW Hei Man, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Essay test or exam": "50", "Others": "50"}}, {"code": "2005", "title": "Ethics and Professionalism for Nutritionists", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "", "description": "Ethics are principles that governing a person’s professional behaviour. Students need to understand what is and what is not professional behaviour. Therefore, this course will cover the issues of professional behavior, including Association for Nutrition (AfN) Standards for Ethics, Conduct and Performance. Other topics relating to professionalism, such as intellectual property issues, preventing from corruption behavior, handling of privacy/personal data, etc. will also be covered in this course.To apply for the Nutritionist stream (FNS-NS), students must pass the course with at least a C in this course along with other FNS-NS admission requirements.", "outcome": "After completion of this course, students will be able to: analyze what is and what is not professional behaviour, remember and understand the standards of ethics, conduct and performance set by AfN, describe intellectual property issues, how to avoid corruption, and property ways of handling privacy data", "syllabus": "Week 1: Course IntroductionWeek 2: Ethics and values of professionsWeek 3: AfN Standards for Ethics, Conduct, and PerformanceWeek 4: Fitness to practiceWeek 5: Local and overseas nutrition profession, stature registration vs voluntary registrationWeek 6: Nutritionists’ scope of practiceWeek 7: Case Studies / tutorial / discussionWeek 8: Intellectual Property Issues (1)Week 9: Intellectual Property Issues (2)Week 10: Preventing from CorruptionWeek 11: Regulation of handling privacy/personal data in Hong KongWeek 12: Case Studies / tutorial / discussionWeek 13: Course conclusion", "required_readings": " UKVRN Standards of Ethics, Conduct and Performance, Association for Nutrition.  https://www.associationfornutrition.org/wp-content/uploads/2020/06/2020-AfN-Standards-of-Ethics-Conduct-and-Performance.pdfAnd, others to be provided by the course teacher", "recommended_readings": "To be provided by the course teacher", "terms": {"2021-22 Term 2": {"--LEC (8693)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Science Centre L1"], "instructors": ["Ms. YIP Pui Sze"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Examination": "50", "Others": "30", "Test or quiz": "20"}}, {"code": "3001", "title": "Food Science Laboratory I", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "Co-requisite: FNSC3110.", "description": "This laboratory course accompanies FNSC3110 and 3180. This course introduces fundamental principles, methodologies and techniques currently used in food microbiological tests and food composition analysis.", "outcome": "This laboratory course contributes as one of the core competencies in the analytical aspects of food science. Upon successful completion of this course, the students should be able to:\r 1. understand the essential theories and concepts common to basic and applied food chemistry and microbiology\r 2. master basic experimental skills used for food microbiological examinations and food proximate analyses\r 3. demonstrate a good knowledge in the official methods of food chemical analyses\r 4. understand the principles and operations of modern analytical instruments such as GC-MS and HPLC for the food \r  composition analyses\r 5. use various methods to enumerate the number of microorganisms in foods and determine if a product meets the \r  microbial levels listed in specifications, guidelines, or standard\r 6. understand the selective activity of growth media and identify specific microorganisms important to food importance\r 7. apply the appropriate concepts and analytical methods when presented with a practical problem\r 8. demonstrate practical proficiency in a food testing and analysis laboratory\r 這是一個教授主要食品分析科學知識的實驗課堂。成功完成本科後，學生應該能夠： 1. 理解有關食品化學及微生物學上一些基本及應用的理論和概念\r 2. 掌握應用於食品微生物檢驗和食品成分分析的基本實驗技能\r 3. 對共識的食品化學分析方法有良好的知識\r 4. 理解現代食品成分分析儀器，如氣相色譜-質譜儀及高效液相色譜儀的運作原理及操作\r 5. 使用不同方法來測定食品中微生物的數量，及斷定食品是否符合規範中列明 的微生物水平、指引或標準\r 6. 理解選擇培養基的運作特性，及鑑别有特定重要性的食品微生物\r 7. 應用適當的概念和分析方法去處理實際問題\r 8. 在食品測試和分析實驗室中表現出精通的實踐能力\r 这是一个教授主要食品分析科学知识的实验课堂 。成功完成本科后，学生应该能够： 1. 理解有关食品化学及微生物学上一些基本及应用的理论和概念\r 2. 掌握应用于食品微生物检验和食品成分分析的基本实验技能\r 3. 对共识的食品化学分析方法有良好的知识\r 4. 理解现代食品成分分析仪器，如气相色谱 - 质谱仪及高效液相色谱仪的运作原理及操作\r 5. 使用不同方法来测定食品中微生物的数量，及断定食品是否符合规范中列明的微生物水平，指引或标准\r 6. 理解选择培养基的运作特性，及鉴别有特定重要性的食品微生物\r 7. 应用适当的概念和分析方法去处理实际问题\r 8. 在食品测试和分析实验室中表现出精通的实践能力", "syllabus": "Experiment 1. Enumeration of Bacteria in Food I: Standard Plate Count\r Experiment 2. Enumeration of Bacteria in Food II: Membrane filtration and Most Probable Number\r Experiment 3. Evaluation of Surface Contamination in Food\r Experiment 4. Detection of Salmonella and Staphylococcus\r Experiment 5. Food Yeasts and Molds\r Experiment 6. Identification of Microorganism: BIOLOG and API system\r Experiment 7. Food Composition Analysis I: Crude protein content in foods\r Experiment 8. Food Composition Analysis II: Total fat, moisture and ash content in foods\r Experiment 9. Food Composition Analysis III: Dietary fiber and minerals content in foods\r Experiment 10. Food Composition Analysis IV: Sugar and saturated/trans- fatty acids content in foods", "required_readings": "", "recommended_readings": "References for each experiment are listed in the laboratory manual provided", "terms": {"2020-21 Term 1": {"-L01-LAB (9142)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor CHEUNG Chi Keung Peter"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}}, "2021-22 Term 1": {"AL01-LAB (6863)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Science Centre 394"], "instructors": ["Professor CHEUNG Chi Keung Peter"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}, "BL01-LAB (6757)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Science Centre 394"], "instructors": ["Professor CHEUNG Chi Keung Peter"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}, "assessments": {"Essay test or exam": "55", "Lab reports": "30", "Others": "15"}}, {"code": "3002", "title": "Nutritional Science Laboratory I", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "Prerequisite: FNSC3030. Co-requisite: FNSC3010.", "description": "This course is a laboratory counterpart of FNSC3010, 3030 and 4150. It is designed to train students in laboratory skills commonly used in research of nutritional biochemistry, relationship of nutrition and human development, and medical nutrition therapy.\r", "outcome": "This laboratory course comprises of multiple disciplines on health and nutritional status assessments and research techniques on evaluating relationship among food and human body. After completing this course, the students should be able to:\r  1. Master basic experimental skills in nutritional biochemistry.\r 2. Understand the essential theories and concepts on clinical methods of accessing health and nutritional status.\r 3. Recognize their current health status.\r 4. Interpret experimental data to determine the possible disease that the patients may suffer.\r 5. Understand the experimental methods on evaluating the relationship between food and human health.\r 此科包括健康與營養狀況的檢測及測試食物與人體之間的關係的實驗方法，完成此科後，學生預期具備以下能力： 1. 掌握基本營養生物化學的實驗技巧。\r 2. 認識健康及營養狀況評估的臨床方法的理論及概念。\r 3. 注意個人現在的健康狀況。\r 4. 解讀實驗中的數據以分析病人有可能患上的疾病。\r 5. 認識測試食物與人體健康的關係的實驗方法。\r 此科包括健康與營養狀況的檢測及測試食物與人體之間的關係的實驗方法，完成此科後，學生預期具備以下能力：  1. 掌握基本营养生物化学的实验技巧。 \r 2. 认识健康及营养状况评估的临床方法的理论及概念。 \r 3. 注意个人现在的健康状况。 \r 4. 解读实验中的数据以分析病人有可能患上的疾病。 \r 5. 认识测试食物与人体健康的关系的实验方法。", "syllabus": "Practical 1 Body Composition Measurement\r Practical 2 Daily Energy Intake and Expenditure\r Practical 3 Calorimetry\r Practical 4 Measurement of Vitamins\r Practical 5 Determination of Plasma LDL-cholesterol, HDL-cholesterol, Triacylglycerol and Apolipoproteins\r Practical 6 Red Cell Indices\r Practical 7 Effect of Tea Antioxidants on Lipid Oxidation in Red Blood Cell Membrane\r Practical 8 Effect of Food on Aspirin Absorption\r Practical 9 Measurement of Plasma Glucose, Insulin and Beta-hydrobutyrate\r 實驗一 身體組成的檢測 實驗二 每日能量攝取及消耗 實驗三 熱量測量法 實驗四 維他命的檢測 實驗五 血液中低密度脂蛋白膽固醇、高密度脂蛋白膽固醇、三酸业甘油脂及載脂蛋白的檢測 實驗六 紅血球細胞指數 實驗七 茶抗氧化物對紅血球細胞壁脂氣化的影響 實驗八 食物如何影響阿司匹靈的吸收 實驗九 血糖、胰島素及β-羥丁酸的測量\r 实验一 身体组成的检测  实验二 每日能量摄取及消耗  实验三 热量测量法  实验四 维他命的检测  实验五 血液中低密度脂蛋白膽固醇、高密度脂蛋白膽固醇、三酸业甘油脂及載脂蛋白的檢測  实验六 红血球细胞指数  实验七 茶抗氧化物对红血球细胞壁脂气化的影响  实验八 食物如何影响阿司匹灵的吸收  实验九 血糖，胰岛素及β-羟丁酸的测量", "required_readings": "", "recommended_readings": "1) Dashman T, Blocker DE and Baker N (1991). Laboratory Manual for Human Nutrition Harwood Academic Publishers, New York\r 2) Whitney EN and Rolfes SR. Understanding Nutrition (1993). West Publishing Company, New York\r 3) Rosalind S. Gibson (1993). Nutritional Assessment. A Laboratory Manual Oxford University Press, New York, pp. 132-140\r 4) Sauberlick HE, Dowdy RP, Skala JH (1974) Laboratory Tests for the assessment of Nutritional Status. CRC Press Inc, Cleveland, Ohio\r 5) Friedewald, WT et al 1972 Estimation of the concentration of low-density-lipoprotein cholesterol lin plasma without use the preparative ultracentrifuge. Clinical Chemistry 18:499-502\r 6) Clark PM, Hales CN. How to measure plasma insulin. Diabetes/Metabolism Reviews, 10:79-90 (1994)\r 7) Custer EM, Myers JL, Poffenbarger PL, Schoen I. The storage stability of 3-hydroxy-butyrate in serum, plasma, and whole blood. Am J Clin Pathol 80:375 (1983).\r 8) Rolfes SR Pinna K and Whitney E (2009) Understanding Normal and Clinical Nutrition (8th Ed), Wadsworth, Chapter 17 (Nutrition Care and Assessment), p. 588-608; Chapter 26 (Diabetes Mellitus), p. 810-835.\r 9) Schlenker ED and Long S. (2007) Williams’ Essentials of Nutritional & Diet Therapy (9th ed.), Mosby Inc. Chapter 17 (Drug- Nutrient Interactions), p. 411-430.\r 10) Berdanier L and Berdanier CD (2010) Case Studies in Physiology and Nutrition, CRC Press.", "terms": {"2020-21 Term 2": {"AL01-LAB (8625)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Science Centre 190"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor LEUNG Lai Kwok"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}, "BL01-LAB (8626)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Science Centre 190"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor LEUNG Lai Kwok"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}, "CL01-LAB (4834)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Science Centre 190"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor LEUNG Lai Kwok"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}, "DL01-LAB (6017)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Science Centre 190"], "instructors": ["Dr. WONG Tsz Yan"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}}, "2021-22 Term 2": {"AL01-LAB (6454)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Science Centre 190"], "instructors": ["Professor CHEN Zhenyu"], "meetingDates": ["11/1", "18/1", "25/1"]}, "BL01-LAB (6480)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Science Centre 190"], "instructors": ["Professor CHEN Zhenyu"], "meetingDates": ["13/1", "20/1", "27/1"]}, "CL01-LAB (6580)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Science Centre 190"], "instructors": ["Professor CHEN Zhenyu"], "meetingDates": ["12/1", "19/1", "26/1"]}, "DL01-LAB (6547)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Science Centre 190"], "instructors": ["Dr. WONG Tsz Yan"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Essay test or exam": "40", "Lab reports": "50", "Others": "10"}}, {"code": "3010", "title": "Nutrition and Human Development", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "Pre-requisite: FNSC3030. Co-requisite: FNSC3002.", "description": "Since our body is experiencing changes in the life cycle, the nutrition needs would be different in various stages. This course describes the basis of these needs. Furthermore, the assessment of nutrient intake and physiology of our body in different life-cycle stages will be discussed. Prevention of chronic diseases through prudent dietary practices will also be introduced.\r", "outcome": "FNSC3010 contains eight parts:\r Part I: Introduction to the role of nutrition in the life cycle\r Part II: Maternal Nutrition\r Part III: Lactation and Human Milk\r Part IV: Nutrition during Infancy\r Part V:  Nutrition in Childhood\r Part VI: Nutrition in Adolescence\r Part VII: Nutrition during Adulthood\r Part VIII: Nutrition for the Elderly\r  The learning outcomes:\r PART I Introduction to the role of nutrition in the life cycle\r Objectives: After these lectures, a student should be able to\r • Define a nutrient and an essential nutrient and list the six classes of nutrients found in foods.\r • Define the dietary reference intakes (DRI) and state who develops the DRI.\r • Discuss to whom the DRI apply and how DRI are used.\r • Define the four categories of DRI namely Estimated Average Requirement (EAR), Recommended Dietary\r • Allowance (RDA), Adequate Intake (AI) and Tolerable Upper Intake Level (UL).\r • Describe the judgment factors involved in setting the energy and nutrient intake.\r • Identify the functions of brown fat tissue in energy metabolism.\r • List methods used in nutrition surveys and describe the kinds of information these surveys can provide.\r • Describe advantages and disadvantages of each method used in nutrition survey?\r • Define the malnutrition, undernutrition and overnutrition.\r • List the diet-planning principles and describe how each principle helps in diet planning.\r • Describe the major food groups and their nutrient profile and how to use food groups in planning a diet.\r • Describe how food pyramid (old or new) is developed and its limitations.\r • List the information you can expect to find on a food label.\r • Define the Daily Values and describe how they can help you meet health recommendation.\r  PART II Maternal Nutrition \r Objectives: After these lectures, a student should be able to\r • Describe the physiological changes in pregnancy.\r • Identify the mechanisms by which the plasma glucose level is regulated differently in pregnant women.\r • Explain the metabolic changes in macronutrients and the special needs for various nutrients.\r • Identify the behavioral as well as environmental conditions that may jeopardize the pregnancy.\r • Describe the influences of maternal dietary intake on the fetus. \r • Identify the health effect on the mother and the fetus for teenage pregnancy.\r • Assess the nutrition status during pregnancy.\r  PART III Lactation and Human Milk\r Objective: After these lectures, a student should be able to\r • Describe the physiology of lactation\r • Describe how RDAs are established for lactating women.\r • Explain how maternal nutrients and immune factors are transported to the milk.\r • Describe the features of human milk and the advantages over formulas.\r • Identify substances consumed by the mother inducing health problems to the infant.\r • Diagnose failure-to-thrive for breastfed infants.\r  PART IV Nutrition during Infancy\r Objectives: After these lectures, a student should be able to\r • Identify the major dietary factors influencing growth and maturation.\r • Use of Growth Chart for assessing nutrition and health condition in infancy.\r • Describe the development of digestion and absorption in early infancy.\r • Describe the nutrient needs during infancy.\r • Assess the nutrition status during infancy.\r  PART V Nutrition in Childhood\r Objectives: After these lectures, a student should be able to\r • Explain the nutrient needs for children at preschool and school age.\r • Discuss factors that affect food choice.\r • Assess the nutrition status during childhood.\r • Explain the possibility of chronic disease initiation arisen from childhood nutrition.\r • Identify the health effect of vegetarian diet on childhood.\r  PART VI Nutrition in Adolescence\r Objectives: After these lectures, a student should be able to\r • Assess the nutrition status in adolescence.\r • Describe the growth and development and the nutrient needs.\r • Describe rapid growth in adolescence and how it relates to an orderly process of sexual maturation.\r • Describe the body composition changes associated with adolescent growth and differences between male and \r  female.\r • Describe the specific nutrient requirement for adolescents to support their growth.\r • Describe the common nutritional disorders that adolescents are likely to have.\r • Describe how diet of the adolescents affects growth and physical performance and may influence behavior and \r  future risk of chronic diseases.\r • Describe the change in nutrient needs from childhood to adolescence.\r • Describe why an adolescent girl is more likely to develop an iron deficiency than is a boy.\r • Describe the criterion to assess the anemia.\r • Describe why iron, zinc and calcium are so important for adolescents.\r • Describe the problems associated with childhood/adolescent obesity and the strategies for prevention and \r  treatment.\r • Discuss the major factors in contribution to childhood/adolescent obesity. \r • Describe eating disorders, Anorexia Nervosa and Bulimic Nervosa, and the possible factors for these eating \r  disorders.\r  PART VII Nutrition during Adulthood\r Objectives: After these lectures, a student should be able to\r • Describe various dietary recommendations for population at risk of chronic diseases.\r • Describe dietary recommendation for general health.\r • Explain potential health problems caused by unhealthy diets.\r • Plan for a healthy lifestyle on the top of prudent dietary habits.\r • Describe the major factors in contribution to the heart diseases\r • Describe the major dietary factors that affect cancer development\r • Describe the major factors leading to hypertension.\r  PART VIII Nutrition in the Elderly\r Objectives: After these lectures, a student should be able to\r • Describe the physiological changes of ageing.\r • Describe the major theories of ageing.\r • Describe the anti-ageing theory of antioxidant and free radicals. \r • Describe the osteoporosis and concern in calcium deficiency.\r • Define the nutrient requirements for the elderly.\r • Explain the food selection of the elderly.\r  FNSC3010包含八個部分：\r 第一部分：介紹營養在其生命週期的作用 第二部分：產婦營養 第三部分：泌乳和人乳 第四部分：嬰兒期營養  第五部分：兒童營養 第六部分：青春期營養 第七部分：成年時營養 第八部分：長者營養  學習成果： 第一部分 介紹營養在生命週期的作用 目標：經過這些講座，學生應該能夠 •定義一種營養和必需的營養物質，並列出六大類食物中的營養物質發現。 •定義的膳食參考攝入量（DRI）和陳述誰制定DRI的發展和國家的DRI誰。\r •討論誰的DRI直接還原鐵的應用在誰身上和如何使用DRI。\r •定義DRI的四個類別，分別為確定四類，即直接還原鐵估計平均要求需要量（耳EAR），建議攝取量（RDA）反應，適宜攝入量（AI）和可耐受上的最高攝入量（UL）的。\r •描述的判決涉及的因素在確定能量和營養攝入。描述制定能量和營養攝入量的判斷因素。 •識別功能褐色脂肪組織在能量代謝裡的功能。 •列出營養調查所用的方法，並描述這些信息的各種統計調查可以提供的資料。 •描述的優點和缺點每種方法用於營養調查方法的優點和缺點？ •定義營養不良，營養不良營養不足和營養過剩。 •列出飲食規劃的原則，並說明每一項原則怎樣有助於飲食規劃。 •描述主要的食品集團物類別及其養分概況，以及如何利用食品集團物類別在規劃的飲食。 •闡述如何食物金字塔（舊或新的）如何發展是發達國家和它的局限性。 •列出的信息，你可以期望找到食物的標籤上你能找到的資訊。 •定義每日價值定義，並描述它們如何幫助您滿足符合健康的建議。  第二部分 母體營養 目標：經過這些講座，學生應該能夠 •描述在懷孕期間的生理變化。 •確定該機制的調節血糖水平在不同的懷孕婦女。識別在懷孕婦女中，血糖水平不同地調節的機制。 •解釋營養素的代謝變化和特殊需要的各種營養素的特殊需要。 •確定識別可能危及妊娠的行為以及環境條件情況可能危及妊娠。 •描述的影響產婦的飲食攝入對胎兒的影響。 •確定識別少女時期懷孕對母親和胎兒健康的影響母親和胎兒的少女懷孕。 •評估在懷孕期間的營養狀況。  第三部分 泌乳和人乳 目的：在這些講座，學生應該能夠 •哺乳期的生理描述 •描述地區發展局是如何建立為哺乳期婦女建立RDA。\r •解釋如何產婦解釋如何將母親的營養和免疫因素因子被輸運送到了牛奶母乳。 •描述人乳的特徵特點和人乳相比的優勢公式。 •確定物質消耗在母親誘導對嬰兒的健康問題。識別母親所消耗；會誘導嬰兒健康問題的物質。 •診斷故障對母乳喂養的嬰兒的生長遲緩繁衍。  第四部分營養， 嬰兒期營養 目標：經過這些講座，學生應該能夠 •確定主要飲食因素影響生長和成熟的飲食因素。 •使用生長曲線圖，來評估嬰兒期的營養和健康狀況處於起步階段。 •描述的嬰兒期發展消化和吸收的發展嬰兒早期。 •描述在嬰兒期的營養需要。 •評估嬰兒期的營養狀況。  第五部分 兒童營養 目標：經過這些講座，學生應該能夠 •解釋為兒童在學齡前和學齡兒童的營養需要在學齡前和學齡兒童。 •討論食物選擇的影響因素。 •評估在兒童時期的營養狀況。 •解釋兒童營養的可能性開始出現的導致慢性疾病的可能性，從兒童營養。 •確定健康影響的素食飲食對童年健康的影響。  第六部分 青少年營養 目標：經過這些講座，學生應該能夠 •評估在青春期的營養狀況。 •描述的生長發育和營養需求。 •描述在青春期裡的快速增長生長以及它怎樣和有秩序的性成熟過程扯上關係它與有秩序的過程性成熟。 •描述與青少年成長有關的身體成分的變化與青少年的成長和差異，男性和女性之間的差異。 •描述用以支持青少年成長具體的特殊營養要求，以支持青少年的成長。 •描述青少年可能有；常見的營養失調，青少年可能有。 •描述飲食如何影響增長的青少年的生長和物理性能，還可能影響人們的行為和未來患上慢性疾病未來的風險的慢性疾病。 •描述變化的從童年到青春期營養需要的變化在從童年到青春期。 •描述為什麼青春期女孩比男孩更容易患上缺鐵比是個男孩。 •描述的標準來評估貧血的標準。 •描述為什麼鐵，鋅，鈣是對非常重要的青少年來說是非常重要的。 •描述的兒童 /青少年肥胖相關的問題與兒童 /青少年肥胖與防治對策。\r •討論的導致兒童 /青少年肥胖問題的主要貢獻因素，兒童 /青少年的肥胖問題。\r •描述飲食失調，神經性厭食症和暴食症，和導致而這些因素可能飲食失調的可能因素。  第七部分營養成年時期營養 目標：經過這些講座，學生應該能夠 •描述了給有高風險患上慢性疾病的人的各種飲食建議的人口處於危險的慢性疾病。 •闡述的一般健康飲食的建議。 •解釋不健康的飲食習慣引起的潛在的性健康問題引起的不健康的飲食習慣。 •基於審慎的飲食習慣計劃一個健康的生活方式對頂部審慎的飲食習慣。 •描述導致心髒病的主要因素，貢獻心髒病。 •描述會影響癌症發展的主要膳食飲食因素會影響癌症發展。 •描述導致高血壓的主要導致高血壓的因素。  第八部分 中老年營養 目標：經過這些講座，學生應該能夠 •描述老年的生理變化。 •描述老化的主要理論。 •描述抗衰老的理論和自由基的和抗氧化劑的抗衰老理論。 •描述骨質疏鬆症和缺鈣所要的關注的。 •定義老年人的營養需求。 •解釋老年人的食物選擇。  FNSC3010包含八个部分：\r 第一部分：介绍营养在生命周期的作用 第二部分：产妇营养 第三部分：泌乳和人乳 第四部分：婴儿期营养  第五部分：儿童营养 第六部分：青春期营养 第七部分：成年时营养 第八部分：长者营养  学习成果： 第一部分 介绍营养在生命周期的作用 目标：经过这些讲座，学生应该能够 •定义一种营养和必需的营养物质，并列出六大类食物中的营养物质。 •定义膳食参考摄入量（DRI）和陈述谁制定DRI。\r •讨论DRI应用在谁身上和如何使用DRI。\r •定义DRI的四个类别，分别为估计平均需要量（EAR），建议摄取量（RDA），适宜摄入量（AI）和可耐受最高摄入量（UL）。\r •描述制定能量和营养摄入量的判断因素。 •识别褐色脂肪组织在能量代谢里的功能。 •列出营养调查所用的方法，并描述这些调查可以提供的资料。 •描述每种营养调查方法的优点和缺点.\r •定义营养不良，营养不足和营养过剩。 •列出饮食规划的原则，并说明每一项原则怎样有助于饮食规划。 •描述主要的食物类别及其养分概况，以及如何利用食物类别规划饮食。 •阐述食物金字塔（旧或新的）如何发展和它的局限性。 •列出食物卷标上你能找到的信息。 •定义每日价值，并描述它们如何帮助您符合健康建议。  第二部分 母体营养 目标：经过这些讲座，学生应该能够 •描述在怀孕期间的生理变化。 •识别在怀孕妇女中，血糖水平不同地调节的机制。 •解释营养素的代谢变化和各种营养素的特殊需要。 •识别可能危及妊娠的行为以及环境情况。 •描述产妇的饮食摄入对胎儿的影响。 •识别少女时期怀孕对母亲和胎儿健康的影响。 •评估在怀孕期间的营养状况。  第三部分 泌乳和人乳 目的：在这些讲座，学生应该能够 •哺乳期的生理描述 •描述如何为哺乳期妇女建立RDA。\r •解释如何将母亲的营养和免疫因子输送到母乳。 •描述人乳的特点和相比的优势公式。 •识别母亲所消耗；会诱导婴儿健康问题的物质。 •诊断母乳喂养的婴儿的生长迟缓。  第四部分 婴儿期营养 目标：经过这些讲座，学生应该能够 •确定主要影响生长和成熟的饮食因素。 •使用生长曲线图来评估婴儿期的营养和健康状况。 •描述婴儿期消化和吸收的发展。 •描述在婴儿期的营养需要。 •评估婴儿期的营养状况。  第五部分 儿童营养 目标：经过这些讲座，学生应该能够 •解释在学龄前和学龄儿童的营养需要。 •讨论食物选择的影响因素。 •评估在儿童时期的营养状况。 •解释儿童营养导致慢性疾病的可能性，。 •确定素食饮食对童年健康的影响。  第六部分 青少年营养 目标：经过这些讲座，学生应该能够 •评估在青春期的营养状况。 •描述生长发育和营养需求。 •描述在青春期里的快速生长以及它怎样和有秩序的性成熟过程扯上关系。 •描述与青少年成长有关的身体成分变化和男性女性之间的差异。 •描述用以支持青少年成长的特殊营养要求，。 •描述青少年可能有；常见的营养失调，。 •描述饮食如何影响青少年的生长和物理性能，还可能影响人们的行为和未来患上慢性疾病的风险。 •描述从童年到青春期营养需要的变化。 •描述为什么青春期女孩比男孩更容易患上缺铁。 •描述评估贫血的标准。 •描述为什么铁，锌，钙对青少年来说是非常重要的。 •描述儿童 /青少年肥胖相关的问题与防治对策。\r •讨论导致儿童 /青少年肥胖问题的主要因素。\r •描述饮食失调，神经性厌食症和暴食症，和导致这些饮食失调的可能因素。  第七部分成年期营养 目标：经过这些讲座，学生应该能够 •描述给有高风险患上慢性疾病的人的各种饮食建议。 •阐述一般健康饮食的建议。 •解释不健康的饮食习惯引起的潜在性健康问题。 •基于审慎的饮食习惯计划一个健康的生活方式。 •描述导致心脏病的主要因素。 •描述会影响癌症发展的主要饮食因素。 •描述导致高血压的主要因素。  第八部分 中老年营养 目标：经过这些讲座，学生应该能够 •描述老年的生理变化。 •描述老化的主要理论。 •描述自由基和抗氧化剂的抗衰老理论。 •描述骨质疏松症和缺钙所要关注的。 •定义老年人的营养需求。 •解释老年人的食物选择。", "syllabus": "PART I INTRODUCTION TO THE ROLE OF NUTRITION IN THE LIFE CYCLE\r 1.1 Overview of 40 nutrients Dietary Reference Intakes (DRIs)\r 1.2 Food groups (types)\r 1.3 Nutritional assessment and Food labels\r 1.4 Nutrition Transition in China\r  PART II MATERNAL NUTRITION\r 2.1 Physiology of pregnancy\r 2.2 Metabolism of lipids, carbohydrates and proteins in pregnancy\r 2.3 Effect of maternal diet on fetal development\r 2.4 Nutrient needs for pregnancy\r 2.5 Harmful substances in breast milk\r  PART III LACTATION AND HUMAN MILK\r 3.1 Physiology of lactation\r 3.2 Nutrients in human milk\r 3.3 Non-Nutrients in human milk\r 3.4 Nutrient recommendations for lactating women\r 3.5 Breast feeding vs bottle feeding\r  PART IV NUTRITION DURING INFANCY\r 4.1 Growth and maturation\r 4.2 Nutrient needs of infants – energy, protein, carbohydrate, lipids, minerals, vitamins\r 4.3 Nutrient comparison – Human milk and formulas\r 4.4 Food choice for infants at different stages of development\r  PART V NUTRITION IN CHILDHOOD\r 5.1 Physical growth and its assessment during childhood\r 5.2 Baby Formula Standardization\r 5.3 Nutrient needs of children – preschool vs school age\r  PART VI NUTRITION IN ADOLESCENCE\r 6.1 Adolescent growth and development\r 6.2 Nutritional assessment and requirements\r 6.3 Eating disorders\r 6.4 Childhood and adolescent obesity\r 6.5 Obesity treatment\r  PART VII NUTRITION IN THE ADULT\r 7.1 Planning for a healthy lifestyle\r 7.2 Nutrition requirements in general\r 7.3 Dietary recommendations for reducing heart disease and cancers\r 7.4 A nutritional problem – an imbalance of sodium and potassium intake in Chinese\r  PART VIII NUTRITION FOR THE ELDERLY\r 8.1 Physiological aspects of ageing\r 8.2 A nutritional problem in elderly – calcium deficiency\r 8.3 Nutrient requirements of older people\r 8.4 Food selection of elderly\r 8.5 Programs for meeting needs of the elderly", "required_readings": "Text Books:\r 1. Nutrition though the life cycle 4th Ed, Judith E. Brown, 2010, Wadsworth Publishing Inc.\r 2. Nutrition throughout the life cycle, Worthington-Roberts BS and William SR, 2002. McGraw-Hill Book Company\r 3. Nutrition across the life span, Mitchell MK, 2003. WB Saunders Company", "recommended_readings": "Reference Books:\r 1. Understanding Nutrition, Whiteney EN and Rolfes SR, 2010. Wadsworth Publishing Inc.\r 2. Modern Nutrition in Health and Diseases (8th edition), Shils ME, Olson JA and Shike M, 2005. Lea and Febiger\r 3. Nutritional biochemistry and metabolism, with clinical applications, Linder MC, 1991 Appleton and Lange\r 4. Understanding Normal and Clinical Nutrition. (8th edition), Rofles SR, Pinna K and Whitney E, 2009. Wadsworth \r  Publishing Inc.", "terms": {"2020-21 Term 2": {"--LEC (6957)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor LEUNG Lai Kwok"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 2": {"--LEC (4874)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Science Centre L1"], "instructors": ["Dr. WONG Tsz Yan, \n\rProfessor CHEN Zhenyu"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Essay test or exam": "50", "Others": "5", "Project": "10", "Short answer test or exam": "35"}}, {"code": "3030", "title": "Nutritional Biochemistry", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "", "description": "This component will provide students with the background required to appreciate the biochemical aspects of nutrition and the impact of nutrition-related factors on normal human biochemistry.  Areas covered include the digestion and absorption of nutrients, energy intake and expenditure, nutrition and metabolism of carbohydrate, cholesterol synthesis and homeostasis, metabolism of dietary fats and their effect on lipoprotein cholesterol, nitrogen metabolism, and minerals and vitamins and their roles in biochemical processes.\r", "outcome": "FNSC3030 contains six parts:\r PART I Energy and metabolism, intake and expenditure\r PART II Nutrition and metabolism of carbohydrates \r PART III Nutrition and metabolism of proteins \r PART IV Nutrition and metabolism of vitamins \r PART V  Nutrition and metabolism of fats \r PART VI  Metabolism of cholesterol and lipoproteins \r  The learning outcomes:\r PART I Energy intake, expenditure and metabolism\r Objectives: After these lectures, a student should be able to\r • describe changes in body composition from birth to adulthood.\r • define the basal metabolic rate (BMR), resting metabolic rate (RMR), and diet-induced thermogenesis (DIT).\r • describe the methods used in estimating BMR and RMR.\r • calculate the energy content of a mixed diet\r • identify the functions of brown fat tissue in energy metabolism.\r • describe the role of carbohydrate in energy metabolism.\r  PART II Nutrition and metabolism of carbohydrates\r Objectives: After these lectures, a student should be able to\r • identify the mechanisms by which the plasma glucose level is regulated.\r • define the glycemic index and explain how it is useful in the control of diabetes mellitus.\r • outline the metabolic differences between glucose and fructose.\r • describe the influences of dietary fructose on plasma LDL-cholesterol, HDL-cholesterol and triglyceride and explain the possible mechanisms involved.\r • define insoluble and soluble fibers, and give some examples and source of each.\r • identify the health effect of dietary fibers and explain the possible mechanisms involved.\r • explain the biochemical basis of major inborn disorders of carbohydrate metabolism.\r • list some major commercial artificial sweeteners and some specific characteristics of each.\r  PART III Nutrition and metabolism of proteins\r Objectives: After these lectures, a student should be able to\r • define the essential amino acids.\r • define nitrogen balance and its application in the determination of protein requirement.\r • identify the general steps by which amino acids are converted to glucose in fasting and starvation.\r • explain the biochemical basis of homocystinuria and its atherogenic effect.\r • explain the biochemical basis of phenylketonuria.\r • describe the differences between animal and plant proteins.\r • identify the positive and negative effects of vegetarian diets.\r  PART IV Nutrition and metabolism of vitamins\r Objectives: After these lectures, a student should be able to\r • describe the functions of fat-soluble vitamins.\r • describe the structures and functions of B vitamins.\r • define the term coenzymes and their role in energy metabolism.\r • explain why some vitamins are essential to energy metabolism.\r • describe some common biochemical tests to assess the vitamin status.\r • describe the symptoms of various vitamin deficiency diseases.\r  PART V  Nutrition and metabolism of fats\r Objective: After these lectures, a student should be able to\r • describe the nomenclature of lipids used in nutrition.\r • describe the characteristics of omega-3, omega-6 and omega-9 fatty acids.\r • identify the characteristic features of vegetable oils, fish oil and animal fats, and their potential nutritional significance.\r • identify the biochemical pathway by which linoleic acid is converted to arachidonic acid.\r • identify the biochemical pathway by which -linolenic acid is converted to docosahexaenoic acid.\r • identify the biochemical pathway by which oleic acid is converted to eicosatrienoic acid.\r • list the chemical reactions and enzymes involved in chain-elongation and -desuration.\r • identify the enzymes and biochemical pathway in fatty acid synthesis.\r • understand the mechanisms by which dietary fatty acid composition affects lipogenesis.\r • describe the possible health effects of trans fatty acids.\r • list some common fat substitutes and the proposed use in food industry.\r • explain why olestra is neither digested nor absorbed.\r  PART VI  Nutrition and metabolism of cholesterol and lipoproteins\r Objectives: After these lectures, a student should be able to\r • identify the major dietary factors influencing the level of plasma cholesterol.\r • identify the biochemical pathway by which cholesterol is synthesized and degraded.\r • describe the roles of cholesterol-7-hydroxylase and acyl CoA: cholesterol acyltransferase (ACAT) in metabolism of cholesterol.\r • classify the inborn lipoprotein disorders.\r • describe the processes by which cholesterol is digested, mobilized and transported in the body.\r • define the hyperlipoproteinemia.\r • understand the mechanism by which dietary plant sterols decrease the risk of atherosclerosis.\r  FNSC3030 這科包含六個部份\r 第一部份　能量與代謝，攝取與消耗 第二部份　碳水化合物的營養價值與代謝 第三部份　蛋白質的營養價值與代謝 第四部份　維生素的營養價值與代謝 第五部份　脂肪的營養價值與代謝 第六部份　膽固醇及脂蛋白的代謝  學習成果： 第一部份　能量與代謝，攝取與消耗 目標：完成此部份後，學生應該能夠：  瞭解人體組成部份從出生到成年的變化  區分「基礎代謝率」（BMR）、「靜息代謝率」（RMR）及「攝食生熱效應」（DIT）\r  瞭解測定「基礎代謝率」及「靜息代謝率」的方法  計算混合飲食中的熱量  識別在能量代謝中褐色脂肪的作用  瞭解碳水化合物在能量代謝中的作用  第二部份　碳水化合物的營養價值與代謝 目標：完成此部份後，學生應該能夠：  識別調控血糖水平的機制  界定升糖指數及其在糖尿病控制中的作用  概述葡萄糖及果糖代謝的分別  叙述食用果糖對血液中的低密度脂蛋白膽固醇、高密度脂蛋白膽固醇及三酸甘油酯的影響幷解釋當中的機制  闡釋水溶性及非水溶性纖維並認識其中的一些例子及來源  識別食用纖維對健康的影響及當中的機制  解釋主要的先天性碳水化合物代謝紊亂的生化基礎  列出一些主要的商用人造代糖及其一些主要特性  第三部份　蛋白質的營養價值與代謝 目標：完成此部份後，學生應該能夠：  界定「必需氨基酸」  闡釋「氮平衡」及其在決定脂肪需要量中的用途  識別禁食及飢餓時氨基酸轉化成葡萄糖的一般代謝過程  解釋高胱氨酸尿症的生化基礎及其致粥瘤性作用  解釋苯丙酮尿症的生化基礎  敍述動物與植物蛋白的分別  識別素食的正面及負面的影響  第四部份　維生素的營養價值與代謝 目標：完成此部份後，學生應該能夠：  敍述脂溶性維生素的功能  敍述維生素B群的結構及功能\r  界定「輔酶」及其在能量代謝中的角色  解釋為何一些維生素對能量代謝特別重要  敍述一些評估身體中的維生素含量的生化檢測方法  叙述不同維生素缺乏症的病徵  第五部份　脂肪的營養價值與代謝 目標：完成此部份後，學生應該能夠：  闡釋營養學中脂肪的命名方法  敍述Omega-3、Omega-6及Omega-9不飽和脂肪酸的特性\r  認識植物油、魚油和動物脂肪的特性及其潛在營養價值的重要性  明白亞油酸在體內被轉化成花生四稀酸的生化反應  明白亞麻酸在體內被轉化成二十二碳六稀酸的生化反應  認識從油酸轉化成二十碳三稀酸的生化反應  列出鏈延長和去飽和作用中所涉及的化學反應及酶  認識脂肪合成中的酶及生化反應  理解膳食脂肪酸的組成影響體內脂肪合成的機理  叙述反式脂肪酸對健康的影響  列出一些常見的脂肪替代品及其在食品工業中的應用  解譯為何蔗糖聚酯無法消化或吸收  第六部份　膽固醇及脂蛋白的代謝 目標：完成此部份後，學生應該能夠：  認識主要的飲食因素對血液中膽固醇的影響  認識膽固醇合成及降解過程中的生化反應  敍述膽固醇7α羥化酶和人醯基輔酶A：膽固醇醯基轉移酶在膽固醇代謝中的角色\r  將先天性脂蛋白代謝紊亂分類  敍述膽固醇的吸收運送和代謝  界定高脂蛋白血症  理解攝入植物固醇减低患動脉粥樣硬化風險的機理", "syllabus": "PART I ENERGY METABOLISM, INTAKE AND EXPENDITURE\r 1.1 Composition of human body\r 1.2 Energy content of foods\r 1.3 Energy needs\r 1.4 Energy metabolism\r  PART II NUTRITION AND METABOLISM OF CARBOHYDRATES\r 2.1 Glucose metabolism\r 2.2 Postprandial glucose metabolism and glycemic index of complex carbohydrate\r 2.3 Metabolism of fructose and galactose compared with that of glucose\r 2.4 Inborn errors of metabolism in carbohydrate\r 2.5 Dietary fiber\r 2.6 Artificial sweeteners\r  PART III NUTRITION AND METABOLISM OF PROTEINS\r 3.1 Overview of nutritional aspects of amino acids and proteins\r 3.2 Nitrogen balance\r 3.3 Metabolism of amino acids in fasting and starvation\r 3.4 Inborn errors of metabolism in proteins and amino acids\r 3.5 Animal and plant proteins\r  PART IV NUTRITION AND METABOLISM OF VITAMINS\r 4.1 Nomenclature, properties, and sources of vitamins\r 4.2 The role of vitamins in metabolism of carbohydrate, fats and protein\r 4.3 Biochemical evaluation of vitamin status\r 4.4 Thiamin (B1), riboflavin (B2), Niacin (B3), Pantothenic acid (B5), Folate, Vitamin B12, Biotin, Vitamin C, Vitamin A, Vitamin D, Vitamin E, Vitamin K\r  PART V NUTRITION AND METABOLISM OF FATS\r 5.1 Overview of lipids\r 5.2 Essential fatty acid metabolism – desaturation and elongation\r 5.3 Dietary fatty acids and lipogenesis\r 5.4 Omega-3 fatty acids and fish oil\r 5.5 Omega-3 fatty acids and brain development\r 5.6 Trans fatty acids\r 5.7 Fat substitutes\r  PART VI Nutrition and metabolism of cholesterol and lipoproteins\r 6.1 Cholesterol synthesis\r 6.2 Cholesterol catabolism\r 6.3 Lipoproteins and their structure\r 6.4 Lipoproteins metabolism and hyperlipidemia\r 6.5 Dietary fats, cholesterol and coronary heart disease\r 6.6 Traditional hypolipidemic foods\r  第一部份　能量與代謝，攝取與消耗 1.1 人體的組成部份\r 1.2 食物中的能量\r 1.3 能量的需求\r 1.4 能量的代謝\r  第二部份　碳水化合物的營養價值與代謝 2.1 葡萄糖的代謝\r 2.2 餐後複合碳水化合物的葡萄糖代謝及血糖指數\r 2.3 比較果糖及半乳糖的代謝與葡萄糖的代謝\r 2.4 先天性碳水化合物代謝紊亂\r 2.5 食用纖維\r 2.6 人造代糖\r  第三部份　蛋白質的營養價值與代謝 3.1 氨基酸及蛋白質營養價值概觀\r 3.2 氮平衡\r 3.3 禁食及飢餓中氨基酸的代謝\r 3.4 先天性蛋白質及氨基酸代謝紊亂\r 3.5 動物及植物蛋白質\r  第四部份　維生素的營養價值與代謝 4.1 維生素的命名、特性及攝取來源\r 4.2 維生素在碳水化合物代謝、脂肪代謝及蛋白質代謝中的作用\r 4.3 體內維生素含量的生化檢測\r 4.4 硫胺素(B1)、核黃素(B2)、烟鹼酸(B3)、泛酸(B5)、葉酸、維生素B12、生物素、維生素C、維生素A、維生素D、維生素E、維生素K\r  第五部份　脂肪的營養價值與代謝 5.1 脂肪概觀\r 5.2 主要的脂肪酸代謝—去飽和及鏈延長作用\r 5.3 飲食中的脂肪酸對體內脂肪合成的影響\r 5.4 Omega-3脂肪酸及魚油\r 5.5 Omega-3脂肪酸及腦部發展\r 5.6 反式脂肪酸\r 5.7 脂肪替代品\r  第六部份　膽固醇及脂蛋白的代謝 6.1 膽固醇的合成\r 6.2 膽固醇的代謝\r 6.3 脂蛋白及其結構\r 6.4 脂蛋的的代謝和高脂血症\r 6.5 膳食脂肪、膽固醇與冠心病\r 6.6 傳統的降血脂食物", "required_readings": "Rolfes SR, Pinna K, Whitney E. (2008) Understanding Normal and Clinical Nutrition, Thomson and Wadsworth", "recommended_readings": "Whitney EN and Rolfes SR (2002) Understanding Nutrition (9th ed), West Publishing Company, St Paul, MN, USA\r  Linder MA (1991) Nutritional Biochemistry and Metabolism with Clinical Application (2nd ed), Elsevier Science Publishing Company, New York, USA\r  Brody M (1999) Nutritional Biochmeistry, Academic Press, New York, USA", "terms": {"2020-21 Term 1": {"--LEC (7686)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor LEUNG Lai Kwok"], "meetingDates": ["11/9", "18/9", "25/9"]}}, "2021-22 Term 1": {"--LEC (5757)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Science Centre L1"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor CHOW Hei Man"], "meetingDates": ["10/9", "17/9", "24/9"]}}}, "assessments": {"Essay test or exam": "70", "Short answer test or exam": "30"}}, {"code": "3110", "title": "Food Chemistry and Analysis", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "Co-requisite: FNSC3001.", "description": "This course will cover the basic chemical and analytical aspects of major food components (water, carbohydrates, lipids and proteins) and minor food components (vitamins, minerals, pigments and food additives including flavors, colorants and preservatives). Emphasis will be made on the chemical reactions and changes in these food constituents during processing, handling and storage. The principles and applications of chemical and instrumental analysis of food will be illustrated. The actions and applications of enzymes in food manufacture and food spoilage will be discussed.\r", "outcome": "This course contributes as one of the core competencies in food science. \r After the students have finished the learning activities in FNSC3110, they will be able to:\r  Understand the chemistry underlying the properties and reactions of various food components\r  Have sufficient knowledge of food chemistry to control reactions in foods\r  Understand the major chemical reactions that limit shelf life of foods\r  Understand the principles behind analytical techniques associated with food\r The detailed content of the course is as follows:\r Teaching: 37 lecture hours and mid-term examination: 2 lecture hours\r I. Water  [2 lectures]\r  Water structure: physical characteristics and water-solute interactions\r  Water activity: definition, sorption isotherms\r  Reaction rates and water content: physical changes, chemical reactions and microbial growth\r  Importance of water activity\r II. Food Carbohydrates [6 lectures]\r   Classification of food carbohydrates\r   Chromatographic analysis of carbohydrates\r   Food-related chemical reactions of carbohydrates\r   Functional properties of food polysaccharides\r   Dietary fiber: definition, constituents and methods of analysis\r III. Food Lipids [5 lectures]\r  Fatty acids: nomenclature and saturation\r  Analysis of lipids\r  Chemical degradation: rancidity (oxidation) and effects of heat\r  Physical properties of triglycerides\r  Emulsions and emulsifiers \r  Fat replacers and mimetics\r  Fats and oils in the marketplace\r  Hydrogenation and Trans fatty acids\r IV. Food Proteins [5 lectures]\r  Protein classification and structure\r  Protein denaturation\r  Chemical changes in proteins\r  Functional properties of proteins\r  Food proteins from animal and plant origins\r V. Food Additives and Contaminants [5 lectures]\r   Food additives: purposes, definitions and functional categories\r   Local issues on food additives\r   Selected examples of food additives: their properties and applications\r   Contaminants (incidental additives)\r VI. Food Colorants [4 lectures]\r  Natural food pigments\r  Tetrapyrrole pigments - myoglobin and chlorophyll\r  Isoprenoid derivatives - carotenoids\r  Benzopyran derivatives – anthocyanins and  flavonoids\r  Artificial/synthetic colorants\r  Certified color dyes and lakes\r  Regulatory and safety aspects\r VII. Micronutrients [5 lectures]\r   Vitamins: sources, degradation and functional properties\r  Fat-soluble (Vitamin A and E)\r  Water-soluble (C and B1)\r   Chemical analysis\r  Vitamins: colorimetric and HPLC methods\r  Mineral: ashing procedures and atomic absorption spectrophotometry  (AAS)\r VIII. Food Enzymes [5 lectures]\r  Classification and numbering system\r  General applications of food enzymes\r  Specific examples of food enzymes\r  Hydrolysis of starch by amylases\r  Pectic enzymes and fruit juice processing\r  Proteases in milk and cheese production\r  Polyphenol oxidases and enzymatic browning\r  Lipases and lipoxygenases for flavor and off-flavors development", "syllabus": "1. Water\r 2. Food Carbohydrates\r 3. Food Proteins\r 4. Major Food Additives\r 5. Food Colorants\r 6. Food Enzymes\r 7. Minerals and Vitamins", "required_readings": "1. DeMan J.M. (1999) Principles of Food Chemistry, 3rd edition, An Aspen Publication.", "recommended_readings": "1. Owusu-Apenten, R. (2005) Introduction to Food Chemistry, CRC Press.\r 2. Sikorski Z.E. (2007) Chemical and Functional Properties of Food Components, 3rd edition, CRC Press.\r 3. McWilliams, M. (2008) Foods: Experimental Perspectives, 6th edition, Pearson Prentice Hall.\r 4. Demodaran et al. (2008). Fennema’s Food Chemistry, 4th edition, CRC Press.", "terms": {"2020-21 Term 1": {"--LEC (8049)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor CHEUNG Chi Keung Peter"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}}, "2021-22 Term 1": {"--LEC (4783)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["William M W Mong Eng Bldg LT"], "instructors": ["Professor CHEUNG Chi Keung Peter"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}, "assessments": {"Essay test or exam": "60", "Short answer test or exam": "40"}}, {"code": "3180", "title": "Food Microbiology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "", "description": "This course considers the microorganisms in food safety, spoilage, and production. Topics discussed include food-borne disease agents and their control, food sanitation/hygiene, growth parameters of food spoilage agents, destruction of microbes in food, food fermentations, and the biotechnology of microbes as a resource for the food industry.", "outcome": "The students should learn the following: • To obtain an integrated picture of food microbiology  • To learn to address the problems as a food microbiologist • To learn to address the\"how\" and \"why\" and \"what can we do about it\" questions regarding the activities of microbes in food.  • To understand that there is no simple answers to these questions or simple solutions to the problems we are studying • To learn to make the best decisions among the many alternatives and to designing the most creative new approaches.  • To learn to analyse a situation, e.g. a food poisoning outbreak, hypothesize what would have happened to cause the situation and suggest an improvement.  Part I: Introduction Introduction to Food Microbiology What food microbiology should include the following of food-borne microbes: Ecology Physiology Epidemiology Pathology Food microbiology includes food-borne diseases, food spoilage, microbial foods and food fermentation. The food supply-chain and its relationship to food-borne problems The basic biology of various microorganisms--fungi, bacteria, viruses To know the important microbes in foods.  Part II: Food-borne disease Introduction to Food-Borne Disease  To distinguish food-borne infection and intoxication To know the action of toxins on the gasterointestinal cells To distinguish various kinds of toxin and their actions To understand the importance of growth and survival of different kinds of microorganisms in our environment as related to food-borne diseases Enterobacteriaceae and Related Bacteria in Foods For the bacterial species discussed, the students will learn the biology, ecology, pathology, disease pictures, transmission paths, and control measures Bacteria of this section: Salmolnella enterica Escherichis coli Shigella spp. Campylobacter jejuni Vibrio cholera Vibrio parahaemolyticus Yersinia spp. To learn to analyze the situations that would allow these bacteria to cause problems Spore-Forming Bacteria in Food-Borne Disease  To understand the properties of endospores To learn the biology, ecology, pathology, disease pictures, transmission paths, and control measures of the endospore formers The endospore formers are: Clostridium perfringens Clostridium botulinum Bacillus cereus To learn to analyze the situations that would allow the endospore formers to cause problems Staphylococcus aureus  To learn that S. aureus is a typical food-borne intoxication causing bacteria To learn the biology, ecology, pathology, disease pictures, transmission paths, and control measures of S. aureus Emerging Bacterial Pathogens  To understand the factors leading to the emergence of some bacteria as food-borne pathogens To learn the biology, ecology, pathology, disease pictures, transmission paths, and control measures of the emerging bacterial pathogens including: Listeria monocytogenes Escherichia coli O157:H7 Yersinia enterocolitica Aeromonas hydrophila Vibrio vulnificus Viral Diseases Transmitted by Food and Water To distinguish the characteristics of food-borne diseases caused by viruses and bacteria To learn the biology, ecology, pathology, disease pictures, transmission paths, and control measures of the food-borne viruses  Protozoa and Parasitic Worms Found in Food To learn the biology, ecology, pathology, disease pictures, transmission paths, and control measures of Protozoa and Parasitic Worms Fungal Toxins in Food To understand the kind of fungal toxins in foods and their actions  Part III: Introduction to Epidemiological investigation To learn: Aims of epidemiological investigation Application of investigation results Essential steps for investigation of food-borne disease outbreaks The things to look for in an investigation To know how to investigate food-borne disease outbreaks   Part IV: Parameters of microbial growth and food spoilage To learn the effects of the environmental parameters on growth and survival of microorganisms Temperature Effects on Microbial Growth and Survival  Thermal Destruction Kinetics and Calculations  Water Activity as a Parameter of Survival and Growth  Acids as Food Preservatives  Effect of Atmosphere on Microbial Growth and Survival  To acquire the ability to analyze food for spoilage possibilities  To learn Microbial Food Spoilage Patterns  To understand Controversial Preservation Methods: Nitrite, Antibiotics, and Food Irradiation  Part V: Microbial and fermented foods  To understand why we make fermented foods To understand various kinds of food fermentations Lactic Acid Bacteria and Lactic Fermentations  Fermentations Involving Extracellular Hydrolases And Other Complex Fermentations   Special topics:  The students will form groups of 5-6. To learn to collect information, to perform field works of interviews and industry visits for the following topics:  1. The roles of HK SAR Government agencies to food safety and food hygiene in HK SAR I: Health, Wealth and Food Bureau 2. The roles of HK SAR Government agencies to food safety and food hygiene in HK SAR II: Food and Environmental Hygiene Department and Centre for Food Safety 3. The roles of HK SAR Government agencies in HK SAR III: “Health Department”, “Agriculture, Fishery, and Conservation Department”, “Government Laboratory”, etc. 4. Food safety and public health in HK SAR : Import controls 5. Food safety in Food Supplies in HK SAR I : Central supplies—slaughter houses, vegetable whole-sales, fishery whole-sales 6. Food safety in Food Supplies in HK SAR II: Food manufacturers—cooked foods for consumption in a short time 7. Food safety in Food Supplies in HK SAR III: Food manufacturers—foods for long-term storage 8. Food safety in Food Supplies in HK SAR IV: Retails—markets and supermarkets 9. Food safety in food service premises in HKSAR: Fast-food and other take-out food stalls; Restaurants  To learn and practice:  1. Collect information and data relating to the topic—anything in the specific area that may relate to food safety and hygiene  2. Critically analyze the information and data  3. Generalize and hypothesize the situation, relate it to the situations in other countries if necessary 4. Compile examples to support your analysis 5. Summarize the key observations and analyses 6. Suggest any improvement", "syllabus": "1. Foodborne diseases overview 2. Enterobacteriaceae  3. Campylobacter 4. Vibrio 5. Listeria 6. Spore-Forming Bacteria 7. Staphylococcus aureus 8. Emerging Bacterial Pathogens 9. Viral Diseases Transmitted by Food and Water 10. Protozoa, Parasites & Fungal Toxins in Food 11. Investigation of Food-borne Diseases 12. Temperature Effects on Growth & Survival 13. HACCP and Food Safety Systems 14. Food Safety Cases Discussions 15. Thermal treatments, Acids as food preservatives 16. Water Activity Effects on Growth & Survival 17. Atmosphere Effects on Growth & Survival 18. Microbial Spoilage 19. Food Fermentations 20. Special topic presentation", "required_readings": "Adams, M. R. & Moss, M. O. 2008. Food microbiology. rd 3d., Royal Society of Chemistry, Cambridge, UK.", "recommended_readings": "1. Montville, T.J. and Mathews K.R. 2008. Food mcirobiology: an introduction. 2nd ed., ASM Press, D.c. 2> Ray, B and Bhunia A. 2008. Fundamental food mircobiology. 4th ed., Boca Raton: CRC Press.", "terms": {"2020-21 Term 1": {"--LEC (6301)": {"startTimes": ["12:30", "11:30"], "endTimes": ["13:15", "13:15"], "days": [3, 1], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Dr. WONG Tsz Yan", "Dr. WONG Tsz Yan"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12", "7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}, "2020-21 Term 2": {"--LEC (6457)": {"startTimes": ["11:30", "10:30"], "endTimes": ["12:15", "12:15"], "days": [4, 1], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Dr. LI Yuk Man", "Dr. LI Yuk Man"], "meetingDates": ["14/1", "21/1", "28/1", "4/2", "11/1", "18/1", "25/1", "1/2", "8/2"]}}, "2021-22 Term 2": {"--LEC (4713)": {"startTimes": ["11:30", "10:30"], "endTimes": ["12:15", "12:15"], "days": [4, 1], "locations": ["Science Centre L1", "Science Centre L1"], "instructors": ["Dr. LI Yuk Man, \n\rProfessor XU Chunliang", "Dr. LI Yuk Man, \n\rProfessor XU Chunliang"], "meetingDates": ["13/1", "20/1", "27/1", "10/1", "17/1", "24/1"]}}}, "assessments": {"Examination": "50", "Presentation": "20", "Short answer test or exam": "30"}}, {"code": "4001", "title": "Food Science Laboratory II", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "Pre-requisite: FNSC4110. Co-requisite: FNSC4170.", "description": "This is an integrated laboratory course for the food product production, which is composed of three interrelated areas, namely, food processing technology, food product development and food quality control. Through the food processing practicum, the principles, techniques and applications of conventional food processing technologies and equipment are introduced. Topics include frying, packaging, dehydration, concentration, sterilization, fermentation, protein coagulation, emulsification, baking, dough formation and candy making. This course also covers the techniques in formal sensory evaluation, and the principles of the common instruments for physical and chemical analyses of food quality. Besides, it contains an interactive workshop to explore the procedures in food product development in the contemporary catering and food industries.\r", "outcome": "This is a multidisciplinary laboratory course comprising of food processing practicum, sensory evaluation experiment, and the workshops on food hygiene and safety, food product development and quality control. After the students have finished these learning activities, they should be able to:1. understand the principles of food processing technologies and their applications in different kinds of food production2. understand the theories and recognize the critical techniques of various food unit operations3. master the knowledge in the production process of daily food products4. recognize the importance of good hygiene standard and safety measures in food production plant and laboratory5. select and setup different sensory tests based on specific objectives, and use the statistical method for data analyses appropriately6. identify the quality requirements for food products, and their corresponding examination procedures7. comprehend the different stages involved in food product development, and apply the appropriate knowledge in the real situation", "syllabus": "Experiment 1. Soy Products and Potato ChipsExperiment 2. Milk Powder, Freeze Fried Vegetables and Concentrated JuiceExperiment 3. Sausage, Mayonnaise and Canned SoupExperiment 4. Pastry and PastaExperiment 5. Pastille and Ice creamExperiment 6. Vinegar and YogurtExperiment 7. Sensory Evaluation I: Discrimination Tests: Pair Comparison (AFC); Duo-Trio and Triangle TestsExperiment 8. Sensory Evaluation II: Threshold Detection and Time-intensity EvaluationsWorkshop 1. Food Product DevelopmentWorkshop 2.  Food QC Experiments and Instrument DemonstrationWorkshop 3. Safety and Hygiene in Food Processing Plant", "required_readings": "", "recommended_readings": "References for each experiment are listed in the laboratory manual provided", "terms": {"2020-21 Term 2": {"AL01-LAB (7558)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Science Centre 394"], "instructors": ["Mr. CHU Kin Kan Astley"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}, "BL01-LAB (7559)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Science Centre 394"], "instructors": ["Mr. CHU Kin Kan Astley"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}, "2020-21 Summer Session": {"-L01-LAB (1176)": {"startTimes": ["14:30", "14:30"], "endTimes": ["18:15", "18:15"], "days": [2, 4], "locations": ["Science Centre 394", "Science Centre 394"], "instructors": ["Dr. WONG Tsz Yan", "Dr. WONG Tsz Yan"], "meetingDates": ["18/5", "25/5", "1/6", "8/6", "15/6", "22/6", "29/6", "20/5", "27/5", "3/6", "10/6", "17/6", "24/6"]}}, "2021-22 Term 1": {"-L01-LAB (6674)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Science Centre 394"], "instructors": ["Dr. WONG Tsz Yan"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}, "2021-22 Term 2": {"AL01-LAB (6533)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Science Centre 394"], "instructors": ["Mr. CHU Kin Kan Astley"], "meetingDates": ["11/1", "18/1", "25/1"]}, "BL01-LAB (6534)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Science Centre 394"], "instructors": ["Mr. CHU Kin Kan Astley"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Essay test or exam": "50", "Lab reports": "10", "Others": "40"}}, {"code": "4002", "title": "Nutritional Science Laboratory II", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Laboratory", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "Co-requisite: FNSC4120.", "description": "The laboratory course provides practical skills acquire for works of clinical and community nutrition.  The topics in this laboratory course require students to apply science knowledge into practice.\r", "outcome": "After taking this laboratory course, students will be able to:\r -Design therapeutic diets for patients with diseases and special needs\r -Conduct nutrition/health survey, including use of the software SPSS to manage and statistically analyze data, for diagnoses of community nutrition problems\r -Perform basic individual counseling and community nutrition screening\r -Skills of developing educational material for nutrition promotion and delivering health messages to the public", "syllabus": "Lab 1: Therapeutic diets (weight management, diabetes, cardiovascular diseases)\r Lab 2: Therapeutic diets (gastrointestinal disorders, oncology, HIV disease)\r Lab 3: Therapeutic diets (pulmonary, renal, trauma/burns/surgery)\r Lab 4: Therapeutic diets (neurologic disorders, nutrition support)\r Lab 5: Nutrition diagnoses\r Lab 6: Case studies\r Lab 7: Use of SPSS (descriptive analyses)\r Lab 8: Use of SPSS (statistical analyses)\r Lab 9: Individual counseling and nutrition screening\r Lab 10: Developing educational material and delivering health messages", "required_readings": "", "recommended_readings": "SPSS Survival Manual: a step by step guide to data analysis using SPSS for Windows / Julie Pallant.", "terms": {"2020-21 Term 1": {"-L01-LAB (5134)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Ms. YIP Pui Sze"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}, "2021-22 Term 1": {"-L01-LAB (5348)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Y.C. Liang Hall 106"], "instructors": ["Staff"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Others": "80", "Presentation": "20"}}, {"code": "4101", "title": "Human Physiology for Nutrition Studies I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "Not for students who have taken BIOL3630 or FNSC5130. Pre-requisite: LSCI1002 or LSCI1003.", "description": "This course is the first part of a two-semester physiology series.  This course covers the main physiological systems of the human body.  By the completion of these courses, students should understand how the organ systems taught in our body function and regulate; they should be able to describe in detail how the taught organs work together to maintain homeostasis.\r", "outcome": "After completing the course, students should be able to:\r i. understand the functions of different organ systems,\r ii. integrate the physiological functions in the taught systems, and \r iii. apply the physiological conditions in diseases.\r  Objectives for student development:\r 1. Integrate the physiology of the taught organ systems.\r 2. Prepare students for the second part of the series.", "syllabus": "Week 1 Introduction – Basic Chemistry/Biology Review  [Chapter 1]\r  Introduction to Human Physiology\r  Basic Chemistry/ Biology Review\r  Homeostasis and homeostatic control system\r Week 2  Cell Physiology I  [Chapter 2-3]\r  An overview of Cell Structure\r  Molecular Interactions\r  Compartmentation: Cells and Tissues\r Week 3 Cell Physiology II  [Chapter 4-6]\r  Energy and Cellular Metabolism\r  Membrane Dynamics\r  Communication, Integration and Homeostasis\r Week 4 Nervous System I [Chapters 8-11]\r  Introduction to nervous system\r  Membrane and Action Potentials\r  AP conduction and synaptic transmission\r Week 5 Nervous System II [Chapters 8-11]\r  Central Nervous System \r  Spinal Cord, Brain and Brain Function\r  Autonomic and Somatic Motor Control\r Week 6 Mid-term Examination\r Week 7 Sensory Physiology  [Chapters 8-11]\r  Introduction to the Human Sensory System\r  Receptor Physiology and Pain\r  The Senses of Vision, Hearing, Balance, Smell and Taste\r  Control of Food Intake\r Week 8 Muscle Physiology  [Chapter 12]\r  Structure of Skeletal Muscle\r  Muscle tissue, Neuro-muscular Control and the Mechanics\r  Spinal Reflex and Control of Motor Movement\r Week 9 Cardiac Physiology  [Chapters 14-15, 17-18]\r  Anatomy of the Heart\r  Cardiac Cycle and Contraction of Myocardium\r  Cardiac electrophysiology\r Week 10 Vascular Physiology  [Chapters 14-15, 17-18]\r  Structure of Vascular Wall\r  Regulation of Vascular Tone\r  Arterial, Venous, Lymphatic Blood Vessels\r Week 11 Blood, Immune, and Lymphoid Organs  [Chapters 16, 24]\r  Overview of structural components\r  Hematopoiesis and blood clotting\r  Mechanism of immune defense: innate and adaptive\r  Role of lymphoid organs \r Week 12 Energy Balance and Thermoregulation [Chapter 22]\r  Role of energy balance and energy storage – adipose tissue\r  Burning energy to produce heat: UCP1 \r Week 13 Immunometabolism [Chapter 22]\r  Role of immune cells in sensing temperature\r  Obesity and chronic inflammation \r  Brown, white, beige adipose tissue interactions with immune cells\r Week 14  Final Examination", "required_readings": "To be assigned by the course lecturer.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (5554)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor WONG Wing Tak Jack"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2021-22 Term 1": {"--LEC (5635)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [3], "locations": ["William M W Mong Eng Bldg LT"], "instructors": ["Professor WONG Wing Tak Jack"], "meetingDates": ["8/9", "15/9"]}}}, "assessments": {"Essay test or exam": "60", "Homework or assignment": "5", "Others": "5", "Short answer test or exam": "30"}}, {"code": "4102", "title": "Human Physiology for Nutrition Studies II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "Not for students who have taken BCHE4130 or FNSC5320. Pre-requisite: FNSC4101.", "description": "This course is a continuation of a two-semester physiology series.  This physiology course complements the other organ systems taught in the first semester.  By the completion of these courses, students should have the whole picture of the organ systems in our body; they should be able to describe in detail how these organs work together to maintain homeostasis, thus keeping us alive and healthy.\r", "outcome": "After completing the course, students should be able to:\r i. understand the functions of different organ systems,\r ii. integrate the physiological functions in various systems, and \r iii. apply the physiological conditions in diseases.\r  Objectives for student development:\r 1. Integrate the physiology of various organ systems.\r 2. Prepare students for pursuing a higher degree in healthcare profession.", "syllabus": "Week 1 Endocrine System I  [Chapters 7, 23]\r  Introduction to hormones\r  Endocrine glands \r Week 2 Endocrine System II  [Chapters 7, 23]\r  Endocrine, paracrine, juxtacrine signaling \r  Hormone production, release, and control\r  Hormone interactions\r Week 3 Gastrointestinal Physiology I  [Chapter 21]\r  Overall anatomy of the digestive system\r  Regulation of GI function\r Week 4 Gastrointestinal Physiology II  [Chapter 21]\r  Biochemical processing/digestion of food \r  Mechanism: Absorption of key metabolites in GI tract \r Week 5 Metabolism and Energy Balance [Chapter 22]\r  Overview of metabolic chemical reactions i.e. ATP production\r  Fed vs fast metabolic response\r  Metabolic dysregulation – diabetes and obesity\r Week 6 Mid-term Examination\r Week 7 Renal System I  [Chapter 19, 20]\r  Anatomy of the Renal system\r  Kidneys: Functionality\r  Osmolarity and acid-base homeostasis\r Week 8 Renal System  II [Chapter 19, 20]\r  Filtration and Reabsorption of waste and nutrients\r  Urination – control \r Week 9 Respiratory System  [Chapters 17-18]\r  Anatomy of respiratory system\r  Mechanics of breathing\r  Gas exchange and transport \r Week 10 Fluid and Acid-Base Balance [Chapter 20]\r  Expansion on acid-base control in the body\r  Control of water and other essential salt balance \r Week 11 Skeletal System  [Chapter 12]\r  Overview of bone structure\r  Biomechanics of bone\r  Osteoclast/osteoblast: bone stress-based remodeling\r Week 12  Exercise [Chapter 25]\r  Metabolism and Exercise\r  Physiological responses during Exercise\r  Exercise and Health\r Week 13 Reproduction and Development [Chapter 26]\r  Male & female reproductive organs\r  Gamete production\r  Pregnancy, growth, and aging\r Week 14 Final Examination", "required_readings": "To be assigned by course lecturer.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (7576)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. LAM Yiu Man, \n\rDr. WONG Tsz Yan, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["15/1", "22/1", "29/1", "5/2"]}}, "2021-22 Term 2": {"--LEC (7819)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Science Centre L1"], "instructors": ["Dr. LAM Yiu Man, \n\rDr. WONG Tsz Yan, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["14/1", "21/1", "28/1"]}}}, "assessments": {"Essay test or exam": "60", "Homework or assignment": "5", "Others": "5", "Short answer test or exam": "30"}}, {"code": "4110", "title": "Food Technology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "", "description": "In this course, students will examine the principles behind food processing technology, different kinds of conventional equipments and their effects on the sensory, microbiological and nutritional qualities of food e.g. meats, vegetable, fruits. Topics may also include food processing, waste management, etc., and basic principles of food engineering.\r", "outcome": "FNSC4110 contains four parts: \r Part I: Introduction and basic principles \r Part II: Ambient temperature processing \r Part III: High temperature processing \r Part IV: Low temperature processing\r  The learning outcomes: \r Part I Introduction and basic principles \r Objectives: After these lectures, a student should be able to \r  Define and differentiate terminology such as food science, food technology, process, unit operation, etc. \r  Describe what are process block diagram, process flow diagram, floor plan and 3-D process diagram\r  Distinguish between phase and glass transition.\r  Define density, bulk density and porosity\r  Define absolute pressure, atmospheric pressure and gauge pressure\r  Understand viscosity and its relationship with shear stress and shear rate in food, and related properties\r  Calculate mass balance in a process and its function\r  Understand the essence in the Bernoulli's equation in fluid flow\r  Differentiate streamline and turbulent flow and application of the Reynolds number\r  Differentiate among the conduction, convection and radiation. \r  Understand the parameters involved in conduction and convection\r  Able to make use the heat transfer coefficient, thermal conductivity and overall heat transfer coefficient in real life\r  application\r  Differentiate between steady state and unsteady-state of heat transfer\r  Define and apply biot number in specific conditions\r  Part II Ambient temperature processing\r 1. Raw material preparation \r Objectives: After these lectures, a student should be able to \r  Understand the features and requirements for raw material preparation \r  Identify the types of common contaminants on raw foods and the methods of their detection and/or removal\r  Compare the differences the principles and applications of dry and wet cleaning methods\r  Understand the importance of sorting in food processing\r  Classify the separation of raw materials into groups by their different physical properties including size, shape, \r  weight, density and color\r  Examine the differences in the principles of equipments used for sorting\r  Describe the factors used for grading \r  Understand the methods of peeling and the considerations of choice\r  2. Size reduction\r Objectives: After these lectures, a student should be able to \r  Understand the importance of size reduction in food processing\r  Correlate the nature of forces, physical properties and equipment design for size reduction in solid foods\r  Explain homogenization and emulsification in liquid foods and their associated processing equipments\r  Examine the effect of size reduction in solid and liquid foods in terms of sensory and nutritional values\r  3. Mixing\r Objectives: After these lectures, a student should be able to \r  Understand the objectives of mixing in food processing\r  Describe the different mechanisms in solid mixing in relationship with the equipment design. \r  Differentiate the different theories of liquid mixing based on viscosity in explaining the different designs of the \r  liquid mixers\r  Understand the possible effect of mixing on foods \r  4. Mechanical separations\r Objectives: After these lectures, a student should be able to\r  Explain the principles of centrifugation in separating immiscible liquids or solids from liquids\r  Examine the design and operations of centrifuges in different food applications\r  Contrast the different means, of filtration (vacuum versus pressure) in association with the equipment, design and\r  operations\r  Understand the use of compressive forces and other physical factors to produce oil and juice in batch, and \r  continuous modes of operations\r  5. Membrane concentration\r Objectives: After these lectures, a student should be able to \r  Understand this unit operation as pressure-activated using a semi-permeable membrane to separate \r  components in a solution or colloidal suspension\r  Compare reverse osmosis and ultrafiltration in terms of theories and food applications\r  Understand the advantages and limitations of membrane concentration over concentration by evaporation\r  Describe the membrane materials and equipment design \r  6. Radiation\r Objectives: After these lectures, a student should be, able to \r  Understand the advantages and limitations of irradiation \r  Describe the theory and equipment used for food irradiation and its food applications \r  Discuss the safety issues of food irradiation\r  Part III High temperature processing \r 1. Blanching\r Objectives: After these lectures, a student should be able to \r  Describe the purpose of blanching\r  Differentiate the different enzymes which responsible for the quality deterioration\r  Tell the function of indicator enzymes\r  Describe the heating sources of blancher and their pros and cons of function\r  Describe the criteria of idea equipment\r  Name the different types of blanchers and their features\r  Describe how they affect the quality of foods\r  2. Heat sterilization\r Objectives: After these lectures, a student should be able to \r  Describe the purpose of heat sterilization\r  Define commercial sterilization\r  Elaborate the 12D, 5D concept\r  Differentiate two different, types of sterilization\r  Describe the factors affecting sterilization time and how it is determined\r  Read \"D\" and \"z\" and their implications\r  Describe how the pH or acidity affects the heat resistance of microorganism and enzymes\r  Describe the importance of monitoring the rate of heat penetration and factors affect the rate \r  Define \"F\", and \"F0\" values and their application\r  Determine the process time\r  Describe the purpose of exhausting and closing. \r  Describe the three major heating sources of in-container sterilization; their special feature and examples\r  Describe the features in ultrahigh-temperature process, direct and indirect systems \r  Provide examples and products character for indirect systems including plate heat exchanger, tubular heat \r  exchangers, scraped-surface heat exchanger and Jupiter double-cone heat exchanger\r  Describe how they affect the quality of foods\r  3. Dehydration\r Objectives: After these lectures, a student should be able to \r  Describe dehydration, its purpose and benefits \r  Understand the mechanism of drying and describe the modes of water migration from the inside to the surface, \r  and from the surface to the surroundings \r  Describe the drying curve in terms of moisture' content vs drying time as well as the drying rate vs the moisture \r  content. \r  Describe the three characteristics of air to increase the drying rate. \r  Differentiate between hot-air driers and heated surface driers, provide examples for each class \r  Describe the features in different types of driers. \r  Describe the purpose of the agglomerated powder\r  Describe how dehydrate would affect the quality of foods \r  4. Pasteurization\r Objectives: After these lectures, a student should be able to \r  Describe pasteurization and its purpose\r  Tell how pasteurization works\r  Describe how the D-value determines the extent of pasteurization\r  Name the two major groups of equipment for pasteurization of liquid food\r  Describe the features in different pasteurizers.\r  Describe how pasteurization would affect the quality of foods\r  Part IV Low temperature processing \r 1. Chilling\r Objectives: After these lectures, a student should be able to \r  Understand the purpose, principles and characteristics of chilling in extending the shelf-life of foods\r  Distinguish the factors that determined the shelf life of fresh and processed chilled foods\r  Understand cook-chill systems as a combination of high and low temperature processing to extend the shelf-life \r  of cooked foods\r  Classify the different mechanical chilling equipments based on the chilling medium \r  Compare the different characteristics of some common refrigerants\r  Understand cryogenic chilling as an alternative low temperature processing and compare the characteristics of \r  some common cryogens\r  Describe the applications of cryogenic cooling in foods\r  Discuss the possible effect of chilling on foods including the sensory, microbiological and physiological aspects \r  of foods\r  2. Freezing and frozen-food storage\r Objectives: After these lectures, a student should be able to \r  Understand the recent frozen food market\r  Describe the underlying principles of freezing in food preservation\r  Understand the physical changes that happen in food during the process of freezing including ice crystal \r  formation, solute concentration, and volume change\r  Understand the factors that determine the freezing time \r  Differentiate mechanical freezer equipments based on their designs in freezing medium and mode of operations\r  Understand the applications of different mechanical freezing equipments to different food categories\r  Discuss the advantages of cryogenic freezers over mechanical ones\r  Understand the principles and food applications of cryogenic freezers\r  Discuss the possible changes happened during frozen-food storage\r  Compare the effect on food quality produced by slow freezing and quick freezing in terms of ice crystal formation\r  Describe the effect of temperature fluctuations during frozen storage in term of recrystallization and freezer burn\r  Understand the monitoring of temperature fluctuations in frozen foods\r  Understand the evaluation of shelf-life of frozen foods\r  Understand thawing is not an exact reverse process of freezing\r  Describe the equipment and considerations for thawing", "syllabus": "1. Basic Principles\r 2. Heat Processing\r 3. Ambient temperature Processing\r 4. Low-temperature Processing", "required_readings": "1. Fellow, P.J. 1990 or 2000. Food Processing Technology: Principles and Practices. Ellis Horwood. (TP370.F45 1990/2000)", "recommended_readings": "1. Brennan, J.G. 2006. Food Processing Handbook, Weinheim: Wiley-VCH (TP370 F667)\r 2. Brennan et al., Food Engineering Operation, 3rd, Elsevier Applied Science. (TP370.F62 1990)\r 3. Singh, R.P., Heldman, D.R. 1993 or 2001. Introduction to Food Engineering. 2nd or 3rd eds., Academic Press. (TP370.S456 1993/2001)", "terms": {"2020-21 Term 1": {"--LEC (4978)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Mr. CHU Kin Kan Astley, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor CHUNG Hau Yin"], "meetingDates": ["11/9", "18/9", "25/9"]}}, "2021-22 Term 1": {"--LEC (5811)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Basic Med Sci Bldg G18"], "instructors": ["Mr. CHU Kin Kan Astley, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor CHUNG Hau Yin"], "meetingDates": ["10/9", "17/9", "24/9"]}}}, "assessments": {"Essay test or exam": "50", "Short answer test or exam": "50"}}, {"code": "4120", "title": "Community Nutrition", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "", "description": "Community nutrition recognizes that the control and prevention of nutrition problems are not merely biomedical in nature, but are embedded in the community of the affected individuals. A community nutritionist assesses and monitors not only physiological and dietary, but also social, cultural, technological and psychological information from many sources to determine needs and identify opportunities for sound, appropriate interventions that improve nutritional health. Because well-conceived nutrition surveys are basic tools for prioritising problems and deciding program plans and evaluations to provide better nutrition services to the public, the course will first introduce community nutrition survey design to the students. Making healthier choices, however, requires lifelong change in thinking and action at both individual and community levels. The rest of the course examines applications of current individual and group nutritional behaviour change theories to promote healthier diets.", "outcome": "-Discuss the work of community nutrition in preventing disease and promoting health\r -Design a nutrition survey, demonstrating appropriate use of methodology and statistics\r -Discover findings, and arragne, interpret and present results from a nutrition survey\r -Appreciate the interrelationships of social, cultural, technological and psychological factors in determining food choice and eating habits\r -Describe how to apply some theoretical models of individual, interpersonal, and group health behaviors to designing nutrition intervention strategies", "syllabus": "-Community nutrition and nutrition survey research\r -Nutrition promotion and nutrition behavior change theories", "required_readings": "", "recommended_readings": "-Community Nutrition: Applying Epidemiology to Contemporary Practice, 2nd ed. Gail C Frank. Jonese and Barlett Publishers, 2008 QU 145 F69 2008\r -Nutrition in Public Health: Principles, Policies and Practice. A Spark, QU145 S63 2007\r -Nutrition Education, Linking Research, Theory and Practice by I Contento. Joense and Bartlett Publishers, Sudbury Mass, USA. 2007. WB18 C759n 2007\r ... Plus, there are many more good community or public health nutrition books and journals in the library.\r Also books on biostatistics, epidemiology and health promotion may be helpful", "terms": {"2020-21 Term 1": {"--LEC (6361)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Ms. YIP Pui Sze, \n\rProfessor TSANG Suk Ying"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}, "2021-22 Term 1": {"--LEC (4785)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Yasumoto Int'l Acad Park LT5"], "instructors": ["Professor TSANG Suk Ying"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Essay test or exam": "60", "Short answer test or exam": "40"}}, {"code": "4150", "title": "Introduction to Medical Nutrition Therapy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "", "description": "Medical nutrition therapy examines the theory and practice behind the prevention and treatment of diseases with the help of diet. This course will introduce the etiology and dietary management of selected diet-related diseases including obesity; anorexia and other eating disorders; diabetes mellitus; cardiovascular diseases including hyperlipidemias; diseases of the alimentary canal, liver, kidney and gall bladder; pancreatitis; food allergy and cancer. It will also cover nutritional management for AIDS patients, interaction of drugs and nutrients, and aspects of dietary therapy in Chinese Medicine. The related applied aspects of dietetics, including the practical skills associated with the preparation, use and evaluation of special diets, and the development of interview and communication skills, will also be covered.\r", "outcome": "After taking this course, students are expected to be able to:\r 1. assess the nutritional status using simple nutritional assessment methods\r 2. distinguish between enteral nutrition and parenteral nutrition as nutritional support for patients with special needs\r 3. recognize the interactions between drugs and nutrients and how these interactions affect nutrition therapy\r 4. describe the etiology, treatment and dietary management of selected diet-related diseases including obesity and \r  diabetes mellitus; diseases of the heart, blood vessels, and lungs; gastrointestinal diseases, renal diseases, \r  food allergy and food intolerance, cancer and AIDS\r 5. discuss the role of Chinese Medicine as an alternate means of dietary therapy for some common diseases", "syllabus": "Major topics to be covered include:\r - Nutritional Assessment and Patient Care\r - Enteral and Parenteral Nutrition\r - Drug-Nutrient Interaction\r - Renal Diseases\r - Surgery Patients and Gastrointestinal Diseases\r - Medical Nutrition Therapy for Food Allergy \r - Nutritional Care for Cancer Patients \r - Medical Nutrition Therapy for HIV Infection and AIDS \r - Obesity: Energy Imbalance\r - Diabetes Mellitus\r - Diseases of the Heart, Blood Vessels, and Lungs\r - Aspect of Dietary Therapy in Chinese Medicine (This topic will be taught in Cantonese)\r  授課內容包括以下題目： - 營養評估與病人護理\r - 腸外與腸內營養 \r - 藥品和營養的相互作用 \r - 腎臟疾病 \r - 外科手術病人及胃腸道疾病 \r - 醫學營養治療食物過敏\r - 癌症病人的營養護理\r - 醫學營養治療HIV病毒感染及愛滋病\r - 肥胖症與能量不平衡\r - 糖尿病\r - 心臟、血管、和肺部疾病\r - 中醫食療 (此課題將會以粵語教授)", "required_readings": "1. Schlenker E.D. and Long S. (2007) Williams’ Essentials of Nutritional & Diet Therapy (9th ed.), Mosby Inc. \r 2. Mahan L.K. and Escott-Stump S. (2008) Krause’s Food & Nutrition Therapy (12th ed.), Saunders", "recommended_readings": "1. Rolfes SR Pinna K and Whitney E (2009) Understanding Normal and Clinical Nutrition (8th Ed) Wadsworth\r 2. Roth RA (2007) Nutrition & Diet Therapy (9th Ed) Thomson", "terms": {"2020-21 Term 1": {"--LEC (7131)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor LEUNG Lai Kwok, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["10/9", "17/9", "24/9"]}}, "2021-22 Term 1": {"--LEC (5758)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Humanities Building 115"], "instructors": ["Dr. LI Yuk Man, \n\rProfessor CHEN Zhenyu, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Essay test or exam": "40", "Short answer test or exam": "20", "Selected response test or exam": "40"}}, {"code": "4160", "title": "Nutrition Planning and Food Policy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "Pre-requisite: FNSC4120.", "description": "This course explores the emergence of food and nutrition policies from their multisectoral agricultural, population, health, environmental, economic, technological and political origins. The class will examine case studies from the international arena, focusing on Asian regional and local food and nutrition policy developments. Because nutrition promotion to the public is an integral component of these policies, a final portion of this course is devoted to the design of effective nutrition promotion and communication strategies for specific groups, including needs assessment, planning, implementation and evaluation.\r", "outcome": "- Discuss global food policy issues\r - Discuss dietary recommendations for public and economic consideration in relation to food and nutrition\r - Discuss nutrition programme planning and nutrition promotion in variety settings", "syllabus": "-World Food Production, Hunger, and Overnutrition\r -Origins of Food and Nutrition Policies\r -Regional/Local Nutrition Policy Case Studies\r -HK Food Production: Agriculture, Fisheries, Industry\r -Food Needs/Supply and Environment\r -Economic Considerations\r -Dietray Recommendations\r -Functional Foods/Introduction to Nutrition Promotion\r -Nutrition Promotion Development\r -Programme Evaluation and Reportng; School Nutrition Promotion\r -Worksite and Older Adult Nutrition Promotion\r -Breastfeeding Promotion", "required_readings": "", "recommended_readings": "Health program planning and evaluation: a practical, systematic approach for community health / L. Michele Issel, 2004.\r  Articles and material as recommended by instructors; WebCT materials", "terms": {"2020-21 Term 2": {"--LEC (6084)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Ms. YIP Pui Sze, \n\rProfessor LEUNG Lai Kwok"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}}, "2021-22 Term 2": {"--LEC (4875)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Mong Man Wai Bldg LT1"], "instructors": ["Dr. WONG Tsz Yan, \n\rMs. YIP Pui Sze"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Essay test or exam": "50", "Homework or assignment": "20", "Presentation": "30"}}, {"code": "4170", "title": "Food Product Development and Quality Control", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "Pre-requisite: FNSC4110.", "description": "This course explores various stages of food product development, and the importance of quality assurance. Topics include idea development, taste-panelling,  shelflife, local food regulations, the ISO standards, GMP, HACCP, quality control tools, statistic quality control and product evaluation.\r", "outcome": "FNSC4170 contains twelve parts:\r Part I: Introduction and definition\r Part II: Idea generation\r Part III: Idea screening\r Part IV: Sensory evaluation\r Part V: Shelflife of foods\r Part VI: Food laws\r Part VII: HACCP\r Part VIII: GMP\r Part IX: ISO standards\r Part X: Quality control tools\r Part XI: Statistic quality control\r Part XII: Product evaluation\r  The learning outcomes:\r Part I Introduction and definition\r Objectives: After these lectures, a student should be able to\r  Define new food products\r  Classify different new products with real-world examples\r  Define and differentiate line extension, reposition, new forms, reformulation, new packaging, innovative products \r  and creative products\r  Understand the driving forces of new product development\r  Describe product life cycle\r  Describe why company needs new products\r  Describe different phases in new product development\r  Part II Idea generation\r Objectives: After these lectures, a student should be able to\r  Identify the various sources of product development ideas\r  Differentiate the internal and external sources of new ideas\r  Obtain ideas in conferences, exhibits, trade shows, public libraries, etc.\r  Generate information from the total market place analysis\r  Describe the purpose of analysis of purchases\r  Master the gap analysis to generate product ideas\r  Part III Idea screening\r Objectives: After these lectures, a student should be able to\r  Explain the purpose of idea screening and the elements involved in the process\r  Explain the purpose and the skill of new product development team\r  Identify the function of each team member\r  Part IV Sensory evaluation\r Objectives: After these lectures, a student should be able to\r  Define “Sensory Evaluation” as specify by the Institute of Food Technologists (IFT)\r  Describe the general conditions of the subjects carrying out sensory evaluation\r  Describe the various sensory techniques used as described by the IFT\r  Describe the setup and environment of a sensory facility\r  Understand the operation of the “Different tests” including pair comparison, due trio, triangle, ranking, rating \r  difference tests\r  Define and determine the threshold value\r  Describe the elements in Flavor Profile, Quantitative Descriptive Analysis\r  Describe the purpose and the considerations in the application of the “Affective Test”\r  Describe the consideration when designing questionnaires for sensory evaluation\r  Part V: Shelflife of foods\r Objectives: After these lectures, a student should be able to\r  Describe the importance of shelflife to food\r  Identify the various intrinsic and extrinsic factors affecting the shelflife of food\r  Understand the mechanisms involved in the deterioration of food\r  Differentiate between the direct and indirect approach to shelflife determination\r  Describe the various elements in the stages of shelflife determination\r  Make use of the Arrhenius equation in the determination of shelflife and understand the limitations of the indirect \r  shelflife determination approach\r  Part VI: Food laws\r Objectives: After these lectures, a student should be able to\r  Describe where to search the food laws in Hong Kong\r  Identify the major areas of food laws covered in Hong Kong\r  Define what a food and an additive\r  Identify the sweeteners used in Hong Kong Food Law\r  Describe the major contents of the harmful substances regulated in the local food law\r  Identify the prohibited substances in Hong Kong\r  Describe the major categories of additive described in the local Food Law\r  Define mineral oil and describe its conditional usage\r  Describe the major categories of coloring matter used locally\r  Differentiate the difference between preservatives and antioxidants used in food\r  Identify the metal contaminants permitted in Hong Kong\r  Describe the major content in the composition and labeling law\r  Part VII: HACCP\r Objectives: After these lectures, a student should be able to\r  Define the essence in HACCP\r  Identify the 7 principles\r  Recognize the various physical, chemical and biological hazards\r  Able to use the decision trees to identify critical point for raw materials and actual operation\r  Describe the 4 stages in a HACCP system\r  Describe the steps in HACCP plan and provide example for each step\r  Understand how long and what types of the HACCP records should be kept\r  Part VIII: GMP\r Objectives: After these lectures, a student should be able to\r  Define quality and explain why it is important\r  Understand the implications of the customer surveys towards unsatisfied customers\r  Describe the evolution of quality assurance philosophy\r  Define the purpose of “Good Manufacturing Practice” (GMP)\r  Part IX: ISO Standards\r Objectives: After these lectures, a student should be able to\r  Define the mission of ISO\r  Understand the background for ISO Standards\r  Describe the core standards\r  Understand the steps in certification process\r  Differentiate between accreditation and certification\r  Tell the limitation of the certification\r  Part X: Quality control tools\r Objectives: After these lectures, a student should be able to\r  Differentiate the various problem solving tools\r  Describe the basic rules and steps in brainstorming\r  Describe the function of pareto analysis and its steps\r  Describe how to construct a process flow diagram\r  Utilize the cause and effect diagram\r  Understand when to use the control chart\r  Part XI: Statistic quality control\r Objectives: After these lectures, a student should be able to\r  Understand the terms used and recognize the pattern in the control chart\r  Understand the different types of control charts and their application\r  Differentiate different types of quality defects\r  Describe the difference between sampling inspection and control chart\r  Describe different sampling types\r  Understand how to use sampling table such as JIS Z 9002 and MIL-STD-105D\r  Part XII: Product evaluation\r Objectives: After these lectures, a student should be able to\r  Decide what kind of method to use to measure the concentration of sugar and salt\r  The function of a refractometer and its principle\r  Describe the quality of brine\r  Describe the method and the principle to measure sugar and sucrose content in potato\r  Describe the direct and indirect tests to measure the undesirable odors presence with the packaging materials\r  Describe the latest technology in measuring odor and taste, its working principle and limitations\r  Describe ways to measure food color and texture\r  Describe methods to determine the maturity in food\r  Describe the measurements to reflect the quality condition in fat and oil\r  Decide the method to measure total acidity and pH\r  Evaluate the integrity of package and container", "syllabus": "1. Product Development Stages\r 2. Idea Development\r 3. Idea Screening\r 4. Sensory Evaluation\r 5. Shelflife Evaluation\r 6. Food Regulations\r 7. HACCP\r 8. GMP\r 9. ISO\r 10. Quality Control – Tools\r 11. Statistical Quality Control\r 12. Product Evaluation", "required_readings": "", "recommended_readings": "1. Baker, R.C.; Hahn, P.W.; Robbins, K.R. 1988. Fundamentals of New Food Product Development. Elsevier, New York, USA. TP370 .B35 1988 \r 2. Brody, A. L. and Lord, J. B. 2000 or 2007. Developing New Food Products for a Changing Marketplace, CRC Press, Boca Raton, Florida, USA. HD9000.5 .D48 2000 or 2007 [e- version] \r 3. Fuller, G.W. 1994. New Food Product Development--From Concept to Market place. CRC Press, Florida, USA. HD9000.5.F86 1994 \r 4. Gould, W.A. 1992. Total Quality Management for the Food Industries. CTI Publications Inc., Maryland, USA. TP372.5 .G69 1992 \r 5. Gould, W.A.; Gould, R.W. 1993. Total Quality Assurance for the Food Industries. CTI Publications, Inc. Maryland, USA. TP372.6 .G68 1993 \r 6. Hubbard, M.R. 1996. Statistical Quality Control for the Food Industry. Chapman & Hall, New York, USA. TP372.6.H83 1996 \r 7. Macfie, H., 2007. Consumer-Led Food Product. CRC Press, Boca Raton, Florida, USA. TP370.5.C66 2007 \r 8. Matz, S. A., 1994. Technology of Food Product Development, Pantech International, McAllen, Texas, USA. TP370.M379 1994 \r 9. Side, C. (Ed.), 2002. Food Product Development Based on Experience. Iowa State Press, Ames, Iowa, USA. TP370.F628 2002 [e-version]", "terms": {"2020-21 Term 2": {"--LEC (7052)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor CHUNG Hau Yin"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (5769)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Science Centre L1"], "instructors": ["Professor CHUNG Hau Yin"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Essay test or exam": "30", "Homework or assignment": "15", "Presentation": "25", "Short answer test or exam": "30"}}, {"code": "4901", "title": "Senior Experimental Project I", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "-", "description": "In this course, students carry out an independent laboratory research project either provided by the supervisor or jointly decided with the student.  To fulfill the course requirement, students are required to discuss their progress with their supervisors regularly and submit a research proposal.", "outcome": "Students taken this course are expected to develop the following abilities: 1) Integrate the knowledge and skills learnt previously in other courses 2) Survey scientific literature relevant to their research project 3) Read scientific literature critically to identify the scientific questions or problems 4) Design independent research project to address the scientific questions  5) Acquire hands-on research techniques in conducting experiments 6) Develop problem-solving abilities 7) Improve skills in writing scientific proposal 8) Develop a sense of responsibility and term spirit  學生將會發展以下能力： 1) 應用在課堂中獲得的知識及技能 2) 搜尋文獻的技巧 3) 具批判性思維閱讀及分析文獻的內容，並認知及思考當中的科學問題 4) 就自己的專題研究題目，設計實驗去解說科學問題 5) 各式實驗的操作能力 6) 解決問題的能力 7) 書寫研究計劃報告的能力 8) 有責任感及團體精神  学生将会发展以下能力： 1) 应用在课堂中获得的知识及技能 2) 搜寻文献的技巧 3) 具批判性思维阅读及分析文献的内容，并认知及思考当中的科学问题 4) 就自己的专题研究题目，设计实验去解说科学问题 5) 各式实验的操作能力 6) 解决问题的能力 7) 书写研究计划报告的能力 8) 有责任感及团体精神", "syllabus": "The students should take the initiative to discuss with their supervisors and come up with a topic for the independent research project. The students should first conduct a literature survey of their research project and identify the scientific questions they want to address. The students then design and perform the experiments for this project under the guidance of the supervisors and submit a research proposal at the end of the term.  學生要於學期開始前主動聯絡教授，並訂出研究課題。學生就該研究課題搜尋相關文獻，並確定研究方向。學生要設計實驗，進行研究，並於學期結束前遞交一份研究計劃。  学生要于学期开始前主动联络教授，并订出研究课题。学生就该研究课题搜寻相关文献，并确定研究方向。学生要设计实验，进行研究，并于学期结束前递交一份研究计划。", "required_readings": "Reference materials relevant to the selected project will be provided by the supervisor", "recommended_readings": "Reference materials relevant to the selected project will be provided by the supervisor", "terms": {"2020-21 Summer Session": {"-J01-PRJ (1354)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEUNG Chi Keung Peter, \n\rProfessor HUI Jerome Ho Lam, \n\rProfessor NGAI Sai Ming"], "meetingDates": ["18/05/2021 - 29/06/2021"]}}}, "assessments": {"Essays": "50", "Others": "50"}}, {"code": "4902", "title": "Senior Experimental Project II", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "-", "description": "In this course, students continue to work on the research project from FNSC4901 or freshly start a new research project.  Students are required to discuss their progress with their supervisor(s) regularly and submit a progress report at the end of the term.  The report is assessed for performance.  Students must take FNSC4903 in 2nd term.", "outcome": "Students taken this course are expected to develop the following abilities:\r 1) Integrate the knowledge and skills learnt previously in other courses\r 2) Survey scientific literature relevant to their research project\r 3) Read scientific literature critically to identify the scientific questions or problems\r 4) Design independent research project to address the scientific questions \r 5) Acquire hands-on research techniques in conducting experiments\r 6) Develop problem-solving abilities\r 7) Develop data analysis and interpretation skills in logical and scientific ways\r 8) Improve skills in scientific writing and oral presentation\r 9) Develop a sense of responsibility and team spirit\r  學生將會發展以下能力： 1) 應用在課堂中獲得的知識及技能\r 2) 搜尋相關文獻的技巧\r 3) 具批判性思維閱讀及分析文獻的內容，並認知及思考當中的科學問題\r 4) 就自己的專題研究題目，設計實驗去解說科學問題\r 5) 各式實驗的操作能力\r 6) 解決問題的能力\r 7) 數據分析，並合乎邏輯性和具科學角度地表述出來\r 8) 書寫符合標準科技論文格式的書面報告及口頭報告的能力\r 9) 有責任感及團體精神\r  学生将会发展以下能力： 1) 应用在课堂中获得的知识及技能\r 2) 搜寻相关文献的技巧\r 3) 具批判性思维阅读及分析文献的内容，并认知及思考当中的科学问题\r 4) 就自己的专题研究题目，设计实验去解说科学问题\r 5) 各式实验的操作能力\r 6) 解决问题的能力\r 7) 数据分析，并合乎逻辑性和具科学角度地表述出来\r 8) 书写合符标准的科技论文及口头报告的能力\r 9) 有责任感及团体精神", "syllabus": "The students should continue to work on the research project from FNSC4901. Students should discuss the progress with their supervisors and submit a progress report in the end of the term. Students who do not continue to work on the research project in FNSC4903 should submit a final report and give an oral presentation.\r  學生可就FNSC4901的研究課題繼續進行研究，並定期向教授匯報及討論研究所得的數據。於學期結束前遞交一份研究進展報告。\r 學生須繼續修讀FNSC4903。\r  学生可就FNSC4901的研究课题继续进行研究，并定期向教授汇报及讨论研究所得的数据。于学期结束前递交一份研究进展报告。学生须继续修读FNSC4903。", "required_readings": "Reference materials relevant to the selected project will be provided by the supervisor", "recommended_readings": "Reference materials relevant to the selected project will be provided by the supervisor", "terms": {"2020-21 Term 1": {"-J01-PRJ (4979)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEUNG Chi Keung Peter, \n\rProfessor NGAI Sai Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2021-22 Term 1": {"-J01-PRJ (5390)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEUNG Chi Keung Peter, \n\rProfessor HUI Jerome Ho Lam, \n\rProfessor NGAI Sai Ming, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["11/09/2021 - 04/12/2021"]}}}, "assessments": {"Essays": "50", "Others": "50"}}, {"code": "4903", "title": "Senior Experimental Project III", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "Pre-requisite: FNSC4902.", "description": "In this course, students continue to work on and finish up the research project from FNSC4902.  Relevant data analysis and conclusion formulation are performed after discussion with supervisors.  A final report in the form of a manuscript and an oral presentation are assessed at the end of the term for assessment.", "outcome": "Students taken this course are expected to develop the following abilities: 1) Integrate the knowledge and skills learnt previously in other courses 2) Survey scientific literature relevant to their research project 3) Read scientific literature critically to identify the scientific questions or problems 4) Design independent research project to address the scientific questions  5) Acquire hands-on research techniques in conducting experiments 6) Develop problem-solving abilities 7) Develop data analysis and interpretation skills in a logical and scientific ways 8) Improve skills in scientific writing and oral presentation 9) Develop a sense of responsibility and team spirit  學生將會發展以下能力： 1) 應用在課堂中獲得的知識及技能 2) 搜尋相關文獻的技巧 3) 具批判性思維閱讀及分析文獻的內容，並認知及思考當中的科學問題 4) 就自己的專題研究題目，設計實驗去解說科學問題 5) 各式實驗的操作能力 6) 解決問題的能力 7) 數據分析，並合乎邏輯性和具科學角度地表述出來 8) 書寫符合標準科技論文格式的書面報告及口頭報告的能力 9) 有責任感及團體精神  学生将会发展以下能力： 1) 应用在课堂中获得的知识及技能 2) 搜寻相关文献的技巧 3) 具批判性思维阅读及分析文献的内容，并认知及思考当中的科学问题 4) 就自己的专题研究题目，设计实验去解说科学问题 5) 各式实验的操作能力 6) 解决问题的能力 7) 数据分析，并合乎逻辑性和具科学角度地表述出来 8) 书写符合标准科技论文格式的书面报告及口头报告的能力 9) 有责任感及团体精神", "syllabus": "The students should continue to work on the research project from FNSC4902.  Students should discuss the progress with their supervisors and submit a final report in the form of manuscript and present orally in the term end.  學生就FNSC4902的研究課題繼續進行研究，並定期向教授匯報及討論研究所得的數據。於學期結束前遞交一份科技論文並作口頭報告。  学生就FNSC4902的研究课题继续进行研究，并定期向教授汇报及讨论研究所得的数据。于学期结束前递交一份科技论文并作口头报告。", "required_readings": "Reference materials relevant to the selected project will be provided by the supervisor", "recommended_readings": "Reference materials relevant to the selected project will be provided by the supervisor", "terms": {"2020-21 Term 2": {"-J01-PRJ (5713)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEUNG Chi Keung Peter, \n\rProfessor NGAI Sai Ming"], "meetingDates": ["16/01/2021 - 24/04/2021"]}}, "2021-22 Term 2": {"-J01-PRJ (8516)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEUNG Chi Keung Peter, \n\rProfessor HUI Jerome Ho Lam, \n\rProfessor NGAI Sai Ming"], "meetingDates": ["15/01/2022 - 23/04/2022"]}}}, "assessments": {"Essays": "40", "Others": "30", "Presentation": "30"}}, {"code": "4906", "title": "Internship", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Food & Nutritional Sci PC", "requirements": "", "description": "In this course, students have the opportunity to gain practical experience working in the government, private companies or non-government organizations.  Internship projects can be held either locally or overseas, and must be approved by the Programme.  Students are required to serve at least 160 hours and submit a written report for assessment.", "outcome": "Students taken this course are expected to acquire the following abilities:\r 1) Integrate the knowledge and skills learnt previously in other courses\r 2) Design, organize, schedule and execute individual or group projects\r 3) Acquire hands-on techniques in conducting experiments or special projects provided by the company where the \r  interns join\r 4) Develop problem-solving abilities\r 5) Work cooperatively with a team in a laboratory or company setting\r 6) Develop a sense of responsibility\r 7) Obtain empirical experiences and out-of classroom experiences for career development\r 8) Improve skills in writing reports\r  學生將會發展以下能力： 1) 應用在課堂中獲得的知識及技能\r 2) 設計、安排、計劃及執行指定的個人或團體項目\r 3) 實驗或專題項目的操作能力\r 4) 解決問題的能力\r 5) 團體合作精神\r 6) 有責任感\r 7) 累積課堂以外的工作經驗\r 8) 書寫報告的能力\r  学生将会发展以下能力： 1) 应用在课堂中获得的知识及技能\r 2) 设计、安排、计划及执行指定的个人或团体项目\r 3) 实验或专题项目的操作能力\r 4) 解决问题的能力\r 5) 团体合作精神\r 6) 有责任感\r 7) 累积课堂以外的工作经验\r 8) 书写报告的能力", "syllabus": "Students should search for their own internship position and submit relevant documents to the Programme for approval. Each intern is required to work in the approved company or laboratory on a scientific project for at least 5 weeks (160 hours) in summer. The progress of each student will be monitored by a supervisor from the Programme. At the end of the internship, students should give an oral presentation and submit a written report.\r  學生須自行尋找本地或海外的專題實習機會，並提交相關資料以取得學系認可。實習生須在暑期時到認可之公司或機構工作或參與研究項目，為期最少五星期(160小時)。學生進度由學系導師監察。實習完結後，學生須作口頭報告並提交書面報告。\r  学生须自行寻找本地或海外的专题实习机会，并提交相关资料以取得学系认可。实习生须在暑期时到认可之公司或机构工作或參与研究项目，为期最少五星期(160小时)。学生进度由学系导师监察。实习完结后，学生须作口头报告并提交书面报告。", "required_readings": "Reference materials relevant to the selected project will be provided by the supervisor", "recommended_readings": "Reference materials relevant to the selected project will be provided by the supervisor", "terms": {"2020-21 Term 1": {"-J01-PRJ (8050)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHEUNG Chi Keung Peter"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2021-22 Term 1": {"-J01-PRJ (8154)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEUNG Chi Keung Peter"], "meetingDates": ["07/09/2021 - 30/11/2021"]}}}, "assessments": {"Essays": "30", "Others": "50", "Presentation": "20"}}, {"code": "5101", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Food & Nutritional Sciences", "description": "Students shall be required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in food and nutrition and in-depth knowledge in a particular field of food and nutritional sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1598)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (1652)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "5110", "title": "Chemical, Physical and Microbiological Characteristics of Food", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Food and Nutritional Sciences or MSc Nutrition, Food Science and Technology\nNot for students who have taken LSCI5811", "description": "This course applies the knowledge of the physical and chemical behavior of food components in the context of food manufacturing and storage, with emphasis on both safety and nutritional attributes. It also aims at developing chemical, microbiological and sensory analyses to assess the quality and safety of foods.", "outcome": "After taking this course, students are expected to be able to: - Understand the chemical, physical, and microbiological characteristics of food components  - Integrate/apply this knowledge in solving problems in food safety, food processing and product development as well as human nutrition", "syllabus": "This course covers three basic characteristics of foods including: (i) the chemical aspect with water, macro- (carbohydrates, proteins and lipids) and micronutrients (vitamins); (ii) the physical aspect with texture, sensory quality and shelf-life; and (iii) the microbiological aspect with food microbiology and fermentation as well as microbial contamination and related foodborne diseases", "required_readings": "Chemical characteristics of food: Chemical characteristics of food: deMan, J.M., Finley, J.W., Hurst, W.J., Chang, Y.L. (2018) Principles of Food Chemistry, 4th edition, Springer.(e-book) Wong, D.W.S. (2018) Mechanism and Theory in Food Chemistry, 2nd edition, Springer. (e-book) Damodaran, S., Parkin, K.L. and Fennema, O.R. (ed.) (2008/2018) Fennema’s Food Chemistry 4th/5th edition, CRC PressPhysical characteristics of food: Bourne, M. (2002) Food texture and viscosity. Concept and measurement. 2nd edition, Academic Press. IFST. (1993) Shelf-life of Food-Guidelines for its Determination and Prediction. Institute of Food Science & Technology, London, UK. Meilgaard, M.C., Civille, G.V., Carr B.T. (2016) Sensory Evaluation Techniques 4th/5th edition, CRC Press.Microbiological characteristics of food: M. R. Adams & M. O. Moss (2008), Food Microbiology.3rd edition Cambridge, UK: RSC Publishing （e-book） A. K. Bhunia (2018), Foodborne Microbial Pathogens: Mechanisms and Pathogenesis. 2nd edition New York, NY: Springer B. M. Mehta, A. Kamal-Eldin, R. Z. Iwanski (2012), Fermentation: Effects on Food Properties. CRC Press", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (2970)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. LI Yuk Man, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor CHUNG Hau Yin"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12", "8/12", "15/12", "22/12"]}}, "2021-22 Term 1": {"--LEC (1212)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Yasumoto Int'l Acad Park LT5"], "instructors": ["Dr. LI Yuk Man, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor CHUNG Hau Yin"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11", "7/12", "14/12", "21/12"]}}}}, {"code": "5120", "title": "Nutrition and the Challenge of Non-communicable Disease", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Food and Nutritional Sciences or MSc Nutrition, Food Science and Technology\nNot for students who have taken LSCI5812", "description": "This course explores the origins and etiology, dietary therapies and population-based strategies to overcome the nutrition-related chronic disease burden globally, regionally and in Hong Kong. Multidisciplinary researchers and practitioners will discuss how modern culture, including food consumption and lifestyles, produces this noncommunicable disease burden, leaving governments challenged to fnd effective policy solutions.", "outcome": "After this course, the students will be able to - understand how nutrition transition will affect our diet by referring to historical, cultural, biological, and economical aspects - describe how modern diets and lifestyle give rise to the global and local epidemic and individual/societal burdens of non-communicable diseases (NCD) - recognize the influence of NCD on individual’s nutritional status and describe role of medical nutrition therapy (MNT) in the management and treatment of NCD such as cancer, diabetes and metabolic syndrome, obesity, osteoporosis, cardiovascular disease, and renal disease etc.  - describe the role of nutrition in health care, the nutrition care process and methods of nutrition assessment, specialized nutrition support and geriatric nutrition", "syllabus": "Nutrition and the Challenge of Non-communicable Diseases", "required_readings": "Each lecturing staff will announce his/her own suggested reading materials", "recommended_readings": " DeBruyne LK, Pinna K and Whitney E (2016) Nutrition & Diet Therapy (9th ed.), Cengage Learning. WB400 C36 2016 GLutz CA, Mazur EE and Litch NA (2015) Nutrition and Diet Therapy (6th ed.),  F.A. Davis Company [UL Electronic resource] Nix S (2017) Williams' Basic Nutrition and Diet Therapy (15th ed.), Elsevier [UL Electronic resource] Rolfes SR, Pinna K and Whitney E (2015) Understanding Normal and Clinical Nutrition (10th ed.) Cengage Learning. QU145 W458 2015", "terms": {"2020-21 Term 2": {"--LEC (2838)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["Li Koon Chun Hall LT1"], "instructors": ["Miss LEE Hoi Yee Carmela, \n\rMs LEE Yik Han Helen, \n\rProfessor CHEN Zhenyu, \n\rProfessor TSANG Suk Ying"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 2": {"--LEC (2840)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["Yasumoto Int'l Acad Park LT2"], "instructors": ["Miss LEE Hoi Yee Carmela, \n\rMs LEE Yik Han Helen, \n\rProfessor CHEN Zhenyu, \n\rProfessor TSANG Suk Ying"], "meetingDates": ["13/1", "20/1", "27/1"]}}}}, {"code": "5201", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Food & Nutritional Sciences", "description": "Students shall be required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in food and nutrition and in-depth knowledge in a particular field of food and nutritional sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1599)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2367)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "5210", "title": "Food Processing Technology and Food Biotechnology", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Food and Nutritional Sciences or MSc Nutrition, Food Science and Technology\nNot for students who have taken LSCI5821", "description": "This course reviews the causes of food spoilage and quality loss. Principles and effects of traditional food processing and food preservation technology on food quality will be covered. New and emerging processing technology will also be covered. The course highlights the latest industrial applications of food biotechnology with emphasis on the production of food and food products through molecular biology, bioprocess engineering and microbial biotechnology.", "outcome": "After taking this course, students are expected to be able to: 1. understand the principles of the unit operations in food processing and preservation 2. understand the effects of processing on the quality of food 3. understand the biotechnology as applied in the production and/or the preservation of food", "syllabus": "This course reviews the causes of food spoilage and quality loss. Principles and effects of traditional food processing and food preservation technology on food quality will be covered. New and emerging processing technology will also be covered. The course highlights the latest industrial applications of food biotechnology with emphasis on the production of food and food products through molecular biology, bioprocess engineering and microbial biotechnology.Principles of Food Processing and PreservationEmerging Processing TechnologyFood Biotechnology", "required_readings": "Fellows, P.J. 2017. Food Processing Technology: Principles and Practice. Ellis Horwood.", "recommended_readings": "Brennan, J.G. 2012. Food Processing Handbook, Weinheim: Wiley-VCHBrennan et al., 1990. Food Engineering Operation, Elsevier Applied Science.Singh, R.P., Heldman, D.R. 2009. Introduction to Food Engineering, Academic Press.", "terms": {"2020-21 Term 2": {"--LEC (2135)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Li Koon Chun Hall LT1"], "instructors": ["Dr. LI Yuk Man, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor CHUNG Hau Yin"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 2": {"--LEC (2398)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Yasumoto Int'l Acad Park LT2"], "instructors": ["Dr. LI Yuk Man, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor CHUNG Hau Yin"], "meetingDates": ["8/2", "15/2", "22/2", "1/3", "8/3", "15/3", "22/3", "29/3"]}}}}, {"code": "5220", "title": "Nutrition and Immunity across the Life Span", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Food and Nutritional Sciences or MSc Nutrition, Food Science and Technology\nNot for students who have taken LSCI5822", "description": "This module covers various aspects of nutrition, ranging from biochemistry to nutrition for the lifespan. The content aims to integrate fundamental knowledge into dietary practices in everyday life. The development and prevention of chronic diseases in the context of nutrition will also be discussed. Recent popular topics, such as obesity, trans fat, etc, are also introduced. At the end of this module, students should be able to state the basic biological mechanisms in maintaining a body through good nutrition.", "outcome": "After completing this course, the students are able to describe the biochemical and physiological significance of the nutrients. They should also understand and integrate the requirements of various nutrients in different stages of life. Moreover, the students should also be able to explain the effect of nutrients on the immune system development and functioning throughout the life cycle. They should be able to work as a group and locate the resources of information for researching on a subject in relation to nutrition and diseases.", "syllabus": "This module covers various aspects of nutrition, ranging from biochemistry to nutrition for the elderly. The content aims to integrate fundamental knowledge into dietary practices in everyday life. The development and prevention of chronic diseases in the context of nutrition will also be discussed. Recent popular topics, such as obesity, trans fat, etc, are also introduced. At the end of this module, students should be able to state the basic biological mechanisms in maintaining a healthy body through prudent nutrition.", "required_readings": "Wardlaw’s Perspectives in Nutrition 10th ed., Byrd-Bredbenner C. et al., McGraw Hill Higher Education, Boston, 2015.", "recommended_readings": " Nutrition throughout the Life Cycle 4th ed., Worthington-Roberts B.S. & Williams S.R., McGraw Hill International Edition, New York, 2000.   Nutrition across the Life Span 2nd ed. Mitchell M.K., W.B. Saunders Co., Philadelphia, 2003.  Dietary Components and Immune Function, Watson R.R. et al., Springer Science, NJ, 2010. [Electronic resource] Nutrition, Immunity and Infection, Shetty P., CABI Publishing, Cambridge, 2010.", "terms": {"2020-21 Term 1": {"--LEC (2996)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. LI Yuk Man, \n\rProfessor LEUNG Lai Kwok, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["11/9", "18/9", "25/9"]}}, "2021-22 Term 1": {"--LEC (2043)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [5], "locations": ["Yasumoto Int'l Acad Park LT6"], "instructors": ["Dr. LI Yuk Man, \n\rProfessor CHOW Hei Man, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["10/9", "17/9", "24/9"]}}}, "assessments": {"Examination": "85", "Report": "15"}}, {"code": "5301", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Food & Nutritional Sci", "description": "Students shall be required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in food and nutrition and in-depth knowledge in a particular field of food and nutritional sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (2345)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2368)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "5320", "title": "Nutritional Physiology", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MSc Nutrition, Food Science and Technology or MPhil-PhD Food and Nutritional Sciences or BSc Food and Nutritional Sciences\nNot for students who have taken LSCI5832", "description": "In this course, the physiological aspects of nutrition will be introduced. The course covers how nutrients may affect human physiologically in an organ-specific manner. Malnutrition can be interpreted as over- or under-nutrition. Together with the basic understanding of human anatomy and physiology, the pathophysiological impact of malnourishment will be discussed. Gastrointestinal, renal, cardiovascular, respiratory and endocrine systems will be covered.", "outcome": "After completing this course, the students are able to describe the human physiology in relation to nutrient metabolism. They should also understand and integrate the effect of nutrients on some chronic disease development, such as cardiovascular diseases. Moreover, the students should also be able to explain how our body is handling the food ingested, how the nutrients are used in exercising, and how the food consumed may affect our brain development, etc. After all, the students should be familiar with the interplay between nutrients consumed and our organ system. They should be able to work as a group and locate the resources of information for researching on a subject in relation to nutrition and physiology.", "syllabus": "1.          Appetite and the Regulation2.          GI Secretion & Digestion3.          Nutrient Retention in the Kidneys4.          Nutrition and Cardiovascular Physiology5.          Blood Pressure and Diet6.          Nutrition and Sensory Physiology7.          Nutrition and Exercise8.          Nutrition and Microorganisms in the Gut", "required_readings": "1.          Nutrition and metabolism / edited on behalf of the Nutrition Society by Susan A. Lanham-New, Ian A. MacDonald, Helen M. Roche; 2nd ed. Chichester, West Sussex, UK; Ames, Iowa: Wiley-Blackwell 20112.          Physiology: a clinical core text of human physiology with self-assessment / J.G. McGeown. 3rd ed., Edinburgh; New York: Churchill Livingstone/Elsevier, 2007.3.          Essentials of human anatomy & physiology, global edition; E. N. Marieb, & S. M. Keller. Pearson Education Limited, 2017", "recommended_readings": "1.          Stress and Hypertension : Examining the Relation Between Psychological Stress and High Blood Pressure. Larkin, K. T. ;Yale University Press. 20052.          Gut microbiota : Interactive effects on nutrition and health. Shiguro, E., Haskey, N., & Campbell, K. London, United Kingdom: Academic Press. 20183.          Diet, Microbiome and Health. Holban, A., & Grumezescu, A. 2018. ", "terms": {"2020-21 Term 2": {"--LEC (3840)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [5], "locations": ["Yasumoto Int'l Acad Park LT1"], "instructors": ["Dr. LI Yuk Man, \n\rProfessor LEUNG Lai Kwok, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["15/1", "22/1"]}}, "2021-22 Term 2": {"--LEC (2296)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [5], "locations": ["Yasumoto Int'l Acad Park LT2"], "instructors": ["Dr. LI Yuk Man, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["14/1", "21/1", "28/1"]}}}, "assessments": {"Examination": "50", "Others": "5", "Project": "10", "Test or quiz": "35"}}, {"code": "5420", "title": "Applied Nutrition", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Food and Nutritional Sciences or MSc Nutrition, Food Science and Technology\nNot for students who have taken LSCI5842", "description": "This course presents applied aspects of nutrition with emphasis on research and development in functional foods, nutritional values of traditional Chinese herbs and sports nutrition, fitness and weight management, with a view to enhance health status and quality of life. Each of these areas addresses a specific issue that is the interest of public and presents the progress in these exciting new researches.", "outcome": "After taking this course, students are expected to be able to: 1. understand WHO definition of health; 2. understand the definition of functional foods and their application in prevention of chronic diseases including obesity, heart diseases, diabetes mellitus, hypertension, cancer ; 3. understand the principle of Traditional Chinese medicine and its application in nutrition; 4. combine both functional foods and traditional Chinese medicine to decrease the risk of chronic diseases.", "syllabus": "1.          Nutrients Recommendation2.          Nutrition Assessment3.          Food Nutrition Label4.          Functional Foods and Nutraceuticals5.          Energy Metabolism6.          Sports Nutrition7.          Traditional Herbal Medicines8.          Medicinal Foods9.          Maternal Nutrition10.        Diet and Epigenetics", "required_readings": " Nutrigenomics and nutrigenetics in functional foods and personalized nutrition / [edited by] Lynnette R. Ferguson. Lynnette R Ferguson. Boca Raton, FL : CRC Press; 2014. Functional foods : the connection between nutrition, health, and food science. Leah Coles.  New Jersey : Apple Academic Press, 2014.", "recommended_readings": "1.     Sport Nutrition for Health and Performance. Manore & Thompson, Champaign, IL : Human Kinetics, 2000.2.     Functional foods : concept to product. Gibson and Williams, Boca Raton, FL: CRC Press; Cambridge : Woodhead Pub., 2000.3.     Functional foods. Chadwick R, Berlin ; New York : Springer, 20034.     Modern nutrition in health and disease. Shils ME,  Philadelphia : Lippincott Williams & Wilkins, 2006", "terms": {"2020-21 Term 2": {"--LEC (3745)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [1], "locations": ["Li Koon Chun Hall LT1"], "instructors": ["Dr. LI Yuk Man, \n\rProfessor CHEN Zhenyu, \n\rProfessor TSANG Suk Ying, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}}, "2021-22 Term 2": {"--LEC (2399)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [1], "locations": ["Yasumoto Int'l Acad Park LT7"], "instructors": ["Dr. LI Yuk Man, \n\rProfessor CHEN Zhenyu, \n\rProfessor TSANG Suk Ying, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Attendance": "20", "Examination": "80"}}, {"code": "5430", "title": "Food Toxicology & Safety", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MSc Nutrition, Food Science and Technology or MPhil-PhD Food and Nutritional Sciences or BSc Food and Nutritional Sciences\nNot for students who have taken LSCI5843", "description": "Food can be contaminated at any stage of its production and handling with naturally occurring toxicants and/or man-made chemicals that have adverse health effects to humans. The objective of this course is to gain knowledge on the key concepts and principles of food safety and toxicology. Students are expected to develop an understanding of the nature and properties of the toxic substances in foods as well as the nature and magnitude of the hazard they represent to humans, with the aim of preventing health risks due to food intake. Topics on food safety include food hygiene, food poisoning, food legislation and food safety control systems. Topics on food toxicology include its general principles, biochemical and physiological mechanisms of action of food toxicants, and methods for food safety assessment. Emphasis will be placed on the evaluation of current issues in food safety toxicology including risk assessment and management.", "outcome": "After taking this course, students are expected to be able to: 1. gain knowledge on the key concepts and principles of food safety and toxicology 2. understand the nature and properties of the toxic substances in foods as well as the nature and magnitude of the hazard they represent to humans,  3. understand the general principles, biochemical and physiological mechanisms of action of food toxicants, and methods for food safety assessment 4. understand the basic principles of food hygiene and food poisoning to prevent health risks due to food intake.  5. understand food legislation and food safety control systems, as well as risk analysis", "syllabus": " Introduction to Food Toxicology and Health Risk Management Natural Toxins Metal Intoxication Pesticides and Trace Organics Food Additives and Novel Foods Food Adulteration and Current Issues Food and Environmental Hygiene Food poisoning and spoilage Food Legislations Food Safety Control Risk Management in Food Safety", "required_readings": "1.Shibamoto, T., & Bjeldanes, L., 1993. Introduction to food toxicology (Food science and technology). Academic Press :: San Diego.2.Omaye, S., 2004. Food and Nutritional Toxicology. Boca Raton : CRC Press c2004", "recommended_readings": "1.Helferich, W., & Winter, C., 2001. Food Toxicology. Boca Raton : CRC Press c20012.P Hodgson, E. (2004). A Textbook of Modern Toxicology", "terms": {"2020-21 Term 1": {"--LEC (1685)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr. LI Yuk Man, \n\rMr LI Ka Kei"], "meetingDates": ["10/9", "17/9", "24/9"]}}, "2021-22 Term 1": {"--LEC (1534)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["Yasumoto Int'l Acad Park LT3"], "instructors": ["Dr. LI Yuk Man, \n\rMr LI Ka Kei"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Examination": "50", "Test or quiz": "50"}}, {"code": "6313", "title": "Directed Research and Seminar I", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MSc Nutrition, Food Science and Technology", "description": "In this course, students will undertake a final year, year-long research project or literature review of a topic of their choice in area of either nutrition or food science and technology under the supervision of a faculty member. Each student is required to submit a written progress report about his or her research on completion of the course.", "outcome": "After taking this course, students are expected to be able to: 1. learn how to conduct a comprehensive and systematic search on scientific literature 2. familiar with a special research area or topic in food and nutritional sciences 3. critically evaluate experimental data and prepare report summary", "syllabus": "In this course, students will undertake a research project or review a topic of their choice in areas of either nutrition or food science and technology under the supervision of a faculty member. Each student is required to attend a series of research seminars delivered by the teachers and submit a written progress report about his or her research at the end of the first semester.", "required_readings": "Readings recommended by teachers", "recommended_readings": "Readings recommended by teachers", "terms": {"2020-21 Term 1": {"-S01-SEM (2971)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor CHOW Hei Man, \n\rProfessor CHUNG Hau Yin, \n\rProfessor KWAN Kin Ming, \n\rProfessor LEUNG Lai Kwok, \n\rProfessor TSANG Suk Ying, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12", "9/12", "16/12"]}}, "2021-22 Term 1": {"-S01-SEM (1213)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["Yasumoto Int'l Acad Park LT7"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor CHOW Hei Man, \n\rProfessor CHUNG Hau Yin, \n\rProfessor KWAN Kin Ming, \n\rProfessor TSANG Suk Ying, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["8/9", "15/9"]}}}, "assessments": {"Attendance": "40", "Lab performance": "20", "Report": "40"}}, {"code": "6413", "title": "Directed Research and Seminar II", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MSc Nutrition, Food Science and Technology\nPrerequisite: FNSC6313", "description": "In this course, students will undertake a final year, year-long research project or literature review of a topic of their choice in area of either nutrition or food science and technology under the supervision of a faculty member. The results of the research or literature review will be presented in a seminar and be formally written in the form of a final report.", "outcome": "After taking this course, students are expected to be able to:  1. learn how to give a scientific oral presentation on a research specific topic 2. learn how to prepare a scientific dissertation on a specific research topic", "syllabus": "Students in this course will continue to carry out the project under the same supervisor in FNSC6313 in the first semester. They will need to give an oral presentation on their project in the middle of the semester and submit a final thesis by the end of the second semester.", "required_readings": "Readings recommended by teachers", "recommended_readings": "Readings recommended by teachers", "terms": {"2020-21 Term 2": {"-S01-SEM (3024)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [6], "locations": ["Yasumoto Int'l Acad Park LT3"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor CHOW Hei Man, \n\rProfessor CHUNG Hau Yin, \n\rProfessor KWAN Kin Ming, \n\rProfessor LEUNG Lai Kwok, \n\rProfessor TSANG Suk Ying, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["16/1", "23/1", "30/1", "6/2"]}}, "2021-22 Term 2": {"-S01-SEM (1212)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [6], "locations": ["Yasumoto Int'l Acad Park LT3"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor CHOW Hei Man, \n\rProfessor CHUNG Hau Yin, \n\rProfessor KWAN Kin Ming, \n\rProfessor TSANG Suk Ying, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["15/1", "22/1", "29/1"]}}}, "assessments": {"Lab reports": "50", "Presentation": "50"}}, {"code": "7101", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Food and Nutritional Sciences", "description": "Students are required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in food and nutrition and in-depth knowledge in a particular field of food and nutritional sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1052)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (1069)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7201", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Food and Nutritional Sciences", "description": "Students are required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in food and nutrition and in-depth knowledge in a particular field of food and nutritional sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1053)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2370)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7301", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Food and Nutritional Sciences", "description": "Students are required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in food and nutrition and in-depth knowledge in a particular field of food and nutritional sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1054)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (2371)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-S01-SEM (2552)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-S01-SEM (2634)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7401", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Food and Nutritional Sciences", "description": "Students are required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in food and nutrition and in-depth knowledge in a particular field of food and nutritional sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1055)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (1070)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-S01-SEM (2553)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-S01-SEM (2635)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7501", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Food and Nutritional Sciences", "description": "Students are required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in food and nutrition and in-depth knowledge in a particular field of food and nutritional sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1725)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (1775)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-S01-SEM (2547)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-S01-SEM (2628)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7601", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Food and Nutritional Sciences", "description": "Students are required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in food and nutrition and in-depth knowledge in a particular field of food and nutritional sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1056)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (1071)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-S01-SEM (2554)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-S01-SEM (2636)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "7701", "title": "Seminar", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Food and Nutritional Sciences", "description": "Students are required to present the results of their research to their peers and staff.", "outcome": "After finishing the course, students should be able to (1) acquire core knowledge in food and nutrition and in-depth knowledge in a particular field of food and nutritional sciences for research. (2) acquire life-long learning skills to be an independent researcher. (3) acquire knowledge to plan research work. (4) acquire generic skills such as analytical skills, communication skills and writing skills. (5) acquire skills how to prepare manuscript for publication.", "syllabus": "-   Life Sciences Seminar Series-   Graduate Seminar", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-S01-SEM (1057)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-S01-SEM (1072)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-S01-SEM (2556)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-S01-SEM (2639)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor KWAN Kin Ming"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Attendance": "10", "Presentation": "90"}}, {"code": "8003", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Food & Nutritional Sciences", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student's academic progress.", "outcome": "Development of research skills, including field and/or laboratory studies and data analysis as related to the students' thesis research.", "syllabus": "-    Identify a research topic-    Develop a research hypothesis-    Prepare a research proposal-    Develop research methodology and experimental design-    Conduct an original research with impact in a specific field or subject-    Analyze experimental results and make appropriate data interpretation-    Prepare a research dissertation/thesis and related manuscripts for publication", "required_readings": "Journal articles and other research materials assigned by individual supervisors. ", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-M01-TMC (2378)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor CHUNG Hau Yin, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-M01-TMC (2366)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor CHUNG Hau Yin, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-M01-TMC (1990)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEUNG Chi Keung Peter"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-M01-TMC (2375)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEUNG Chi Keung Peter"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}}, {"code": "8006", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "6.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Food & Nutritional Sciences", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student's academic progress.", "outcome": "Development of research skills, including field and/or laboratory studies and data analysis as related to the students' thesis research.", "syllabus": "-    Identify a research topic-    Develop a research hypothesis-    Prepare a research proposal-    Develop research methodology and experimental design-    Conduct an original research with impact in a specific field or subject-    Analyze experimental results and make appropriate data interpretation-    Prepare a research dissertation/thesis and related manuscripts for publication", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-M01-TMC (3302)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor CHUNG Hau Yin, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-M01-TMC (3394)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor CHUNG Hau Yin, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-M01-TMC (1991)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-M01-TMC (2060)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}}, {"code": "8012", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "12.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Division of Life Sciences", "requirements": "For students in MPhil-PhD Food & Nutritional Sciences", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student's academic progress.", "outcome": "Development of research skills, including field and/or laboratory studies and data analysis as related to the students' thesis research.", "syllabus": "-    Identify a research topic-    Develop a research hypothesis-    Prepare a research proposal-    Develop research methodology and experimental design-    Conduct an original research with impact in a specific field or subject-    Analyze experimental results and make appropriate data interpretation-    Prepare a research dissertation/thesis and related manuscripts for publication", "required_readings": "Journal articles and other research materials assigned by individual supervisors.", "recommended_readings": "Additional journal articles and other research materials recommended by individual supervisors.", "terms": {"2020-21 Term 1": {"-M01-TMC (3303)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor CHUNG Hau Yin, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-M01-TMC (2404)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor CHUNG Hau Yin, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-M01-TMC (1992)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor CHUNG Hau Yin, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-M01-TMC (2061)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEN Zhenyu, \n\rProfessor CHEUNG Chi Keung Peter, \n\rProfessor CHUNG Hau Yin, \n\rProfessor WONG Wing Tak Jack"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}}]