[{"code": "1020", "title": "The Hong Kong Story", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Joint Colleges General Edu", "requirements": "For Shaw College students and Year 1 students of Wu Yee Sun College only.;Not for students who have taken UGEC2865, SOCI1201 or SOCI2104.", "description": "From the crown jewel of the British Empire to the \"spoiled\" SAR of the PRC, the Hong Kong story has undergone many ups and downs, twists and turns. Designed from a sociological perspective, but specifically for students without sociological background or much background knowledge about Hong Kong, this course shall guide them through the journey of Hong Kong and its people so far. It will pick up popular images about Hong Kong, such as \"a laissez-faire economic miracle\", \"the safest place in the world\", or \"the land of opportunity\", evaluating their validities or tracing their origins and implications. Integrating experiential learning and e-learning strategies, this course should offer students a range of new learning experiences and new angles of approaching the society that we are living in.\r", "outcome": "After completing the course, students should be able to: \r 1. Go beyond the constraint of individual experiences and recognize the broader influence of Hong Kong’s post-war social developments on Hong Kong people's personal biography and community living. \r 2. Identify and critically discuss dominant imageries of social life in Hong Kong. \r 3. Analyze everyday encounters in the community of Hong Kong and evaluate their broader significance with consolidated knowledge and perspectives gained from this course. \r 4. Engage in self-initiated learning processes with technological-aid geared towards active discovery.", "syllabus": "1. Introduction – The Hong Kong spectacle\r 2. Hong Kong as a crown jewel of the British Empire: Colonial history and legacy\r 3. Hong Kong as an international hub: The rise of Hong Kong in the world-system\r 4. Hong Kong as an economic miracle? The myth of laissez-faire and industrialization\r 5. Hong Kong as a migration center: Cultural diversity and social polarization in Hong Kong\r 6. Hong Kong as a place of conflict over hearts and minds: identity politics beyond left and right\r 7. Hong Kong as a divided society: From land of opportunity to land of inequality?\r 8. Hong Kong as an urban jungle: High-density living in Hong Kong\r 9. Hong Kong as the safest place in the world? From gang-land to cop-land to Disneyland\r 10. Hong Kong as a city of protest: Social movement and the quest for democracy\r 11. Hollywood of the East: Cultural industry in Hong Kong\r 12. Conclusion: Cosmopolitan Hong Kong", "required_readings": "1. Introduction – The Hong Kong spectacle\r - Carroll, John. 2013. “Introduction.” in A Concise History of Hong Kong. Hong Kong: Hong Kong University Press.\r - Chen, Piera and Chung Wah Chow. 2013. “Understanding Hong Kong.” In Lonely Planet Hong Kong (15th edition). Hong Kong: Lonely Planet Publications Pty Ltd.\r 2. Hong Kong as a crown jewel of the British Empire: Colonial history and legacy\r - Carroll, John. 2013. “Early colonial Hong Kong” and “State and society.” in A Concise History of Hong Kong. Hong Kong: Hong Kong University Press.\r 3. Hong Kong as an international hub: The rise of Hong Kong in the world-system\r - So, Alvin Y. 1986. “The economic success of Hong Kong: Insights from a world-system perspective.” Sociological Perspectives 29: 241-258.\r 4. Hong Kong as an economic miracle? The myth of laissez-faire and industrialization\r - Chiu, Stephen Wing-kai 1996. “Unravelling Hong Kong’s exceptionalism: The politics of laissez-faire in the industrial takeoff.” Political Power and Social Theory 10: 229-56.\r - Smith, Carl. 1995. “Sham Shui Po: From proprietary village to industrial-urban complex.” In Carl Smith (edited). A Sense of History: Studies in the Social and Urban History of Hong Kong. Hong Kong: Hong Kong Educational Publishing Company.\r 5. Hong Kong as a migration center: Cultural diversity and social polarization in Hong Kong\r - Chiu, Stephen Wing-kai and Asian Migrant Centre. 2005. A Stranger in the House. Foreign Domestic Helpers in Hong Kong. Occasional paper No.162. Hong Kong Institute of Asia-Pacific Studies, The Chinese University of Hong Kong.\r 6. Hong Kong as a place of conflict over hearts and minds: identity politics beyond left and right\r - Mathews, Gordon, Eric Kit-wai Ma and Tai-lok Lui. 2008. “Fleeing the nation, creating a local home, 1949-1983” and “Rejoining the nation: Hong Kong, 1983-2006.” In Hong Kong, China: Learning to Belong to a Nation. Oxon: Routledge. \r 7. Hong Kong as a divided society: From land of opportunity to land of inequality?\r - Chiu, Stephen Wing-kai and Tai-lok Lui. 2004. “Testing the global city-social polarisation thesis: Hong Kong since the 1990s.” Urban Studies 41: 1863-1888. \r 8. Hong Kong as an urban jungle: High-density living in Hong Kong\r - Poon, Alice. 2010. “Land and power.” In Land and the Ruling Class in Hong Kong (2nd Edition). Hong Kong: Enrich Professional Publishing. \r 9. Hong Kong as the safest place in the world? From gang-land to cop-land to Disneyland\r - Gaylord, Mark and Harold Traver. 1995. “Colonial policing and the demise of British rule in Hong Kong.” International Journal of the Sociology of Law 23:23-43. \r 10. Hong Kong as a city of protest: Social movement and the quest for democracy\r - Lui, Tai-lok and Chiu, Stephen Wing-kai. 2000. “Introduction—Changing Political Opportunities and the Shaping of Collective Action: Social Movements in Hong Kong”, pp.1-20 in Wing-kai Chiu and Tai-lok Lui (eds.) The Dynamics of Social Movement in Hong Kong. Hong Kong: University of Hong Kong Press. \r - Chiu, Stephen Wing-kai and Li Hang. 2014. Contentious Politics in Two Villages. Anti-High-Speed-Rail Campaigns in Hong Kong and Taiwan. Occasional Paper no. 230. Hong Kong Institute of Asia-Pacific Studies, The Chinese University of Hong Kong.\r 11. Hollywood of the East: Cultural industry in Hong Kong\r - Chiu, Stephen Wing-kai and Victor K.W. Shin. 2013. The fall of Hong Kong movies: A post-mortem investigative report. Occasional Paper No. 225, Hong Kong Institute of Asia-Pacific Studies, The Chinese University of Hong Kong. \r 12. Conclusion: Cosmopolitan Hong Kong\r - Mathews, Gordon, Eric Kit-wai Ma and Tai-lok Lui. 2008. “Hong Kong’s market-based national identity: harbinger of a global future?” In Hong Kong, China: Learning to Belong to a Nation. Oxon: Routledge.", "recommended_readings": "- Ngo, Tak-wing. 1999. “Colonialism in Hong Kong revisited.” In Tak-wing Ngo (edited). Hong Kong’s History: State and Society under Colonial Rule. London: Routledge.\r - So, Alvin Y., and Stephen W.K. Chiu. 1995. “The semiperipherization of the newly industrializing economies.” In East Asia and the World Economy. Thousand Oaks, CA: Sage Publications.\r - Chiu, Stephen Wing-kai and Ho-fung Hung. 1999. “State Building and Rural Stability.” In Tak-Wing Ngo (Edited). Hong Kong's History: State and Society Under Colonial Rule. London: Routledge.\r - Sit, Victor. 1980. “The location of urban small industries: An ecological approach.” Transactions of the Institute of British Geographers, New Series 5(4): 413-426.\r - Sara Ashencaen Crabtree and Hung Wong. 2013. “‘Ah Cha’! The racial discrimination of Pakistani minority communities in Hong Kong: An analysis of multiple, intersecting oppressions.” British Journal of Social Work 43: 945–963.\r - Lui, Tai-lok. 2009. “Hong Kong’s changing opportunity structures: Political concerns and sociological observations.” In Kwok-bun Chan, Agnes S. Ku and Yin-wah Chu (eds.) Social Stratification in Chinese Societies. Leiden: Brill.\r - Castells, Manuel, Lee Goh, R. Yin-wang Kwok. 1990. “Public housing as a political strategy: its economic, social, and political goals and impacts.” In The Shek Kip Syndrome: Economic Development and Public Housing in Hong Kong and Singapore. London: Pion Ltd. \r - Smart, Alan. 2006. The Shek Kip Mei Myth: Squatters, Fires and Colonial Rule in Hong Kong, 1950-1963. Hong Kong: Hong Kong University Press.\r - Cuthbert, A.R. 1995. “The right to the city. Surveillance, private interest and the public domain in Hong Kong.” Cities 12(5):293-310.\r - So, Alvin Y. 2011. “The development of post-modernist social movements in the Hong Kong Special Administrative Region.” In Jeffrey Broadbent and Vicky Brockman (edited). East Asian Social Movements. Power, Protest, and Change in a Dynamic Region. NY: Springer.\r - Chan, Joseph Man, Anthony Ying-Him Fung and Chun-hung Ng. 2010. “Introduction: What has happened in Hong Kong?” pp. 9-32 in Chan Joseph Man, Fung Anthony Ying-Him and Ng Chun-hung (eds.) Policies for the sustainable development of the Hong Kong film industry. Hong Kong: Hong Kong Institute of Asia-Pacific Studies, The Chinese University of Hong Kong", "terms": {"2020-21 Term 1": {"--LEC (9039)": {"startTimes": ["15:30"], "endTimes": ["17:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. LEE King Wa"]}, "-X01-WBL (9038)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Dr. LEE King Wa"]}}}, "assessments": {"Essays": "0", "Selected response test or exam": "0"}}, {"code": "1110", "title": "College, University and Community: Student-Oriented Teaching", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Discussion", "campus": "Main Campus", "academic_group": "Chung Chi College", "requirements": "For Year 1 Chung Chi College students only. Students must take GEJC1120 in the same term for taking this course. Not for students who have taken GECC1130 or GECC1131.", "description": "This is a student-oriented small group tutorial course connected to GEJC1120 for Chung Chi students only. This course is designed specifically for year one students, with the aims to enhance students to adapt to the learning environment and life style in The Chinese University, allow them to get a better understanding to university life, university education and the lectures of GEJC1120 through small group discussion.The enrollment of this course is in connection with the 2 unit course GEJC1120 “College, University and Community”. \r", "outcome": "After completing this course, students should be able to: \r 1. describe and examine topics related to university education, university life, history and tradition of Chung Chi College; 2. recognize contemporary and perennial issues covered in GEJC1120; 3. develop effective communication and critical thinking skills; 4. demonstrate the ability to work in team.\r  修讀本科後，同學將能夠： 1. 闡述及探討有關大學教育及大學生活的題目，以及崇基學院歷史與傳統；\r 2. 理解GEJC1120講課中當今與恆常的課題；\r 3. 培養有效溝通能力和批判思考；\r 4. 展示團隊合作能力。", "syllabus": "The purpose of the STOT classes is to engage students in the discussions on topics related to university education, college life or topics in GEJC1120. Students and class teacher can decide on their topic of interest for discussion. Recommended topics include:\r  1. University Life: Problems and Solutions\r 2. Emotion Management, Time Management, Money Management\r 3. Issues in the Education System of HK and Worldwide\r 4. The Role of University in a Changing World \r 5. The Search for Values of the Youth of Hong Kong\r 6. The Role of University Students: The Ambition and Responsibilities of Intellectuals\r 7. Liberal Education / General Education and Humanity\r 8. The History and Heritage of Chung Chi College\r 9. CUHK and Chung Chi College: Traditions and Ideals\r 10. Value, Ethics, Integrity, Moral Judgement\r 11. The Idea of Love, Intimacy, Affection\r 12. Friendship, Family Relationship, Kinship, Teacher-student relationship, Apprenticeship\r 13. Self-fulfillment and Vision of Life; Contribution to the Society and Mankind\r 14. A topic covered in GEJC1120\r  STOT 討論內容圍繞大學教育、大學生活或GEJC1120之講課課題，可由導師及組員決定，建議題目如下：\r  1. 大學生活︰困難與解決方法\r 2. 情緒管理、時間管理、理財\r 3. 香港與世界之學制問題 \r 4. 大學的角色之演變 \r 5. 大學生的品格\r 6. 大學生之自我定位：知識分子的抱負與責任\r 7. 通識教育與人文精神 \r 8. 崇基歷史與承傳\r 9. 誠信與道德判斷\r 10. 崇基與中大的歷史淵源及理想實踐\r 11. 情愛的意義 \r 12. 友情、親情與師生情之情感生活\r 13. 成己與立命、經世與立群\r 14. GEJC1120其中一節講課之題目", "required_readings": "To be assigned by class teacher.", "recommended_readings": "Kerr, C. 2001. “ The Idea of a Multiversity” In Uses of the University, 5th edition, 1-34. Cambridge, Massachusetts, London, England: Harvard University Press.\r Rashdall, H. 2009. “What is a university?” In The History of Higher Education, Vol II, edited by Roy Lowe, 18-35. London , New York: Routledge.\r  And to be assigned by class teacher.", "terms": {"2020-21 Term 1": {"AD01-DIS (4791)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor LIEN Jaimie Wei Hung"]}, "BD01-DIS (4795)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. TIAN Jie Jenny"]}, "CD01-DIS (4792)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor KANG Byung Ho"]}, "DD01-DIS (4793)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor BIAN Liming"]}, "ED01-DIS (4794)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor LAO Xiangqian"]}, "FD01-DIS (7419)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor WANG Dajun"]}, "GD01-DIS (4607)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. HAN Man"]}, "HD01-DIS (4565)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. CHOW Ian Castor"]}, "ID01-DIS (9287)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Staff"]}, "JD01-DIS (9290)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Staff"]}, "KD01-DIS (9293)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Staff"]}}}, "assessments": {"Discussion": "30", "Essays": "40", "Presentation": "30"}}, {"code": "1120", "title": "College, University and Community", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Joint Colleges General Edu", "requirements": "1. For College Year 1 Students only. 2. Students enrolled in this course cannot take GECC1131, GENA1112 or GEUC1011. 3. Chung Chi students are required to take GEJC1110 in the same term.", "description": "This course is jointly offered by Chung Chi, New Asia and United Colleges with the aim of introducing students to the basic elements of university education, history and traditions of college, campus life, personal development and social responsibility. The course comprises a series of lectures, each with a distinct theme. Together the lectures encompass critical aspects of education and life in the social, cultural and global contexts. The course would allow students to develop an understanding and appreciation of university education as well as their role and responsibility in the community.", "outcome": "By the end of this course, students will be able to:\r  1. develop inter-cultural sensitivity and appreciate different cultures and social issues in a global context; 2. recognize the common concerns of contemporary physical and social environment; 3. formulate personal set of positive attitudes and values; 4. demonstrate the ability to think independently; 5. adapt to university life and appreciate essential characteristics of university learning; 6. recognize the history and tradition of affiliated College.", "syllabus": "The course will cover a wide array of topics under five areas of knowledge:\r  1. Basic Skills\r  Topics: Intellectual Property Rights and Research Ethics\r 2. Adaptation to Change\r  Topics: Gender and Sexuality; Healthy Sleep and University Education\r 3. Horizon Widening\r  Topics: Architecture; Music; Service-Learning; Art and War: From Churchill to Zhang Daqian; Exploring Science on Computers\r 4. Contemporary Issues\r  Topics: Global Environmental Issues; Creativity and Entrepreneurship\r 5. University and College Education\r  Topics: University Traditions – East and West; The University and Its Colleges; College Briefings and Activities\r  The topics will be reviewed on a yearly basis, and have to be aligned with the specific knowledge areas mentioned above.", "required_readings": "Hayhoe, R. 1999. “Chapter 1 Concepts and Frameworks for Telling the Story” In China’s Universities 1895-1995, a Century of Cultural Conflict, 3-28. Hong Kong: University of Hong Kong.\r Kerr, C. 2001. “ The Idea of a Multiversity” In Uses of the University, 5th edition, 1-34. Cambridge, Massachusetts, London, England: Harvard University Press.\r Rashdall, H. 2009. “What is a university?” In The History of Higher Education, Vol II, edited by Roy Lowe, 18-35. London , New York: Routledge.", "recommended_readings": "To be assigned by lecture speakers.", "terms": {"2020-21 Term 1": {"--LEC (6370)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor CHAN Sun On, \n\rProfessor LEE Hung Kay, \n\rProfessor SIU Fung Ying Angela"]}}}, "assessments": {"Essays": "40", "Essay test or exam": "50", "Others": "10"}}]