[{"code": "1000", "title": "College Assembly", "career": "Undergraduate", "units": "0.00", "grading": "Pass/Not Pass", "components": "Assembly", "campus": "Main Campus", "academic_group": "United College", "requirements": "United College Assembly", "description": "", "outcome": "Understand the moral ethics associated with the College motto \"ming de xin min\".理解與書院校訓「明德新民」的道德理想Formulate personal set of positive attitudes and values.建立個人積極的人生態度及價值Recognize the common concerns of contemporary physical and social environment.關注當代人類共同面對的重大議題Develop cohesion and sense of belonging to United College.發展對母校的凝聚力和歸屬感Increase interests and improve life style.拓展興趣及提升生活品味Demonstrate intercultural sensitivity and appreciate different culture.具有跨文化觸覺，能欣賞不同文化 ", "syllabus": "Guests from various organizations and fields are invited to give speeches at College Assemblies; other formats like group discussion and performance may be arranged as well. A wide range of themes including culture, art, science, social affairs, as well as those for enhancing personal growth of students will be arranged for our College Assemblies.每次書院聚會設專題探討，邀請各界專家、學者作嘉賓，以增進同學對文化、藝術、科學及社會問題之認識，及在個人成長方面有所提升。採用之形式包括講座、討論、表演等。", "required_readings": "No沒有", "recommended_readings": "", "terms": {"2020-21 Term 1": {"-A01-ASB (7695)": {"startTimes": ["11:30"], "endTimes": ["13:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor LEE Hung Kay"]}, "AA01-ASB (8640)": {"startTimes": ["11:30"], "endTimes": ["13:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor LEE Hung Kay"]}}, "2020-21 Term 2": {"-A01-ASB (7713)": {"startTimes": ["11:30"], "endTimes": ["13:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor LEE Hung Kay"]}, "AA01-ASB (8870)": {"startTimes": ["11:30"], "endTimes": ["13:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor LEE Hung Kay"]}}}}, {"code": "1011", "title": "University Life and Learning", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "United College", "requirements": "For United College Year 1 Students only.", "description": "This course is designed to provide basic preparation for studying in the university. Topics include the aims of a university, the purposes of university education, campus life and the art of thinking - an introduction to the basic concepts, principles and methods of logical thinking, the rules of rational discourse and of scientific enquiry.\r", "outcome": " 建立與書院校訓一致的人生態度及價值觀； 關注當代人類共同面對的重大議題； 以終身學習的態度去拓展興趣，及提升生活品味； 掌握獨立思考和創新思維的能力； 提升包容和欣賞跨文化的能力。", "syllabus": "課題 內容 基本能力 如何管理您的生活、個人誠信、運動與健康、圖書館資源* 適應轉變 大學生活、心理健康、學習方法、性別認知 開闊視野 通識教育、舞台劇欣賞、歷史今昔 關心社會 大數據世代 書院關係 聯合書院的邁進  內容每年不同，由書院通識教育委員會於五月議訂下一學年的題目及講者。每年最少有兩個題目的變動，主要是因應世界和香港社會的轉變。", "required_readings": "1. 金耀基。〈大學之功能與大學生的責任觀〉。《大學之理念》。台北時報文化事業出版，1983。 2. 馬臨。〈中大精神〉。《中大學生報》。第99期。 3. 王俞。〈中文大學的本質〉。 香港專上學生聯會、中文學生會合編：《香港教育透視》，香港廣角鏡出版社，1982。 4. 李彼得。〈有效力的思考〉。《成功的通行證》第十二章。香港南華早報有限公司，1980。 5. 楊牧谷。〈聽課的藝術〉。《讀書這玩意兒》。校園書房出版社，1985。 6. 〈通識教育──訪問宗教系沈宣仁博士〉。《中文二十年》。香港中文大學學生會，1984。", "recommended_readings": "1. 《大學教育》。台灣商務印書館編審部，1972。 2. 〈大學的期望〉。吉柏特烈恩編：《認識大學》。台北環宇出版社，1974。 3. 房志榮。〈初步的學術工作〉。房志榮、沈宣仁：《學術工作與學術論文》，台北現代學苑出版社，1972。 4. 〈香港大學的發展〉。 香港大學學生會編：《香港教育未來：港大前瞻》。香港廣角鏡有限公司，1986。", "terms": {"2020-21 Term 1": {"--LEC (7696)": {"startTimes": ["13:30"], "endTimes": ["15:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor LEE Hung Kay"]}}}, "assessments": {"Essays": "60", "Essay test or exam": "30", "Others": "10"}}, {"code": "2017", "title": "Bacchus: Exploring Grape Wine", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "LectureSeminar", "campus": "Main Campus", "academic_group": "United College", "requirements": "For United College Year 2 and Year 3 students only.;Not for HTMG students.", "description": "Wine weaves in with human history from its very beginnings and developed into one of the foremost products of civilization. Great wines have their roots in the customs, traditions and history of their home ground. Celebration of vine and wine is often associated with the legend and worship of Bacchus, the wine God. Similarly, the origins of fermenting and drinking wine in China go far back in time. Tu Kang 杜康is a household name. It is no doubt that wine occupies an important place in the culture and life of the Chinese people. This course leads students on a cultural journey on wine around the world. It introduces to students a historical perspective on wine and its role in society. In addition, it provides students with basic knowledge on wine appreciation, and the relationship among wine, food and culture. Students can develop the skill to taste wines of common production regions and grape varieties. They can develop a positive understanding on various aspects of life through appreciation of wine culture.\r", "outcome": "Upon successful completion of this course, students will have acquired basic knowledge on appreciation, selection, serving, and tasting of wines.  In addition, students should be able to:  understand the relationship of social, historical and cultural factors that interact with wines, and health and social issues associated with alcoholism.  use basic terminology to describe the sensory properties of wines and evaluate wines by tasting link cuisine art and lifestyle, and understand the concepts of wine and food matching. assess wines for basic attributes, varietal character, terroir, and basic wine styles  discuss tradition, historical, and geographical characteristics and diversity of wines of the Old World and New World countries, and various country systems for classification of wines. Students will achieve the following desirable learning outcomes of the College General Education Programme: describe connections and integrate knowledge across fields; demonstrate the ability to think independently and innovatively; cultivate comprehensive views to appreciate different cultures; and develop leadership skills, and be able to collaborate and communicate effectively in teamwork.", "syllabus": "The topics include cultural history of wine and its role in society; descriptions of major wine types, wine-producing regions, grape varieties, and vintages; explanations of label terminology and wine production methods; techniques for opening and serving wine; and an introduction to sensory training and comparative tasting methods.   1. The Ways of Wine and Society  • History of wines and different cultural tastes throughout the civilization evolution • Sensory evaluation of wines – the science and practice of wine tasting, assessment techniques, the senses and how they work  • Wines and cuisine – principles of wine and food matching  • The rituals of wine – factors governing selection, storage and serving of wines   2. Vinification and Viticulture • The vine species and dominant international vs. regional grape varietals  • Terroir (soil, temperature, rainfall, slopes), yield and quality of wines  • In the vineyard and the winegrower’s year  • The art of the winemakers – fermentation, and white and red wine making processes   3. Wines and Travel - The World of Wines • The vine conquers the world – regions where Vitis Vinifera has developed are also regions where various civilizations reached peak of development  • New World versus Old World competition – stress on varietal as opposed to geographical, distinctions, identities, and labeling  • Leading wine production countries – their history, local culture, geographic location, famous wine regions and wine labeling laws (e.g. Appellation d'origine contrôlée (AOC) in France and Denominazione di Origine Controllata (DOC) in Italy)", "required_readings": "• Zraly, Kevin. (2005). Windows on the World: Complete Wine Course. Seterling Publishing Co., Inc., New York", "recommended_readings": "• 邑心文(編著) (2005). 酒的故事. 岳麓書社。 • Jobe, Joseph (ed.) (1982). The Great Book of Wine, Galahad Books, New York.  • Johnson, Hugh (1992). Vintage: The Story of Wine, Simon and Schuster, New York.  • Baldy, M.W. (1998). The University Wine Course: A wine appreciation text and self tutorial, The Wine Appreciation Guild.  • Johnson, Hugh and Robinson, J. (2001). The World Atlas of Wine, Mitchell Beazley.  • Galet, P. (2002). Grape Varieties, Cassell Illustrated, London.  • Jancis Robinson (1999). Vines, Grapes, and Wines, Alfred A. Knopf.", "terms": {"2020-21 Term 2": {"--LEC (6638)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Mr LUK Yiu Man Raymond"]}}}, "assessments": {"Essays": "30", "Essay test or exam": "40", "Presentation": "20", "Participation": "10"}}, {"code": "2018", "title": "Leadership in Practice", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "United College", "requirements": "For United College Year 2 and Year 3 students only.", "description": "It has been well established that experiential training is an excellent means of developing leadership, confidence, team spirit and other qualities of character. For many years the development of such qualities has been recognized as being of high importance by the senior management of the academic, non-government and commercial organizations. Leadership is best learned by doing. This course will explore and examine leadership theory and practice through experiential learning in the outdoor and a different setting rather than studying mainly in a classroom. It provides students with a structured, supervised programme of participation in the practice of leadership and teambuilding. The goal of this course is to help students acquire practical skills and judgment to develop their leadership qualities. On completion of this course, students will be able to identify and achieve their goals at a comparatively earlier stage in life.\r", "outcome": "Upon successfully completing this course, students will be able to: Execute thefivemain leadership functions which required by Action-centered Leadership Coordinate members to work together as an effective team; Apply problem solving strategies in tackling the assigned leadership task; Exhibit skills in communication in maintaining the morale of the team; and Construct their own conception of leadership. Students will achieve the following desirable learning outcomes of the College General Education Programme: understand the College motto and develop positive attitudes and values; develop life-long learning habits for expanding interest and improving life-style; demonstrate the ability to think independently and innovatively; and develop leadership skills, and be able to collaborate and communicate effectively in teamwork.", "syllabus": "This subject aims to bring out students’ firm understanding of the vital attributes of leadership skills for meeting the training needs of today’s young people. It places students in a simulated situation and coaches them to be responsible for dealing with problems, challenges and routine skills when training students to be practical, sensible and helpful in our society. The theory of outdoor experiential training for leadership and team building is that leadership skills can be honed and team spirit developed by taking students into the great outdoors. This concept features both physical and mental exercises.   Key theories about leadership will be introduced with their practical applications for leadership including the follows:  1. Defining leadership 2. Leadership and management 3. Nature of leadership and leadership styles 4. Action-centred leadership 5. Leadership checklist 6. Time management for leaders 7. Motivation for leaders 8. Creativity at work 9. Leadership tasks  The course includes a mixture of lectures, interactive tutorial, group discussion and challenge course which is specially designed to enhance personal development and team spirit in the sense of problem solving, caring colleagues and coping with the difficulties through participating in a series of challenging and exciting outdoor activities in an energetic and fun-filled atmosphere.   Students will be divided into small groups. Through job rotation, each student has opportunity to take a leading position to complete a leadership task. The training involves facilitators leading the students through activities, encouraging them to reflect on experiences and helping them to transfer the knowledge and skills learned to a working context. It focuses on enhancing self-awareness, changing attitudes, building teams and improving inter-personal skills.", "required_readings": "1. Adair, J. (2009). Effective leadership: How to be a successful leader. London: Pan Books. 2. Kouzes, J. & Posner, B. (2012). The leadership challenge. San Francisco, CA.:Jossey-Bass.", "recommended_readings": "1. Thomas, N. (2004). Adair on team building and motivation. London: Thorogood. 2. Gill, R. (2006). Theory and practice of leadership. London Sage. 3. Northouse, P.G. (2007). Leadership: Theory and practice. CA: Sage. 4. Yukl, G. (2012). Leadership in organizations. NJ: Prentice Hall.", "terms": {"2020-21 Term 2": {"--LEC (4634)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Staff"]}}}, "assessments": {"Essays": "30", "Fieldwork or field study": "60", "Others": "10"}}, {"code": "2019", "title": "Design Thinking Approach to Innovation", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "United College", "requirements": "For United College year 2 or year 3 students.;Not for IBBA major students.", "description": "The course aims to develop “T-shaped” characters who can develop the depth of expertise in a single field (one’s major as represented by the vertical bar of the T) while acquiring the ability to communicate and collaborate with others from different disciplines (the horizontal bar of the T) to address challenges. The ability to connect horizontally is “design thinking”. Individuals equipped with the ability to think as a designer will be able to innovate, tackle complex problems and manage changes in real life situations. With “design thinking” or by “thinking as a designer”, students can begin to understand how our world has come to its current form through intended and unintended design. Knowing that the only thing that is not designed, is nature, humans need to learn where to draw the line. By acquiring a designer’s mindset in looking at the world, each person can do one’s part to be a responsible and conscious prosumer of design. This includes utilizing eco-friendly artifacts and designing one’s learning, career and life experience on this planet in a responsible way.\r", "outcome": "On completion of the module, students are expected to be able to: Understand the background that gives rise to the experience economy, network society, and design thinking movement; Understand what “design thinking” or “thinking as a designer” means and be able to participate in a design process; Utilize role playing, prototyping and visualization aids to frame and solve problems in a group setting; and Apply design thinking in one’s life to become a modern day “educated person”.Students will achieve the following desirable learning outcomes of the College General Education Programme: describe connections and integrate knowledge across fields; demonstrate the ability to think independently and innovatively; cultivate comprehensive views to appreciate different cultures; and develop leadership skills, and be able to collaborate and communicate effectively in teamwork.", "syllabus": "1. Experience Economy, Network Society, and Design Thinking (a) Trace the rise of the experience economy and network society (b) Integrate user experience (UX), technology platform (TP), and business model (BM) to foster innovation (c) Understand the relationship between creativity, design and innovation (d) Facilitate the design process through divergent and convergent thinking methods and techniques in a multidisciplinary team context (e) Manage team formation and project implementation with digital tools  2. Managing the Design Process (a) Gain deep insights into the ecosystem dynamics formed by the various social actors as they respond to external forces and trends  (b) Recognize the importance of cultural identity and branding in the design process (c) Use brainstorming and visualization as a means to frame and solve problems (d) Storyboarding role playing the user journey (e) Build and test out prototypes to expedite the learning process  3. Technology Platform and Business Model for Sustainable Innovation (a) The cloud and big data environment (b) Platforms and frameworks for industry disruption and transformation (c) Using technology (including crowd sourcing and open-innovation resources) to gain competitive and process advantages (d) Business model mapping for product-market fit  (e) Validate user and customer adoption with Kickstarter, user testing, social media, and field observation", "required_readings": "1. British Design Council (2013) Design for Public Good  last accessed 6/2/2014 2. Christensen, C. (2014) Key Concepts of Disruptive Innovation < http://www.claytonchristensen.com/key-concepts/> last accessed 6/2/2014 3. Moore, G. (2012) Crossing the Chasm in Consumer Markets: A Visual Example  last accessed 6/2/2014 4. Osterwalder, A. (2010), Business Model Generation Chapter 1, John Wiley & Sons 2010. last accessed 1/4/2013  5. Pine II, J. B. (2004) TED: What consumers want last accessed 6/2/2014", "recommended_readings": "1. Buchanan, R. (1992) Wicked Problems in Design Thinking, Design Issues, Vol. 8, No. 2, pp. 5-21 2. Institute of International Studies (2001) UC Berkeley: Identity and Change in the Network Society --- Conversation with Manuel Castells last accessed 6/2/2014 3. Keller, K.L, Sternthal, B., and Tybout, A. (2002) Three Questions You Need to Ask About Your Brand, Harvard Business Review, September 2002.  4. Prahalad, C. K. and Ramaswamy, V. (2003) The New Frontier of Experience Innovation. MIT Sloan Management Review, Summer 2003, Vol. 44 No.4.  5. Wells-Papanek, D. and Hargrove, W. (2010) Victor Papanek Going Forward Action Research Study. < http://www.idsa.org/sites/default/files/VictorPapanekGoingForward.pdf >last accessed 6/2/2014", "terms": {"2020-21 Term 1": {"--LEC (6252)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Miss HO Wing Chee Beatrice"]}}, "2020-21 Term 2": {"--LEC (6439)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Miss HO Wing Chee Beatrice"]}}}, "assessments": {"Essays": "30", "Others": "10", "Project": "50", "Participation": "10"}}, {"code": "2101", "title": "Social Service: Participation and Reflection", "career": "Undergraduate", "units": "1.00", "grading": "Pass (P)/Fail (U)", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "United College", "requirements": "For United College students to take in their second year and third year of study only.;Social Work major students cannot take the course to fulfill General Education requirements.", "description": "The objective of this course is to foster students to become positive and responsible citizens through participating in community social service. Based on the principles of service-learning and theories of experiential learning, the course assists students to consolidate their prior and on-going community service experiences. Through self reflection, small group discussion, community agency visits and project presentation, students will be able to understand the needs of vulnerable groups, aware of human issues related to social justice and develop positive attitude to community social service. The purpose of this course is to facilitate students’ self development and develop a long-term interest in serving the community and populations in need.\r", "outcome": "After completion of this course, students will be able to: Understand the theory and practice of service-learning and social enterprisingness; Integrate community service or social enterprise visit experiences with the related principles; Relate their experiential-learning experience with the concepts of civic responsibility and social justice; Critically appraise their personal development in relation to their experiential-learning experience; Develop an awareness towards populations in need and identify ways to serve them; and Initiate long-term interest to serve the community and society; and Practice constant self-reflection in order to achieve self-discovery and self-expression.Students will achieve the following desirable learning outcomes of the College General Education Programme: understand the College motto and develop positive attitudes and values; recognize the common concerns of the contemporary world; demonstrate social enterprisingness in protecting the environment and serving the community; and develop life-long learning habits for expanding interest and improving life-style.", "syllabus": "The major concepts and topics to be covered in this course are:  I. Theory and Practice of Service-Learning i. Theoretical roots of service-learning ii. Basics and principles of service-learning iii. Positive and best practices in service-learning  II. Perspectives on Personal Development i. A humanistic approach to personal growth ii. Choice theory approach to personal growth iii. Multiple intelligences and multiple learning styles  III. Principles of Experiential and Reflective Learning i. Three models of the experiential learning process ii. Kolb’s experiential learning cycle iii. Practice of reflective learning  IV. Importance of Civic Responsibilities i. Volunteerism ii. Principles of social justice Social Entrepreneurship  I. Introduction, course requirements and conceptualization II. Understanding the socially disadvantaged, understanding social enterprise in Hong Kong III. Principles and skills in visit and interview", "required_readings": "On Service-Learning  1. 東華大學教學卓越中心社會參與教師社群 (編) (2012)。教育小革命 -- 大學生的十堂社會參與課。台北：心靈工坊文化事業。 2. Butin, D.W. (2010). Service-learning in theory and practice: the future of community engagement in higher education. NY: Palgrave Macmillan. Chapter 1. 3. Xing, J. & Ma, H. K. (2010). Service-Learning in Asia: Curricular Models and Practices. HK: Hong Kong University Press.  On Volunteerism and Personal Development 4. Liu S.C., Holosko, M. & Lo, T.W. (Ed.) (2008) Youth Empowerment and Volunteerism: Principles, Policies and Practices. City University of Hong Kong Press. 298-306. 5. Wong, L. P., Chui, W. H., & Kwok, Y. Y. (2011). The volunteer satisfaction index: A validation study in the Chinese cultural context. Social indicators research, 104(1), 19-32.   On Understanding the Social Disadvantaged Groups and Social Welfare Services in Hong Kong 6. 黃洪 (2013) 。「無窮」的盼望 -- 香港貧窮問題探析。香港：中華書局。 7. Batson, C.D., Admad, N. & Tsang, J.A. (2002). Four motives for community involvement. Journal of Social Issues, 58(3), 429 – 445. 8. Hughes, C., Steinhorn, R., Davis, B. Beckrest, S., Boyd, E. & Cashen, K. (2012). University-Based Service Learning: Relating Mentoring Experiences to Issues of Poverty. Journal of College Student Development 53(6). 767-782.  On Program Planning, Implementation and Evaluation 9. 甘炳光 (2009) 。小组遊戲帶領技巧 -- 從概念到實踐。香港：香港城市大學出版社。 10. 黃幹知、梁玉麒 (編著) (2011) 。舉一玩十 -- 一種物質帶領多個遊戲。香港：策馬文創。  On Experiential Learning and Reflective Thinking 11. Ngai, S. Y. (2009). The Effects of Program Characteristics and Psychological Engagement on Service-Learning Outcomes: A Study of University Students in Hong Kong. Adolescence. 44(174). 375-389.  On Social Entrepreneurship 12. Au, K. & Birtch, T.A. (2010). Social enterprise as an interactive process between entrepreneurs and the community: a social capital perspective. In S.H. Ng, S.Y.L. Cheung & B. Prakash (Eds.), Social capital in Hong Kong: Connectivities and social enterprise (pp. 279-301). Hong Kong: City University of Hong Kong Press. 13. Chan, K.T., Kuan, Y.Y. and Wang, S.T. (2011), “Similarities and divergences: comparison of social enterprises in Hong Kong and Taiwan”, Social Enterprise Journal, Vol. 7 No. 1, pp. 33-49. 14. Ridley-Duff, R. & Bull, M. (2011). Understanding social enterprise: theory & practice (pp. 56-81). London; Thousand Oaks, Calif.: SAGE. (Chapter 3: Defining Social Enterprise, p.56-81)", "recommended_readings": "On Service-Learning  1. 香港青年協會 (2009) 。社會服務學習經歷 -- 青年服務長者專集。香港：香港青年協會。 2. 馬學嘉、陳章明、劉誠、麥梅芳 (主編) (2014) 。高等教育新思維：中國特式的服務學習。北京：社會科學文獻出版社。 3. 黃玉 (總校閱) (2009)。從服務中學習 -- 跨領域服務 - 學習理論與實務 (第二版)。台北：洪葉文化事業。 4. 嶺南大學服務研習處 (2008)。服務學習計劃：嶺南模式。香港：嶺南大學服務研習處。 5. Deeley, S.J. (2015), Critical Perspectives on Service-Learning in Higher Education, UK: Palgrave Macmillan  On Volunteerism and Personal Development 6. 香港青年協會 (2008) 。「青年志願者領袖培訓計劃」彙編。香港：香港青年協會。 7. Haldar, U.K. (2010). Leadership and team building. India: Oxford University Press.  8. On Understanding the Social Disadvantaged Groups and Social Welfare Services in Hong Kong 9. 陳啟芳、黃昌榮、邵家臻 (編) (2012) 。會說話的社會福利。香港：圓桌文化。 10. Altschuld, J.W. & White, J.L. (2010). Needs Assessment, analysis and prioritization. LA: Sage. 11. 周永新 (2013) 。社會政策的觀念和制度。香港：中華書局。  On Program Planning, Implementation and Evaluation 12. 蔡炳綱、吳漢明 (2001) 。72個體驗活動。香港：匯智。 13. On Experiential Learning and Reflective Thinking 14. Brockbank, A. & McGill, I. (2007). Facilitating reflective learning in higher education. (2nd ed.) NY: Open University Press.  On Social Entrepreneurship 15. Centre for Entrepreneurship. 2014. Research Study on the Social Enterprise sector in Hong Kong: to Capture the Existing Landscape of the Social Enterprises in Hong Kong. The Chinese University of Hong Kong. (Chapter 2: Examine Social Value Creation in Social Enterprises, p.9 – 20) 16. http://entrepreneurship.bschool.cuhk.edu.hk/SEresearch 17. Defourny, J. and Kim, S.Y. (2011), “Emerging models of social enterprise in Eastern Asia: a cross-country analysis”, Social Enterprise Journal, Vol. 7 No. 1, pp. 86-111. 18. Ko, S. (2012), “Viability of social enterprises: the spillover effect”, Social Enterprise Journal, Vol. 8 No. 3, pp. 251-263. 19. 社企流 (2014) 。《社企力》。臺灣：果力文化。 20. 張瑞霖(2011) 。《黑暗中對話：經營社會企業的體悟》。香港：商務印書館。 21. 李美儀、陸人龍主編。(2010) 。《社會創新: 香港社企發展研究 (第一版) 》。香港: 商務印書館。 22. 謝家駒主編 (2007) 。《新愚公移山：十個社會企業創業者的故事》。香港：社會創業論壇。 23. 香港(中國). 社會福利署。(2006) 。《企業匯眾, 社會共融 : 復康-社會企業》。香港：社會福利署。  Useful Websites: 24. The Hong Kong Council of Social Service - http://www.hkcss.org.hk/ 25. HKSAR Government Official Site – Social Enterprise - http://www.social-enterprises.gov.hk/ 26. Social Enterprise Summit - http://www.social-enterprise.org.hk/ 27. Hong Kong Social Entrepreneurship Forum - http://www.hksef.org/ 28. Hong Kong Social Enterprise Incubation Centre Ltd. - http://www.seic.hk/ 29. Social Ventures Hong Kong - http://www.sv-hk.org/ 30. Wofoo Social Enterprises - www.wse.hk 31. Commission on Poverty - http://www.cop.gov.hk/ 32. Social Enterprise Directory - http://sebc.org.hk/sebc/eng/node/64", "terms": {"2020-21 Term 1": {"AF01-FLD (4722)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Mr WONG Kon Chi"]}, "BF01-FLD (5945)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [2], "locations": ["Lee Shau Kee Building 514-5"], "instructors": ["Mr WONG Kon Chi"]}, "CF01-FLD (5946)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [3], "locations": ["Lee Shau Kee Building 514-5"], "instructors": ["Dr CHOY Bing Kong"]}, "DF01-FLD (5947)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr CHOY Bing Kong"]}, "SF01-FLD (4593)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. NG Chui Ha"]}}, "2020-21 Term 2": {"AF01-FLD (4680)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [4], "locations": ["T.C. Cheng Bldg C1"], "instructors": ["Ms. FUNG Yin King Helina"]}, "BF01-FLD (7984)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [4], "locations": ["TBA"], "instructors": ["Staff"]}, "CF01-FLD (7062)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [3], "locations": ["Lady Shaw Bldg LT2"], "instructors": ["Staff"]}, "DF01-FLD (8493)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [2], "locations": ["Lady Shaw Bldg LT5"], "instructors": ["Dr CHOY Bing Kong"]}, "SF01-FLD (8947)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [5], "locations": ["Institute of Chin Studies L1"], "instructors": ["Dr. NG Chui Ha, \n\rProfessor TAM Wai Lun"]}}}, "assessments": {"Essays": "35", "Fieldwork or field study": "30", "Presentation": "35"}}, {"code": "2102", "title": "Public Affairs: Participation and Reflection", "career": "Undergraduate", "units": "1.00", "grading": "Pass (P)/Fail (U)", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "United College", "requirements": "For United College students to take in their second or third year of study.;Government and Public Administration major students cannot take this course to fulfill General Education requirements.", "description": "This course aims to foster students’ sense of citizenship and leadership by enhancing their ability to understand and analyse political and social problems. It is not confined to the technical training of political and policy analysts, but broadened to the liberal education of citizens who have the knowledge, attitudes and competence to participate in public affairs. The purpose of the course is to raise the awareness of students towards social issues, nurture their ability to identify and analyse the pivotal aspects of the issues, and most importantly, encourage the students to form their own opinions and to suggest solutions. In line with this purpose, the course is issue-oriented, with controversial issues cutting across the discussions and reflections. Apart from classroom teaching and discussion, there will also be field trips to government agencies as well as non-government organizations, in which students will have opportunities to directly exchange ideas and opinions with government officials, community leaders and ordinary people.", "outcome": "This course will furnish the students with the following capacities and skills: Throughout the course the students are expected to master the basic concepts in political analysis and be able to apply them to analyse real-world problems. More specifically, the students are expected to develop some basic knowledge as to the different features of civil society, social movement and governance. By taking this course, the students are expected to be familiar with a wide range of practical problems besting the ordinary citizens in Hong Kong and the Mainland China. The students are encouraged to consider and observe the ways in which civil society can help to tackle and resolve these problems, and whether too much hope is placed on civil society. In recent years the places like Hong Kong, Mainland China and Asia in general has been marked by the rise of social movements and new social movements. By taking this course, the students are expected to develop the skills to analyse the rationale behind the social movements and their impact on governance. Perhaps more importantly, the students are expected to have the opportunity and ability to reflect on the ‘optimal’ relationships between government, private corporations and the social activists of a new generation.  This course is intended to develop the students into active and considerate citizens. In order to become good citizens, they must master generic skills in terms of articulating and communicating complicated ideas and analytical results effectively in both verbal and written formats. These skills are unlikely to emerge automatically. They have to be deliberately nurtured. In this course, through face-to-face interaction with social participants, and a round of presentation and discussion exercises, the students are offered a well-organised setting where their analytical and communicating skills can burgeon.Students will achieve the following desirable learning outcomes of the College General Education Programme: understand the College motto and develop positive attitudes and values; recognize the common concerns of the contemporary world; demonstrate social enterprisingness in protecting the environment and serving the community; and demonstrate the ability to think independently and innovatively.", "syllabus": "Lecture Plan  Week One (2 Hours). Civil Society and the State  Theme: This lecture introduces the concepts of the state and civil society. It studies the challenges that the contemporary governments encounter in doing public governance from a state-society interaction perspective.  Week Two (2 Hours). Social Movement  Theme: This topic aims at providing a general picture of the development, processes and characteristics of traditional and new social movements, particularly in relation to the theoretical framework of state-civil society relations discussed in previous topic.  Week Three/Four (total 4 Hours). Guest speaker’s session/fieldtrip  Week Five/Six/Seven (total 5 Hours). Group presentation and discussion   List of organizations 1. Politics/ Think tank 2. New media 3. Urbanism/ Urban politics 4. Art and Culture 5. Green 6. Community", "required_readings": "1.) Shils, E. (1991). “The virtue of civil society”, Government and Opposition, Vol. 26, No. 1, pp. 3-20. 2.) Johnston, H. (2011). States and Social Movements. Cambridge: Polity, chapter 1: “The State, Protest and Social Movements”. 3.) Eder, K. (2011). “The ‘New Social Movements’: Moral Crusades, Political Pressure Groups or Social Movements,” in Zirakzadeh, Cyrus Ernesto ed., Social and Political Movements (Volume 1). London: Sage, pp. 343-58.", "recommended_readings": "1.) Skocpol, T. (1985). “Bringing the State Back In: Strategies of Analysis in Current Research,” in Evans, P. B., Rueschemeyer, D. and Skocpol, T. Eds., Bringing the State Back In. Cambridge: Cambridge University Press, pp. 3-37. 2.) Elin, L. (2003). “The Radicalization of Zeke Spier: How the Internet Contributes to Civic Engagement and New Forms of Social Capital”, in McCaughey, M. and Ayers, M. D. (eds.) Cyberactivism: online activism in theory and practice. London: Routledge, pp. 97-116. 3.) Tarrow, S. (2011). Power in Movement: Social Movements and Contentious Politics. Cambridge: Cambridge University Press, chapter 1: “Contentious Politics and Social Movements”. 4.) 葉蔭聰（2010），《直接行動》（香港：進一步多媒體）。 5.) 葉蔭聰，“彰顯道統的一支泛民”，《明報》，2011年1月9日。", "terms": {"2020-21 Term 1": {"AF01-FLD (4893)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor TAM Kam Lan Annie"]}, "BF01-FLD (4940)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr. CHAN Wai Yin"]}}, "2020-21 Term 2": {"AF01-FLD (5442)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [2], "locations": ["Humanities Building 115"], "instructors": ["Mr. CHOY Chi Keung Ivan"]}, "BF01-FLD (5283)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [2], "locations": ["T.C. Cheng Bldg C1"], "instructors": ["Mr. CHOY Chi Keung Ivan"]}, "CF01-FLD (7870)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [3], "locations": ["T.C. Cheng Bldg C1"], "instructors": ["Mr. CHOY Chi Keung Ivan"]}, "DF01-FLD (4934)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [3], "locations": ["Humanities Building 115"], "instructors": ["Mr. CHOY Chi Keung Ivan"]}}}, "assessments": {"Essays": "35", "Fieldwork or field study": "30", "Presentation": "35"}}, {"code": "4011", "title": "Senior Seminar", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureProject", "campus": "Main Campus", "academic_group": "United College", "requirements": "For United College Students only", "description": "This is a compulsory three-unit and small-group student-orientated teaching (STOT) course for final year students, with teaching staff serving as supervisors, the emphasis will be on students’ participation and discussion. Student groups will choose a topic of their own interests, conduct research studies, present their findings and submit a report.The course objectives include:1. Arousing students’ interest in exploring contemporary local or global issues; 2. Sharpening research, problem-solving and thesis-writing skills; and3. Enhancing ability in conducting group research projects and seminars which require a collective effort\r.", "outcome": "Upon completion of the course, students are expected to achieve the following learning outcomes: recognize the common concerns of the contemporary world; describe connections and integrate knowledge across fields; demonstrate the ability to think independently and innovatively; cultivate comprehensive views to appreciate different cultures; and develop leadership skills, and be able to collaborate and communicate effectively in teamwork.", "syllabus": "As it is a STOT course, no specific subject contents will be taught in the class. Student groups will pick their own research topics and conduct formal research, present findings and prepare written report.  The course arrangements are as follows:  1. Pre-course registration and topic selection 2. Meetings and communication with respective class supervisors and/or graduate research consultants (postgraduate students) 3. Work out research plans 4. Literature review or background research 5. Setup milestones or schedule for the research processes 6. Conduct research via appropriate means (questionnaire, survey, interview, focus group, etc) 7. Confirm research findings, explore implications and limitations 8. Prepare oral presentations 9. Prepare written reports", "required_readings": "1. Babbie, E. 2004. The Practice of Social Research. Thomason/Wadsworth. 2. Baker, T.L. 1999. Doing Social Research. 3rd ed. McGraw-Hill. 3. Chan, Y.K. et al. 1991. A Practical Guide to Sample Surveys. Hong Kong Statistical Society. 4. Dooley. D. 2001. Social Research Methods. 4th ed. Prentice Hall. 5. Fowler, F.J. Jr. 2002. Survey Research Methods. 3rd ed. Sage. 6. Miller, D.C. 2002. Handbook of Research Design and Social Measurement. 6th ed. Sage. 7. 陳膺強，1998，<應用抽樣調查>，商務印書館。 8. 香港中文大學社會學系，2002，<社會研究一本通>，香港中文大學出版社。", "recommended_readings": "", "terms": {"2020-21 Term 1": {"AAJ1-PRJ (5665)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. John Alexander WRIGHT"]}, "ABJ1-PRJ (8433)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor XU Lei"]}, "ACJ1-PRJ (4558)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor XU Yuan"]}, "ADJ1-PRJ (6251)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor XU Yunjian"]}, "AEJ1-PRJ (7502)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor YAO Zhihua"]}, "AFJ1-PRJ (7975)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor ZENG Tieyong"]}, "AGJ1-PRJ (8454)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor ZHAO Ni"]}, "AJ01-PRJ (8685)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor BAI Barry"]}, "BJ01-PRJ (8315)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. CHAN To"]}, "CJ01-PRJ (6945)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor CHEN Yangchao"]}, "DJ01-PRJ (5620)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Mr. CHU Kin Kan Astley"]}, "EJ01-PRJ (7942)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor CHU Lee Man"]}, "FJ01-PRJ (5621)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. FU Rao"]}, "GJ01-PRJ (6964)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor FUNG Hoi Lam Helene"]}, "HJ01-PRJ (5208)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor Patrick James HARVEY"]}, "IJ01-PRJ (5291)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. IP Tak Sang"]}, "JJ01-PRJ (7490)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. KOON Ho Kee"]}, "KJ01-PRJ (7448)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor LAM Tai Ning"]}, "LJ01-PRJ (5623)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. LAU Yuk King"]}, "MJ01-PRJ (8682)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. LAW Yee Shui"]}, "NJ01-PRJ (8683)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor LEE Hung Kay"]}, "OJ01-PRJ (5624)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor LEE Kaman"]}, "PJ01-PRJ (5625)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. LEE Pak Kuen Philip"]}, "QJ01-PRJ (5626)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. LEUNG Chung Ho"]}, "RJ01-PRJ (5663)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. LEUNG Tak Wah"]}, "SJ01-PRJ (7999)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. LO Wai Sze"]}, "TJ01-PRJ (8711)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor LOK Tat Ming"]}, "UJ01-PRJ (5662)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Miss HO Wing Chee Beatrice"]}, "VJ01-PRJ (7287)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor Duncan James POUPARD"]}, "WJ01-PRJ (6982)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor SHEN Jianfa"]}, "XJ01-PRJ (5664)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. SIU Kam Wah"]}, "YJ01-PRJ (7322)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor TIAN Xiaoyu"]}, "ZJ01-PRJ (8713)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor WONG Man Hon"]}}}, "assessments": {"Presentation": "30", "Participation": "20", "Report": "50"}}, {"code": "4012", "title": "Social Enterprise and Innovation: Internship", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Others", "campus": "Main Campus", "academic_group": "United College", "requirements": "For students of United College.", "description": "This is an advanced experiential-learning course that will give students an opportunity to work directly for social enterprises under the guidance of their supervisors and professional mentors. Students would have opportunities to experience how the social enterprises help the underprivileged groups and gain hands-on business experience, which will strengthen their soft skills, help them implement the innovative business and promotional ideas in a practical way, and will greatly improve their understanding on the societal needs of the community.This course is designed to immerse students in the world of social enterprise. This course enables students to further develop career and apply leadership-ready skills in the operation of a social enterprise or social business. Students are encouraged to provide ideas to promote the designated social enterprise among the youth community, and they will also have an opportunity to undertake an internship in a real social enterprise setting.", "outcome": "After completion of this course, students will be able to: Integrate and apply theoretical knowledge in service leadership Demonstrate an understanding of the ways in which social enterprise initiatives and the humanities and social sciences research skills, methods, knowledge and information are relevant to post-university working life and advance career prospects and applications; Demonstrate a degree of professional expertise commensurate with an intensive period of practical hands-on experience through providing ideas to promote the social enterprise among youth community; Adjust to a real-life work setting and understand the organizational culture of a social business; Exchange ideas and experiences with partners, resolve differences, mutually enhance personal development and accomplish tasks through collaborationStudents will achieve the following desirable learning outcomes of the College General Education Programme: Understand the College motto and develop positive attitudes and values Recognize the common concerns of contemporary world Demonstrate social enterprisingness in protecting the environment and serving the community Describe connections and integrate knowledge across fields Develop leadership skills, and be able to collaborate and communicate effectively in teamwork", "syllabus": " Pre-Internship Preparation Activities Pre-Internship orientation  Aim and objective of Internship Nature, mission and business of the attached social enterprises  Roles and Responsibilities of students, supervisor and social enterprise supervisor Workplace etiquette, work attitude and professional ethics at work Practical arrangement   First meeting with the designated social enterprise  Meeting the social enterprise supervisor and self-introduction Social enterprise and work place orientation Working hours and practices arrangement   Creation of action plan  Preparing workplan to social enterprise supervisor Workplan progress update process and timeline Agreeing on measurement Mutually agree on internship expectation and outcomes    During-Internship Learning Activities Internship work, including action plan  Keeping work journal Updating action plan periodically Obtaining periodic feedback from social enterprise supervisor   Mid-term and final reports  Mid-term progress report to supervisor Final report (draft version) to supervisor     Post-Internship Consolidation Activities Final debriefing with the supervisor  Obtaining social enterprise evaluation report Completing self-evaluation report Meeting supervisor for debriefing   Final presentation  Presentation to supervisor and social enterprise supervisor Final report submission with revision after final presentation  ", "required_readings": "Dr. Kee Chi Hing, Dr. Clara Kan, Ms. Eva Wong (2018), “Applying Design Thinking to Create Social Impacts: A win-win for SE & CSR”, Fullness Social Enterprises Society Dr. Kee Chi Hing, Dr. Clara Kan (2016), “Hong Kong: Frontier in Social Entrepreneurship”, Fullness Social Enterprises Society Dr. Kee Chi Hing, Mr. Ted Kwan, Dr. Clara Kan (2016), “Comparing the Key Performance Indicators of the Social Enterprise Sectors Among Hong Kong, United Kingdom and Korea”, Fullness Social Enterprises SocietyDr. Kee Chi Hing, Mr. Ted Kwan, Mr. Joseph Chan, Dr. Tracy Ng (2016), “Introduction to Social Impact Measurement Hong Kong Context”, Fullness Social Enterprises Society徐沛然 (2018), 社企是門好生意?社會企業的批判與反思, 台北: 時報出版", "recommended_readings": "Catherall, R., & Richardson, M. (2017). Social entrepreneurship in education: Empowering the next generation to address society’s needs. The British Council.Martin Lackéus. (2015). Entrepreneurship in education - What, why, when, how. Retrieved from https://www.oecd.org/cfe/leed/BGP_Entrepreneurship-in-Education.pdfJanus, K.K. (2015 June 15). Bringing social entrepreneurship into the classroom. Stanford Social Innovation Review.Amoros, J. Ernesto, and Bosma, Niels. (2014). Global Entrepreneurship Monitor: 2013 global report. Au, Kevin. (2014). Research study on social enterprise sector in Hong Kong. Bosma, Niels; Jones, Kent; Autio, Erkko; and Levie, Jonathan. (2008). Global Entrepreneurship Monitor: 2007 executive report. Chan, Kam-Tong. (23 January 2015). Presentation: Development and outlook of social enterprises in Hong Kong: From an academic perspective. Choi Young-Chool and Jang Ji-Hyun. (March 2014). Analysis of current conditions facing social enterprise in Korea: Policy issues regarding the sustainability development. International Journal of Business and Social Research, vol. 1, no. 3. Drucker, Peter. (1990). Managing the non-profit organization. DTI. (2002). Social enterprise: A strategy for success. Kang, Daesung. New model of social enterprise innovation and expansion. Social Enterprise World Forum DVD. Kirkpatrick, Donald. (2005). Transferring learning to behavior. Barrett-Koehler Publishers. Lee, Chaephil. (2014). Strategy of Korea for vitalization of social enterprises. Social Enterprise World Forum DVD. Miller, David, ed. (1985). Popper selections. Princeton University Press. Rogers, Everett. (1962, 2003). Diffusion of innovations. 5th ed. New York: Free Press. Santos, Filipe. (2012). A positive theory of social entrepreneurship. Journal of Business Ethics, vol. 111, 335–351. Social Enterprise Coalition. (2010). No more business as usual: A manifesto of social enterprise. Social Enterprise London. (2011). Transition. Tukey, John. (1962). The future of data analysis. Annals of Mathematical Statistics, vol. 33, no. 1. Yoo, Jungkyu. Corporate governance for social innovation. 2014 Social Enterprise World Forum DVD.Brock, D.D., & Kim, M. (2011). Social entrepreneurship education resource handbook. SSRN Electronic Journal.", "terms": {"2020-21 Term 2": {"-O01-OTH (4817)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [3], "locations": ["TBA"], "instructors": ["Dr. NG Chui Ha, \n\rProfessor TAM Wai Lun"]}}}, "assessments": {"Others": "50", "Presentation": "30", "Report": "20"}}]