[{"code": "5011", "title": "Geographic Information Systems", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSc Geoinformation Science", "description": "This course discusses the principles, structure and application of geographic information systems. It emphasizes on the use of Geographic Information Systems (GIS) to organize and manage spatial data, and how to perform spatial analysis with GIS. Topics include: GPS data acquisition, georelational data model, raster and vector data structures, spatial database, spatial analysis and application issues.", "outcome": "At the end of the course, students are expected to:- Understand the essence of spatial data modelling, spatial analysis skills, navigation and positioning techniques, latest development trends, GIS applications and project management;- Gain experiences in investigating and solving real problems using GIS through practices and final project.", "syllabus": "Topics include: GPS data acquisition, georelational data model, raster and vector data structures, spatial database, spatial analysis and application issues.", "required_readings": "Textbook (reserved in Chung Chi Library)Chang, Kang-tsung, 2016, Introduction to Geographic Information Systems, 8th Edition, McGrew Hill International Edition [G70.212 .C4735 2016].Major Reference Book (reserved in Chung Chi Library)Burrough, P. A., McDonnell, R., McDonnell, R. A., & Lloyd, C. D. (2015). Principles of geographical information systems. Oxford University Press. [G70.212 .B87] ", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (3998)": {"startTimes": ["18:30"], "endTimes": ["20:30"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. MAK Shuk Han, \n\rProfessor CHEN Yongqi"]}, "-L01-LAB (3999)": {"startTimes": ["20:30"], "endTimes": ["21:30"], "days": [1], "locations": ["No Room Required"], "instructors": ["Dr. MAK Shuk Han, \n\rProfessor CHEN Yongqi"]}}}, "assessments": {"Examination": "40", "Homework or assignment": "30", "Project": "30"}}, {"code": "5012", "title": "GIS-T and Logistical Information Management", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSc Geoinformation Science", "description": "This course focuses on how geographic information systems (GIS) can be used to support various applications in transportation and logistics. This course covers such topics as shortest paths, routing, network flows, facility location, travel demand analysis, and intelligent transportation systems. Students will use TransCAD (Caliper Corp.) and ArcGIS (ESRI) in this course to gain hands-on experience with GIS-T. The main course objective is to help students gain a better understanding of GIS-T concepts and GIS-T applications.", "outcome": "At the end of the course, students are expected to:\r - Understand the principles of applying GIS to the areas of transportation and logistics; - Gain familiarity with the use of GIS-T tools; - Develop competence in implementing an application of GIS for transportation or logistics.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (4000)": {"startTimes": ["18:30"], "endTimes": ["20:30"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor HE Ying, \n\rProfessor HUANG Bo"]}, "-L01-LAB (4001)": {"startTimes": ["20:30"], "endTimes": ["21:30"], "days": [2], "locations": ["No Room Required"], "instructors": ["Professor HE Ying, \n\rProfessor HUANG Bo"]}}}}, {"code": "5022", "title": "Digital Remote Sensing Image Analysis", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSc Geoinformation Science", "description": "This course discusses the principles and applications of remote sensing image analysis. Topics include principle of remote sensing, acquisition of satellite imagery, format of digital images, digital image processing systems, image display, geometric correction, radiometric adjustment, image enhancement, image classification, accuracy verification, change detection, and orthophoto applications. This course is taught with both lectures and laboratories. Lectures will be accompanied by laboratories for students to grasp both the theoretical and practical issues in remote sensing image analysis.", "outcome": "At the end of the course, students are expected to:  - Understand the principles of satellite remote sensing; - Learn the techniques of digital image analysis; - Understand how digital image analysis is being used in geographical studies.", "syllabus": "1) Principle of Remote Sensing 2) Image Resolutions 3) Technical Aspects of Resolutions 4) Image Enhancement 5) Image Preprocessing 6) Multispectral Transforms  7) Spatial Filtering and Texture Analysis 8) Image Classification 9) Accuracy Assessment 10) Change Detection", "required_readings": "Jensen, J.R., 2005, Introductory Digital Image Processing: A Remote Sensing Perspective, 3rd edition, Prentice-Hall, Upper Saddle River, New Jersey.", "recommended_readings": "• Jensen, J.R., 2016, Introductory Digital Image Processing: A Remote Sensing Perspective, 4th edition, Pearson Education, Inc. Glenview, IL • Campbell, J.B., 2002, Introduction to Remote Sensing, 3rd edition, Guilford, New York. • Fenstermaker, L.K., 1994 (ed.), Remote Sensing Thematic Accuracy Assessment: A Compendium, American Society for Photogrammetry and Remote Sensing, Nethesda. • Franklin, S. 2001, Remote Sensing for Sustainable Forest Management, Lewis, Boca Raton. • Jensen, J.R., 2007, Remote Sensing of the Environment, an Earth Resource Perspective, 2nd edition, Prentice Hall, New York. • Lillesand, T.M., R.W. Kiefer and J.W. Chipman, 2008, Remote Sensing and Image Interpretation, 6th edition, John Wiley and Son, Hoboken, NJ.  • Mather, P.M., 2004, Computer Processing of Remotely Sensed Images, 3rd edition, John Wiley & Sons, New York. • Richards, J.A. and X. Jia, 2006, Remote Sensing Digital Image Analysis, 4th edition, Springer & Verlag, London. • Schott, J.R., 1997, Remote Sensing: the Image Chain Approach, Oxford University Press, New York. • Schowengerdt, R.A., 2007, Remote Sensing: Models and Methods for Image Processing, 3rd Edition, Academic Press, New York. • Wilkie, D.S., 1996, Remote Sensing Imagery for Natural Resources Monitoring: A Guide for First-Time Users, Columbia University Press, New York.", "terms": {"2020-21 Term 1": {"--LEC (4381)": {"startTimes": ["18:30"], "endTimes": ["20:30"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Dr. WONG Kwan Kit"]}, "-L01-LAB (1490)": {"startTimes": ["20:30"], "endTimes": ["21:30"], "days": [3], "locations": ["No Room Required"], "instructors": ["Dr. WONG Kwan Kit"]}}}, "assessments": {"Lab reports": "40", "Project": "40", "Participation": "20"}}, {"code": "5023", "title": "Applied Remote Sensing", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSc Geoinformation Science", "description": "This course discusses various applications of remote sensing image analysis. The course begins by introducing the basic principle of remote sensing and an overview of remote sensing applications. On one hand, individual topics covering the application of remote sensing in vegetation, urban landscape, water and hydrology are discussed. On the other hand, various kinds of remotely-sensed data including high-resolution, thermal, hyperspectral, radar are introduced. This course is taught with lectures, laboratories and individual projects. Lectures will be accompanied by laboratories for students to grasp both the theoretical and application issues of remote sensing. Students are required to initiate, present and submit individual project to complete the course requirement.", "outcome": "At the end of the course, students are expected to:\r - Understand the application of remote sensing data in different aspects of the environment including vegetation, urban landscape and water; - Learn the skills in processing and analysing different types of remote sensing data; - Extract initial statistics and thematic information from different data.\r • Acquire advanced knowledge and skills in classification problems", "syllabus": "1) Principle of radiative transfer\r 2) Image spectrometry\r 3) Thermal infrared remote sensing and applications\r 4) Radar remote sensing and applications\r 5) Airborne remote sensing \r 6) Advanced vegetation mapping/ classification\r 7) Vegetation biophysical parameter estimation\r 8) Water remote sensing and hydrological applications\r 9) Image fusion and feature selection\r 10) Advanced classification algorithms", "required_readings": "Nil", "recommended_readings": "There is no single text for this class. The following materials are given for reference: \r • Cracknell A.P. and L. Hayes (2007) Introduction to Remote Sensing, 2nd Edition, CRC Press, Taylor & Francis Group, London.\r • Campbell, J.B. (2002) Introduction to Remote Sensing, 3rd edition, Guilford, New York.\r • Donnay, J.P., M.J. Barnsley and P.A. Longley (2001) Remote Sensing and Urban Analysis, Taylor & Francis, London.\r • Fenstermaker, L.K. (1994) Remote Sensing Thematic Accuracy Assessment: A Compendium, American Society for Photogrammetry and Remote Sensing, Nethesda.\r • Franklin, S. (2001) Remote Sensing for Sustainable Forest Management, Lewis, Boca Raton.\r • Guzzi, R. (2003) Exploring the atmosphere by remote sensing techniques, Springer, New York.\r • Jensen, J.R. (2004) Introductory Digital Image Processing: A Remote Sensing Perspective, 3rd edition, Prentice-Hall, Englewood Cliffs, New Jersey.\r • Jensen, J.R (2007) Remote Sensing of the Environment, an Earth Resource Perspective, 2nd edition, Prentice Hall, New York.\r • Jones, H. G. and R. A. Vaughan (2010) Remote Sensing of Vegetation: Principles, Techniques, and Applications, Oxford University Press, New York.\r • Liang, h., X. Li and J. Wang (2012) Advanced remote sensing: terrestrial information extraction and applications, Elsevier/Academic Press, Waltham, MA.\r • Lillesand, T.M., R.W. Kiefer and J.W. Chipman (2008) Remote Sensing and Image Interpretation, 6th edition, John Wiley and Son, Hoboken, NJ. \r • Lo, C.P, (1986) Applied Remote Sensing, Longman, Hong Kong\r • Martin, S (2004) An introduction to ocean remote sensing, Cambridge University Press, new York. \r • Mather, P.M. (2004) Computer Processing of Remotely Sensed Images, 3rd edition, John Wiley & Sons, New York.\r • Mountrakis, G., J. Im and C. Ogole (2011) Support vector machines in remote sensing: A review. ISPRS Journal of Photogrammetry and Remote Sensing, 66, 247-259.\r • Rees, W. G (2013) Physical principles of remote sensing, Cambridge University Press, New York.\r • Richards, J.A. and X. Jia (2006) Remote Sensing Digital Image Analysis, 4th edition, Springer & Verlag, London.\r • Schott, J.R. (1997) Remote Sensing: the Image Chain Approach, Oxford University Press, New York.\r • Schowengerdt, R.A. (2007) Remote Sensing: Models and Methods for Image Processing, 3rd Edition, Academic Press, New York.\r • Schultz, G.A. and E.T. Engman (2000) Remote Sensing in Hydrology and Water Management, Springer, Berlin.\r • Toselli F. and J. Bodechtel (1992) Imaging Spectroscopy: Fundamentals and Prospective Applications, Kluwer Academic Publishers, Luxembourg\r • Wilkie, D.S. (1996) Remote Sensing Imagery for Natural Resources Monitoring: A Guide for First-Time Users, Columbia University Press, New York.", "terms": {"2020-21 Term 2": {"--LEC (1538)": {"startTimes": ["18:30"], "endTimes": ["20:30"], "days": [3], "locations": ["Pending"], "instructors": ["Dr. WONG Kwan Kit"]}, "-L01-LAB (1539)": {"startTimes": ["20:30"], "endTimes": ["21:30"], "days": [3], "locations": ["Chen Kou Bun Bldg 222"], "instructors": ["Dr. WONG Kwan Kit"]}}}, "assessments": {"Essays": "10", "Lab reports": "35", "Presentation": "15", "Project": "40"}}, {"code": "5024", "title": "Global Positioning Systems", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSc Geoinformation Science", "description": "This course covers the basic principles of Global Positioning Systems (GPS): observables, error sources and their reduction, and positioning techniques. Other systems of Global Navigation Satellite Systems (GNSS) will also be introduced. Applications of GNSS in various fields will be discussed, including navigation, Intelligent Transport Systems (ITS), Location Based Services (LBS), engineering, and atmosphere sensing. Through hands-on exercises, students will learn how to use GPS devices to collect data in the field in support of various geospatial applications.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5033", "title": "Spatial Decision Support System", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSc Geoinformation Science", "description": "This course aims at the concepts and applications of spatial decision support systems (SDSS) in solving real-life problems. Fundamentals of decision making and SDSS will be discussed. It covers various paradigms for spatial knowledge representation and inference, expert systems for building knowledge-based GIS, computational models, and intelligent SDSS. The enrichment of spatial decision support by data mining and knowledge discovery will also be examined. In-house software will be employed to facilitate discussion and to assist students to acquire hands-on experience.", "outcome": "The emphasis of this course is placed on the fundamentals of spatial decision support systems and the hands-on experience in using and designing simple expert systems and decision support systems for spatial decision making. After taking the course, students are expected to:\r - Understand the basic concepts of spatial decision support systems; - Know the basic paradigms for knowledge representation and inference; - Employ in-house expect system shell to develop simple domain specific expert system; - Use in-house SDSS tool to develop simple SDSS.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (1541)": {"startTimes": ["18:30"], "endTimes": ["20:30"], "days": [1], "locations": ["Lady Shaw Bldg LT5"], "instructors": ["Dr. WONG Kin Hong, \n\rProfessor LEUNG Kwong Sak, \n\rProfessor LEUNG Yee"]}, "-L01-LAB (1540)": {"startTimes": ["20:30"], "endTimes": ["21:30"], "days": [1], "locations": ["Chen Kou Bun Bldg 222"], "instructors": ["Dr. WONG Kin Hong, \n\rProfessor LEUNG Kwong Sak, \n\rProfessor LEUNG Yee"]}}}}, {"code": "5035", "title": "Urban Environmental Modeling and Simulation", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSc Geoinformation Science", "description": "This course covers major concepts and methods for modeling spatial patterns and processes. Topics include cellular automata, agent-based models, terrain modeling, spatio-temporal data modeling, integration of GIS and environmental modeling, noise modeling, modeling of watershed hydrology and water quality and other relevant applications. During the course, students will learn about different modeling approaches and their applications and work on lab exercises and course projects.", "outcome": "At the end of the course, students are expected to:\r - Develop an understanding of geospatial modeling and simulation methods; - Evaluate the trade-offs among different modeling and simulation methods; - Demonstrate a working knowledge to solve real-world geographical issues using the methods learned.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (4533)": {"startTimes": ["18:30"], "endTimes": ["20:30"], "days": [2], "locations": ["Y.C. Liang Hall 103"], "instructors": ["Dr. WANG Lang, \n\rProfessor LI Xiang, \n\rProfessor YIM Hung Lam Steve"]}, "-L01-LAB (4534)": {"startTimes": ["20:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Y.C. Liang Hall 103"], "instructors": ["Dr. WANG Lang, \n\rProfessor LI Xiang, \n\rProfessor YIM Hung Lam Steve"]}}}}, {"code": "5053", "title": "Design and Implementation of Geographical Information Systems", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSc Geoinformation Science; Prerequisite: GISM5011", "description": "This course covers the basic principles for GIS design and application system implementation using the mainstream techniques. Topics include requirement analysis, object-oriented design using Unified Modeling Language (UML), database normalization, and GIS customization within a GIS environment. Students will develop their competence in designing and customizing GIS tools through lectures, hands-on lab exercises, and a course project.", "outcome": "At the end of the course, students are expected to:\r - Understand the principles of GIS Design using Structured System Analysis and Design Method; - Gain familiarity with the methods for customizing GIS; - Develop competence in implementing a GIS-based application system.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (4122)": {"startTimes": ["18:30"], "endTimes": ["20:30"], "days": [4], "locations": ["Chen Kou Bun Bldg 222"], "instructors": ["Professor HUANG Bo"]}, "-L01-LAB (4123)": {"startTimes": ["20:30"], "endTimes": ["21:30"], "days": [4], "locations": ["Chen Kou Bun Bldg 222"], "instructors": ["Professor HUANG Bo"]}}}}, {"code": "5060", "title": "Statistical Analysis of Geographical Data", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSc Geoinformation Science", "description": "This course provides an introduction to the basic and spatial statistical analysis methods that are commonly used to investigate geographically represented data. Topics covered include: (1) correlation analysis, (2) principal components analysis, (3) cluster analysis, (4) Geostatistical analysis, and (5) global and local spatial regression models. Students will develop their competency in using and applying GIS and statistical tools to solve real-world geographical problems through hands-on lab exercises and course projects.", "outcome": "At the end of this course, students are expected to:\r • Understand the principles of basic statistics and spatial statistics,\r • Develop proficiency in using GIS and statistical tools relevant to the principles covered, and\r • Apply the knowledge to analyze real-world geographical problems", "syllabus": "1. Geographical data manipulation\r 2. Correlation and spatial autocorrelation analysis\r 3. Linear and stepwise regression analysis\r 4. Logistic regression analysis\r 5. Principal component analysis\r 6. Factor analysis\r 7. Canonical correlation analysis \r 8. Cluster analysis\r 9. Discriminant analysis\r 10. Spatial regression models\r 11. Geographically weighted regression analysis\r 12. Geostatistical Kriging models\r 13. Presentations by postgraduates", "required_readings": "•Marcoulides George A. and Scott L. Hershberger (1997), Chapter 2 Basic Matrix Algebra, Multivariate Statistical Methods: A First Course, Mahwah: Lawrence Erlbaum Associates, 9-22\r •Griffith Daniel A. (2003), Spatial Autocorrelation and spatial Filtering: Gaining Understanding Through Theory and Scientific Visualization, Germany: Springer \r •Hsieh Chun-Ying, Chou Kuo-Ping (2002), A spatial autocorrelation analysis of aging distribution and transition, Journal of Population Studies, Vol 25, pp, 91-119\r •Kachigan Sam Kash (1991) Chapter 4 Regression analysis, Multivariate Statistical Analysis: A Conceptual Introduction, New York: Radius Press, 160-193\r •Luc Anselin (2005), Exploring Spatial Data with GeoDaTM: A Workbook. URL: https://geodacenter.asu.edu/system/files/geodaworkbook.pdf \r •Loo, Beckyp. Y. (2000), an application of canonical correlation analysis in regional science: the interrelationships between transport and development in China’s Zhujiang Delta, Journal of Regional Science, Vol 40, No. 1, \r •Marcoulides George A. and Scott L. Hershberger (1997), Chapter 6 Canonical Correlation, Multivariate Statistical Methods: A First Course, Mahwah: Lawrence Erlbaum Associates, 133-161\r •Epperson Bryank, Li Tianquan (1996), Measurement of genetic structure within populations using Moren’s spatial autocorrelation statistics, Population Biology, Vol 93, pp. 10528-10532.", "recommended_readings": "•Anderson T.W. (2003), An Introduction to Multivariate Statistical Analysis, Third Edition, USA: Wiley Interscience\r •Clifford Nicholas, Shaun French and Gill Valentine (eds) (2010), Key methods in geography, London : SAGE\r •Goodchild Michael F. (1986), Spatial Autocorrelation, Norwich: Geo Books, Catmog 47\r •Johnson, Richard A. & Dean W. Wichern (2002), Applied Multivariate Statistical Analysis, Prentice-Hall, 5th edition\r •Huang, B., Wu, B., and Barry, M., 2010. Geographically and Temporally Weighted Regression for modeling spatio-temporal variation in house prices. International Journal of Geographical Information Science, 24(3): 383 – 401. \r •Huang, B., Zhang, L., and Wu, B., 2009. Spatio-temporal analysis of rural-urban land conversion. International Journal of Geographical Information Science, 23(3): 379 - 398. \r •Johnston R.J. (1980), Multivariate Statistical Analysis in Geography, London: Longman Group Limited\r •Kachigan Sam Kash (1991), Multivariate Statistical Analysis: A Conceptual Introduction,New York: Radius Press\r •Marcoulides George A. and Scott L. Hershberger (1997), Multivariate Statistical Methods: A First Course, Mahwah: Lawrence Erlbaum Associates\r •Wong David W.S. and Jay Lee (2005), Statistical Analysis of Geographic Information with ArcView GIS, New Jersey: John Wiley & Sons, Inc.", "terms": {"2020-21 Summer Session": {"--LEC (1077)": {"startTimes": ["18:30"], "endTimes": ["20:30"], "days": [1], "locations": ["Yasumoto Int'l Acad Park LT8"], "instructors": ["Dr. HUANG Yefang, \n\rProfessor MEI Changlin"]}, "-L01-LAB (1078)": {"startTimes": ["20:30"], "endTimes": ["21:30"], "days": [1], "locations": ["Chen Kou Bun Bldg 222"], "instructors": ["Dr. HUANG Yefang, \n\rProfessor MEI Changlin"]}}}, "assessments": {"Lab reports": "40", "Others": "25", "Presentation": "10", "Selected response test or exam": "25"}}, {"code": "5065", "title": "Geospatial Big Data for Urban Planning", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSc Geoinformation Science", "description": "This course introduces to students geospatial big data (e.g., social media and GPS trajectories) and their applications in urban planning, including land functionality classification, environmental monitoring, sentiment analysis, and transportation planning. The use of GIS in various urban applications relevant to big data will also be covered. These applications encompass urban form, public health, 3D GIS, and geodesign. Through hands-on lab exercises such as data crawling from the web, 3D urban model construction using CityEngine, and geodesign using Geoplanner, students are expected to understand how geospatial big data can be applied to address real-world challenges in the urban environment, and to grasp more advanced skills relating to GIS applications.", "outcome": "At the end of this course, students are expected to:\r • Understand the principles of urban planning, big data and 3D GIS.\r • Develop proficiency in using advanced GIS tools relevant to big data, and\r • Apply the knowledge to address real-world urban problems with the support of big data and GIS", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (2161)": {"startTimes": ["18:30"], "endTimes": ["20:30"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor LEUNG Cheuk Fai Jimmy"]}, "-L01-LAB (2162)": {"startTimes": ["20:30"], "endTimes": ["21:30"], "days": [4], "locations": ["No Room Required"], "instructors": ["Professor LEUNG Cheuk Fai Jimmy"]}}}}, {"code": "6061", "title": "Thesis", "career": "Postgraduate - Taught", "units": "4.00", "grading": "Graded", "components": "Independent StudyLecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSc Geoinformation Science", "description": "The master thesis project is a compulsory course of the GISM program. It is not a regular course with modules and exercises, but an individual research project where you present your work in an oral presentation and a scientific written report. Students are required to carry out independent studies of selected topics relevant to Geoinformation Science on a variety of problems under staff supervision. Evaluation is based on the oral presentation and written report.", "outcome": "The master thesis requires a high degree of independent work as the student is working and guided by a supervisor. \r Upon completion of the dissertation, students should be able to: \r - Advance the knowledge and understanding of Geoinformation science on a variety of problems, with an analysis or application of geographical or spatial data; - Demonstrate ability to select, design and implement an appropriate application topic in Geoinformation science through independent learning; - Improve the skills on doing a project within a given time frame, applying scientific methodologies with constant critical analysis.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Summer Session": {"-I01-IND (1140)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Dr. WANG Lang, \n\rDr. WONG Kwan Kit, \n\rProfessor FUNG Tung, \n\rProfessor HUANG Bo, \n\rProfessor LEE Fung, \n\rProfessor YIM Hung Lam Steve"]}}}}]