[{"code": "2002", "title": "Methodology of Social Science Research", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "Not for students who have taken SOCI2003", "description": "This course deals with the methodology and skills in studying social science subjects, with particular focus on politics, economics and sociological disciplines. It provides training for students to handle a variety of data presented in either verbal, numbers or graphical fashion, alongside with the skills to present their analysis in a reader-friendly fashion. It also familiarizes students with some basic data-processing skills and functions supported by SPSS (Statistical Package for the Social Sciences). This course covers, but not limited to, i) Basic research skills: Literature Review and citations ii) Quantitative data analysis: Basic Statistics, Simple Regression Model and SPSS; iii) Qualitative data analysis: Surveys, interviews, focus groups, field works and discourse analysis, iv) Analysis and Interpretation; v) Internet Research methods. This is a required course for GLBS students.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2003", "title": "Field Studies and Methodology of Social Science Research", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "Not for students who have taken GLBS2001", "description": "This is a required course for GLBS students and a continuation of GLBS2002. Students will be given the opportunities to visit a destination outside of Hong Kong, to taste the real-world implications of Globalization to different communities. The objective of this course is multifold: (1) to practice the skills acquired from GLBS2002 via field studies; (2) to train students’ ability in comparing the impact of Globalization to different regions, (3) to provide opportunities for students work in group; and (4) to enhance students’ relationship with the teaching staffs. The field studies will take place under the supervision of one or more teaching staffs of this Programme. Students are required to join all lectures and workshops before the field studies. They are required to submit an individual report afterwards.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2201", "title": "Geopolitics and the World in Media", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course introduces a number of important issues happening around the World today - provided with some basic level of analysis and understanding of some key terms often come across in studying features of Globalization - by using materials from news media. It aims to equip students with better foundation of facts as well as some basic presentation skills. This course is going to cover, but not limited to, i) historical background of the contemporary world order; ii) basic knowledge about the geopolitical distribution; iii) overview of the agendas concerned by different regions; iv) introduction and comparisons of the political systems and institutions undertaken in the major powers. This is a required course for GLBS students and is conducted in Chinese.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3001", "title": "Use of English in Global Studies", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This is a required course for all the first-year GLBS students. Students will receive intensive trainings about the usage of English, including the vocabulary expansion, speaking and writing for academic purposes, so that it can enhance their capabilities to cope with various topics come across from different classes. Coursework is specifically designed and particularly relevant to international and global affairs.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3002", "title": "English Speech and Presentation for the Global Market", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This is a required course dedicated for GLBS students in order to enhance their communication skills and competitiveness in the Global market. Special attention will be given to interpersonal communication, pair/group discussion, oral presentations and speaking improvement activities.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3003", "title": "English Speaking in Global Studies", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course is an advanced version for GLBS3002. It aims to equip students with better speaking skills in order to enhance their competitiveness in the global market through intensive trainings in oral presentations and interpersonal communications. Students are required to demonstrate active participation in class. This is exclusively designed for GLBS students only.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3101", "title": "Theories and Practices of International Relations", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course provides an overview of International Relations (IR) theory, the concepts and approaches often adopted in studying the discipline. It aims to familiarize students with different theoretical frameworks and key issues encountered by the globalizing society. This course covers a wide array of topics, but not limited to, i) the mainstream IR theories, provided with some case studies; ii) analysis of some key theoretical literatures and introduce their respective historiographical perspectives, including the Clash of Civilizations and its critics; iii) in-depth studies on some selected thematic issues; iv) International Relations theory and Globalization.\r", "outcome": "By the end of the course students should be able to: \r 1) grasp the key assumptions and implications of different major IR theories and historiographical concepts; 2) apply different theories under distinct contexts;  3) evaluate the merits/demerits of these theories in explaining world affairs;  4) relate the theories and perspectives with different courses;  5) enhance their skills to construct and substantiate their arguments in written essays", "syllabus": "1) Introduction: Defining International Relations;  2) Overview of history: from Cold War to now;  3) Historiography and Globalization: Samuel Huntington, Edward Said, Francis Fukuyama and Antonio Negri;  4) Realism and its variants;  5) Liberalism and Democratic Peace;  6) Constructivism and Critical Theory; 7) Actors and Structure in the International system: Individual, State, and Globalization;  8) IR Theory and Global Economy: the North and the South;  9) IR Theory and Security: Balance of Power to Security Communities;  10) Culture and World Affairs;  11) Human Rights and International Relations;  12) Democratization;  13) International Institutions and Global Governance;  14) Globalization and the future of International Relations: End of IR Theories?", "required_readings": "1) Chris Brown & Kirsten Ainley, Understanding International Relations, 4th edition, (Basingstoke: Palgrave Macmillan, 2009);  2) Peter Sutch & Juanita Elias, International Relations: The Basics, (Oxon: Routledge, 2007);  3) Daniel W. Drezner, Theories of International Politics and Zombies, (Princeton: Princeton University Press, 2011).", "recommended_readings": "1) Tim Dunne, Milja Kurki & Steve Smith (eds.), International Relations Theories: Discipline and Diversity, 2nd edition (Oxford: Oxford University Press, 2010);  2) John Baylis, Steve Smith, & Patricia Owens (eds.), The Globalization of World Politics: an Introduction to International Relations, 5th edition, (Oxford: Oxford University Press, 2010);  3) Mark Beeson & Nick Bisley (eds.), Issues in 21st century World Politics, (Basingstoke: Palgrave Macmillan, 2010);  4) Cynthia Weber, International Relations Theory: a critical introduction, 3rd edition, (Oxon: Routledge, 2010);  5) Samuel P. Huntington, The Clash of Civilizations: and the remaking of world order, (London: Simon & Schuster, 1997);  6) Michael Hardt & Antonio Negri, Empire, (Harvard: Harvard University Press, 2000);  7) Edward W. Said, Culture and Imperialism, (London: Vintage Press, 1993);  8) Francis Fukuyama, The End of History and the Last Man, (New York, Harper Collins, 1992);  9) Karen Mingst & Ivan M. Arreguín-Toft, Essentials of International Relations, 5th edition, (New York: W.W. Norton & Company, 2010).", "terms": {"2020-21 Summer Session": {"--LEC (1489)": {"startTimes": ["16:30", "16:30", "16:30"], "endTimes": ["19:15", "19:15", "19:15"], "days": [2, 3, 4], "locations": ["Online Teaching", "Online Teaching", "Online Teaching"], "instructors": ["Dr. HORIUCHI Toru", "Dr. HORIUCHI Toru", "Dr. HORIUCHI Toru"], "meetingDates": ["29/6", "6/7", "13/7", "20/7", "27/7", "30/6", "7/7", "14/7", "21/7", "28/7", "8/7", "15/7", "22/7", "29/7"]}}}, "assessments": {"Essay test or exam": "0", "Others": "0"}}, {"code": "3102", "title": "Global Governance and Principles of International Law", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course aims to cope with the subjects of Global Governance from the perspective of Public International Law. It examines the interaction among nation-states, non-state-actors and the International institutions and analyzes how they come to terms with each other under the Global context, provided with some case studies. This course covers, but not limited to, i) concepts of global governance; ii) key concepts from different sources of International Law, e.g. the Law of the Sea ; iii) international organizations and global governance including the Bretton Woods system; iv) state, sovereignty, and globalization; v) role of Hong Kong and China in Global Governance.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3104", "title": "World Economies: Theories, Practices and New Development", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course provides an introduction to both macroeconomics and microeconomics with a view of the international economy by looking at some major theories and case studies. It aims at equipping students with the capacity to analyze the impacts of economic and social policies. It studies the implications of national policies and international agreements as well. This course covers, but is not limited to, i) macroeconomic theory, ii) microeconomic theory, iii) theories of international economics, iv) relationship between trade and politics, and v) international trade policy in developing nations, not least the emerging markets and BRICS.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3105", "title": "Understanding Global Cities and Urban Space", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "The course aims to present the effect of globalization on global cities and urban space. This is a required course for students majoring Global Studies without substantial background in social science disciplines on society and urban space use. The course shall first provide students with basic ideas and concepts relevant to topics relating to modern society and control of public space in social science disciplines. The second part of the course shall present fundamental concepts and theoretical perspectives to the study of globalization and its consequence on urban development and global changes. Such course design aims to build students’ conceptual thinking and imagination on the global world so they shall use such capacities to evaluate issues and debates shaped by the effects of globalization on the expansion of global cities and functions of public space in GLBS4501 Analyzing Development and Change in Global Cities and Urban Space.", "outcome": "After students have met basic requirements of this course, they are expected to demonstrate abilities to:\r 1. describe main theoretical approaches in explaining the effects of globalization on urban development\r and change\r 2. use urban ethnographic method to analyze identity and (sub)culture in social organizations in their\r assignments and group projects\r 3. provide personal and critical reflection on redevelopment projects in Hong Kong or any part of the\r world, then to make their own decisions about the extent of personal engagement in collective movements\r for future urban development in communities where they belong to", "syllabus": "Introduction to course organization, topics, expectation and assessment\r Basic concepts and perspectives in the study of society and urban space\r Part I. Societal Effects of Development and Change in Global Cities\r a) Societal effects of globalization: basic concepts\r b) Economic, cultural and societal aspects of globalization\r c) Theoretical foundations of urban and suburban forms in development and change\r • Classical foundations\r • Urban Ecology: the Chicago School\r d) Methodology studying urban development and changes in social organization: urban ethnography\r e) Urbanism as a way of life\r • Demography and cities\r • Social inequality in global cities\r • Migration within and across borders\r • Global civil society\r Part II. Political Interactions of Space Use and Functions in Global Places\r a) Spatial effects of globalization: basic concepts\r b) Theoretical foundations and evolution of spatial structures of capitalist urbanization\r c) The new urban restructuring:\r • The globalization of urbanization\r • The neoliberalization of urbanization\r d) Resistance: Oppositional forces in urban restructuring under the global era\r • The global politics of globalization: global movements and social changes\r • Contestation of the rights on cities spaces: ‘glocalization’ as a solution?\r e) Cities spaces and the global ‘war on terror’", "required_readings": "1) Lechner, Frank J. Globalization: The Making of World Society. Chichester, U.K.; Malden, MA: Wiley-Blackwell, 2009.\r 2) Tonnies, Ferdinand. Community and Society. New York, NY: Dover Publications, 2002.\r 3) Simmel, Georg. \"The Metropolis and Mental Life.\" In The Sociology of Georg Simmel. Edited by Kurt H. Wolff. New York, NY: Free Press, 1964, pp. 409-424.\r 4) Wirth, Louis. 1938.\"Urbanism as a Way of Life.\" The American Journal of Sociology 44(1):1-24.\r 5) Fainstein, Susan S. and Scott Campbell. Readings in Urban Theory. Chicester, West Sussex; Malden, MA: Wiley-Blackwell, 2011.\r 6) Castells, Manuel. The Castells Reader on Cities and Social Theory. Edited by Ida Susser. Malden, MA: Blackwell Publishing Limited, 2002,\r 7) Sassen, Saskia. The Global City: New York, London, Tokyo. Princeton, NJ: Princeton University Press, 2001.\r 8) Harvey, David. 2008. “The Right To The City.” New Left Review 53, September-October.\r 9) Marcuse, Peter and Ronald van Kempen (eds). 2000. Globalizing Cities: A New Spatial Order? Oxford; Malden, Mass: Blackwell, 2000.\r 10) Brenner, Neil. New State Spaces: Urban Governance and the Rescaling of Statehood. Oxford: Oxford University Press, 2004.\r 11) Gough, Jamie, Aram Eisenschitz with Andrew McCulloch. Spaces of Social Exclusion. London; New York: Routledge, 2006.\r Remarks: Additional reading materials (e.g. journal and news articles) shall be assigned for each lecture.", "recommended_readings": "1) Pacione, Michael. Urban Geography: A Global Perspective. 3rd ed. Oxon: Routledge. 2009.\r 2) Bridge, Gary and Sophie Watson. The Blackwell City Reader. 2nd ed. Chichester, West Sussex, U.K.; Malden, MA: Wiley-Blackwell, 2010.\r 3) Jones, Andrew. Globalization: Key Thinkers. Cambridge: Polity Press. 2010.\r 4) Giddens, Anthony. The Consequences of Modernity. Cambridge: Polity Press. 1991.\r 5) Held, David and Anthony McGrew. The Global Transformations Reader: An Introduction to the Globalization Debate. Cambridge: Polity Press. 2002.\r 6) Gottdiener, Mark. The Social Production of Urban Space. Austin: University of Texas Press, 1994.\r 7) Harvey, David. Spaces of Capital: Towards a Critical Geography. Edinburgh: Edinburgh University Press, 2001.\r 8) Gill, Stephen. Power and Resistance in the New World Order. Basingstoke; New York: Palgrave Macmillan, 2003.\r 9) Graham, Stephen and Simon Marvin. Splintering Urbanism: Networked Infrastructures, Technological Mobilities and the Urban Condition. London; New York: Routledge, 2001.\r 10) Graham, Stephen. Cities, War, and Terrorism: Towards an Urban Geopolitics. Malden, MA: Blackwell Publishing, 2004.\r 11) Hamel, Pierre, Henri Lustiger-Thaler and Margit Mayer (eds). Urban Movements in a Globalising World. London; New York: Routledge, 2000.\r 12) Whyte, William F. Street Corner Society: The Social Structure of an Italian Slum. 4th ed. Chicago, IL: University of Chicago Press, 1993.", "terms": {"2021-22 Term 2": {"--LEC (5111)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Wong Foo Yuan Bldg 405"], "instructors": ["Staff"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Essays": "0", "Others": "0", "Presentation": "0"}}, {"code": "3106", "title": "The Rise of China in the Global Context I: Diplomacy, Trade and Soft Power", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course looks at the \"Rise of China\" from the perspective of Global Governance and specifically sheds light on its diplomatic, trade and cultural relations with others in the Global Community. It provides a critical analysis on the transformation of Chinese foreign policies since the establishment of the People's Republic of China and the momentum behind this change of practices. This course covers, but not limited to, i) the History and evolution of Chinese foreign policies; ii) the analytical framework of policy-making process in China, particularly in handling foreign and security affairs; iii) its foreign relations with both the developed and developing nations; iv) its booming economy and integration with the global economy; v) assessment on the rhetoric of \"Peaceful Rise\" and \"Charm Offensive\" with reference to the Confucius Institute.", "outcome": "By the end of the course students should be able to: \r 1) identify the concepts and key features of the Chinese foreign policies;  2) identify the relationship between China with other nations, notably the U.S., BRICS and its neighbours in Asia-Pacific;  3) identify the driving forces of Chinese foreign and security policies;  4) identify the changes and continuities in Chinese foreign policies;  5) assess critically the impact of different policies towards the Global Governance;  6) think critically", "syllabus": "1) Introduction to Chinese foreign policies: a historical overview since 1949;  2) Analytical Framework in formulating foreign policies: the Party, the Bureaucrats, the think-tanks, the Military and Public Opinions;  3) Chinese national security and strategic culture: its IR view and impact on foreign policies;  4) China's conception of Sovereignty and International Order \r 5) Chinese foreign relations with Asia, Latin America, Africa and Middle East; 6) Chinese foreign relations with Europe and North America;  7) Relations with major powers: US, Japan and Russia;  8) China's role in Global Governance: Trade and Security;  9) China turns to Multilateralism;  10) China and the peripheries: Tibet, Xinjiang, Taiwan and Hong Kong.", "required_readings": "1) Marc Lanteigne, Chinese Foreign Policy: an introduction, (Oxon: Routledge, 2013);  2) Andrew J. Nathan & Andrew Scobell, China's Search for Security, (New York: Columbia University Press, 2012).", "recommended_readings": "1) Lai Hongyi, The Domestic Sources of China's Foreign Policy: Regimes, Leadership, Priorities and Processes, (Oxon: Routledge, 2010);  2) Susan Shirk, China: Fragile Superpower, (New York: Oxford University Press, 2008);  3) Wang Gangwu & Zheng Yongnian (eds.), China and the New International Order, (Oxon: Routledge, 2008);  4) Alastair Iain Johnston, Social States: China in International Institutions, 1980-2000, (Princeton: Princeton University Press, 2008);  5) Robert G. Sutter, Chinese Foreign Relations: Power and Policy since the Cold War, 3rd edition, (Lanham: Rowman & Littlefield, 2012);  6) Guoguang Wu & Helen Lansdowne (eds.), China Turns to Multilateralism: Foreign policy and Regional Security, (Oxon: Routledge, 2008).", "terms": {"2020-21 Term 2": {"--LEC (6514)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Dr. HORIUCHI Toru"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 1": {"--LEC (5466)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Chen Kou Bun Bldg 123"], "instructors": ["Dr. HORIUCHI Toru"], "meetingDates": ["8/9", "15/9"]}}}, "assessments": {"Essay test or exam": "0", "Others": "0"}}, {"code": "3301", "title": "Understanding Global Issues from Movies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This is an elementary level course which examines how media industries have projected the global agenda items through movies. It enables students to understand how the difference in cultural/national/social background would impact on the perceptions of people, in spite of the same objects and referents. In some occasions, such interpretations may reflect a certain degree of bias and hence jeopardize integrity of the facts. It is particularly helpful to students who haven't studied any courses from the Global Studies Programme in understanding relevant topics.\r", "outcome": "By the end of the course student should be able to: \r 1) identify the differences and relations between various cultures and their respective interpretations on several agenda-items in the Global Community;  2) identify and assess critically the integrity and validity of the interpretations;  3) relate contents with their daily life examples;  4) think critically", "syllabus": "Designed by the course instructors", "required_readings": "", "recommended_readings": "1) 國際政治夢工場 - 從電影看國際政治。 香港：上書房，2007", "terms": {"2020-21 Term 2": {"--LEC (8010)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Dr. CHAN Wai Shun"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}}, "assessments": {"Essay test or exam": "0", "Others": "0"}}, {"code": "3302", "title": "Sports and World Politics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course examines the relationship between Sports and World politics, in particular about the evolution of global political economy through various sports events like the Olympic Games and World Cup. Taking different sport games as case studies, this course aims to raise attention about some ongoing debates on the global political arena, e.g. Separatism, regional identity, global democracy. It also encourages students to think critically how politics and sports are mutually shaping each other.\r", "outcome": "After completing this course, students are expected to demonstrate abilities to: \r 1) Understand the relationship between Global Politics and World Sports\r 2) Understand sports from a political structure and landscape\r 3) Analyze various global issues through sports events.", "syllabus": "Materials to be provided by course instructor(s).", "required_readings": "1) Roger Levermore and Adrian Budd (eds.), Sport and International Relations: an emerging relationship, London: Routledge, 2004. \r 2) Andrei S. Markovits and Lars Rensmann, Gaming the world: how sports are reshaping global politics and culture, Princeton: Princeton University Press, 2010. \r 3) Joseph Maguire, Global Sport: identities, societies, civilizations, Cambridge: Polity Press, 1999", "recommended_readings": "1) Adam Brown, Tim Crabbe and Gavin Mellor (eds.), Football and community in the global context: studies in theory and practice, Oxon: Routledge, 2009. \r 2) Joseph Maguire, Kevin Young (eds.), Theory, sport & society, Bingley: Elsevier Science, 2002. \r 3) Joseph Maguire, Grant Jarvie, Louise Mansfield and Joe Bradley, Sport Worlds: a sociological perspective, Champaign: Human Kinetics, 2002. \r 4) Victor D. Cha, Beyond the final score: the politics of sport in Asia, New York: Columbia University Press, 2009.", "terms": {"2020-21 Term 1": {"--LEC (8708)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr. Tobias ZUSER"], "meetingDates": ["10/9", "17/9", "24/9"]}}}, "assessments": {"Essay test or exam": "0", "Others": "0"}}, {"code": "3303", "title": "Music in the Global Society", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course examines aspects of popular music culture and its industry in shaping global order and influencing the global society. It introduces the dominant theoretical approaches to the study of music, including musicology, cultural studies and sociology. By illustrating the relationship and conflict between industry giants and indie musicians in light of the approaches taught, students are able to appreciate the global and local dynamics in shaping our global society. Societal trends and phenomena affecting the global order that are driven by music, such as the 60’s US folk movement and the recent K-Pop enthusiasm, will be lastly examined.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3401", "title": "Hong Kong's External Relations and Chinese Foreign Policies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "(UGEC3541 is double-coded with GLBS3401.) This course aims to illustrate how Hong Kong has exercised its influence in the global society after the handover of Sovereignty in 1997, despite the constraints imposed by the Basic Law, and how they conform to, or at odds with, the grand strategy of People's Republic of China (PRC). This course approaches the subjects from individual, domestic, and systemic levels of analysis. It covers topics ranging from the transnational economic network of Hutchison-Whampoa to legal case which exhibit clashes of the code of practice between the Special Administrative Region (SAR) and its motherland. This course is conducted in Chinese.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3402", "title": "Korea and the World: Politics, Economy and Culture", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course examines the connection between Globalization and South Korea after World War II. It is also interested in accounting for the changes of political, economic, social and cultural aspects ofSouth Korea in the last few decades and the transformation of the attitudes towards Globalization in South Korean society. This course will cover a variety of topics ranging from i) brief overview ofthe historical development of South Korea since WWII; ii) driving forces and features of the economic developments, iii) their foreign policy concerns, iv) the characteristics of the traditional culturalidentities, v) the recent Korean-wave phenomenon; vi) opportunities and challenges brought by Globalization to Korean society.\r", "outcome": "By the end of the course students should be able to:\r 1) identify the key concepts and features of the respective politico-economic-cultural systems of South Korea; 2) identify the challenges and opportunities engendered by Globalization brought to the system; 3) identify the characteristics of South Korea in terms of their attitudes and priorities towards Globalization; 4) relate the content with the daily contexts; 5) relate the content with a number of theoretical approaches from other courses; 6) think critically", "syllabus": "1) Theoretical Discussion on the South Korean political economy; 2) Historical review of Transformation of South Korea in the 20th century; 3) Mechanisms and Institutions in foreign policy-making: public opinion, strategic culture, interest groups, governments and parties; 4) Changes of Political cultures in South Korea before and after democratization; 5) Globalization of Korean enterprises: Case of Samsung and Hyundai; 6) Hallyu from Its Origin to Present: the Role of Government\r ; 7) Security concerns and the Inter-Korean Relations; 8) Social changes and the rise of civil societies in South Korea; 9) Global impact of the Korean popular culture: K-Pop, Drama and Movie ; 10) South Korea and the concept of ' Middle Power'; 11) Assessment over the impact of Globalization on South Korea foreign policy, society and culture", "required_readings": "1) Chang Yun-Shik, Hyun-Ho Seok, and Donald L. Baker (eds.) Korea confronts Globalization, (Oxon: Routledge, 2009); 2) Samuel S. Kim (ed.) Korea's globalization, (Oxford: Cambridge University Press), 2000; 3) Kim Youna (ed.) The Korean Wave: Korean Media Go Global. (London: Routledge), 2013.\r 4) Bruce Cumings. Korea's Place in the Sun: A Modern History, (New York; London: W. W. Norton), 2005.", "recommended_readings": "1) James Lewis and Amadu Sesay (eds.) Korea and Globalization: politics, economics and culture, (London: RoutledgeCurzon, 2002); 2) Hee-yeon Cho, Lawrence Surendra & Hyo-je Cho (eds.) Contemporary South Korean Society: a critical perspective, (Oxon: Routledge, 2013); 3) Soong Hoom Kil & Chung-in Moon (eds.), Understanding Korean Politics: an introduction, (Albany: State University of New York Press, 2001); 4) Song Jesook (ed), New Millennium South Korea: Neoliberal Capitalism and Transnational Movements. (Milton Park, Abingdon, Oxon, [England]; New York: Routledge), 2011. ; 5) Chua Beng Huat and Koichi Iwabuchi (eds), East Asian Pop Culture: Analysing the Korean Wave. (Hong Kong: Hong Kong University Press),\r 2008; 6) Chung-in Moon, The Sunshine Policy: In Defense of Engagement as a Path to Peace in Korea, (Seoul, Korea: Yonsei University Press, 2012); 7) Young-Chan Kim, Doo-Jin Kim and Young Jun Kim, South Korea: Challenging Globalisation and the Post-crisis Reforms, (Oxford, England:\r Chandos Pub., 2008) ); 8) Kyong Ju Kim, The Development of Modern South Korea: State Formation, Capitalist Development and National Identity , (Abingdon, Oxon; New York, NY: Routledge, 2006).", "terms": {"2020-21 Summer Session": {"--LEC (1179)": {"startTimes": ["14:30", "14:30"], "endTimes": ["17:15", "17:15"], "days": [2, 4], "locations": ["Wong Foo Yuan Bldg LT4", "Wong Foo Yuan Bldg LT4"], "instructors": ["Mr. CHUNG Lok Wai", "Mr. CHUNG Lok Wai"], "meetingDates": ["18/5", "25/5", "1/6", "8/6", "15/6", "22/6", "29/6", "20/5", "27/5", "3/6", "10/6", "17/6", "24/6"]}}}, "assessments": {"Essay test or exam": "0", "Others": "0"}}, {"code": "3403", "title": "European Union and the World", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course adopts various approaches to unravel the complexity of the ongoing integration project in Europe. Alongside the theoretical analysis, this course sheds light on the connection between Europe and the World. It will cover topics including, but not limited to, the Common Foreign and Security Policy, the EU Law, as well as EU’s contribution to Global Governance.\r", "outcome": "Upon successful completion of this course, the student will have\r 1. better understanding about the institutional architecture and operation in Europe\r 2. clearer image about the European mindset towards global affairs\r 3. acquired the skills of critical thinking\r 4. acquired the techniques to apply theories and perspectives into daily lives", "syllabus": "History of European Integration\r Institutions of the European Union and policy-making mechanism\r European Union Law and its legal system\r Politics and economics inside EU\r Regionalism and regional politics in Europe\r Strategic culture and Principles of foreign policy in Europe \r EU Enlargement and Neighbourhood policy\r EU and the Powers: US, Russia and China\r EU and the Third World\r EU and International Organizations: NATO, OSCE, UN\r EU and Global Economy\r EU and Global Governance", "required_readings": "Simon Hix and Bjorn Hoyland, The Political System of the European Union, 3rd edition, Basingstoke: Palgrave Macmillan, 2011.\r Fraser Cameron, An Introduction to European Foreign Policy, 2nd edition, London: Routledge, 2012.\r John McCormick, European Union Politics, Basingstoke: Palgrave Macmillan, 2011.\r Christopher Hill & Michael Smith (eds.), International Relations and the European Union, 2nd edition, Oxon: Oxford University Press, 2011.", "recommended_readings": "Michael Baun and Dan Marek, The New Member States and the European Union: Foreign Policy and Europeanization, 1st edition, London: Routledge, 2013.\r Ian Manners and Richard Whitman (eds.), The Foreign Policies of European Union Member States, Manchester: Manchester University Press, 2001.\r Karen Smith, European Union Foreign Policy in a Changing World, London: Polity, 2009.\r Richard McAllister, European Union: An Historical and Political Survey, London: Routledge, 2009.\r Simon Hix, What’s Wrong with the European Union and How to Fix it, London: Polity, 2008.\r Knud Erik Jørgensen and Katie Verlin Laatikainen I(eds.), Routledge Handbook on the European Union and International Institutions: Performance, Policy, Power, London: Routledge, 2013.\r Walter E. Carlsnaes, Helene Sjursen and Brian White (eds.), Contemporary European Foreign Policy, 1st edition, Thousand Oaks, Calif.: SAGE Publication Ltd., 2004.\r Ben Tonra and Thomas Christiansen (eds.), Rethinking European Union Foreign Policy, Manchester: Manchester University Press, 2004.\r Chris J. Bickerton, European Union Foreign Policy: From Effectiveness to Functionality, Basingstoke: Palgrave Macmillan, 2011.\r Paul James Cardwell, EU External Relations and System of Governance: The CFSP, Euro-Mediterranean Partnership and Migration, London: Routledge, 2011.\r Kristina Farrugia, The Union for the Mediterranean: Building upon the Euro-Mediterranean Partnership and European Neighbourhood Policy, Saarbrücken: LAP Lambert Academic Publishing, 2010.\r Mario Telo, European Union and New Regionalism: Regional Actors and Global Governance in Post-Hegemonic Era, 2nd rev. edition, Aldershot, England; Burlington, VT: Ashgate, 2007.\r Richard G. Whitman and Stefan Wolff (eds.), The European Neighbourhood Policy in Perspective: Context, Implementation and Impact, reprint edition, Basingstoke: Palgrave Macmillan, 2012.\r Helen Wallace, Mark Pollack and Alasdair Young (eds.), Policy-making in the European Union, Oxford: Oxford University Press, 2010. \r Simon Sweeney, Europe, the state, and Globalization, New York: Pearson Education, 2005. \r Robert Leonardi, Cohesion policy in the European Union, Basingstoke: Palgrave Macmillan, 2005. \r Christopher Booker & Richard North, The Great Deception: can the European Union survive?, London: Continuum, 2005.", "terms": {"2020-21 Term 2": {"--LEC (6894)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr. James Floyd DOWNES"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 2": {"--LEC (4994)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Wu Ho Man Yuen Bldg 504"], "instructors": ["Dr. James Floyd DOWNES"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Essay test or exam": "0", "Others": "0"}}, {"code": "3404", "title": "Japan and Global Political Economy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course examines the connection between Globalization and foreign policy-making of the country after World War II. It will cover a variety of topics ranging from the rationales behind the ups-and-downs of its economy, towards the Japanese perceptions towards Sino-Japanese relations and even the country’s role in the Global society.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3405", "title": "International Relations in Southeast Asia", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "(UGEC3546 is double-coded with GLBS3405.) This course aims to elevate students' understanding of Southeast Asia by examining the dynamics of interaction between nation-states, regional organizations, and non-state actors in Southeast Asia under the context of Globalization. After looking into the history, interests, strategic concerns, and senses of vulnerability shared among these actors, students are encouraged to think critically about the significance of this oft-overlooked region in the study of world politics. Hence, this course stresses analytical skills instead of hard facts about the region. Topics of the course include: 1) Definition of Southeast Asia and its history; 2) Basic International Relations Theories; 3) Actors in Contemporary Southeast Asia International Politics; 4) Evolution of ASEAN and regionalism in the World Politics; 5) Economic development of Southeast Asia and; 6) Regional Security in Southeast Asia.\r", "outcome": "  After completing this course, students are expected to demonstrate abilities to:   1) Apply different IR theories to account for the dynamics of international relations in Southeast Asia   2) Describe the significance of different actors in Southeast Asia   3) Describe the evolution of the concept of \"Southeast Asia\"   4) Examine the contemporary security and economic relations among and between ASEAN member-states and other actors   5) Rethink critically the importance of Southeast Asia in the global arena", "syllabus": "      Introduction: What is Southeast Asia?         Why is Southeast Asia important?    Evolution of the term ‘Southeast Asia’    Key players in Southeast Asia: nation-states, ASEAN, and others             IR Theories and Southeast Asia         Realism & Subaltern Realism: Balance of Power or national survival?    Liberalism and international regimes    Constructivism and security communities    Why there is no non-Western International Relations theory in Southeast Asia?             Regionalism and Regionalization         Region, Regionness, Regionalization, and Regionalism    Functionalism and ‘Old’ Regionalism Theory    English School approach and New Regionalism Theory             Nation-building in Southeast Asia         Impacts of foreign imperialism on national development    Cold War and independence movements in Southeast Asia             Political Economy of Southeast Asia         Asian values, Democratization and Communitarianism    Developmental states/ Patrimonial states and Crony Capitalism    Development gap between ASEAN-5 and CLMV             ASEAN and ASEAN Way        Structure of ASEAN    ASEAN Way: dispute settlement or conflict avoidance?    ASEAN Way and non-intervention: myth or reality?    From soft-institutionalism to ASEAN Charter: change or continuity?             Security challenges in East/Southeast Asia        (Re)Definition of Security: traditional and non-traditional security    Traditional security: Territorial disputes and intra-mural conflicts in ASEAN    Non-traditional security: Piracy, Terrorism, and transnational organized crimes    Human Security: Environmental, food and water security             Security cooperation in East/Southeast Asia        Cooperative Security: balance of power or identity-building?    Sub-/Extra-regional cooperation and development projects?    ASEAN Regional Forum and preventive diplomacy: success or failure?             Economic integration in East/Southeast Asia         Asian Financial Crisis: wake-up call to developing countries?    Role of external regional actors in driving regional integration    Regionalization in East/Southeast Asia: a response to, or driven by globalization?    Impact of FTAs, APEC, ASEAN+3 and others in driving regionalization             China and Southeast Asia: Restoring the Sino-centric world order?        Chinese factors in Southeast Asia: from (pre-)Cold War to contemporary era    China’s worldview and Southeast Asia: Tianxia system or modern system?    Response to the rise of China: balance of power or socialization?    South China Sea disputes: peace or conflicts             US in Southeast Asia: savior or trouble-maker?         Dynamics of US-Southeast Asian relations from Cold War to post-9/11 era    US presence in Southeast Asia: hegemony or post-hegemony?    US interests and Southeast Asia: conflicts or cooperation?             Conclusion: Future of East/Southeast Asian Regional architecture        Review of existing regional architecture: ASEAN, ARF, APEC, EAS, TPP, RCEP…    Review of the most effective forms of regional integration: unilateralism, bilateralism, or multilateralism?    Future of the East/ Southeast Asian regional integration.       ", "required_readings": "      Introduction: What is Southeast Asia?        Donald E. Weatherbee. International Relations in Southeast Asia: The Struggle for Autonomy, 2nd edition (Lanham, MD: Rowman & Littlefield, 2009). Ch. 1.    Donald K. Emmerson. ‘“Southeast Asia”: What’s in a name?’ Journal of Southeast Asian Studies, Vol. 15, No. 1, 1984, pp. 1-21.    Jessie P. H. Poon. ‘Regionalism in the Asia-Pacific: Is Geography Destiny?’ Area, Vol. 33, No. 3, 2001, pp. 252-260.             IR Theories and Southeast Asia        Amitav Acharya. ‘Thinking Theoretically about Asian IR,’ in David Shambaugh & Michael Yahuda (eds.) International Relations of Asia, 2nd edition (Lanham, MD: Rowman & Littlefield, 2014).    Sorpong Peou. ‘Realism and Constructivism in Southeast Asian security studies today: a review essay,’ The Pacific Review, Vol. 15, No. 1, 2002, pp. 119-138.    Shaun Narine. ‘ASEAN in the twenty-first century: a skeptical review,’ Cambridge Review of International Affairs, Vol. 22, No. 3, 2009, pp. 369-386.             Regionalism and Regionalization        Björn Hettne & Fredrik Söderbaum. ‘Theorising the rise of regionness,’ in Shaun Breslin, Christopher W. Hughes, Nicola Phillips & Ben Rosamond (eds.) New Regionalisms in the Global Political Economy: Theories and Cases (Oxon: Routledge, 2002).    Shaun Breslin. ‘Theorising East Asian regionalism(s): New regionalism and Asia’s future(s),’ in Melissa G. Curley & Nicholas Thomas (eds.) Advancing East Asian Regionalism (Oxon: Routledge, 2007).    Joseph S. Nye. ‘Comparative Regional Integration: Concept and Measurement,’ International Organization, Vol. 22, No. 4, 1968, pp. 855-880.             Nation-building in Southeast Asia        Donald E. Weatherbee. International Relations in Southeast Asia: The Struggle for Autonomy, 2nd edition (Lanham, MD: Rowman & Littlefield, 2009). Ch. 3.        Robert E. Elson. ‘Southeast Asia and the Colonial Experience,’ in Mark Beeson (ed.) Contemporary Southeast Asia, 2nd edition (Basingstoke: Palgrave Macmillan, 2009).    Mark T. Berger. ‘The End of Empire and the Cold War,’ in Mark Beeson (ed.) Contemporary Southeast Asia, 2nd edition (Basingstoke: Palgrave Macmillan, 2009).             Political Economy of Southeast Asia        Greg Felker. ‘The Political Economy of Southeast Asia,’ in Mark Beeson (ed.) Contemporary Southeast Asia, 2nd edition (Basingstoke: Palgrave Macmillan, 2009).    Scott A. Fritzen. ‘Public Administration,’ in Mark Beeson (ed.) Contemporary Southeast Asia, 2nd edition (Basingstoke: Palgrave Macmillan, 2009).    Fareed Zakaria. ‘Culture is Destiny: a conversation with Lee Kuan Yew,’ Foreign Affairs, Vol. 73, No. 2, 1994, pp. 109-126.             ASEAN and ASEAN Way        Amitav Acharya. Constructing a Security Community in Southeast Asia: ASEAN and the problem of regional order, 2nd edition (Oxon: Routledge, 2009). Ch. 2.    Donald E. Weatherbee. International Relations in Southeast Asia: The Struggle for Autonomy, 2nd edition (Lanham, MD: Rowman & Littlefield, 2009). Ch. 4.    Lee Jones. ‘ASEAN’s unchanged melody? The theory and practice of “non-interference” in Southeast Asia,’ The Pacific Review, Vol. 23, No. 4, 2010, pp. 479-502.             Security challenges in East/Southeast Asia        Alan Collins. Security and Southeast Asia: domestic, regional, and global issues (Boulder, CO: Lynne Rienner, 2003). Ch. 1.    Donald E. Weatherbee. International Relations in Southeast Asia: The Struggle for Autonomy, 2nd edition (Lanham, MD: Rowman & Littlefield, 2009). Ch. 6.    Yukiko Nishikawa. ‘Human Security in Southeast Asia: viable solution or empty slogan?’ Security Dialogue, Vol. 4, No. 2, 2009, pp. 213-236.             Security cooperation in East/Southeast Asia        Ralf Emmers. Cooperative Security and the Balance of Power in ASEAN and the ARF (Oxon: Routledge, 2003). Ch. 1.    Jurgen Haacke. ‘The ASEAN Regional Forum: from dialogue to practical security cooperation,’ Cambridge Review of International Affairs, Vol. 22, No. 3,        2009, pp. 427-449.    Natasha Hamilton-Hart. ‘War and other insecurities in East Asia: what the security studies field does and does not tell us,’ The Pacific Review, Vol. 22, No. 1, 2009, pp. 49-71.             Economic integration in East/Southeast Asia        Donald E. Weatherbee. International Relations in Southeast Asia: The Struggle for Autonomy, 2nd edition (Lanham, MD: Rowman & Littlefield, 2009). Ch. 7.    Mark T. Berger. ‘Bringing History Back In: The Making and Unmaking of the East Asian Miracle,’ International Politics and Society, Vol. 3, 1999, pp. 237-252.    Christopher Dent. East Asian Regionalism (Oxon: Routledge, 2008). Ch. 5.             China and Southeast Asia: Restoring the Sino-centric world order?        Ian Storey. Southeast Asia and The Rise of China: The search for security (Oxon: Routledge, 2011). Ch. 3.    William A. Callahan. ‘Chinese Visions of World Order: Post-hegemonic or a New Hegemony?’ International Studies Review, Vol. 10, No. 4, 2008, pp. 749-761.    Alice Ba. ‘Managing the South China Sea Disputes: What can ASEAN do?’ in Murray Hiebert, Phuong Nguyen & Gregory B. Poling (eds.) Perspectives on the South China Sea: diplomatic, legal, and security dimensions of the dispute (Lanham, MD: Rowman & Littlefield, 2014), pp. 1-12.             US in Southeast Asia: savior or trouble-maker?        Robert Sutter. ‘The United States in Asia: Durable leadership,’ in David Shambaugh & Michael Yahuda (eds.) International Relations of Asia, 2nd edition (Lanham, MD: Rowman & Littlefield, 2014).    Euan Graham. ‘Southeast Asia in the US Rebalance: Perceptions from a Divided Region,’ Contemporary Southeast Asia, Vol. 35, No. 3, 2013, pp. 305-332.    Charmaine G. Misalucha. ‘Southeast Asia-US relations: Hegemony or Hierarchy?’ Contemporary Southeast Asia, Vol. 33, No. 2, 2011, pp. 209-228.             Conclusion: Future of East/Southeast Asian Regional architecture        Donald E. Weatherbee. International Relations in Southeast Asia: The Struggle for Autonomy, 2nd edition (Lanham, MD: Rowman & Littlefield, 2009). Ch. 10    Christopher Roberts. ASEAN Regionalism (Oxon: Routledge, 2011). Conclusion.    Jürgen Rüland. ‘Southeast Asian Regionalism and Global Governance: “Multilateral Unity” or “Hedging Utility”?’ Contemporary Southeast Asia, Vol. 33, No. 1, 2011, pp. 83-112.       ", "recommended_readings": "    Donald E. Weatherbee. International Relations in Southeast Asia: The Struggle for Autonomy. 2nd edition (Lanham, MD: Rowman & Littlefield, 2009).    D.R. Desai. Southeast Asia: Past and Present. 7th edition (Boulder, CO: Westview Press, 2013).    Michael Leifer. ASEAN and the Security of Southeast Asia. (London: Routledge, 1989).    Amitav Acharya. Constructing a Security Community in Southeast Asia: ASEAN and the problem of regional order. 2nd edition (Oxon: Routledge, 2009).    Shaun Narine. Explaining ASEAN: Regionalism in Southeast Asia. (Boulder, CO: Lynne Rienner, 2002).    Christopher Roberts. ASEAN Regionalism: Cooperation, Values and Institutionalization. (Oxon: Routledge, 2011).    Mark Beeson (eds.) Contemporary Southeast Asia. 2nd edition (Basingstoke: Palgrave Macmillan, 2009).        Useful Journals:   Asia-Pacific Review; Asian Politics & Policy; Cambridge Review of International Affairs; Contemporary Southeast Asia: A Journal of International and Strategic Affairs; International Relations of the Asia-Pacific; Journal of Contemporary China; Journal of Current Southeast Asian Affairs; Journal of Southeast Asian Studies; Pacific Affairs; Southeast Asian Affairs; Southeast Asian Studies; The Pacific Review; Third World Quarterly", "terms": {"2021-22 Term 1": {"--LEC (7397)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Sino Building 239"], "instructors": ["Mr FUNG Ka Shing Kalvin"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Essays": "0", "Essay test or exam": "0", "Presentation": "0"}}, {"code": "3406", "title": "Colonial Governance in Hong Kong and the British Empire", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "(UGEC3542 is double-coded with GLBS3406.) This course studies the interaction between Hong Kong, at a time when it was still under British colonial rule, and the international community. Themes include the features of early globalization, the connection between colonial Hong Kong and the collapse of the Qing Dynasty in China, Hong Kong under the influence of Japanese Imperialism and the Cold War, and Sino-British relations. It also examines how various international norms have found their way to shaping the tiny colony, which has stood in stark contrast with Mainland China, to whom Hong Kong's sovereignty was returned in 1997.\r", "outcome": " Upon successful completion of this course, the student will 1.            be able to identify a broad range of issues towards of the impact of British colonialism to Hong Kong 2.            be able to recognize and describe the history of Hong Kong’s external relations in the modern era reflecting the features of early Globalization and the international norms, including free-trade policies, popular nationalism, rise of anti-colonialism, Transnational Corporations and democratization 3.            be able to analyze and elaborate the features of early Globalization and the international norms from historical, political, economic and socio-cultural dimensions 4.            be able to reflect independently and critically on the position and role of Hong Kong under the British colonial rule and post 1997 with sovereignty returned to China", "syllabus": " Major concepts and topics to be covered:    PART I: CORE CONCEPTS AND BACKGROUND Empire and Colonialism: Why and How were they formed? Hong Kong-China relations in the pre-modern era Features of the British Colonial governance   PART II: HONG KONG BEFORE 1949 “Old Colonialism”, Hong Kong and birth of free-trade policies Multiethnic society in Hong Kong From Xenophobia to Popular Nationalism in Hong Kong: 1842-1911 Six Day War: the first anti-colonial “War” in Hong Kong Inter-Colonial relations: Hong Kong’s position in the British Empire   PART III: HONG KONG AFTER 1949 Hong Kong-The People's Republic of China-Republic of China (HK-PRC-ROC) relations Cold War: Hong Kong between Communism and Capitalism 1967 Riots (I): Hong Kong, the Chinese Cultural Revolution and Hong Kong Identity 1967 Riots (II): Hong Kong and the Rise of Anti-Colonialism The Economic Miracle: Hong Kong and the Four Asian Tigers Democratization: Post-Tiananmen China, Hong Kong and Britain", "required_readings": " PART I: CORE CONCEPTS AND BACKGROUND   Empire and Colonialism: Why and How were they formed?  Jürgen Osterhammel, Colonialism: a theoretical overview, Trans. Shelley L. Frisch, Markus Wiener Publishers, 2005, Chapter 1-2. Hong Kong-China relations in the pre-modern era  Dick Wilson, Hong Kong! Hong Kong!, HarperCollins Publisher, 1991, Chapter 1-4. Features of the British Colonial governance  Ngok Ma, Political Development in Hong Kong: state, political society, and civil society, Hong Kong University Press, 2007, Chapter 2.  Steve Tsang, Modern History of Hong Kong, I.B. Tauris & Co Ltd, 2007, Chapter 14.   PART II: HONG KONG BEFORE 1949   “Old Colonialism”, Hong Kong and birth of free-trade policies  Steve Tsang, Modern History of Hong Kong, I.B. Tauris & Co Ltd, 2007, Chapter 2. Multiethnic society in Hong Kong  Christopher Munn, “Colonialism ‘in a Chinese atmosphere’: the Caldwell affair and the perils of collaboration in early colonial Hong Kong”, in Robert Bickers and Christian Henriot (eds.), New frontiers: imperialism’s new communities in East Asia, 1842-1953, Manchester University Press, 2000, Chapter 2.  Claude Markovits, “Indian communities in China, c. 1842-1949”, in Robert Bickers and Christian Henriot (eds.), New frontiers: imperialism’s new communities in East Asia, 1842-1953, Manchester University Press, 2000, Chapter 4. From Xenophobia to Popular Nationalism in Hong Kong: 1842-1911  Jung-fang Tsai, “From antiforeignism to popular nationalism: Hong Kong between China and Britain, 1839-1911”, in Ming K. Chan and John D. Young (eds.), Precarious Balance : Hong Kong between China and Britain, 1842-1992, M.E. Sharpe, 1994, Chapter 2.   Inter-Colonial relations: Hong Kong’s position in the British Empire  Edgar Wickberg, “Localism and the Organization of Over-Seas Migration in the Nineteenth Century”, in Gary G. Hamilton (eds.), Cosmopolitan Capitalists: Hong Kong and the Chinese Diaspora at the end of the 20th century, University of Washington Press, 1999, Chapter 2. Hong Kong under Japanese Imperialism  Philip Snow, The Fall of Hong Kong: Britain, China, and the Japanese Occupation, Yale University Press, 2003, Chapter 2.     PART III: HONG KONG AFTER 1949 Hong Kong-The People's Republic of China-Republic of China (HK-PRC-ROC) relations  Bryson S. J. Weng, “Patterns in Relations between Taiwan and Hong Kong, 1949-97 and Beyond”, in C.L. Chiou and Leong H. Liew (eds.), Uncertain future : Taiwan-Hong Kong-China relations after Hong Kong’s return to Chinese sovereignty, Ashgate, 2000, Chapter 6. Cold War: Hong Kong between Communism and Capitalism  John D. Young, “The building years: maintaining a China-Hong Kong-Britain equilibrium, 1950-71”, in Ming K. Chan and John D. Young (eds.), Precarious Balance : Hong Kong between China and Britain, 1842-1992, M.E. Sharpe, 1994, Chapter 8. 1967 Riots (I): Hong Kong, the Chinese Cultural Revolution and Hong Kong Identity  Steve Tsang, Modern History of Hong Kong, I.B. Tauris & Co Ltd, 2007, Chapter 13. 1967 Riots (II): Hong Kong and the Rise of Anti-Colonialism  Dietmar Rothermund, The Routledge Companion to Decolonization, Routledge, 2006, Chapter 3. The Economic Miracle: Hong Kong and the Four Asian Tigers  Gary Hamilton, “Hong Kong and the Rise of Capitalism in Asia”, in Gary G. Hamilton (eds.), Cosmopolitan Capitalists: Hong Kong and the Chinese Diaspora at the end of the 20th century, University of Washington Press, 1999, Chapter 1. Hong Kong Transnational Corporations in Southeast Asia  Henry Wai-Chung Yeung, Transnational Corporations and Business Networks: Hong Kong firms in the ASEAN region, Routledge, 1998, Chapter 4, 6. Hong Kong and Deng’s China: the era of reform  Robert F. Ash, “‘Like Fish Finding Water’: Economic relations between Hong Kong and China”, in Robert Ash, Peter Ferdinand, Brian Hook, and Robin Porter (eds.), Hong Kong in Transition: the handover years, St. Martin Press, 2000, Chapter 4. Democratization: Post-Tiananmen China, Hong Kong and Britain  Dick Wilson, Hong Kong! Hong Kong!, HarperCollins Publisher, 1991, Chapter 19.", "recommended_readings": "    Ming K. Chan and John D. Young (eds.), Precarious Balance : Hong Kong between China and Britain, 1842-1992, M.E. Sharpe, 1994.    Takeshi Hamashita, Hong Kong – Network City in Asia [translated in Chinese], Hong Kong Commercial Press, 1997.    Pui-tak Lee (eds.), Colonial Hong Kong and Modern China : interaction and reintegration, Hong Kong University Press, 2005.    Hai Ren, Neoliberalism and Culture in China and Hong Kong : the countdown of time, Routledge, 2010.    Cindy Yik-yi Chu, Chinese Communists and Hong Kong Capitalists : 1937-1997, Palgrave Macmillan, 2010.    Joe Studwell, Asian Godfathers : money and power in Hong Kong and Southeast Asia, Profile Books, 2007.    Stephanie Po-yin Chung, Chinese business groups in Hong Kong and political changes in South China, 1900-1925, St. Martin’s Press, 1998.   ", "terms": {"2020-21 Term 1": {"--LEC (6772)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. TANG Ching Kin"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}}}, "assessments": {"Essays": "0", "Essay test or exam": "0", "Presentation": "0"}}, {"code": "3501", "title": "Global Civil Society and Operation of Non-Governmental Organizations", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course looks at the operation of Global Governance from a bottom-up approach. It aims to provide a combination of major theories and debates behind global civil society, together with the practices of advocacy networks, social movements and non-governmental organizations coalitions. This course covers the following topics, but is not limited to, i) Features and Operations of Global Civil Society (GCS), with particular concerns on the operations of NGOs; ii) Themes and Issues which GCS pushed forward in the recent decade, and assessments over their performance; iii) Role of GCS in Global Governance, e.g. its cooperation with the United Nations in addressing global food crisis; iv) Challenges and Opportunities open to different International NGOs and transnational advocacy groups; v) Case-studies, e.g. Anti-WTO protests in Seattle; GONGOs in China, etc.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3502", "title": "ICT and the Global Order: Internet, Smartphone and E-Governance", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course tackles specifically on the growing importance of Information Technology and e-Governance in recent decades. Besides studying the significance of the proliferating information flow and accessibility, this course studies how the virtual society has hence been connected to the physical life, not least its effects on us. The following topics will be covered in this course, but they are not confined to: i) Rise and Features of E-commerce, E-politics and E-Governance; ii) IT Products and trade policies; iii) IT, Social Media and Political influence; iv) Cyber-security and Cybercrime; v) Case Studies on digital currencies and virtual states.\r", "outcome": "By the end of the course students should be able to: \r 1) identify the key concepts of E-Governance and the blurring boundaries between the virtual society and the real society; 2) identify the changing responses of different political actors towards the IT Revolution and assess their impacts to the Global Society;  3) identify the potential threats brought about from advancement of interconnectedness;  4) relate the content with the daily contexts;  5) judge the extent to which the virtual society can substitute the physical network;  6) think critically", "syllabus": "1) Concepts and theoretical analysis of the e- words: E-politics; E-commerce; E-governance; 2) IT products in Global market: WTO, MNCs and 'patent wars';  3) Information flow and transnational political influence: E-petition in UK; Facebook and Arab Spring;  4) IT, equality and development \r 5) Internet and growth of online transaction: Amazon, Taobao and Bitcoins;  6) Internet and reconfiguration of identity: Virtual states, the Principality of Sealand;  7) IT for individual and society \r 8) Rise of Cybercrime and Cybersecurity;  9) National policies towards IT Revolution;  10) IT in Global Governance;  11) Opportunities and Challenges to \"Traditional\" understanding of Social Science", "required_readings": "1) James Slevin, The Internet and Society, (Cambridge: Polity Press, 2000);  2) Manuel Castellas, Networks of Outrage and Hope: Social movements in the Internet Age, (Cambridge: Polity Press, 2012); 3) Nick Couldry, Media, Society, World: Social Theory and Digital Media Practice, (Cambridge: Polity Press, 2012)", "recommended_readings": "1) Michael Mandiberg (ed.), The Social Media Reader, (New York: New York University Press, 2012);  2) Geert Lovink, Networks without a Cause: A Critique of Social Media, (Cambridge: Polity Press, 2011); 3) James Curran, Natalie Fenton & Des Freedman, Misunderstanding the Internet, (Oxon: Routledge, 2012);  4) Philip N. Howard & Muzami M. Hussain, Democracy's Fourth Wave? : Digital Media and the Arab Spring, (New York: Oxford University Press, 2013);  5) Michael E. Milakovich, Digital Governance: New Technologies for Improving Public Service and Participation, (Oxon: Routledge, 2012).", "terms": {"2020-21 Term 1": {"--LEC (8975)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor Severine ARSENE"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}, "2021-22 Term 1": {"--LEC (5139)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Sino Building 239"], "instructors": ["Dr. CHEUNG Ho Yan Yannie"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Essay test or exam": "0", "Others": "0"}}, {"code": "4102", "title": "Developmental Study: Poverty, Inequality and Welfare of the World", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course aims at providing a critical and theoretical overview of the issues, processes, and responses central to poverty, inequality and welfare around the World. It relates the challenges encountered by these developing states with the dark-sides of the Globalization. This course covers topics including, but not limited to, i) Theoretical understanding of Development and Poverty; ii) Development and Modernization: Asia as examples; iii) Dependency and World Systems Theories: Latin America as examples; iv) Colonization and Cultural Imperialism; iv) Equality in various aspects: Gender, Labour, Food and Wealth; v) International Institutions in ameliorating/aggravating poverty.", "outcome": "By the end of the course students should be able to: \r 1) identify the key concepts of development studies;  2) identify the root causes of inequality in the \"Third-World Countries\" and how Globalization has influenced upon its spread;  3) relate this subject with other courses, e.g. World Economies, and borrow the analytical framework for providing an extra perspective;  4) relate the content with real-life contexts;  5) review critically the news media's report and politicians' rhetoric on these developing countries", "syllabus": "1) Introduction on development studies: concepts of development and inequality;  2) Features and variants of the Developmental States;  3) Impact of Globalization (I): Modernization and Development: Asia as examples; 4) Impact of Globalization (II): Dependency and World Systems Theories; 5) Impact of Globalization (III): Colonialism and Cultural Imperialism;  6) Poverty and Gender Inequality;  7) Poverty and labour/income inequality;  8) International responses: Structural Adjustment Programs, Poverty Reduction Strategy Papers, and Millennium Development Goals;  9) South-South Cooperation;  10) Role of NGOs: Human Rights, Gender and Welfare;  11) Challenges and Possibilities in the 21st century", "required_readings": "1) Jeffrey Haynes, Development Studies, (London: Polity Press, 2008);  2) Robert Potter et al, Geographies of Development: An Introduction to Development studies, 3rd edition, (Essex: Pearson Education, 2008)", "recommended_readings": "1) Peter Alcock, Understanding Poverty, 3rd edition, (Basingstoke: Palgrave Macmillan, 2006);  2) Peter Townsend & David Gordon (eds.), World Poverty: new policies to defeat an old enemy, (London: Polity Press, 2002);  3) Arturo Escobar, Encountering Development: The Making and Unmaking of the Third World, (Princeton: Princeton University Press, 1995);  4) Damien Kingsbury et al, International Development: Issues and Challenges, 2nd edition, (Basingstoke: Palgrave Macmillan, 2012)", "terms": {"2020-21 Term 1": {"--LEC (7266)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Wong Foo Yuan Bldg UG01"], "instructors": ["Dr. CHEUNG Ho Yan Yannie"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}}, "assessments": {"Essay test or exam": "0", "Others": "0"}}, {"code": "4104", "title": "Global Development: Markets, States, Societies and IOs", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course aims to provide in-depth analysis of inter-disciplinary global issues using basic principles of economics. This course is built on the introductory economics with respect to the International Political Economy (IPE) framework i.e., the roles of markets, states, society, and International Organizations (IOs) will be elaborated throughout the course. Hence, prior knowledge of introductory economics and the IPE theory are recommended. The course covers growth and human capital theories, and case studies of how policies are developed and implemented to address global issues. Issues discussed in the course include human capital development, economic development and widening inequality, education, social protection, human rights, emergencies and responses including both natural disaster and man-made conflicts, aging population, disadvantaged populations such as disabilities and ethnic minority, energy, and environment.", "outcome": "1. Students deepen understanding of \r a. Various global development problems in the contemporary world, and\r b. Theories for economic development and human capital development.\r 2. Policy and practice of global issues are understood through a case-study approach. \r 3. The roles of markets, states, society and international organizations to address global issues are appreciated.\r 4. A habit of critical thinking is developed.\r 5. The skills to apply the knowledge into daily lives are acquired to act as a change maker to address global issues locally.", "syllabus": "PART I: Human Capital and Economic Development\r Economic Growth Theory\r Human capital Development Theory\r PART II: Global Development Issues\r Human Rights\r Education\r Health\r Gender\r Aging Society and Social Protection\r Disability and Minority Group\r Governance: Corruption, Global Governance (trade), Human rights\r Nuclear Power and renewable energy\r Money, Land and Bubble\r Conservation, White Gold, Bio-Piracy and Intellectual Property Rights", "required_readings": "Diamond, Jared. Guns, Germs, and Steel: The Fates of Human Societies. New York: Norton, 1999. Print.\r  Education for All Global Monitoring Report. (2013, May 17). Wikiprogress.org, . Retrieved 03:35, January 17, 2014 from http://www.wikiprogress.org/index.php?title=Education_for_All_Global_Monitoring_Report&oldid=31695.", "recommended_readings": "Stiglitz, Joseph E. 2008. “Making Globalization Work.” In The Economic and Social Review 39 (3): 171-190.\r   Ethics Commission on a Safe Energy Supply. 2011. Germany’s Energy Turnaround – A Collective Effort for the Future.", "terms": {"2020-21 Term 2": {"--LEC (6294)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Esther Lee Bldg 401"], "instructors": ["Dr. FANG Hsin Hao Arnold"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}}, "2021-22 Term 1": {"--LEC (7302)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Wong Foo Yuan Bldg 405"], "instructors": ["Staff"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Essay test or exam": "0", "Others": "0"}}, {"code": "4151", "title": "Graduation Project and Experiential Learning I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This is a required course for the GLBS final year students while teaching staffs will be assigned as their supervisors. Each student can fulfill the requirement by either i) complete a research project by adopting his/her own research, problem-solving and thesis-writing skills acquired from other subjects; or ii) engage in an internship program - which should be no shorter than 8 weeks - approved by his/her supervisors in advance.\r", "outcome": "By the end of the course students should be able to:  1) explore and develop his/her own research interests; 2) work individually and independently;  3) integrate and apply the knowledge acquired in other subjects to analyze global issues;  4) develop critical thinking and challenge the inadequacies of existing literatures;  5) present his/her own idea through verbal and written presentations", "syllabus": "Designed by the course supervisors", "required_readings": "To be assigned by course instructor.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"-J01-PRJ (5003)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. CHEUNG Ho Yan Yannie, \n\rDr. HORIUCHI Toru, \n\rMr. CHUNG Lok Wai"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}}}, {"code": "4152", "title": "Graduation Project and Experiential Learning II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This is a required course for the GLBS final year students while teaching staffs will be assigned as their supervisors. Each student can fulfill the requirement by either i) complete a research project by adopting his/her own research, problem-solving and thesis-writing skills acquired from other subjects; or ii) engage in an internship program - which should be no shorter than 8 weeks - approved by his/her supervisors in advance.\r", "outcome": "By the end of the course students should be able to:  1) explore and develop his/her own research interests; 2) work individually and independently;  3) integrate and apply the knowledge acquired in other subjects to analyze global issues;  4) develop critical thinking and challenge the inadequacies of existing literatures;  5) present his/her own idea through verbal and written presentations", "syllabus": "Designed by the course supervisors", "required_readings": "To be assigned by course instructor.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"-J01-PRJ (9237)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. HORIUCHI Toru"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-J01-PRJ (8373)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. CHEUNG Ho Yan Yannie, \n\rDr. HORIUCHI Toru, \n\rMr. CHUNG Lok Wai"], "meetingDates": ["17/01/2021 - 25/04/2021"]}}}}, {"code": "4301", "title": "Islamic and Christian Culture in the Global Order: Religion, Society and Economy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course focuses on the relations among the world religions and their contribution to the formation of new identities of class, gender, ethnicity, nation and economic development in the global context. This course covers two major sets of world religions, Islam and Christianity with emphasis on their popular expression rather than formal theologies.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4302", "title": "Advanced Methodology of Social Science Research", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "Prerequistie: GLBS2002 or any other basic methodology courses offered by other departments at a similar level.", "description": "This course is built on the core course on GLBS2002 Methodology of Social Science Research (or any other basic methodology courses offered by other departments at a similar level). While the introductory course covers the basics of social science research methods, this course offers more practical and advanced social research techniques by covering descriptive statistics, uni- and multi-variate regression analysis, and introduction of cost-benefit analysis and other intermediate quantitative methods. Students will acquire new quantitative skills through learning a statistical program (e.g., SPSS). Students are requested to write a term paper using quantitative methods. The quantitative methods learned in this class are used in all policy arenas, including the public and private sectors. The course content prepares students for academic and professional careers that use empirical analyses, particularly relevant to those who are interested in working for governments, NGOs or policy consultation units after graduation.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4401", "title": "Traditional Security: Military, War and Peace", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course introduces the academic field of strategic studies and security studies by referring to a few theoretical analysis and their practices in reality. This course also sketches out the ongoing debates about security, war and peace in International Relations for the better understandings of strengths and limitations of extant frameworks. The topics covered in this course include, but do not limit to, i) Basic understanding of military history and strategies, e.g. Clausewitz and Sun Tzu; ii) Theoretical approaches to International Security; iii) Traditional security challenges faced by nation-states and its evolution; iv) Alliance system and other responses to such challenges; v) Assessment of the level of threats imposed by these traditional security challenges.", "outcome": "By the end of the course students should be able to :\r 1) identify the mainstream theories regarding Strategic studies and security studies and assess their usefulness in explaining the phenomenon and behaviours;  2) identify the differences/similarities between the different schools of thoughts in relation to strategic studies;  3) identify the major traditional security challenges confronted by nation-states and global governance nowadays;  4) assess the importance of traditional security challenges to us;  5) relate the content with different policies undertaken by different countries; 6) think critically", "syllabus": "1) Introduction to strategic studies and security studies;  2) Overview of Military Technology and Strategic thinking of the Major Powers: Air, Land and Sea Power ;  3) Strategic Studies from the East: Sun Tsz and others;  4) Strategic Studies from the West: Clausewitz and others;  5) IR Theories and Strategic Studies;  6) Theories and Practices of Conflict Resolution; 7) History of War;  8) Perception and the Threat of Force: Nuclear Deterrence and WMD;  9) Alliance System;  10) Individuals, Regional Security Institutions, the United Nations Security Council in peacekeeping;  11) Democracy and Peace;  12) Assessment of the level of threats imposed by \"Traditional\" Security Threats under Globalization: Opportunities and Challenges", "required_readings": "1) Thomas G. Mahnken & Joseph A. Maiolo (eds.), Strategic Studies: A Reader, (Oxon: Routledge, 2008); 2) John Baylis, James J. Wirtz & Colin S. Gray (eds.), Strategy in the Contemporary World, 3rd edition, (London: Oxford University Press, 2010); 3) Paul D. Williams (ed.), Security Studies: An Introduction, 2nd edition, (Oxon: Routledge, 2012).", "recommended_readings": "1) Colin S. Gray, Modern Strategy, (Oxon: Oxford University Press, 1999);  2) David Jordan & James D. Kiras (eds.), Understanding Modern Warfare, (Cambridge: Cambridge University Press, 2008);  3) Michael E. Brown, et al(eds.), Theories of War and Peace, (Cambridge: MIT Press; 1998);  4) Bradley S. Klein, Strategic Studies and World Order; The Global Politics of Deterrence, (Cambridge: Cambridge University Press, 1994);  5) Carl von Clausewitz, On War, (Oxford: Oxford University Press), 2007;  6) Sun Tzu, The Art of War, (New York: Cosmio, 2006);  7) Peter Wallensteen, Understanding Conflict Resolution: War, Peace and the Global System, 3rd edition, (London: SAGE Publications, 2011);  8) Hew Strachan & Andreas Herberg-Rothe (eds.), Clausewitz in the Twenty-first Century, (Oxon: Oxford University Press, 2007).", "terms": {"2020-21 Term 2": {"--LEC (8334)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Esther Lee Bldg 405"], "instructors": ["Dr. HORIUCHI Toru"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 2": {"--LEC (8104)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Lee Shau Kee Archi Bldg 211"], "instructors": ["Dr. HORIUCHI Toru"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Essay test or exam": "0", "Others": "0"}}, {"code": "4402", "title": "New Security Challenges: Terrorism, Ethnic Conflicts and Human Trafficking", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course furthers the studies of security challenges to the so-called \"Non-Traditional Security\" field which becomes more outstanding under Globalization by undermining the role of states in terms of the ability to mobilize force. Unlike another course emphasizing states as the primary actors in Global Security, this course puts more emphasis on how individuals, non-state actors and International Organizations have taken up the responsibilities to uphold the Global Order. This course puts special focus on: i) Terrorism, ii) Ethnic conflicts, and iii) other human security challenges including immigration, energy, health problems.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4403", "title": "Political Economy of Africa", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course examines the political economy of nation-states in the Sub-Saharan region and review how Globalization has aggravated the outstanding developmental problems. This course will cover issues such as colonialism, ethnicity, ideology, political cultures, global capitalism, and foreign interventions, in order to provide a comprehensive analysis to study the factors impeding development in Africa.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4501", "title": "Analyzing Global Cities and Urban Space", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "Not for students who have taken GLBS4103.", "description": "The course is an extension of GLBS3105 Understanding Global Cities and Urban Space. It examines the extent of globalization effects that shape social, political and cultural meanings of space and place. The course is divided into two sections. The first section gives emphasis to the collective effect of globalization on everyday life in global cities. Social problems of urbanization, technological change in global cities, and mass culture of consumption are topics to be examined in this section. Political shaping of urban space use is another emphasis of this course. Both sections shall use issue-based approach to illustrate concepts covered in GLBS3105. Each lecture shall cover a collective phenomenon in the global cities. The purpose is to use an issue to illustrate the making of everyday life in global cities is a consequence of globalization. At the same time, local society and communities are remaking the global landscape of social and cultural space.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4502", "title": "Education and Development in a Global Perspective", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course introduces general functions and effects of education in development. The course covers and reviews main theoretical approaches in the field of education and development, such as modernization theory, human capital theory, dependency theory, liberation theory, and new institutionalist theory. Drawing on these theoretical approaches, the course further discusses collective effects of education on national development in industrialized world and developing world. At the same time, the course gives emphasis to examine educational changes and reforms that shape and reshape national educational policies across nations over time. Such organization of this course aims to invite students to think critically about the societal value of schools and schooling experiences and its relevance as a development project in both first and third world societies.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4601", "title": "Global Capital Flows: Multinational Corporations, Global Property Market and FDI", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course examines the major dynamic of economic globalization, global capital flows, and its impacts to the foreign direct investment, global financial market and also the Property market around the World. It also sheds light on the issue of money laundering and other financial crimes which has been accelerated, if not made possible, by Globalization. This course covers the following topics, but is not limited to, i) the Global financial order: Relationship between trade, finance and MNCs, ii) the Operation of different financial markets, e.g. Properties, Derivatives, Bonds, Stocks and FX Market; iii) an in-depth study of the financial institutions and assessment of the mode of Governance, e.g. Credit-Rating Agencies, Central Banks, BIS, G8, G20 and the Bretton Woods System; iv) Possibilities and Challenges of Global Financial Governance in the 21st Century. ", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4602", "title": "The Rise of China in the Global Context II: Internationalization of the Chinese economy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This is an advanced-level course which is designed mainly for students planning to enhance their understanding in the contemporary China under globalization. This course will provide a comprehensive analysis of the market transition of Chinese economy and China’s increasing role in the world economy after 1978. It covers topics including, but not limited to, i) China's strategies in promoting internationalization; ii) China and Global Economic Governance, iii) challenges and possibilities of China's internationalization strategies. Students are recommended to register this course only after having studied GLBS3106 or relevant subjects.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4701", "title": "Selected Topics in Global Studies I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course conducts selected studies on some important topics in Global Studies. The topics may include issues such as globalization, global politics, economic and financial development and social and cultural evolutions. The focus of the course may vary according to the area of expertise of the instructor and the interests of the class.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4702", "title": "Selected Topics in Global Studies II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course conducts selected studies on some important topics in Global Studies. The topics may include issues such as globalization, global politics, economic and financial development and social and cultural evolutions. The focus of the course may vary according to the area of expertise of the instructor and the interests of the class.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4703", "title": "Independent Study", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Independent Study", "campus": "Main Campus", "academic_group": "Global Studies PC 2-yr", "requirements": "", "description": "This course allows final-year students to carry out their own researches which are related to Global Studies. Student can integrate the skills and knowledge acquired from other classes and compiles his/her research report. It should be conducted under the supervision of teaching staff. This course is exclusively designed for students from the Global Studies Programme only.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]