[{"code": "5801", "title": "Theories of Global Political Economy", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "This course provides an introduction to broad themes, key concepts, and major theories used to understand the global political economy, and how national political-economies fit into the global system. In the first half, we will cover a bit of methodology and the philosophy of science of political economy, the history of the global political-economic system, contemporary controversies, and possible futures. In the second half, we will cover the major theories that scholars have constructed to make sense of the global political economy, including economic nationalism or realism, liberalism, and critical theories. Having prior knowledge of international relations scholarship or economics will help, but is not strictly necessary. The aim of this course is to provide an intellectual foundation for understanding how the world system operates, and for further, more specialized studies in the many areas that GPE covers.", "outcome": "• Substantive Knowledge:   The “big picture” of what Global Political Economy covers as an academic discipline: interactions between politics and economics, the history and development of political-economic systems, and understanding the contemporary world system.   Students should be conversant with the essential themes, concepts, and terms employed in the study of global political economy.   Familiarity with the major theories that have been constructed to make sense of the global political economy, where they differ and where they overlap, and their strengths and weaknesses. • Critical Analysis:   Students should be able to identify the central thesis of books or articles, understand how the authors develop and defend it, and critically evaluate the author’s thesis, evidence, and logic.   Students should be able to assess the strength and weaknesses of theories/arguments in GPE and engage in critical discussions and debates.", "syllabus": "1. Methodology and the philosophy of science of political economy Ontology, epistemology, scientific realism, the artificial divide between politics and economics  2. The history of the global political economy Deep history, history of economic development, history of the global financial and economic systems  3. Contemporary problems Financialization, financial reform nationally and internationally  4. The future of political economies Money and its function in political economy  5. Theories through which to understand the complex system Economic nationalism/realism, liberalism, critical theories", "required_readings": "Substantial selections from: The Social Evolution of International Politics, by Shiping Tang  The Great Transformation, by Karl Polanyi (with Foreword by Joseph Stiglitz)  Super Imperialism, Revised Edition (2003), by Michael Hudson  The Production of Money, by Ann Pettifor  Kicking Away the Ladder, by Ha-Joon Chang  Other People’s Money, by John Kay Global Political Economy: Evolution & Dynamics, Fifth Edition, by Robert O’Brien and Marc Williams Plus short articles or book chapters available online", "recommended_readings": "(Will be made available online)", "terms": {"2020-21 Term 1": {"--LEC (2843)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [1], "locations": ["Lady Shaw Bldg LT2"], "instructors": ["Professor CHUNG King Lam Calvin"], "meetingDates": ["7/9", "14/9", "21/9", "28/9"]}}, "2020-21 Term 2": {"--LEC (2220)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [2], "locations": ["Sino Building UG06"], "instructors": ["Professor Peter BEATTIE"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 1": {"--LEC (3216)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [1], "locations": ["Chen Kou Bun Bldg 109"], "instructors": ["Professor CHUNG King Lam Calvin"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11", "6/12", "13/12"]}}, "2021-22 Term 2": {"--LEC (1007)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [2], "locations": ["Chen Kou Bun Bldg 109"], "instructors": ["Professor Peter BEATTIE"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Discussion": "40", "Essays": "60"}}, {"code": "5802", "title": "Theories of International Relations", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "The course offers an introduction to the major theories of international relations with a particular focus on the applicability in contemporary world order. The respective merits and limitations of the theories would also be discussed in hope of illustrating the basics of doing international relations research.", "outcome": "Upon finishing the course, students are expected to:\r Learning outcome 1: Describe the major international relations theories\r Learning outcome 2: Compare and contrast major international relations theories on the respective \r merits and limitations\r Learning outcome 3: Evaluate contemporary global issues through different theoretical lenses\r Learning outcome 4: Reflect upon the development of international politics theories and its applicability to contemporary world", "syllabus": "Part I: Theorizing the World\r - International relations versus International Relations\r - What is a theory and what is not a theory?\r - The foundations of international politics\r  Fundamental concepts of Part I:\r - The distinction between international relations as state actions versus International Relations \r as a discipline in social sciences\r - The idea of social science theory and its limitations\r - The concept of sovereignty, nation-states and international society, anarchy\r - The foundation of modern international politics: the Westphalian system\r  Part II: Major IR Theories and its Critics\r - Realism and Neo-realism\r - Liberalism and Neo-liberalism\r - Constructivism\r - Marxism and the World System Theory\r - The English School\r - Post-structuralism and feminist theory of IR\r - Security Studies and Foreign Policy Analysis\r  Fundamental concepts of Part II:\r - Realist theory and its variations\r - Liberal theory and its variations\r - Constructivism and the rise of social theory of IR\r - Marxist understanding of the world, the neo-Marxist theories and its critics\r - The English School and its critics to traditional theories\r - The Power-Knowledge arguments in IR\r - The Feminist critics\r - The concept of security and layers of security\r - How Foreign Policy is made and understood\r  Part III: Discussing the Contemporary World Order*\r This part is case-study and it is subjected to the materials provided by the lecturer of the course \r  Fundamental concept of Part III:\r Subjected to the topics selected by the lecturer", "required_readings": "Dunne, Tim , Milja Kurki and Steve Smith eds. (2013). International Relations Theories: Discipline and Diversity. Oxford University Press.\r  Smith, Steve, Patricia Owens and John Baylis eds. (2008). The Globalization of World Politics. Oxford: Oxford University Press. Fourth edition.\r  Weber, Cynthia. (2010) International Relations Theory: a critical introduction. Oxon: Routledge. Third edition.", "recommended_readings": "Recommended reading list will be provided by the lecturer of the course.", "terms": {"2020-21 Term 1": {"--LEC (4278)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [2], "locations": ["Chen Kou Bun Bldg UG03"], "instructors": ["Dr. CHAN Wai Shun"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12", "8/12"]}}, "2020-21 Term 2": {"--LEC (3209)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [6], "locations": ["Chen Kou Bun Bldg LT3"], "instructors": ["Professor Karim BETTACHE"], "meetingDates": ["16/1", "23/1", "30/1", "6/2"]}}, "2021-22 Term 1": {"--LEC (3341)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [2], "locations": ["Sino Building UG06"], "instructors": ["Professor Karim BETTACHE"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11", "7/12", "14/12"]}}, "2021-22 Term 2": {"--LEC (3944)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [6], "locations": ["Sino Building UG06"], "instructors": ["Dr. CHAN Wai Shun"], "meetingDates": ["15/1", "22/1", "29/1"]}}}, "assessments": {"Essay test or exam": "30", "Presentation": "30", "Report": "40"}}, {"code": "5803", "title": "Methodology in Social Sciences", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "This course gives emphasis on the application of methodological principles and data analysis techniques in designing and conducting research in Social Sciences, with an objective of enabling students to investigate local, regional or global issues with a design-based approach of social enquiry. Course contents include basic concepts in research designs, data collection strategies and data analysis methods. Both quantitative and qualitative approaches will be discussed to analyze topics in global political economy.", "outcome": "By the end of the course, students shall be able to:\r 1. Recognize major quantitative and qualitative methods in social science; 2. Identify and formulate research questions of a research proposal; 3. Select and collect a body of academic literature which is relevant to the research questions; 4. Describe and explain relationships between the selected independent and dependent variables; 5. Apply research design relevant to the research questions;  6. Compare and contrast the strength and weakness of each method; 7. Produce an empirical research proposal; 8. Use statistical software to organize and analyze quantitative data on an introductory level; 9. Reflect critically his or her own research and those of other social science research papers and \r policy reports; 10. Identify possible societal, political, economic and organizational dynamics that would affect \r research processes; 11. Follow codes of ethics while designing and implementing the research proposal.", "syllabus": "Topic: Theory and Research\r Contents/ fundamental concepts: \r • The logic of scientific inquiry\r • Measurement\r • Scale construction\r • Validity and reliability\r  Topic: Research Design, Data Collection Method and Data Analysis\r Contents/ fundamental concepts: \r • Experiment\r • Survey\r • Qualitative field research\r • Unobtrusive research \r • Evaluation research\r • Sampling: Probability and non-probability sampling\r  Topic: Association, Causation and Elaboration Model\r Contents/ fundamental concepts: \r • Conditions for causation\r • Specification of a causal process\r • Elaboration analysis\r • Quantitative data analysis", "required_readings": "Babbie, Earl R. 2016. The Practice of Social Research, 14th Edition. Belmont, CA: Wadsworth \r Cengage Learning.", "recommended_readings": "Dunning, Thad. 2012. Natural Experiments in the Social Sciences: A Design-based Approach. \r Cambridge, UK: Cambridge University Press.\r Creswell, John W. 2014. Research Design: Qualitative, Quantitative, and Mixed Methods \r Approaches, 4th edition, London: SAGE Publications. \r Lamont, Christopher K. 2015. Research Methods in International Relations. London: SAGE \r Publications.\r Ragin, Charles C. and Lisa M. Amoroso. 2011. Constructing Social Research, 2nd edition, Los \r Angeles: SAGE Publications.", "terms": {"2020-21 Term 1": {"--LEC (2321)": {"startTimes": ["10:00"], "endTimes": ["12:45"], "days": [6], "locations": ["Esther Lee Bldg LT2"], "instructors": ["Dr. CHEUNG Ho Yan Yannie"], "meetingDates": ["12/9", "19/9", "26/9", "3/10"]}}, "2020-21 Term 2": {"--LEC (3178)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [3], "locations": ["Hui Yeung Shing Bldg G05"], "instructors": ["Dr. Tommy TSE"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 1": {"--LEC (2668)": {"startTimes": ["10:00"], "endTimes": ["12:45"], "days": [6], "locations": ["Li Koon Chun Hall LT1"], "instructors": ["Dr. CHEUNG Ho Yan Yannie"], "meetingDates": ["11/9", "18/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11", "4/12", "11/12", "18/12"]}}, "2021-22 Term 2": {"--LEC (1236)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [4], "locations": ["Esther Lee Bldg 203"], "instructors": ["Professor HAN Ling"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Essays": "30", "Project": "50", "Report": "20"}}, {"code": "5810", "title": "Applied Macroeconomics and International Finance", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "This course applies theories of macroeconomics to the real world, and will examine the roots and causes of recent Global Financial Crises, focusing on analyzing the current state of the Global Financial Market and mitigation measures that have been implemented in recent years.", "outcome": "Students are expected to learn how international finance works in practice and how macroeconomic theories are integrated and applied in these dynamic conditions, and the role of exchange rates and interest rates mechanisms. They are also expected to compare and contrasts the interaction of finance and economies in a global context, and reflect on how to create a more stable and better financial system for more inclusive economic growth.", "syllabus": "1. Shadow Banking and Financial Crisis\r Subprime and banking crisis; Interest Rate and Credit Derivatives\r 2. Credit Cycles and Debt Problems\r Government Debt Problems; Bailout Mechanisms\r 3. Financial Markets in the New Paradigm\r Consolidations of Exchanges/ Clearing Houses; Hedging Counterparty Risks\r 4. Understanding Economic Growth\r The Solow Growth Model; The Romer Model\r 5. Monetary Theory and Foreign Exchange\r Unconventional Monetary Policies / Quantitative Easing", "required_readings": " Kun, Edwin and Schmalensee, Richard L. 1971. An introduction to applied macroeconomics. Amsterdam : North-Holland Pub. Co.; New York : American Elsevier.\r  Buckley, Adrian. 2012. International finance: a practical perspective. Harlow, England; New York : Pearson.\r  Van den Berg, Hendrik. 2010. International finance and open-economy macroeconomics : theory, history, and policy. Singapore; London : World Scientific.\r  Sercu, Piet. 2009. International finance : theory into Practice. Princeton, N.J. ; Woodstock : Princeton University Press.\r  Hagen, Kristian L., ed. 2008. International finance and financial services. New York : Nova Science Publishers.\r  Hansanti, Songporn, Islam, Sardar M. N. and Sheehan, Peter. 2008. International Finance in Emerging Markets: Issues, Welfare Economics Analyses and Policy Implications. Heidelberg : Physica-Verlag Heidelberg.\r  Reinhart & Rogoff. 2009. This Time is Different, Princeton University Press\r  Mohamed El Erian. 2008. When Markets Collide, McGraw Hill\r  Joe Zhang. 2013. Inside China's Shadow Banking: The Next Subprime Crisis, Enrich Professional Publishing\r  Michael Lewis. 2011. The Big Short: Inside the Doomsday Machine, W. W. Norton & Company", "recommended_readings": " Neil Ferguson (2009), The Ascent of Money: A Financial History of the World, Penguin\r  Richard Posner (2009), A Failure of Capitalism: The Crisis of '08 and the Descent into Depression, Harvard University Press\r  Gillian Tett (2009), Fool’s Gold -- How Unrestrained Greed Corrupted a Dream, Shattered Global Markets and Unleashed a Catastrophe, Little, Brown \r  George Soros (2008), The New Paradigm for Financial Markets, Public Affairs (a member of the Perseus Book Group)\r  Riccardo Rebonato (2007), Plight of the Fortune Tellers, Why we need to manage risk differently, Princeton University Press", "terms": {"2020-21 Term 1": {"--LEC (4218)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [4], "locations": ["Cheng Yu Tung Building LT4"], "instructors": ["Dr. CHUNG Chun Kit"], "meetingDates": ["10/9", "17/9", "24/9"]}}, "2021-22 Term 1": {"--LEC (1142)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [4], "locations": ["Chen Kou Bun Bldg UG03"], "instructors": ["Dr. MOK Kai Chung"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Attendance": "5", "Essay test or exam": "20", "Presentation": "40", "Participation": "35"}}, {"code": "5811", "title": "International Financial and Trade Policy: From Bretton Woods to G20/Doha", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "This course examines the nature, evolution and particularly the ramifications of the Bretton Woods system and institutions, particularly for companies and other organizations operating in Asia. Global financial institutions and especially international trade and investment, their roles and issues, will be explored. This will include recognizing and understanding the characteristics and challenges of trade and investment across borders, and managing the associated opportunities and threats, illustrated by case examples. The course will begin with an overview of the Bretton Woods system, its rise and fall, and subsequent efforts to manage the global economy. It will discuss the implications of the rules and politics of finance, trade and investment, and issues like globalization, protectionism and the role of foreign direct investment. The focus will be on how international trade and finance rules and particularly policies actually work and don't work for companies and other organizations operating in Asia, with special attention paid to recent developments like the Asia Infrastructure Development Bank, new bilateral and multilateral economic agreements and the evolving role of the G-20. ", "outcome": "Upon completion of this course, students will be able to: \r 1) Acquire knowledge of the post – war economic and financial system, and current developments and trends occurring;  2) Develop a deeper understanding regarding the effects of shifts and changes in International Trade on International Relations and domestic politics; and\r 3) Analyze the strengths and weaknesses of the current system.", "syllabus": "Materials to be provided by course instructor", "required_readings": "• Thomas Oatley, International Political Economy: Interests and Institutions in the Global Economy, 5th ed. (Routledge, 2016). \r  • Thomas D. Lairson and David Skidmore, International Political Economy: The Struggle for Power and Wealth in a Globalizing World (Routledge, 2017). \r  • Thomas Oatley, Debates in International Political Economy, 2nd ed. (Pearson Education, 2012).\r  • Fabrice Lehmann and Jean-Pierre Lehmann, editors, Peace and Prosperity Through World Trade (Cambridge University Press, 2010).\r   Plus related articles, speeches, online resources (including short video materials)", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (4300)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [5], "locations": ["Yasumoto Int'l Acad Park 505"], "instructors": ["Professor Mark Charles MICHELSON"], "meetingDates": ["15/1", "22/1", "29/1", "5/2"]}}, "2021-22 Term 2": {"--LEC (3460)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [4], "locations": ["Wong Foo Yuan Bldg UG02"], "instructors": ["Professor Mark Charles MICHELSON"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Attendance": "5", "Essay test or exam": "20", "Presentation": "35", "Project": "30", "Participation": "10"}}, {"code": "5812", "title": "International Investment Policy: Economic and Business Perspectives", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "This course consists of two closely interrelated and complementary parts. The aim of the economic part is to describe and explain the origins, forms, and consequences of international investment. Both foreign direct investment (FDI) and international portfolio investment are highlighted, but greater emphasis is placed on the former. The role played by governments and international institutions is accorded considerable attention. The aim of the business part is to describe and explain in an elaborate fashion the role played by multinational/transnational enterprises (MNEs/TNEs), the key players in global business arena, in the world economy. The forces shaping this role and MNEs responses—strategic, tactical, and operational—are highlighted. Regulatory matters are accorded considerable attention. ", "outcome": "Upon completion of this course, students will be able to: \r a. To gain insight into the economic nature, sources, dynamics and impacts of FDI; b. To possess an awareness of the factors impinging on public policies towards FDI and their effectiveness;  c. To gain insight into the nature of MNEs, their role in the global economy, their structures, their strategies, and their operations; d. To obtain an appreciation of their multiple impacts, both favourable and unfavourable, on host economies; e. To understand their complex and evolving relationships with governments and other regulatory agencies.", "syllabus": "Topics for economic part:\r 1. Introduction:\r a. Essence, channels, and patterns of international capital flows: JBIC, chap. 2, OECD, chap. 1, sec. 1.4, and 2.\r b. Determinants and theories of foreign direct investment (FDI): LS, chap. 2; MDP, chap. 2.\r 2. FDI and development:\r a. FDI and economic growth: JBIC, chap. 3; LS, chaps. 3-4; OECD, chap. 3.\r b. FDI and human capital enhancement: OECD, chap. 6.\r 3. FDI and international exchanges:\r a. FDI and international trade: JBIC, chap. 4; OECD, chap. 4.\r b. FDI and technology transfer: JBIC, chap. 5; OECD, chap. 5.\r 4. FDI, the market, and the enterprise:\r a. FDI, market structure, and competition: LS, chaps. 3-4; OECD, chap. 7.\r b. FDI and enterprise development: JBIC, chap. 6, OECD, chap. 8.\r 5. Social and environmental consequences of FDI: OECD, chap. 9.\r 6. FDI and risk: BO, entire book; WF, entire book.\r 7. Policies to attract and obtain benefits from FDI: JBIC, chap. 7; LS, chaps. 11-12; OECD, chap. 10; TMa, entire book; TMb, entire book.\r Topics for business part:\r 8. a. The nature and evolution of MNEs: DL, chap 1-2, 6; PD, entire book; PM, entire book; SC, chap. 3.\r b. Varieties of MNEs: AR, entire book; DL, chap.2; MF, entire book; SC, chap. 4.\r 9. a. MNE motives investment geared toward foreign production: DL, chaps. 2-6; SC, chaps.6-7.\r b. MNE entry and expansion strategies: DL, chaps.7, 9.\r 10. a. Internal organization of MNE activities: DL, chap. 8.\r b. External organization of MNE activities: DL, chap. 9.\r 11. MNE geographic linkages and impacts: DL, chap. 16; SC, chap. 8.\r 12. MNEs and long-term technological change: DL, chaps. 11-12.\r 13. MNEs, environmental preservation, and social responsibility: DL, chap. 18.\r 14. MNEs and states: DL, chaps. 19-21; DTL, entire book; SC, chaps. 11-15.", "required_readings": "Japan Bank for International Cooperation, Foreign Direct Investment and Development: Where Do We Stand (JBIC).\r OECD, Foreign Direct Investment for Development: Maximizing Benefits, Minimizing Costs (OECD).", "recommended_readings": "I. Alon, M. Feltscherin, and P. Gugler (eds), Chinese International Investments (AFG). \r C. Chen, Foreign Direct Investment in China: Location Determinants, Investor Behaviour, and Economic Impact (CC).\r G.T. Crane, The Political Economy of China’s Special Economic Zones (GC).\r T. Farole and G. Akinci (eds), Special Economic Zones: Progress, Emerging Challenges, and Future Directions (FA).\r K. A. Froot (ed), Foreign Direct Investment (KF).\r G. Hale and C. Long, Foreign Direct Investment in China: Winners and Losers (HL).\r H. Horaguchi and K. Shimokawa (eds), Japanese Foreign Investment and the East Asian Industrial System: Case Studies from the Automobile and Electronics Industries (HS).\r M. Du Pont, Foreign Direct Investment in Transitional Economies (MDP).\r Y. Huang, Foreign Direct Investment in China: An Asian Perspective (YH).\r Y.C. Jao and C.K. Leung (eds), China’s Special Economic Zones: Policies, Problems, and Prospects (JK).\r S. Lall and P. Streeten, Foreign Investment, Transnationals, and Developing Countries (LS).\r T.H. Moran, Foreign Direct Investment and Development: The New Agenda for Developing Countries and Economies in Transition (TMa).\r T.H. Moran, Harnessing Foreign Direct Investment for Development: Policies for Developed and Developing Countries (TMb). \r M.H.K. Ng, Foreign Direct Investment in China: Theories and Practices (MN).\r B. D. Oseghale, Political Instability, Interstate Conflict, Adverse Changes in Host-Government Policies, and Foreign Direct Investment (BO).\r C.D. Pak, The Special Economic Zones of China and their Impact on its Economic Development (CD).\r R. Paprzycki and K. Fukao, Foreign Direct Investment in Japan: Multinationals’ Role in Growth and Globalization (PF).\r J.D. Park, The Special Economic Zones of China and their Impact on its Economic Development (JP).\r F. Robins, ‘The Uniqueness of Chinese Outward Foreign Direct Investment’ Asian Business and Management (2013) (FR).\r K.P. Sauvant and M.D. Nolan, ‘China’s Outward Foreign Direct Investment and International Investment Law’ Journal of International Economic Law (2015) (SN).\r Y.A.. Wei, and X. Lu, Foreign Direct Investment in China: Determinants and Impact (WL).\r C. White and M. Fan, Risk and Foreign Direct Investment (WF).\r H. Yamawaki, Japanese Exports and Foreign Direct Investment: Imperfect Competition in International Markets (HY).\r  Required readings/textbooks for business part:\r S. D. Cohen, Multinational Corporations and Foreign Direct Investment: Avoiding Simplicity and Embracing Complexity (SC).\r J. H. Dunning and S. M. Lundan, Multinational Enterprises and the Global Economy, 2nd ed.\r Recommended readings for business part:\r Alon, M. Fetscherin, and P. Gugler (eds) , Chinese International Investments (AFG).\r P.W. Beamish, Japanese Multinationals in the Global Economy (PB).\r L. Casanova, Global Latinas: Latin America’s Emerging Multinationals (LC).\r P.N. Doremus et al., The Myth of the Global Corporation (PD).\r Y.L. Doz, J. Santos, and P. Williamson, From Global to Metanational: How Companies Win in the Knowledge Economy (DSW).\r J. H. Dunning and T.M. Lin (eds.), Multinational Enterprises and Emerging Challenges of the 21st Century (DTL).\r D. Encarnation (ed.), Japanese Multinationals in Asia (DE).\r A. Farhommand, Small Business Management and Entrepreneurship in Hong Kong: A Casebook (AF).\r C. Forcese, ‘Regulating Multinational Corporations and International Trade Law’ in Daniel Bethlehem et al. (eds.), Oxford Handbook of International Trade Law (CF).\r M. Forsgren, Theories of the Multinational Firm: A Multidimensional Creature in the World Economy (MF).\r M.W. Hansen et al., Strategies in Emerging Markets: A Case Book on Danish Multinational Corporations in China and India (MH).\r G. Jones and H.G. Schroter, The Rise of European Multinationals in Continental Europe (JS).\r J.P. Larcon (ed), Chinese Multinationals (JL).\r J.A. Mathews, Dragon Multinational: A New Model of Global Growth (JM).\r P. Mourdoukoutas, The Global Corporation: The Decolonization of Global Business (PM).\r E.C. Mujih, Regulating Multinationals in Developing Countries: A Conceptual and Legal Framework for Corporate Social Responsibility (EM).\r A.M. Rugman, The Regional Multinationals: MNEs and “Global” Strategic Management (AR).\r R. Van Tulder, A. Verbeke, and L. Voinea (eds.), New Policy Challenges for European Multinationals (VVV).\r H. Wang and M. Lu, China Goes Global: the Impact of Chinese Overseas Investments in Transforming its Business Enterprises (WL).\r A. Yeung et al., The Globalization of Chinese Companies (AY).\r S. Zhang and R. Pearce, Multinationals in China: Business Strategy, Technology, and Economic Development (ZP).", "terms": {"2020-21 Term 1": {"--LEC (3767)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [5], "locations": ["Cheng Yu Tung Building LT5"], "instructors": ["Professor MUSHKAT Miron"], "meetingDates": ["11/9", "18/9", "25/9"]}}, "2021-22 Term 1": {"--LEC (3238)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [5], "locations": ["Chen Kou Bun Bldg UG05"], "instructors": ["Professor MUSHKAT Miron"], "meetingDates": ["10/9", "17/9", "24/9"]}}}, "assessments": {"Attendance": "5", "Essays": "40", "Presentation": "10", "Participation": "5", "Report": "40"}}, {"code": "5813", "title": "Currency War – Past, Present and Future", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "The Currency War that erupted in 2010 has weaken the financial foundation of the world’s advanced economies and eroded the currency functions of the three global currencies (the USD, Euro and Japanese yen), or G3 currencies. This has given the Chinese renminbi a window of opportunity to rise and challenge the global dominance of the G3 currencies. This is a structural change that will shake up the global political economy and monetary system in the decades to come by adding a new player – China – to the future currency war. Meanwhile, Chinese President Xi Jinping is pushing through structural reforms to chase his \"Chinese Dream\" when the global powers are repositioning to accommodate the renminbi in the global system. The course will encompass the past, present and future aspects of the currency war by integrating China’s development in the global currency war environment. It will prepare students for understanding the coming changes in Mainland China and how they will affect the global monetar卜y system and political economy. The course will start with some basic economic concepts that are needed to understand the economics part of the course. It will use the currency war development to explain the rise of the renminbi, the political and economic challenges behind the opening up of China and the evolution of China's policy and financial development in shaping the future of the world economy.", "outcome": "Upon completion of this course, students will be able to: \r 1) understand the development of the currency war and its impact on the global system;  2) understand the rising importance of China from a currency perspective in the context of the currency war;  3) learn about the future development of China’s political and financial development in preparation for accommodating the new China in the business, investment and academic sectors.", "syllabus": "The lectures will cover the following topics:\r • Theoretical concepts needed to understand and analyse the world’s currency war\r • The origin of currency war and economic/policy lessons learnt from experience\r • Development of the currency war and the renminbi’s mega trend\r • Rotational currency depreciation, an alternative definition of currency war\r • Hong Kong and China in currency war \r • The rise of the renminbi to challenge the G3 currencies \r • Structural drivers that are changing the dynamics behind the G3 currencies and the renminbi \r • Erosion of the financial prowess of the advance economies by the currency war and a window of opportunity for the rise of the renminbi\r • Currency war prompts renminbi reform\r • The advent of the “Impossible Trinity” as the renminbi rises and as China’s capital account opens up\r • The political reality and challenges for China to manage the rise of its currency to become a global currency in the currency war environment\r • Renminbi internationalisation, progress, challenges, and the next step in the context of the currency war\r • China’s Belt and Road initiative and renminbi internationalisation \r • Myths, hypes and truth of the Belt and Road initiative\r • The future of the renminbi (what will make it a global currency?)", "required_readings": "A course text plus lecture notes and reference reading materials to be advised later.", "recommended_readings": "A course text plus lecture notes and reference reading materials to be advised later.", "terms": {"2020-21 Term 1": {"--LEC (1593)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [6], "locations": ["Esther Lee Bldg LT2"], "instructors": ["Mr LO Nim Chi"], "meetingDates": ["12/9", "19/9", "26/9", "3/10"]}}, "2021-22 Term 1": {"--LEC (2932)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [6], "locations": ["Esther Lee Bldg LT2"], "instructors": ["Mr LO Nim Chi"], "meetingDates": ["11/9", "18/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11", "4/12", "11/12", "18/12"]}}}}, {"code": "5814", "title": "Global Energy Markets", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "Energy is a foundation of our modern society. Electricity illuminates and operates the world. Modern transportation systems are energy intensive. However, energy is also the major source of air pollution and greenhouse gases. The competition for energy resources have fueled international conflicts and even wars. Rich endowments of energy resources could be an economic blessing but mismanagement may turn the advantage into an economic curse. Energy markets shape global economic and political systems, while various concerns such as security, safety, reliability, affordability and environmental impacts also dynamically drive their evolution. The global monetary system that is dominated by U.S. dollars has a core in the petrodollar system. Unconventional oil and gas resources are reshaping global geopolitical maps. Nuclear energy emits little CO2 but has experienced several catastrophic accidents. The rise of renewable energy could overthrow the dominance of fossil fuels since the industrial revolution. This course aims to guide students through a wide and interconnected array of real-world topics as suggested above. The covered energy markets include fossil fuels (coal, oil and natural gas), non-fossil conventional fuels (nuclear and hydro), renewables (wind, solar and biomass), as well as electricity. Students should have an open mind and be creative. Active participation in class discussion is highly encouraged. Never hesitate to interrupt the instructor in the classroom. The instructor welcomes questions and appreciates challenges. The hope is that students will have fun in taking the course and get more interested in the topics after one semester. ", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5815", "title": "Theories and Practice of International Law", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "This course provides an introduction to the system of international law that has emerged over the past few centuries. We will examine its historical development, contemporary structure, and content: the law of war, humanitarian and human rights law, international criminal law, treaties, environmental law, and law governing world trade. This course aims at providing basic knowledge and familiarity with important legal institutions and principles, and an understanding of the power and limitations of law. As an introductory course, no prior knowledge is strictly required. This course is related to several other areas of GPE, since law provides an essential part of the institutional infrastructure of the world system.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5816", "title": "Political Psychology for Global Political Economy", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "This course provides an introduction to the hybrid field of political psychology – a cross between social psychology and political science – focusing particularly on its areas of overlap with the traditional concerns of GPE. We will examine evolutionary psychology and the psychological underpinnings of political-economic ideology; the psychological dynamics of propaganda and public opinion; the psychology of radicalization and terrorism; national identity and other forms of identity; and economic psychology. As an introductory course, no prior knowledge is strictly required, although prior study in social psychology will be helpful. This course is indirectly related to aspects of international relations, but for the most part it provides a very different approach to issues in GPE.", "outcome": "• Substantive Knowledge: \r Key theories in political psychology and their relevance for an understanding of GPE \r How the experimental method of political psychology can inform a systemic understanding of political-economic concerns\r • Critical Analysis: \r Students should be able to critique individual experiments and political-psychological theories, and incorporate their findings and conclusions within a system-level understanding of the global political economy.", "syllabus": "1. Evolutionary psychology and the psychological underpinnings of political-economic ideology\r The evolutionary algorithm; how evolutionary history made its mark on human psychology; the psychological correlates of political-economic ideology\r  2. The psychological dynamics of propaganda and public opinion\r How the human mind processes information; psychological biases; propaganda, PR, and persuasion; influences on public opinion\r  3. The psychology of radicalization and terrorism \r What motivates radicalization and terrorism; ideational and emotional influences; reforming former terrorists\r  4. National identity and other forms of identity\r What is national identity, and how do different people conceptualize it; quality/complexity of thought and identity; overlapping identities; ingroup and outgroup bias\r  5. Economic psychology\r Behavioral economics; how human psychology affects economic processes", "required_readings": "(Subject to revision)\r Substantial selections from:\r Political Psychology in International Relations, by Rose McDermott\r Us Against Them, by Donald Kinder and Cindy Kam\r National Security through a Cockeyed Lens, by Steve Yetiv\r Perception and Misperception in International Politics, by Robert Jervis\r The Righteous Mind: Why Good People are Divided by Politics and Religion, by Jonathan Haidt \r Crooked Timber and the Broken Branch: The Invisible Hand in the Marketplace of Ideas, by Peter Beattie\r  Plus short articles and book chapters available online", "recommended_readings": "(Will be made available online)", "terms": {"2020-21 Term 2": {"--LEC (4324)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [4], "locations": ["Cheng Yu Tung Building LT4"], "instructors": ["Professor Peter BEATTIE"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 2": {"--LEC (3354)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [5], "locations": ["Chen Kou Bun Bldg UG05"], "instructors": ["Professor Karim BETTACHE"], "meetingDates": ["14/1", "21/1", "28/1"]}}}, "assessments": {"Attendance": "5", "Essays": "60", "Participation": "35"}}, {"code": "5817", "title": "Global Environmental Politics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "This course investigates the linkages between global political economy and environmental changes. The first part of the course examines how contemporary environmental changes have taken on aglobal form, and reviews how different theories have interpreted these changes as the drivers and consequences of political economic struggles. The second part of the course applies pertinent theoriesto analyse the production, degradation and protection of the environment in various physical and political settings, with a focus on how different actors and institutions are unevenly involved in andimpacted by environmental changes.", "outcome": "After completing this course, students should be able to:1. appreciate that environmental problems are inextricably political economic questions;2. describe and explain the global dimensions of contemporary environmental changes, in terms of their roots, processes and implications;3. describe, compare and evaluate the assumptions and interpretations of key theories of global environmental politics, and4. apply theories of global environmental politics to analyse the roles and strategies, and costs and benefits of different actors and institutions in the production and regulation of global environmental changes.", "syllabus": "1. Theories of global environmental politicsa. The question of scaleb. Realism (e.g. Malthusianism)c. Liberalism (e.g. neoliberal institutionalism)d. Political ecology (e.g. eco-Marxism)e. Governmentality2. Issues in global environmental politicsa. Sustainable developmentb. Climate governancec. Resource warsd. Conservation financee. Food activism f. Responsible consumptiong. Waste trade", "required_readings": "1. Katz-Rosene, R., & Paterson, M. (2018). Thinking ecologically about the global political economy. Oxon, UK: Routledge.2. Lispchultz, R. D. & Stabinsky, D. (2018). Environmental politics for a changing world: Power, perspectives, and practice (2nd ed.). Lanham, MD: Rowman & Littlefield.3. Stevenson, H. (2017). Global environmental politics: Problems, policy and practice. Cambridge, UK: Cambridge University Press.4. Books/articles on specific issues in global environmental politics (to be assigned during the course)", "recommended_readings": "1. Carter, N. (2018). The politics of the environment: Ideas, activism, policy (3rd ed.). Cambridge, UK: Cambridge University Press. 2. Chasek, P. S., Downie, D. L., & Brown, J. W. (2018). Global environmental politics (7th ed.). New York, NY: Routledge.3. Harris, P. G. (Eds.). (2014). Routledge handbook of global environmental politics. Abingdon, UK: Routledge.4. Kütting, G., & Herman, K. (Eds.). (2018). Global environmental politics: Concepts, theories and case studies (2nd ed.). Abingdon, UK: Routledge.5. Nicholson, S., & Wapner, P. (2016). Global environmental politics: From person to planet. Abingdon, UK: Routledge.6. Peet, R., Robbins, P., & Watts, M. J. (Eds.). (2011). Global political ecology. Abingdon, UK: Routledge.7. Peterson, M. (2000). Understanding global environmental politics: Domination, accumulation, resistence. Basingstoke, UK: Macmillan Press.8. Steinberg, P. F., & VanDeveer, S. D. (Eds.). (2012). Comparative environmental politics: Theory, practice, and prospects. Cambridge, MA: The MIT Press.", "terms": {"2020-21 Term 2": {"--LEC (2916)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [1], "locations": ["Yasumoto Int'l Acad Park LT9"], "instructors": ["Professor CHUNG King Lam Calvin"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}}, "2021-22 Term 2": {"--LEC (3336)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [1], "locations": ["Chen Kou Bun Bldg UG05"], "instructors": ["Professor CHUNG King Lam Calvin"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Discussion": "40", "Essays": "60"}}, {"code": "5830", "title": "The High Income Trap in East Asia", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "After decades of growth, economies such as South Korea, Taiwan, Singapore, Hong Kong and Japan are entering a high-income trap with structural problems including an aging population, wage stagnation and inflated housing costs. As a result, inequality has widened and social tension is rising. National identities have strengthened and protectionism has gained support. This course will examine the challenges facing several East Asian countries.", "outcome": "Upon completion of this course, students will be able to:\r  1) Gain deeper understanding towards relevant sociology and political-economy theories \r 2) Acquire knowledge of contemporary history and developments of several East Asian economies\r 3) Analyze the effectiveness and implication of relevant public policy", "syllabus": "Part I: Overview\r Middle-income Trap, High-income Trap\r Part II: Symptoms of the High-Income Trap\r Inequality, Aging society, Financialization, Housing bubble, public policy\r  Part III: High-Income Trap in comparative perspective\r Case studies: Japan, South Korea, Taiwan, Hong Kong, Singapore\r  Part IV: Conclusion\r Emerging issues: Rising China, Artificial Intelligence", "required_readings": "Jeff Kingston, Contemporary Japan History, Politics, and Social Change since the 1980s (Wiley-Blackwell, 2013)\r  Jiyeoun Song, Inequality in the Workplace: Labor Market Reform in Japan and Korea (Ithaca and London: Cornell University Press, 2014)\r  Syaru Shirley Lin, Taiwan’s China Dilemma: Contested Identities and Multiple Interests in Taiwan’s Cross-Strait Economic Policy (Stanford: Stanford University Press, 2016)\r  Richard Wong, “The Next Twenty Years,” Hong Kong Economic Journal, June 28, 2017\r  Mukul G. Asher and Amarendu Nandy, “Singapore’s Policy Responses to Ageing, Inequality and Poverty- An Assessment,” International Social Security Review 61, no. 1 (2008), 41-60.", "recommended_readings": "Ann Anagnost, Andrea Arai, and Hai Ren, ed., Global Futures in East Asia: Youth, Nation, and the New Economy in Uncertain Times (Stanford: Stanford University Press, 2017)\r  James Cairns, The Myth of the Age of Entitlement: Millennials, Austerity, and Hope (University of Toronto, 2017)\r  John, L. Campbell & John A. Hall, The Paradox of Vulnerability: States, Nationalism and the Financial Crisis (Princeton University Press, 2017)", "terms": {"2021-22 Term 2": {"--LEC (1008)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [3], "locations": ["Wong Foo Yuan Bldg UG01"], "instructors": ["Professor LIN Syaru Shirley"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Attendance": "5", "Essays": "30", "Participation": "25", "Report": "40"}}, {"code": "5831", "title": "Sub-national Diplomacy and One Country Two Systems: Hong Kong, Macao and the World", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "This course examines the bilateral relations of Hong Kong and Macao, focusing on the unique position of Hong Kong and Macao as a sub-sovereign entity of China, and the degree of independence it has enjoyed since the 1997 Handover in conducting bilateral dealings with foreign countries. Apart from the discussion of the structural role of the two SARs under the One Country Two Systems, the course will draw upon a wide range of current issues and topics as materials, in order to shed light on the uniqueness of the relations of the two SARs with China and its significance in strengthening Chinese interest overseas.", "outcome": "Upon completion of this course, students will be able to:\r 1) Acquire knowledge of the relationship between Hong Kong, Macao and mainland China; 2) Analyze the significance of Hong Kong and Macao in furthering China's foreign interests; 3) Explore future developments in Hong Kong-Mainland relations and Macao-Mainland relations; and\r 4) Reflect upon the significance of such freedom in furthering the interests of the Greater China Region to the uniqueness of Hong Kong and Macao", "syllabus": "Part I: The Theoretical Discussion of Sub-national Diplomacy\r - Sub-national entities, paradiplomacy and One Country Two Systems\r - The theoretical dimension of Hong Kong/Macao external relations\r - The institutional arrangement of Hong Kong/Macao external relations\r - The colonial legacy and its difference on two SARs identity in international world\r - Civilian Sea power and Port Diplomacy as a conceptual framework\r  Fundamental concepts of Part I:\r - The concept of sub-national diplomacy/paradiplomacy/multilevel diplomacy\r - The institutional characteristics of Hong Kong/Macao and the authorized space under the Basic Law\r - The realist-liberal framework of Hong Kong external relations\r - The concept of port diplomacy and civilian sea-power\r - China’s understanding of soft power and Hong Kong’s role in it\r - Colonial legacy in Hong Kong and Macao and its implications to international identity formation\r  Part II: The Practical Dimensions of Sub-national Diplomacy\r - Internationalization of Hong Kong domestic politics: from 1967 Riot to Umbrella Movement\r - Beijing’s diplomatic game and the role of SARs in Chinese foreign policies\r - Sino-American Relations and the SARs’ link to United States\r - Sino-European Relations and the Differential Treatments between Hong Kong and Macao\r - The two SARs in East Asian regional politics\r - The comparative studies on Hong Kong, Macao and Taiwan in terms of international space\r - The participation of two SARs in international organizations\r  Fundamental concepts of Part II:\r - The 1967 Riot in Hong Kong from Global Perspective\r - The Umbrella Movement from Global Perspective\r - Sino-American relations and the role of Hong Kong/Macao in major Sino-American \r issues/conflicts\r - Selective Pragmatism of Sino-European Relations and the Normative Power Europe thesis\r - Sino-ASEAN relations and the selective inclusion of Hong Kong in regional cooperative \r regime\r - Hong Kong vs. Macau vs. Taiwan: Their respective international spaces\r -  The role of Hong Kong and Macao in global governance", "required_readings": "Ash, Robert and Ho, Lok-sang. 2006. China, Hong Kong and the World Economy. London: Palgrave Macmillan.\r  Brown, Stephen and Christine Loh. 2002. Hong Kong : the political economy of land. Hong Kong : Civic Exchange. \r Lau, Siu-kai ed. 2002. The first Tung Chee-hwa Administration : the First Five years of the Hong Kong Special Administration Region. Hong Kong : the Chinese University Press.\r  Mark, Chi-kwan. 2004. Hong Kong and the Cold War: Anglo-American Relations 1949-1957. Oxford: Oxford University Press.\r  McDonoch, Gary and Wong, Cindy. 2006. Global Hong Kong. New York: Taylor & Francis.\r  Meyer, David. 2006. Hong Kong as a Global Metropolis. Cambridge: Cambridge University Press.\r  Postiglione, Gerard and Tang, James (Eds). Hong Kong's Reunion with China: The Global Dimensions. New York: ME Sharpe, 1997. \r Shen, Simon. 2016. Hong Kong in the World: Implications to Geopolitics and Competitiveness. London: Imperial College Press.", "recommended_readings": "Recommended reading list is provided by the lecturer.", "terms": {"2020-21 Term 2": {"--LEC (1906)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [5], "locations": ["Lee Shau Kee Archi Bldg G03"], "instructors": ["Professor SHEN Simon"], "meetingDates": ["15/1", "22/1", "29/1", "5/2"]}}}, "assessments": {"Attendance": "5", "Essays": "40", "Essay test or exam": "30", "Participation": "25"}}, {"code": "5833", "title": "Political Economy and Foreign Policy of the United States", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "This course provides an introduction to the United States’ political economy (how the political and economic systems are structured and how they influence each other) and foreign policy (influences, goals, and means of attaining goals). We will examine the historical development of US political economy and foreign policy, from the American Revolution to modern day, and look at indications of possible future developments. This will include: the structure of the US political-economic system, including law, business, government, media, and society (including public opinion). This course aims at providing a deep understanding of the US government and society, helping to make sense of domestic political developments and the US role on the world stage. No prior knowledge is strictly required, though introductory courses to IR and GPE will be helpful. This course is related to courses analyzing the political economies of other countries and regions, and to comparative politics.", "outcome": "• Substantive Knowledge: \r The “big picture” of the United States’ society and government: how politics and economics intertwine and influence each other, the history and development of the United States and its role in the world, and understanding the contemporary U.S. \r The structure of the U.S. government and legal system, and an overview of its economy\r How U.S. foreign policy is determined and implemented\r • Critical Analysis: \r Students should be able to identify the central thesis of books or articles, understand how the authors develop and defend it, and critically evaluate the author’s thesis, evidence, and logic. \r Students should be able to draw comparisons between facets of the US political economy and those of other countries, and understand how structure influences outcomes", "syllabus": "1. The history and development of the US state and society\r Ideational and material factors jointly influencing development; how economics influenced politics (and vice versa) over time\r  2. The history of US foreign policy\r Ideologies, policies, influences, and actions over US history\r  3. The contemporary United States\r The political, legal, and economic systems; elections; media and society; the Republican and Democratic Parties\r  4. Contemporary US foreign policy\r How “national security” and “national interest” are determined, who/what influences foreign policy, how are goals attained\r  5. Possible future developments\r Economic changes; suggestive signs of political and ideological evolution", "required_readings": "(Subject to revision)\r Substantial selections from:\r Golden Rule: The Investment Theory of Party Competition and the Logic of Money-Driven Political Systems, by Thomas Ferguson \r Who Rules America? (most recent edition), by William Domhoff \r Wall Street’s Think Tank: The Council on Foreign Relations and the Empire of Neoliberal Geopolitics, 1976-2014, by Lawrence Shoup \r Year 501: The Conquest Continues, by Noam Chomsky\r Neither Liberal nor Conservative: Ideological Innocence in the American Public, by Donald Kinder and Nathan Kalmoe\r  Plus short articles or book chapters available online, including from:\r The Unwinding: An Inner History of the New America, by George Packer\r What’s the Matter with Kansas? How Conservatives Won the Heart of America, by Thomas Frank\r United States: Essays 1952-1992, by Gore Vidal\r The Transformation of American Law, by Morton Horwitz\r Killing the Host: How Financial Parasites and Debt Destroy the Global Economy, by Michael Hudson \r Crooked Timber and the Broken Branch: The Invisible Hand in the Marketplace of Ideas, by Peter Beattie", "recommended_readings": "(Will be made available online)", "terms": {"2020-21 Term 1": {"--LEC (4217)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [3], "locations": ["Cheng Yu Tung Building LT5"], "instructors": ["Professor Peter BEATTIE"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12", "9/12"]}}, "2021-22 Term 1": {"--LEC (1020)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [3], "locations": ["Chen Kou Bun Bldg UG03"], "instructors": ["Professor Peter BEATTIE"], "meetingDates": ["8/9", "15/9"]}}}, "assessments": {"Attendance": "5", "Essays": "60", "Participation": "35"}}, {"code": "5834", "title": "Political Economy of the European Union and its Foreign Policies", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "This course adopts various approaches to understand the logic of European Union political economy and its role in international politics. Alongside the theoretical understanding on European integration and European policy formation, the course will also shed light on the connection between the EU and major powers. It will cover topics including but not limited to, the governance of the European Union and its institutional arrangement, the external presence of the European Union in various regions, EU’s responses to major global issues and the challenges faced by the European Union.", "outcome": "After the completion of this course, students should be able to: Learning Outcome 1: Understand the historical and theoretical background of European integration project; Learning Outcome 2: Evaluate the dynamics of EU institutions and their relations to EU member states; Learning Outcome 3: Conceptualize EU external presence and its relations to major powers; and Learning Outcome 4: Reflect upon contemporary issues faced by the European Union and its Member States by various conceptual lenses", "syllabus": "Part I: Historical and Theoretical Understanding of European Integration - The historical background of the European integration project - Explaining the European integration by theories - Conceptualize the current European integration model  Fundamental concepts of Part I: - The history of European integration from ancient time to contemporary era - The Postwar Settlement of Europe and its implications to European integration - Neo-functionalism as an “official theory” of European integration - Liberal intergovernmentalism as a critique to neo-functionalism and its theoretical innovation - The “Experimental Union” thesis and the “European Onion” model  Part II: The Political Economy of the European Union - Executive-legislature relations of the European Union - Supranational-national relations of the European Union - The management of the Single Market and Monetary Union and its challenges - The social dimension of European Union politics - The constitutional project of the European Union and the future of European project  Fundamental concepts of Part II: - Dual executive nature of the European Union governance - The role of European Parliament and the legislative cycle of the European Union - The multilevel governance of the European Union - The history of Single Market and its governance - The European Monetary Union and its challenges - The idea of Social Europe and its challenges - The European Constitution and its necessity in European integration  Part III: The External Relations of the European Union - The formation of European foreign policy and its external presence - The enlargement process and membership accession - European Economic Area, European Neighborhood Policy and EU relations to non-EU Europe - EU relations with selected major powers* - EU responses to selected global issues*  * Subjected to the lecturer’s preference  Fundamental concepts of Part III:  - The European foreign policy machinery and its major theoretical backup - The history of European enlargement process and its membership management - EU relations with Western non-EU members, the Eastern Europe and the Balkans -  EU policy preferences and constraints with major powers and issues", "required_readings": "Bale, Tim. 2005. European Politics: A Comparative Introduction. Basingstoke: Palgrave Macmillan.   Hix, Simon and Bjørn Høyland. 2011. The Political System of the European Union, 3rd Edition. Basingstoke: Palgrave Macmillan. (A traditional textbook for EU institutions and policy course)  Keukeleire, Stephan and Tom Delreux. 2014. The Foreign Policy of the European Union, 2nd Edition. Basingstoke: Palgrave Macmillan.  McCormick, John. 2011. Understanding European Union: A Concise Introduction. New York: Palgrave Macmillan.", "recommended_readings": "Recommended reading list will be provided by the lecturer.", "terms": {"2020-21 Term 1": {"--LEC (4279)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [4], "locations": ["Wong Foo Yuan Bldg 401"], "instructors": ["Dr. CHAN Wai Shun"], "meetingDates": ["10/9", "17/9", "24/9"]}}, "2021-22 Term 1": {"--LEC (3936)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [4], "locations": ["Chen Kou Bun Bldg UG05"], "instructors": ["Dr. CHAN Wai Shun"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Essays": "30", "Presentation": "30", "Report": "40"}}, {"code": "5835", "title": "Regional Integration in China: Pearl River and Yangtze River Deltas", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "Pearl River Delta (PRD) and Yangtze River Delta (YRD) have developed into two regional powerhouses with the rise of China in the global political economy. The course attempts to offer a lively and comprehensive understanding of (1) the development and spatial and temporal transformations of the two regions, particularly the integration of PRD and YRD; (2) the inter-city and inter-provincial relationship in the contexts of the “one country two systems” and other institutional arrangements; and (3) the inter-regional cooperation and competition between the two regions, the dynamic cross-strait interactions with Taiwan, and other regional interactions with economies in Southeast Asia. The strategic objectives, extent, and limitations of such integrations in the dialectic era of globalization and regionalism will be evaluated critically.", "outcome": "Upon the completion of the course, students will be able to: gain a sophisticated understanding of the central underpinnings of regional development and integration of the PRD and YRD regions in China in the contexts of regional integration in the Greater China; and develop the ability to identify and use data or empirical evidences to analyze economic, social, political and cultural aspects and dynamic interaction between globalization, regionalism and local transformation in China’s rise in the world.", "syllabus": "1. UrbanizationDifferent interpretive frameworks of Chinese urbanization and major features.2. Regional developmentIntroduction of region; rationales and mechanisms of regional development.3. Megalopolitan system and global city-regionDifferent spatial models and trajectories of regional development, features, and global status.4. IndustrializationMajor features of industrial development, contributions to urban/regional development, sustainable development and industrial advancement.5. Mega projectFunctions of mega project, features, and both positive and negative contributions to urban/regional development.6. Urban/regional competitivenessConcepts of urban/regional competitiveness, influences on urban/regional development7. Urban/regional governanceDifferent concepts of governance, status of development and features, and relationship with urban/regional development8. Inter-city and inter-regional development and relationshipDifferent kinds of relationship, theories and models, major features and strategies.", "required_readings": "Shen, J. (2018). Urbanization, regional development and governance in China. London and New York: Routledge.Wei, D. (2001). Decentalization, marketization and globalization: The triple processes underlying regional development in China. Asian Geographer, 20(1/2), 7-23.Friedmann, J. (2006). Four theses in the study of China's urbanization. International Journal of Urban and Regional Research, 30(2), 440-451.Gottmann, J. (1976). Megalopolitan systems around the world. Ekistics, 41(243), 109-113.Lang, R., & Knox, P. (2009). The new metropolis: Rethinking megalopolis. Regional Studies, 43(6), 789-802.Ma, X. (2012). The integration of the city-region of the Pearl River Delta. Asia Pacific Viewpoint, 53(1), 97-104.Shen, J. (2004). Urban competitiveness and urban governance in the globalizing world. Asian Geographer, 23(1-2), 19-36.Yang, C. (2012). Restructuring the export-oriented industrialization in the Pearl River Delta, China: Institutional evolution and emerging tension. Applied Geography, 32(1), 143-157.Chen, X., & de’Medici, T. (2010). The “instant city” coming of age: Production of spaces in China’s Shenzhen Special Economic Zone. Urban Geography, 31(8), 1141-1147.Ren, X., & Weinstein, L. (2013). Urban governance, mega-projects and scalar transformations in China and India. In T.R. Samara, S. He, & G. Chen (Eds.), Locating right to the city in the global south (pp. 107-126). Abingdon, Oxon; N.Y.: Routledge.Yeung, Y., & Shen, J. (Eds.) (2008). The Pan-Pearl River Delta: An emerging regional economy in a globalizing China. Hong Kong: The Chinese University PressYang, C. (2009). Strategic coupling of regional development in global production networks: Redistribution of Taiwanese personal computer investment from the Pearl River Delta to the Yangtze River Delta, China. Regional Studies, 43(3), 385-407", "recommended_readings": "Enright, M., Scott, E. E., & Chang, K. (2005). Regional powerhouses: The Greater Pearl River Delta and the rise of China. Singapore: John Wiley & Sons (Asia). Hook, B. (Ed.) (1998). Shanghai and the Yangtze Delta: A city reborn. Hong Kong; New York: Oxford University Press.Lin, G. C. S. (1997). Red capitalism in south China: Growth and development of the Pearl River Delta. Vancouver: UBC Press. Liu, Z., & Zheng, J. (2013). Conflict and harmony: Development in the Yangtze River Delta. Singapore: Enrich Professional Publishing.Luo, X., & Shen, J. (2009). A study on inter-city cooperation in the Yangtze River Delta Region, China. Habitat International, 33, 52-62.Luo, X., & Shen, J. (2012). The making of new regionalism in the cross-boundary metropolis of Hong Kong-Shenzhen, China. Habitat International, 36 (1): 126-135.Marton, A. M. (2000). China's spatial economic development: Restless landscapes in the lower Yangzi Delta. London; New York: Routledge.Sit, V. F. S., & Yang, C. (1997). Foreign-investment-induced exo-urbanisation in the Pearl River Delta, China. Urban Studies, 34 (4), 647-677.Shen, J. (2006). Understanding dual-track urbanisation in post-reform China: Conceptual framework and empirical analysis. Population, Space and Place, 12 (6), 497-516.Shen, J. (2007). Scale, state and the city: urban transformation in post reform China. Habitat International, 31 (3-4), 303-316.Shen, J., & Kee, G. (2017). Development and planning in seven major coastal cities in southern and eastern China. Berlin: Springer.Shen, J., & Luo, X. (2013). From fortress Hong Kong to Hong Kong-Shenzhen metropolis: The emergence of government-led strategy for regional integration in Hong Kong. Journal of Contemporary China, 22 (84), 944–965.Shen, J., & Yang, X. (2014). Analyzing urban competitiveness changes in major Chinese cities 1995-2008. Applied Spatial Analysis and Policy, 7 (4), 361-379.Vogel, R. K. et al. (2010). Governing global city regions in China and the West. Progress in Planning, 73, 1-75.Wong, K., & Shen, J. (Eds.) (2002). Resource management, urbanization and governance in Hong Kong and the Zhujiang Delta. Hong Kong: The Chinese University Press.Yang, C. (2004). From market-led to institution-based economic integration: The case of the Pearl River Delta and Hong Kong. Issue & Studies, 40 (2), 79-118.Yeh, A. G. O. et al. (Eds.) (2002). Building a competitive Pearl River Delta region: Cooperation, coordination, and planning. Hong Kong: Centre of Urban Planning and Environment Management, University of Hong Kong.Yeh, A. G. O., & Xu, J. (Eds.) (2011). China's Pan-Pearl River Delta: Regional cooperation and development. Hong Kong: The University of Hong Kong Press.Zhang, T. (2006). From intercity competition to collaborative planning: The case of the Yangtze River Delta Region of China. Urban Affairs Review, 42 (1), 26-56.Zhao, S. X.B., & Zhang, L. (2007). Foreign direct investment and the formation of global city-regions in China. Regional Studies, 41 (7), 979-994.Zweig, D., & Chen, Z. (Eds.) (2007). China's reforms and international political economy. London and New York: Routledge. ", "terms": {"2020-21 Term 1": {"--LEC (1893)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [5], "locations": ["Cheng Yu Tung Building LT4"], "instructors": ["Mr KEE Wai Man, \n\rProfessor SHEN Jianfa"], "meetingDates": ["11/9", "18/9", "25/9"]}}, "2021-22 Term 1": {"--LEC (1228)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [5], "locations": ["Wong Foo Yuan Bldg UG02"], "instructors": ["Mr KEE Wai Man, \n\rProfessor SHEN Jianfa"], "meetingDates": ["10/9", "17/9", "24/9"]}}}, "assessments": {"Attendance": "5", "Essays": "40", "Presentation": "30", "Participation": "25"}}, {"code": "5836", "title": "Chinese Foreign Policy", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "This course is designed to survey and analyze Chinese foreign policy. In particular, the course examines China’s rise as a global power and its new roles in the international system.This course begins with a review of the main drivers of China’s foreign policymaking. It will then explore the myth and reality of China’s rise as well as its grand strategies since the 1990s. The course will also analyze China’s relations with other great powers such as the United States, Russia, Japan and India, as well as its involvements with Asia’s hot spots of conflicts, such as the South China Sea and the Korean Peninsula. Finally, the course will explore China’s new roles in world affairs to determine whether it is a revisionist or responsible rising power.", "outcome": "Upon completion of this course, students will be able to:\r 1. Acquire knowledge of Chinese foreign policies towards various issues such as territoriality,\r war and conflict, and development; 2. Analyze the implications of Chinese foreign policies for its relations with other countries; 3. Explore the roles of China in the context of its rise as a power.\r 4. Understand the impacts of China’s rise on the international system and global governance", "syllabus": "Topic 1. China’s Rise, Power Shifts, and International Conflicts\r Contents/ fundamental concepts: Power transition; balance of power; Leadership cycle and wars;   Topic 2. China’s Foreign Policy-making: Drivers, Processes and Objectives\r Contents/ fundamental concepts: Offensive realism vs. defensive realism; Levels of analysis; Structural imperatives vs. unit-level variables vs. individual decision-makers in foreign policymaking\r  Topic 3. China’s Grand Strategy for Its Rise\r Contents/ fundamental concepts: What is grand strategy?; Does China have a grand strategy?; Evolutions of China’s grand strategy since the 1980s\r  Topic 4. China’s Rising Material Power and Its Foreign Policy\r Contents/ fundamental concepts: Power in international relations; Has China risen?; Measuring China’s hard power; Economic vs. military power\r  Topic 5. China’s Power from a Critical Perspective\r Contents/ fundamental concepts: China as a fragile rising power; Domestic constraint on China’s power; International constraints on China’s power\r  Topic 6. Soft Power in Chinese Foreign Policy\r Contents/ fundamental concepts: Concept of soft power; China’s soft power strategy; Beijing consensus\r  Topic 7. Xi Jinping and Chinese Foreign Policy\r Contents/ fundamental concepts: Is Xi Jin-ping accelerating China’s rise?; Concept of China Dream; Has Xi changed China’s grand strategy?\r  Topic 8. China’s Relations with the United States\r Contents/ fundamental concepts: Power transition theory; Preventive war; China’s US policy; New type of great power relations\r  Topic 9. China’s Relations with India, Japan and Russia\r Contents/ fundamental concepts: Balance of power in great power relations; Will China form an alliance with Russia? Will China face a trilateral alliance made of US, Japan and India? \r  Topic 10. China and Asia’s Hot Spots: the Korean Peninsula, the Taiwan Strait, and South China Sea\r Contents/ fundamental concepts: China’s North Korea quagmire; Prospects for war across the Taiwan Street; South China Sea as new grounds of great power rivalry\r  Topic 11. China’s Regional Strategy: One Belt, One Road\r Contents/ fundamental concepts: China’s ambition for the Eurasian continent; Regional primacy; Spheres of influence; Economic diplomacy\r  Topic 12. Is China Revising the World Order? \r Contents/ fundamental concepts: Revisionist and status-quo states; Global governance; China as a new global public goods provider; Prospects for a China-led order", "required_readings": "Topic 1\r Graham Allison. 2015. “The Thucydides Trap: Are the US and China Headed for War?”\r The Atlantic Monthly, September 24, at https://www.theatlantic.com/international/archive/2015/09/united-states-china-war-thucydides-trap/406756/\r Ronald L. Tammen and Douglas Lemke. 2000. Power Transition: Strategies for the 21st \r  Century. Chapter 1. \r Robert Gilpin. 1981. War and Change in World Politics, Chapters 4 and 5.\r Dale Copland. 2000. The Origins of Major Wars, the introduction chapter. \r   Topic 2\r Sun Yun, Chinese National Security Decision-Making: Processes and Challenges (Washington, DC: \r The Brookings Institution, 2013)\r Kenneth Waltz. 1979. Theory of International Relations (Long Grove, IL: Waveland Press), \r Chapters1, 3 and 6\r John Mearsheimer. 2001. The Tragedy of Great Power Politics (New York: W.W. Norton), Chapters \r 1, 2 and 3.\r  Topic 3\r Avery Goldstein. 2001. “The Diplomatic Face of China’s Grand Strategy: A Rising Power’s \r Emerging Choice,” The China Quarterly, December 2001. \r Dingding Chen and Jianwei Wang. 2011. “Lying Low No More? China’s New Thinking on Tao \r Guang Yang Hui Strategy,” China: An International Journal, September. \r Zheng Bijian. 2005. “China’s ‘Peaceful Rise’ to Great-Power Status,” Foreign Affairs,Vol. 84, No. 5 (September-October). \r Orville Schell and John Delury. 2013. Wealth and Power: China’s Long March to The Twenty-First \r Century.\r Michael Pillsbury. 2015. The Hundred Year Marathon: China’s Secret Strategy to Replace America \r as the Global Superpower (New York: St. Martin’s).\r  Topic 4\r Keith Fray. 2014. “China Leaps Forward, Overtaking the US as World’s Biggest Economy,” The \r Financial Times, October 8, at \r  http://blogs.ft.com/ftdata/2014/10/08/chinas-leap-forward-overtaking-the-us-as- \r  worlds-biggest-economy/ \r Wayne M. Morrison. 2015. “China’s Economic Rise: History, Trends, Challenges, and Implications \r for the United States,” Congressional Research Service, October 21, at \r https://www.fas.org/sgp/crs/row/RL33534.pdf\r Rand Corporation. 2015. The US-China Military Scorecard: Forces Geography, and the Evolving Balance of Power, 1996-2017, at http://www.rand.org/content/dam/rand/pubs/research_reports/RR300/RR392/RAND_RR392.pdf\r Martin Jacques. 2012. When China Rules of World (London: Penguin Books).\r  Topic 5\r Stephen G. Brooks and William C. Wolhforth. 2016. “The Once and Future Superpower:\r Why China Won’t Overtake the United States,” Foreign Affairs, May/June, at \r https://www.foreignaffairs.com/articles/united-states/2016-04-13/once-and-future-superpower\r David Lampton. 2008. The Three Faces of Chinese Power (Berkeley: University of California \r Press), Chapters 1-4.\r Susan Shirk. 2007. China: Fragile Super Power, Chapters 1-3. \r John Cassidy. 2015. “China’s Economic Slowdown: How Bad Is It?” The New Yorker,\r September 1, at http://www.newyorker.com/news/john-cassidy/chinas-economic-slowdown-how-bad-is-it\r  Topic 6\r Eleanor Albert. 2017. “China’s Big Bet on Soft Power,” Council on Foreign Relations, May 11, at \r https://www.cfr.org/backgrounder/chinas-big-bet-soft-power\r John Williamson. 2012. “Is the Beijing Consensus Now Dominant?” Asia Policy, January.\r Bates Gill and Yanzhong Huang. 2006. “Sources and Limits of Chinese Soft Power,”\r Survival, Vol. 46, No. 2 (May), at \r http://csis.org/files/media/csis/pubs/060605_gill_huang_iiss.pdf. \r Joshua Cooper Ramo. 2004. The Beijing Consensus, at http://fpc.org.uk/fsblob/244.pdf. \r  Topic 7\r Zhang Baohui. 2014. “Xi Jinping, Pragmatic Offensive Realism, and China’s Rise,”\r  Global Asia, Volume 9, No. 2. \r The BBC. 2013. “What does Xi Jinping’s China Dream Mean?” June 6, 2013, at\r  http://www.bbc.com/news/world-asia-china-22726375 \r Liu Mingfu. 2015. The China Dream: Great Power Thinking and Strategic Posture\r  in the Post-America Era (New York: The CN Times Book).\r  Topic 8\r Qi Hao. 2015. “China Debates the New Type of Great Power Relations,” The Chinese\r Journal of International Politics, Vol. 8, No. 4, pp. 349-370, at https://academic.oup.com/cjip/article/8/4/349/384319/China-Debates-the-New-Type-of-Great-Power\r Li Cheng and Lucy Xu. 2014. “Chinese Enthusiasm and American Cynicism: The ‘New Type of \r Great Power Relations,’” China & US Focus, December 14, at \r http://www.chinausfocus.com/foreign-policy/chinese-enthusiasm-and-american-cynicism-over\r -the-new-type-of-great-power-relations/\r Andrew J. Nathan and Andrew Scobell. 2012. “How China Sees America,” Foreign Affairs, \r September-October. \r Kenneth Lieberthabl and Wang Jisi, 2012. Addressing U.S.-China Strategic Distrust \r (Washington: The Brookings Institutions) \r  Topic 9\r Alexander Gabuev. 2015. A “Soft Alliance”? Russia-China Relations after the Ukraine Crisis, at \r http://www.ecfr.eu/page/-/ECFR126_-_A_Soft_Alliance_Russia-China_Relations_After_the_\r Ukraine_Crisis.pdf \r Dmitri Trenin. 2012. “True Partners? How Russia and China See Each Other,” at\r  http://carnegieendowment.org/files/Trenin_CER_Eng.pdf \r Tatsushi Arai, Shihoko Goto, and Zheng Wang. 2016. Clash of National Identities: China, Japan, \r and the East China Sea Territorial Dispute, Wilson Center, \r  at https://www.wilsoncenter.org/sites/default/files/asia_china_seas_web.pdf\r Tomonori Sasaki. 2010. “China’s Threat Perception of Japan since the 1980s,” The China \r Quarterly, September. \r Nanti Bajpai. 2017. “Narendra Modi’s Pakistan and China Policy: Assertive Bilateral \r  Diplomacy, Active Coalition Diplomacy,” International Affairs, Vol. 93, No. 3, \r  pp. 69-91, at https://academic.oup.com/ia/article/93/1/69/2731380/Narendra-Modi-s-Pakistan-and-China-policy\r Lu Yang. 2016. China-India Relations in the Contemporary World: Dynamics of \r  National Identity and Interest (Routlege 2016), Chapters 1-2.\r  Topic 10\r Baill Hayton. 2014. The South China Sea: The Struggle for Power in Asia (New Haven: Yale \r University Press), Chapters 1-3.\r Li Mingjiang. 2012. “Chinese Debates of South China Sea Policy: Implications for \r Future Developments,” at http://www.rsis.edu.sg/publications/WorkingPapers/WP239.pdf. \r Eleanor Albert. 2017. “The China-North Korea Relationship,” Council on Foreign \r  Relations, July 5, at https://www.cfr.org/backgrounder/china-north-korea-relationship\r Bates Gill, 2011. “China’s North Korea Policy: Assessing Interests and Influence, at\r  http://www.usip.org/files/resources/China's_North_Korea_Policy.pdf. \r Baohui Zhang. 2011. “Taiwan’s New Grand Strategy,” Journal of Contemporary China, March. \r Bonnie Glaser. 2016. Prospects for Cross-Strait Relations as Tsai Ing-wen Assumes the Presidency \r In Taiwan (Washington DC: Centre for Strategic and International Studies).\r  Topic 11\r William Norris. 2016. Chinese Economic Statecraft (Ithaca: Cornell University Press) Chapters \r 1-3.\r Scott Kennedy. 2015. “Building China’s One Belt, One Road,” Center for Strategic &   International Studies, April 2, at http://csis.org/publication/building-chinas-one-belt-one-road\r David Dollar. 2015. “China’s Rise as a Regional and Global Power: The AIIB and the \r  One Belt, One Road,” The Brookings Institution, at http://www.brookings.edu/research/papers/2015/07/china-regional-global-power-dollar\r  Topic 12\r Yixian Sun. 2016. “China’s Leadership in Global Economic Governance and the Creation of the \r Asian Infrastructure Investment Bank,” Rising Powers Quarterly, Vol. 1, No. 1, pp. 55-71.\r Stephan Klingebel. “The Changing Role of China in Global Environmental Governance,” Rising Powers Quarterly, Vol. 1, No. 1, pp. 43-54.\r Pradumna B Rana. 2015. “US-led vs. China-led Institutions: Need for New Bretton Woods,” RSIS \r Commentary, August 27, at https://www.rsis.edu.sg/rsis-publication/cms/co15184-us-led-vs-china-led-institutions-need-for-new-bretton-woods/#.VegbtbTFGi4\r Sebastian Heilmann and Moritz Rudolf, “China’s Shadow Foreign Policy: Parallel \r  Structures Challenge the Established International Order,” Mercator Institute for \r  China Studies, October 2014, at \r http://www.merics.org/fileadmin/templates/download/china-monitor/China_Monitor_No_18_e\r n.pdf\r Amitai Etzioni. 2011. “Is China a Responsible Stakeholder? International Affairs, Vol. \r  87, No. 3 (May). \r Shaun Breslin, 2010. “China’s Emerging Global Role: Dissatisfied Responsible Great \r  Power,” Politics, Vol. 30, Supplementary issue.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (1907)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [4], "locations": ["Wu Ho Man Yuen Bldg 505"], "instructors": ["Dr. HORIUCHI Toru"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 2": {"--LEC (2814)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [5], "locations": ["Wong Foo Yuan Bldg UG02"], "instructors": ["Dr. HORIUCHI Toru"], "meetingDates": ["14/1", "21/1", "28/1"]}}}, "assessments": {"Essays": "40", "Essay test or exam": "45", "Presentation": "15"}}, {"code": "5837", "title": "Contemporary Chinese Society", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "China has embarked her economic reforms since the late 1970s when Deng Xiaoping initiated the “Reform and Open Door” policy. The economic transformation over the last four decades has been remarkable and significant. The most notable one is the successful transformation of a centralized and a planned economy into a market (non-market) one. Moreover, China joined the World Trade Organization (WTO) in 2002 to engage fully with the globalization trend. With these internal and external backdrops, contemporary Chinese society has been undergoing many changes, facing challenges and having abundant opportunities too. In this course, several contemporary salient issues will be focused such as higher education, inequality, migration, aging, corruption and health, among others. Their causes, problems, consequences and implications will be examined within the framework of state-society relationship.Last, but not least, discussions will be encouraged in the class. The dialogue should provide an excellent forum for students to engage in an active mode of learning. Ideas can be tested; points will be made, and, above all, judgements will be formed. This will further cultivate a sense of intellectual dialogue within a productive and an encouraging environment.", "outcome": "1. Know many critical issues such as higher education, aging, inequality, migration, trust and health in Contemporary Chinese society.\r 2. Understand the conceptual and theoretical dimensions of state-society relation in Contemporary China.\r 3. Ability to integrate empirical findings with theoretical guidance.\r 4. Working with student-fellows to have team spirit and group efforts\r 5. Discussion skills in the class and communication techniques are used.\r 6. Ability to think critically", "syllabus": "Week 1: \r Introduction\r What are the main issues in Contemporary Chinese Society? State-Society framework\r  Bian, Yanjie. 2002. “Sociological Research on Reform-Era China.” Issues & Studies, Special Issue “The State of the China Studies Field” 38/39:139-174.\r  Whyte, Martin King, ed.(2010) One Country, Two Societies: Rural-Urban Inequality in Contemporary China. Cambridge, Mass: Harvard University Press.\r  Zhou, Xueguang and Xiaomei Pei. 1997. “Chinese Sociology in a Transitional Society.” Contemporary Sociology 26(5):569-572. 2. \r  Weeks 2 and 3\r Higher Education \r  Chen, 2003. Stride From a Country of Tremendous Population to a Country of Profound Human Resources. (China: Higher Education Press.) \r  Bai, Limin (2006). \"Graduate unemployment: Dilemmas and challenges in China's move to mass higher education.\" China Q. (2006): 128.\r  C John N. Hawkins, 2000. \"Centralization, decentralization, recentralization - Educational reform in China\", Journal of Educational Administration, Vol. 38 Issue: 5, pp.442 - 455\r *Mok, KH, 2000. Marketizing Higher Education in Post-Mao China in International Journal of Educationa Development, 20: 109-126\r Pretorius, S.G. and Y.Q. Xue, 2003. “The Transition from Elite to Mass Higher Education: A Chinese Perspective” in Prospects, Vol.33, No. 1.\r  Yang, Rui. 2003. Third Delight: The Internationalization of Higher Education in China.\r New York & London: Routledge.\r  Jiani Zhu, “Higher Education in China: In the Light of Manifestation and Demographic Change”, October 2007, [full text available at \r http://www.che.de/downloads/Higher_Education_in_China_AP97.pdf]\r  陳學飛：“秦惠民主編：《高等教育理論研究精論集：135位學者論高等教育，大眾化與高校擴招》上、中、下冊，中央編譯出版社2004年\r  顾恒铭, & 黄爱宝. (2015). “211 工程”“985 工程” 存废争议背后的若干思考. 现代职业教育, (9), 89-91.\r  李硕豪, & 陶威. (2017). 我国高等教育改革历程回顾与建议. 现代教育管理, (3), 1-9.\r  中國高等教育改革與發展網，http://www.hie.edu.cn/cbs/\r  Articles on higher education can also be found http://www.usc.cuhk.edu.hk/wk.asp\r .\r Weeks 4 and 5 \r Inequality/ Hukou System/Migration\r  Chan, Kam Wing (2008): China Internal Migration\r http://faculty.washington.edu/kwchan/Chan-migration.pdf\r  Davis, Deborah S. and Feng Wang (eds.). 2009. Creating Wealth and Poverty in Postsocialist China. California: Stanford University Press. Ch.1. 2. \r  Hao, Yan. 2009. “Poverty and Exclusion in China.” Berlin: WZB Discussion Paper (SP 2009-202).\r  Urban Poverty 1. Qian, Zhihong and Tai-chee Wong. 2000. “The Rising Urban Poverty: a Dilemma of Market Reforms in China” Journal of Contemporary China 9(23):113-125. 2. \r   Whyte, Martin King, ed.(2010) One Country, Two Societies: Rural-Urban Inequality in Contemporary China. Cambridge, Mass: Harvard University Press.\r  Wu, Fulong. 2010. Urban Poverty in China. Cheltenham: Edward Elgar. Discussion topic: “Urban overty” in different Chinese societies\r  Yan, Fei. 2009. “The Rising Urban Poverty and Political Resentment in a Transitional China: The Experience of Shanghai.” Journal of Politics and Law 1(1): 15-25. 3. \r  Weeks 6 and 7 Aging\r  Chen, Sheying and Jason L. Powell (ed) Aging in Perspective and the Case of China: Issues and Approaches. Nova Science Publishers, 2009\r  Jason L. Powell 2012. China, Aging, and Theory. Nova Science Publishers.\r  NJ Zhang, M Guo, and X Zheng 2012 “China: awakening giant developing solutions to population aging” The Gerontologist.\r  Chen, Sheying, Powell, Jason L. (Eds.)2012 Aging in China: Implications to Social Policy of a Changing Economic State. Springer.\r  England, R. S. 2005. Aging China: The Demographic Challenge to China's Economic Prospects. Praeger \r  Weeks 8 and 9\r Trust/Corruption\r  Fa wu bu. Diao cha ju, Anti-corruption yearbook (Ministry of Justice Investigation Bureau, Republic of China, 2002)\r Huang, Shaojian, Independence of anti-corruption agencies in investigating corruption complaints against the head of state or head of government in selected places and Hong Kong (Hong Kong : Legislative Council Secretariat, Research and Library Services Division, 2008)\r Hsueh, Chao-Yung, \"Power and Corruption in Taiwan.\" In journal of Issues & Studies, Volume 43, Issue 1, 2007, pp. 1-39\r  Independent Commission Against Corruption, Hong Kong Independent Commission Against Corruption (ICAC) (Hong Kong: Independent Commission Against Corruption, 2008)\r  Klitgaard, Robert 1988 Controlling Corruption. Berkeley and Los Angeles: University of California Press. (UL Reserve JF1525 C66K45)\r  He Zengke, “Corruption and anti-corruption in reform China”, Communist and Post-Communist Studies, Volume 33, Issue 2, June 2000, pp.243-270\r  *Lee, Rance P. L., Corruption and its control in Hong Kong : situations up to the late seventies (Hong Kong : Chinese University Press, 1981)\r  Lo, Jack M.K. \"Controlling Corruption in Hong Kong: From Colony to Special Administrative Region.\" In journal of Journal of Contingencies and Crisis Management, Volume 9 Issue 1, 16 Dec 2002, pp. 21-28\r  Lo, Shiu Hing, Political development in Macau (Hong Kong: Chinese University Press, c1995)\r  Lu, Xiaobo. 2000. Cadres and Corruption. Stanford, California: Stanford University Press. Introduction (pp1-30).\r  Melanie Manion, Corruption by Design: Building Clean Government in Mainland China and Hong Kong, (Harvard University Press, 2004)\r  Pan, Wai-fat, The impact of Chinese culture on corruption in Hong Kong (Hong Kong : University of Hong Kong, 2000)\r  Tat Yan Kong, \"Corruption and the effect of regime type: the case of Taiwan.\" In the Journal of New Political Economy, Volume 9, Issue 3 September 2004, pp. 341–364 \r  Tsao, King K. and John Worthley, 1996 \"China: Administrative Corruption Experience in a Comparative Context\" in Australian Journal of Public Administration 4:22-29.\r  Ting Gong and Stephen K. Ma, (eds.), Preventing corruption in Asia : institutional design and policy capacity, London ; New York : Routledge, 2009, [UL-JQ1509.5.C6 P74 2009]\r  *Lu, Xiaobo. 2000. Cadres and Corruption. Stanford, California: Stanford University Press. Introduction (pp1-30).\r  Sun, Y. (2004). Corruption and market in contemporary China. Ithaca, N. Y.: Cornell University Press. (Chapter 1) \r  *Wedeman, Andrew (2012). Double Paradox: Rapid Growth and Rising Corruption in China. Cornell University Press. Chapters 1,6 &7\r  Zengke He, 2000. “Corruption and anti-corruption in reform China”, Communist and Post-Communist Studies, 33: 243-270\r  中央紀委紀檢監察研究所編：《中國共產黨反膺倡廉文獻選編》，中央文獻出版社，2002年\r  劉立憲：《新世紀反貪汙對策研究》，北京：中國方正出版社，2001年\r  何增科著：《反腐新路：轉型期中國腐敗問題研究》，中央編譯出版社，2002年\r  Or other Chinese articles which can be found: 中文大學服務中國研究中心 http://www.usc.cuhk.edu.hk/wk.asp\r  中國廉政文化網，http://www.cnicw.gov.cn/main.php\r  *中國反腐倡廉網，http://www.lianzheng.com.cn/\r  Weeks 10 \r Health\r  Bloom, Gerald & Tang, Shenglan (eds) (2004), Health Care Transition in Urban China, Burlington, VT: Ashgate.\r  Daemmrich, Arthur, 2013. The political economy of healthcare reform in China: negotiating public and private. Springer.\r  Ofra, Anson (2005), Healthcare in Rural China: Lessons From Hebei Province, Burlington, VT: Ashgate.\r  Burns, Lawton Robert and Gordon G. Liu, eds. 2017. China's Healthcare System and Reform \r Cambridge University Press.\r  Week 11\r Housing\r  Wang, Ya Ping, 2005. “Chinese Housing Reform in State-owned Enterprises and Its Impacts on Different Social Groups”. Urban Studies.\r  Xu, Jiang, 2009. “Decoding Urban Land Governance: State Reconstruction in Contemporary Chinese Cities” Urban Studies, 46: 559-581\r  Yang, Zan and Chen, Jie, 2014. Housing Affordability and Housing Policy in Urban China\r Springer.\r  Huang, Youqin and Si-ming Li (eds) 2014. Housing Inequality in Chinese Cities (Routledge Contemporary China Series)\r  Weeks 12--14 \r Student Presentations:\r Remarks and Summary", "required_readings": "Listed under Course Syllabus", "recommended_readings": "Listed under Course Syllabus", "terms": {"2020-21 Term 2": {"--LEC (4325)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [1], "locations": ["Lee Shau Kee Archi Bldg G03"], "instructors": ["Professor TSAO King Kwun"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}}, "2021-22 Term 2": {"--LEC (1009)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [1], "locations": ["Wong Foo Yuan Bldg UG02"], "instructors": ["Professor TSAO King Kwun"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Attendance": "5", "Presentation": "30", "Participation": "15", "Report": "50"}}, {"code": "5838", "title": "Greater China in the Global Political Economy", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "As the world’s second largest economy and biggest trading nation, China is pursuing a multi-pronged strategy to enhance its role in the global political economy. While the quasi-superpower’s goals are focused on attaining a bigger say in reshaping the international financial architecture, its voice is being heard on issues ranging from Free Trade Agreements and commodity prices to climate change and food security. Under the leadership of President Xi Jinping, Beijing is packing a bigger punch in institutions and forums including the International Monetary Fund as well as the G20 and APEC. Moreover, the Xi administration is trying to buttress China’s global influence through overarching undertakings such as the “One Belt, One Road” or the Belt and Road Initiative (B&RI) to nurture cross-border and inter-continental infrastructure projects. The Belt and Road grand plan will also showcase China’s aggressive Outbound Foreign Direct Investment (OFDI) strategy as well as the country’s leaps-and-bounds advancement in high technology. In the course of the teaching and discussion, ample weight will be given to the roles of Taiwan, Hong Kong and Macau, which are substantial players within the “Greater China” universe. Apart from analyzing world-sized projects and activities involving the Belt and Road, the Asian Infrastructure Investment Bank, the G20 as well as UN institutions, this course will examine China’s relations with major countries and regions, particularly the U.S., Russia, Japan, the two Koreas, India, the ASEAN and EU from the global political-economy perspective. A common theme will be to appraise the extent to which Beijing can sell its “win-win” scenarios in trade, investment and security-related cooperation to global partners. The Xi administration, however, has to counter the “anti-China containment policy” supposedly being spearheaded by countries including the U.S., India, Japan, Vietnam and Australia. Beijing must also reassure developed countries that it is not stealing their technologies through M&A operations – and developing nations that it is not pursuing neo-colonialist agendas. The Chinese Communist Party (CCP) administration’s ability to win over countries and regions and to enlarge its global footprint depends, however, on the viability of the “China model.” Whether China can modernize government institutions and corporate governance – and raise the competitiveness of its industrial and services sectors – is pivotal to its objective of becoming a norm-setter in the global political economy. These important issues will be analyzed and discussed in class after students have gained a good understanding of the Chinese economic structure, the country’s foreign-policy and national-security priorities, and latest developments in the global political economy. ", "outcome": "The main objective of this course is to equip students with an adequate grasp of China’s goals and decision-making processes in relations to Beijing’s enhanced global power projection, particularly its growing role in the international political economy. A key understanding of China’s objectives and strategies ranging from reshaping the world’s financial order to boosting investments in intercontinental infrastructure projects will enable students to gain fresh perspectives on China’s fast-changing economic and political ties with international institutions as well as major countries and regions.\r  After taking this course, students should be able to fully understand – and be able to form their own views on: \r • The goals of Chinese foreign and national-security policies; and ways in which Beijing seeks to play a bigger role in reshaping the international financial order;  • China’s strategies of enhancing its leadership capacity in global institutions and forums;  • Beijing’s ambitious projection of financial power through massive overseas investment as well as boosting inter-continental infrastructure projects;  • The pros and cons of major policy agendas such as the Belt and Road Initiative – as well as formidable challenges that they face; • Chinese concerns and game plans regarding the formation of free trade zones and handling global issues such as climate change, commodity prices and food security;  • The pillars of the “China model” and the quasi-superpower’s drive to promote innovation in government systems as well as the industrial and services sectors.\r  Students should be capable of not only making informed analysis but also formulating their own theories and hypotheses regarding the full range of topics. For example, students should use IR and global political economy theories to assess the degree of success of China’s financial and trade-related “great leap outward.” Such prognosis and prognostication should be based on references to latest journal and news publications, ideas introduced by the lecturer, as well as debates within classes among advocates of different viewpoints. Guest lecturers who are practitioners in the finance, think-tank, and diplomatic sectors might be invited to give talks to students.", "syllabus": "Topic 1. CHINA’S CONCERNS AND STRATEGIES IN MAJOR ARENAS OF THE GLOBAL POLITICAL ECONOMY\r The lecture and class discussion will focus on how China the fast-rising quasi-superpower is boosting its clout in the global political economy through major initiatives in diplomacy, national security, and international economics and finance. \r The Xi Jinping administration's new priorities on different aspects of state security -- including financial, energy and environmental security -- will be examined. Particular attention will be paid to China’s diplomatic and economic relations with powers and blocs including the United States, the EU, Japan, Russia, ASEAN, and world bodies such as the UN, the IMF, and the G20.\r  Topic 2. CHINA’S ECONOMICS-BASED DIPLOMACY AND OUTBOUND FOREIGN DIRECT INVESTMENT (OFDI); THE SIGNIFICANCE OF THE “BELT AND ROAD INITIATIVE” \r Beijing has since the 2000s sought to use its economic heft and influence as diplomatic tools to improve its relations with \"peripheral states\" and great powers alike. \r The Xi Jinping administration’s employment of economic inducements such as overseas development aid and outbound foreign direct investment (OFDI) will be studied. Discussion will be held over the execution of China's economics-based diplomacy in selected theatres such as ASEAN, Africa as well as the U.S. and the EU. Assessment will be made of the efficacy of the “One Belt, One Road” game plan.\r Students are encouraged to make suggestions as to how Beijing can better utilize OFDI and related strategies to win friends and neutralize enemies. Emphasis will be put on agendas including securing reliable supplies of energy and other resources; procuring high technology; and marketing Chinese products and know-how including high-speed railways.\r   Topic 3. FOCUS ON THE CHALLENGES OF THE “BELT AND ROAD INITIATIVE”\r An assessment of the significance of the Belt and Road Initiative in view of comparative global undertakings such as the Marshall Plan in post-WWII Europe. Questions will be asked about whether Beijing is shouldering most of the investment burden given lackluster response from the U.S. and the EU. Thorough appraisals will be made of the long-term viability of multi-billion-dollar projects in Pakistan and Sri Lanka, which bear the hallmark of overseas development aid (ODA). Also discussed will be foreign economists’ views that Beijing’s commitments to big projects in Asia and Africa will exacerbate China’s already serious debt problems. Comparisons will be made between the B&RI and the Asia African Growth Corridor sponsored by Japan and India.\r   Topic 4. CHINA, THE G20 AND BEIJING’S EFFORTS TO RESHAPE THE GLOBAL FINANCIAL ARCHITECTURE \r Beijing has since the global financial crisis of 2008 sought to play a more assertive role in reshaping the international financial architecture. The Xi administration's strategies and performance in global forums such as the G20 will be assessed. Students will be asked to discuss major Chinese goals ranging from promoting the global status of the renminbi to ensuring fair trade particularly with the developed world. Also analyzed will be Beijing efforts together with other BRICS members to ensure that major developing countries will have a bigger say in reforming the global financial infrastructure. The long-term significance of the Asian Infrastructure Development Bank – and its perceived challenges to the Asian Development Bank and the IMF – will be appraised. \r  Topic 5. GLOBAL INTERACTIONS: FTAs, FOOD SECURITY, COMMODITY PRICING AND CLIMATE CHANGE\r The lecture and discussion will focus on China the assertive international actor in areas including the formation of free trade agreements and trade pacts with countries ranging from ASEAN members to Central Asian states. Also analyzed will be China’s efforts in engaging in global solutions relating to urgent tasks such as boosting food supplies, reducing carbon emissions, and promoting green energy solutions. Comparisons will be made between the Beijing-initiated Regional Comprehensive Economic Pact (RCEP) and the half-defunct Transpacific Partnership (TPP) spearheaded by the Obama administration. Emphasis will be put on how Beijing can prove itself as a responsible stakeholder if not a leader in the solution of global problems and the provision of global public goods. The fact that the Trump administration has displayed an anti-globalization stance – and Washington’s pulling out of the Paris Accord – has afforded the Xi administration new opportunities of demonstrating China’s commitment to globalization and to becoming a rule-setter in international intercourse.\r  Topic 6. THE GLOBAL POLITICAL ECONOMY PERSPECTIVE OF CHINA-U.S. RELATIONS\r After examining the voluminous literature (in both English and Chinese) on Sino-U.S. relations since WWII, this class will discuss new challenges on the trade and foreign-policy fronts in the Xi Jinping and Donald Trump administrations. The traditionally win-win, symbiotic economic ties between the two giants could be jeopardized by security challenges epitomized by the North Korea crisis. One example is whether Trump could use trade-related threats to force Beijing to use more forceful means to restrain Pyongyang’s nuclear program. Also analyzed will be the role of Taiwan in complicating Sino-U.S. relations from the global political-economy perspective.\r  Topic 7. THE GLOBAL POLITICAL ECONOMY PERSPECTIVE OF CHINA-RUSSIAN RELATIONS\r The lecture and class discussion will focus on the global political economy factors behind the quasi-alliance relationship between China and Russia. For geopolitical and security reasons, both leaderships have developed a strong bondage based on their mutual concern about countering the American threat. Relevant IR theories will be explored to discuss the common China-Russian front on the North Korean issue. Manifestations of China-Russia cooperation in the form of the Shanghai Cooperation Organization will be assessed. However, these two former Cold War \r adversaries also harbor deep-seated distrusts over issues such as China’s economic predominance: Central Asia, hitherto Russia’s backyard, has become a Chinese economic sphere of interest particularly in the wake of the R&BI. \r  Topic 8. THE GLOBAL POLITICAL ECONOMY PERSPECTIVE OF CHINA’S RELATIONS WITH THE TWO KOREAS AND WITH JAPAN\r The North Korean missile and nuclear crisis has thrown into sharp perspective the convoluted quadrangular relations between China, the two Koreas, and Japan. What are the historical – and geopolitical – reasons behind Beijing’s refusal to jettison or at least curtail its alliance relationship with the DPRK? Questions of history as well as disputes over several pieces of rocks (called the Diaoyus or Senkakus) have put obstacles in the way of a symbiotic economic relationship between China and Japan. Discussion will be informed by latest research on the rich but complicated traditions of China-Korean and China-Japanese ties. \r  Topic 9. THE GLOBAL POLITICAL ECONOMY PERSPECTIVE OF CHINA-INDIAN RELATIONS\r Despite exceptionally fast growth in bilateral trade in the past decade, Beijing and New Delhi are locked in dispute over border rows – as well as suspicions of each other’s “containment policies.” China and India, however, are important members of the BRICS group, as well as the Shanghai Cooperation Organization. China-India ties thus offer plentiful illustration of the interaction of potential economic symbiosis juxtaposed against increasingly ferocious geopolitical contest. \r  Topic 10. THE GLOBAL POLITICAL ECONOMY PERSPECTIVE OF CHINA-ASEAN RELATIONS\r China scored a major victory on the global political economy front when the Permanent Court of Arbitration in the Hague ruled against her claims on the South China Sea in 2016 – and nothing seemed to happen. Most ASEAN states are beholden to China due to massive trade and investment benefits emanating from their “win-win scenarios” with China. That Beijing can still hang on to its claims relating to the “nine dash lines” demonstrates the limits of international law in restricting the behaviors of a rising quasi-superpower.\r  Topic 11. THE GLOBAL POLITICAL ECONOMY PERSPECTIVE OF CHINA-EU RELATIONS\r Although French President Emmanuel Macron has warned against Chinese firms acquiring high-tech EU manufacturers, Beijing’s buying power – and geopolitical clout – is such that it is picking up not only tech companies but also ports and mines in Europe. Beijing is also accused of “divide and rule” tactics through its special relationship with the 16 central and east European members of the EU (the so-called “16+1 cooperation”). The class will examine the obstacles that Beijing faces in its effort to use its new-found affinity with the EU to hedge against “American neo-imperialism.” \r  Topic 12. THE VIABILITY AND FUTURE OF “THE CHINESE MODEL” \r There is an intimate connection between China's domestic economic and political achievements on the one hand, and its status and game plans in the global political economy on the other. How viable and sustainable is the \"China model\" -- here understood as not only the country's unique path to economic growth but also the convoluted trajectory of economic and political reforms? The lecture and discussion will focus on reforms introduced by the Hu Jintao and Xi Jinping administrations – and how they impact on China's ability to make a difference on the world stage. \r  Topic 13. CHINA’S WORLD COMPETITIVENESS, THE “SILICON VALLEY” MODEL, AND “MADE IN CHINA 2025” INITIATIVE\r Following the discussion in the previous class on the \"China model,\" this lecture will discuss China's global competitiveness. Students are encouraged to assess the country's unique formula for promoting innovation in government institutions and businesses, including state-own-enterprise conglomerates as well as private firms. Can China nurture a \"Silicon Valley with Chinese characteristics\"? The successful globalization of a selective number of enterprises ranging from Huawei and Haier to Baidu and Alibaba will be analyzed. Premier Li Keqiang’s ambitious “Made in China 2025” program will be examined. Also analyzed will be the diplomatic functions of leading Chinese multinationals as well as their growing international responsibilities.\r  Topic 14. REVISIONS OF HIGHLIGHTS OF THE COURSE AND PREDICTIONS OF THE TRAJECTORY OF CHINA’S RISING CLOUT IN THE GLOBAL POLITICAL ECONOMY", "required_readings": "Required readings:\r Latest journal articles on relevant topics will be distributed a week before each class.\r  Jisi Wang \r China’s search for a grand strategy \r Foreign Affairs (Mar/Apr 2011): 68-79. \r https://www.foreignaffairs.com/articles/china/2011-02-20/chinas-search-grand-strategy\r  Thomas Christenson\r “Advantages of an Assertive China- Responding to Bejing's Abrasive Diplomacy”\r TF Christensen - Foreign Affairs, 2011 - HeinOnline\r  Elizabeth Economy\r “The Game Changer-Coping with China's Foreign Policy Revolution, ”\r EC Economy - Foreign Affairs, 2010 - HeinOnline\r  Caitlin Campbell & Craig Murray \r U.S.-China Economic and Security Review Commission \r “China Seeks a ‘New Type of Major-Country Relationship’ with the United States” \r http://origin.www.uscc.gov/sites/default/files/Research/China%20Seeks%20New%20Type%20of%20Major-Country%20Relationship%20with%20United%20States_Staff%20Research%20Backgrounder.pdf\r  Kenneth Lieberthal & Wang Jisi \r “Addressing U.S.-China Strategic Distrust,” \r The Brookings Institution, \r https://www.brookings.edu/wp-content/uploads/2016/06/0330_china_lieberthal.pdf\r  Michael D. Swaine\r “America’s Challenge: Engaging a Rising China in the 21st Century,”\r Carnegie Endowment for International Peace, Washington, 2011\r (provided by lecturer) \r  Yongding, Yu\r “The G20 and China: A Chinese Perspective”\r Institute of World Economics & Politics, CASS\r http://dspace.cigilibrary.org/jspui/bitstream/123456789/17390/1/The%20G20%20and%20China%20A%20Chinese%20Perspective.pdf?1\r  Gregory Chin \r “THE EMERGING COUNTRIES AND CHINA IN THE G20:\r RESHAPING GLOBAL ECONOMIC GOVERNANCE\"\r http://www.yorku.ca/ycar/Chin_Studia.pdf\r  Giles Chance, China and the Credit Crisis: The Emergence of a New World Order \r (John Wiley & Sons, Singapore, 2010)\r (Excerpts will be provided by lecturer) \r  Sebastian Mallaby and Olin Wethington \r “The Future of the Yuan: China’s Struggle to Internationalize Its Currency” \r January/February 2012 \r http://www.foreignaffairs.com/articles/136778/sebastian-mallaby-and-olin-wethington/the-future-of-the-yuan\r  Arvind Subramanian (PIIE and CGD) and Martin Kessler (PIIE)\r “The Renminbi Bloc is Here: Asia Down, Rest of the World to Go?”\r http://www.iie.com/publications/wp/wp12-19.pdf\r  Lynne Cockerell and Michael Shoory, Reserve Bank of Australia\r “Internationalising the Renminbi”\r http://www.rba.gov.au/publications/bulletin/2012/jun/9.html\r  William Cline & John Williamson \r “Currency Wars?”\r http://www.iie.com/publications/pb/pb10-26.pdf\r  Arthur Kroeber \r “The Renminbi: The Political Economy of a Currency\r Why it's a mistake for the United States to fear the yuan.” \r September 7, 2011 \r http://www.foreignpolicy.com/articles/2011/09/07/the_renminbi_the_political_economy_of_a_currency\r  Li Wang \r “From Client Status to Strategic Partnership: China’s Changing Perceptions of Europe” in Li Wang, ed., Europe and China: Strategic Partners or Rivals?, HKU Press, 2012\r  Zhu Feng \r “Chinese Perspectives on the U.S. role in Southeast Asia,” Southeast Asian Affairs (2013), \r pp. 51-60.", "recommended_readings": "Larry Catá Backer\r “The Trans-Pacific Partnership: Japanese Strategic Diplomacy or Chinese Containment”\r http://papers.ssrn.com/sol3/papers.cfm?abstract_id=2237523##\r  Evelyn Shyamala Devadason \r “The Trans-Pacific Partnership (TPP): The Chinese Perspective”\r http://papers.ssrn.com/sol3/papers.cfm?abstract_id=2101839\r  Ellen Frost \r Strategic Implications of TPP: Answering the Critics\r http://scholarspace.manoa.hawaii.edu/bitstream/handle/10125/29568/APB%20no.%20220.pdf?sequence=1\r  Jose L. Tongzon\r “ASEAN-China Free Trade Area: A Bane or Boon for ASEAN Countries?”\r http://onlinelibrary.wiley.com/doi/10.1111/j.1467-9701.2005.00643.x/abstract\r  Ronald Trostle, US Dept of Agriculture\r “Global Agricultural Supply and Demand: Factors Contributing to the Recent Increase in Food Commodity Prices” \r http://www1.eere.energy.gov/biomass/pdfs/global_agricultural_supply_and_demand.pdf\r  Peter Christoff\r Cold climate in Copenhagen: China and the United States at COP15\r (will be provided by lecturer) \r  Paul G Harris & Yu Hongyuan \r “Global Change, Peace & Security: formerly Pacifica Review: Peace, Security & Global Change” \r Volume 17, Issue 1, 2005 Special Issue: Climate Change and the Reluctant States\r http://www.tandfonline.com/doi/abs/10.1080/0951274052000319355?journalCode=cpar20\r  Lieberthal, Kenneth & Sandalow, David\r Overcoming Obstacles to U.S.-China Cooperation on Climate Change\r http://dspace.cigilibrary.org/jspui/bitstream/123456789/25435/1/Overcoming%20Obstacles%20to%20US-China%20Cooperation%20on%20Climate%20Change.pdf?1\r  Derek Headey & Shenggen Fan\r “Anatomy of a crisis: the causes and consequences of surging food prices”\r http://onlinelibrary.wiley.com/doi/10.1111/j.1574-0862.2008.00345.x/pdf\r  Dingxin Zhao, University of Chicago\r Hongxing Yang, Shanghai University of Finance and Economics\r “Performance Legitimacy, State Autonomy and China’s Economic Miracle” \r http://iis-db.stanford.edu/pubs/24079/Performance_legitimacy_(Zhao).pdf\r  Yang Yao, Peking University \r “The End of the Beijing Consensus:\r Can China's Model of Authoritarian Growth Survive?” \r Foreign Affairs, February 2, 2010 \r http://web.sfc.keio.ac.jp/~tomoki/p1.pdf\r  Stefan Halper, The Beijing Consensus (Basic Books, New York, 2010) \r (Excerpts from book provided by lecturer)\r  Wing Thye Woo\r “China’s economic growth engine: The likely types of hardware failure, software failure and power supply failure”\r BOFIT Discussion Papers 8/ 2011\r http://www.suomenpankki.fi/bofit_en/tutkimus/tutkimusjulkaisut/dp/Documents/DP0811.pdf\r  Nouriel Roubini\r “China’s Bad Growth Bet”\r http://www.project-syndicate.org/commentary/roubini37/English\r  Yasheng Huang \r “Yasheng Huang On China's Growth”\r Jul 28, 2011 \r http://business.in.com/article/special/yasheng-huang-on-chinas-growth/27132/1#ixzz1TUp0cUlJ\r  Joshua Klein Lipman\r “Law of Yuan Price: Estimating Equilibrium of the Renminbi”\r The Wharton School of the University of Pennsylvania\r http://www.michiganjb.org/issues/42/text42b.pdf\r  Wendy Dobson and Paul R. Masson \r “WILL THE RENMINBI BECOME A WORLD CURRENCY?” \r China Economic Review 20 (1, 2009): 124-135 \r http://www.rotman.utoronto.ca/userfiles/faculty/dobson/files/File/RMB%20as%20world%20currency.pdf\r  Cline, William R., and John Williamson.\r “Estimates of the Equilibrium Exchange Rate of the Renminbi: Is There a Consensus, and If Not, Why Not?” \r Washington: Peterson Institute for International Economics.\r http://www.iie.com/publications/papers/cline-williamson1007.pdf\r   Geng Xiao\r “Is the renminbi the next global currency?” \r Mckinsey Quarterly\r http://www.mckinseyquarterly.com/Is_the_renminbi_the_next_global_currency_2532\r  Paul Krugman\r “Taking On China” March 14, 2010 \r http://www.nytimes.com/2010/03/15/opinion/15krugman.html\r  Barry Naughton\r “Singularity and Replicability in China's Developmental Experience”\r www.aeaweb.org/assa/2009/retrieve.php?pdfid=356\r  Barry Naughton \r “In China’s Economy, the State’s Hand Grows Heavier”\r http://www.relooney.info/0_NS4053_142.pdf\r  Jamil Anderlini, Financial Times, \r “China’s growth model ‘unsustainable’”\r Published: December 23 2010 15:02 | Last updated: December 23 2010 15:02\r http://www.ft.com/intl/cms/s/0/f38e08ce-0e84-11e0-b9f1-00144feabdc0.html#axzz1eRh6qwUM\r  David M. Kotz and Andong Zhu\r Department of Economics School of Marxism\r University of Massachusetts Amherst Tsinghua University\r “China's Growth Model: Problems and Alternatives”\r http://www.networkideas.org/ideasact/jan09/PDF/Andong.pdf\r  “Roland Berger List of 20 Most Competitive Chinese MNCs”\r http://www.rolandberger.com.cn/news/local/2012-09-05-mostgloballycompetitivechinesecompany_en.html\r  PAN Rongfang & ZHENG Yongnian\r “CHINA’S INDIGENOUS INNOVATION STRATEGY”\r National U of Singapore, EAI Background Brief No. 649\r http://www.eai.nus.edu.sg/BB649.pdf\r  SIYUAN AN AND BRIAN PECK\r “CHINA’S INDIGENOUS INNOVATION POLICY IN\r THE CONTEXT OF ITS WTO OBLIGATIONS AND\r COMMITMENTS”\r http://gjil.org/wp-content/uploads/archives/42.2/ChinasIndigenousInnovation.PDF\r  Roman Tomasic, Victoria University & Jian Fu, Deakin University\r “Regulation and Corporate Governance of China’s top 100 listed\r companies: Whither the Rule of Law?”\r http://www.reds.msh-paris.fr/communication/docs/tomasic-fu.pdf\r  Adam Segal \r “China’s Innovation Wall: Beijing's Push for Homegrown Technology” \r Foreign Affairs, September 28, 2010 \r http://www.foreignaffairs.com/articles/66753/adam-segal/chinas-innovation-wall\r  Wall Street Journal, Sept 1, 2011\r “Beijing Is Stifling Chinese Innovation: \r ‘Indigenous innovation' policies scare away the foreign-owned research labs that would spur creativity”\r http://online.wsj.com/article/SB10001424053111904583204576541732014359842.html\r  U.S. House of Representatives\r “China’s Indigenous Innovation Policy and U.S. Interests,”\r http://foreignaffairs.house.gov/112/lev030911.pdf\r  U.S. Chamber of Commerce\r “China's Drive for 'Indigenous Innovation'”\r http://www.uschamber.com/sites/default/files/reports/100728chinareport_0.pdf\r  Center for American Progress, Washington DC\r \"Rising to the Challenge: A Progressive U.S. Approach to China’s Innovation and Competitiveness Policies\"\r http://www.americanprogress.org/issues/2011/01/pdf/china_innovation.pdf\r  Steve Lohr \r “In Innovation Race, China Is Not Yet a Rival, Study Says”\r November 15, 2011, \r http://bits.blogs.nytimes.com/2011/11/15/in-innovation-race-china-is-not-yet-a-rival-study-says/\r  World Economic Forum, \"The Global Competitiveness Report, 2010-2011\"\r http://www3.weforum.org/docs/WEF_GlobalCompetitivenessReport_2010-11.pdf\r  [This is a long report on 100-odd countries; you need of course only read those parts relevant to the Chinese situation.] \r  Annalee Saxenian, “Manufacturing in Mainland China,” \r from The New Argonauts: Regional Advantage in a Global Economy \r (Harvard University Press, Boston, 2006)\r (provided by lecturer)\r  CHEN, Yun-chung, Hong Kong University of Science and Technology\r “Technology Transfer between Silicon Valley and Zhongguancun:\r The role of China’s Transnational Technology Community” \r http://www.cctr.ust.hk/materials/conference/conference/papers/Chen,Yun-chung_paper.pdf\r  David Zweig, Chung Siu Fung and Wilfried Vanhonacker \r Center on China’s Transnational Relation\r “Rewards of Technology: Explaining China’s Reverse Migration” \r Working Paper No. 11 The Hong Kong University of Science and Technology \r http://www.cctr.ust.hk/materials/working_papers/WorkingPaper11_v2.pdf\r  Yu Zhou\r “China’s High Tech Industry and the World Economy: Zhongguancun Park” \r Japan Focus 2008 \r http://www.japanfocus.org/-Yu-Zhou/2661\r  Huiyao Wang; David Zweig; Xiaohua Lin\r “Returnee Entrepreneurs: impact on China's globalization process”\r Online publication date: 09 May 2011\r http://www.cctr.ust.hk/materials/library/Returnees_Global.Wang.Zweig.Lin.pdf\r  Justin Tan\r “Growth of industry clusters and innovation: Lessons from Beijing Zhongguancun Science Park”\r Schulich School of Business, York University, Toronto, Ontario, Canada M3J \r http://avalon.cuautitlan2.unam.mx/materialesdidacticos/gerardo_sa/articulos/Growth_Industry.pdf\r  LI Fang, LIN Han-chuan & LIU Yang\r “Dynamic Evolution of China Advanced Manufacturing Model in Global View:\r A Case Study Based on Huawei Company”\r http://en.cnki.com.cn/Article_en/CJFDTOTAL-DBDS201102004.htm\r  Wei Huang\r “Internationalisation of Chinese firms: A case study of Huawei Technologies Ltd.”\r http://edissertations.nottingham.ac.uk/195/1/06MAlixwh8.pdf\r  Donglin Wu and Fang Zhao\r “Entry Modes For International Markets: Case Study of Huawei, A Chinese Technology Enterprise”\r http://bizresearchpapers.com/Paper%2013.pdf\r  Yutaka Nakai, Yoshitoshi Tanaka\r “Chinese Company’s IPR Strategy: How Huawei Technologies\r Succeeded in Dominating Overseas Market by Sideward-Crawl Crab Strategy” \r http://www.me.titech.ac.jp/~ytanaka/pdf/up_201008/10A0047_Yoshino_Tanaka.pdf\r  Alberto Di Minin and Jieyin Zhang\r “Preliminary Evidence on the International R&D Strategies of Chinese Companies in Europe”\r http://gdex.dk/ofdi/21%20Minin%20Alberto.pdf\r  Ying Zhang\r United Nations University Working Paper\r “Alliance-based Network View on Chinese Firms’ Catching-up: Case Study of Huawei Technologies Co.Ltd.”\r http://www.merit.unu.edu/publications/wppdf/2009/wp2009-039.pdf\r  Beiguang Zhu\r “Internationalization of Chinese MNEs and Dunning’s Eclectic (OLI) Paradigm:\r A Case study of Huawei Technologies Corporation’s Internationalization Strategy”\r http://lup.lub.lu.se/luur/download?func=downloadFile&recordOId=1338205&fileOId=1646725", "terms": {"2020-21 Term 2": {"--LEC (1643)": {"startTimes": ["10:00"], "endTimes": ["12:45"], "days": [6], "locations": ["Chen Kou Bun Bldg UG05"], "instructors": ["Professor LAM Wo Lap"], "meetingDates": ["16/1", "23/1", "30/1", "6/2"]}}, "2021-22 Term 2": {"--LEC (2977)": {"startTimes": ["10:00"], "endTimes": ["12:45"], "days": [6], "locations": ["Chen Kou Bun Bldg 706B"], "instructors": ["Professor LAM Wo Lap"], "meetingDates": ["15/1", "22/1", "29/1"]}}}, "assessments": {"Essays": "60", "Project": "40"}}, {"code": "5839", "title": "Non-traditional Security: Terrorism, Corruption and Trans-border Crime", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "This course introduces the concept of terrorism, crime, and corruption. It examines the relations among terrorism, crime, corruption, politics, and economy. Students are encouraged to discuss the impact of terrorism and crime on international and regional stability. The course investigates how governments’ tolerance and intolerance of illicit activities are affected by their impacts on economic growth and self-interests of political elites. Special attention will be focused on the responses of International Organizations and nations on the issues and evaluation of their success and limitations.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5840", "title": "Taiwan’s China Dilemma and Cross-Strait Economic Policy", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "The course examines the political economic relationship between Taiwan and China, focusing on the fundamental role of Taiwan’s evolving national identity in shaping its economic policy towards China. This course analyzes the controversies over Taiwan’s liberalization of its trade and investment relations with the Chinese economy. The course will draw on theories of international political economy and comparative political economy, and on the role of national identity in formulating foreign economic policy.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5850", "title": "Independent Research", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "This course provides students with the opportunities to conduct academic research under supervision of one or more teaching staffs of the Programme. Students are required to submit the required assessment at the end of the course.", "outcome": "After the completion of this course, students should be able to:\r Learning Outcome 1: Recognize the foundations of the political economy \r Learning Outcome 2: Apply theories of political economy to understand the development of a specific area or topic\r Learning Outcome 3: Analyze the global issues through conducting independent research\r Learning Outcome 4: Reflect upon the content learnt in the Programme through independent research", "syllabus": "Topic will be agreed by the supervisor and the supervisee.", "required_readings": "Babbie, Earl and Chapman University (2016). The Practice of Social Research. 14th Edition. Boston, MA : Cengage Learning.\r  Baker, Therese L. (1999). Doing Social Research. 3rd Edition. Boston: McGraw-Hill College\r  Berg, Bruce L. and Howard Lune (2012). Qualitative Research Methods for Social Sciences. 8th Edition. Boston: Pearson.", "recommended_readings": "Recommended reading list is provided by supervisor.", "terms": {"2020-21 Term 2": {"--LEC (4095)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Peter BEATTIE"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 2": {"--LEC (1821)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Peter BEATTIE"], "meetingDates": ["10/01/2022 - 02/05/2022"]}}}, "assessments": {"Homework or assignment": "20", "Presentation": "30", "Project": "50"}}, {"code": "5851", "title": "Independent Research and Guided Field Studies in Selected Area", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "This course provides students with the opportunities to visit a destination outside of Hong Kong, exploring the real-world implications of Global Political Economy to different communities. The field studies will take place under the supervision of one or more teaching staffs of the Programme. Students are required to conduct independent research and submit the required assessment after the field studies.", "outcome": "After the completion of this course, students should be able to:\r Learning Outcome 1: Recognize the foundations of the political economy of the selected area\r Learning Outcome 2: Apply theories of political economy to understand the political and economic development of the selected area\r Learning Outcome 3: Analyze the opportunities and challenges faced by the selected area\r Learning Outcome 4: Reflect upon the content learnt in the Programme through exposure to different cultures and people in the world", "syllabus": "Topic will be designed by the supervisor.", "required_readings": "Bailey, Carol A. (2007). A Guide to Qualitative Field Research. 2nd Edition. Thousand Oaks, Calif. ; London : Pine Forge\r  Danelo, David J. (2017). The Field Researcher’s Handbook: A Guide to the Art and Science of Professional Fieldwork. Washington, D. C.: Georgetown University Press.\r  Pole, Christopher J. (2016). Doing Fieldwork. London: SAGE Publication", "recommended_readings": "Recommended reading list is provided by supervisor.", "terms": {"2020-21 Term 2": {"--LEC (3866)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [3], "locations": ["Lee Shau Kee Archi Bldg G03"], "instructors": ["Professor CHUNG King Lam Calvin"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (3233)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [3], "locations": ["Chen Kou Bun Bldg UG03"], "instructors": ["Professor CHUNG King Lam Calvin"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Homework or assignment": "20", "Presentation": "40", "Report": "40"}}, {"code": "5852", "title": "Internship/Practicum", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For MSSc in Global Political Economy (MGPE) students only.", "description": "This course provides an opportunity for students to gain policy research experience working under a supervisor at a partnering organization in or beyond CUHK that is endorsed by the course coordinator. Over the course of the semester, students will contribute to an ongoing research project (topics vary annually), by performing policy-relevant research, surveying/canvassing, and/or data analysis. Each student is assigned a supervisor who will provide instruction, guidance, and assistance during the internship period. Students are required to submit a final report demonstrating the knowledge outcomes attained: for instance, background knowledge acquisition, experience in practical application of theory, data gathering, and data analysis. The student’s performance will be evaluated on the basis of his/ her final report and the supervisor’s assessment. This course is most similar to Independent Research (GPEC5850); the primary difference is that the focus of this course is on applied research, working with a team and supervised by a leading member of the partnering organizations concerned, while the focus of Independent Research can be more theoretical (e.g., literature review and analysis/interpretation) and is done independently under the supervision of a member of the MGPE teaching staff.", "outcome": "Upon completion of the course, students will be able to:·          acquire experience working both independently and collaboratively with a team of policy professionals;·          develop transferable skills for work or further study (e.g. data and policy analysis);·          better understand how to apply theoretical knowledge to solve social/economic/political challenges and problems; and·          identify how theoretical knowledge can be improved through empirical research and direct experience. ", "syllabus": "Learning Activities:·          Supervised work for at least 12 hours per week during the semester;·          A weekly log detailing students’ work activities and knowledge acquired;·          Write a final report of at least 4,500 words for evaluation", "required_readings": "Reading and research requirements are set at the discretion of the internship coordinator.", "recommended_readings": "", "terms": {"2021-22 Term 2": {"-P01-PRA (1004)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Peter BEATTIE"], "meetingDates": ["10/01/2022 - 02/05/2022"]}}}, "assessments": {"Others": "30", "Report": "70"}}]