[{"code": "5001", "title": "Institution and Reform in Contemporary China", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc in Government and Politics (Greater China) and students in MSSc in General Education only.", "description": "This course aims to understand and analyze the political and economic institutions of the People’s Republic of China and their evolutions since the late 1970s. Throughout the course students will critically examine various aspects of China’s institution and reform, including the bureaucratic management, intergovernmental relations, marketization and privatization reforms, legislative and legal developments, possibility and difficulty of democratization, rise and control of corruption, and state-society relations. Students are expected to come out from the course with a deep understanding of the causes, consequences, constraints, and contradictions of the major changes that have taken place in China in the last three decades.", "outcome": "(A) To have a deep understanding of the political economic institutions of post-Mao China and their transitions. (B) To acquire the ability to critically analyze socio-economic and political affairs in contemporary China. (C) To cultivate the ability to clearly define research questions regarding specific political and/or economic issues and to  conduct rigorous independent research to answer the questions.", "syllabus": "Topic 1: IntroductionTopic 2: Brief History of ReformTopic 3: The One-Party State Topic 4: Elite PoliticsTopic 5: The Management of State AgentsTopic 6: A Debate on MeritocracyTopic 7: Elections and RepresentationTopic 8: Alternative Participation and Popular ContentionTopic 9: State Corporatism and Civil SocietyTopic 10: State and ReligionsTopic 11: Legal Reform", "required_readings": "Kenneth Lieberthal, 2004. Governing China Goldman & MacFarquhar eds., The Paradox of China's Post-Mao Reforms Susan Shirk, 1993. in The Political Logic of Economic Reform in China Mary Elizabeth Gallagher, 2005. Contagious Capitalism Minxin Pel, 2006. \"Transforming the State : From Developmental to Predatory\", in China's Trapped Transition Jean Oi, 1995. \"The Role of the Local State in China's Transitional Economy.\" The China Quarterly 144 (December), pp.1132-49. Hongbin Li and Scott Rozelle, 2003. \"Insider Privatization, Innovative Contracts, and the Performance of Township Enterprises,\" The China Quarterly 176, pp.981-1005. Lawrence Lau, Yingyi Qian, and Gerald Roland, 2000. \"Reform without Losers: An Interpretation of China's Dual-Track Approach to Transition,\" Journal of Political Economy 108:1, pp.120-143. Gabriella Montinola, Yingyi Qian and Barry Weingast, 1995. \"Federalism, Chinese Style: the Political Basis for Economic Success in China\", World Politics 48:1, pp.50-81. Jing Vivian Zhan, 2009. \"Decentralizing China: analysis of central strategies in China's fiscal reforms,\" Journal of Contemporary China 18:60, pp.445-462. Jing Vivian Zhan, 2010. \"Thirty years of Reform: What Can We Learn from China?\" Our Time 13:2, pp.16-19. Maria Edin, 2003. \"State Capacity and Local Agent Control in China: CCP Cadre Management from a Township Perspective,\" The China Quarterly, No. 173 (March), pp.35-52. Tony Saich and Xuedong Yang, 2003. \"Innovation in China Local Governance: Open Recommendation and Selection\", Pacific Affairs 76:2 (Summer), pp.185-208. Lianjiang Li, 2002. \"The Politics of Introducing Direct Township Elections in China,\" The China Quarterly 171 (September): 704-23. Lianjiang Li, 2003. \"The Empowering Effect of Village Election in China\", Asian Survey 43:4, pp.648-662. Pan Wei, 2003. \"Toward a Consultative rule of Law Regime in China\", Journal of Contemporary China 12:34, pp.3-43", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (3858)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [5], "locations": ["Lee Shau Kee Building 514-5"], "instructors": ["Dr. LIU Chun, \n\rProfessor CHEN Xi"], "meetingDates": ["15/1", "22/1", "29/1", "5/2"]}}, "2021-22 Term 1": {"--LEC (3147)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [4], "locations": ["Wu Ho Man Yuen Bldg 408"], "instructors": ["Staff"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Essays": "40", "Essay test or exam": "30", "Others": "10", "Presentation": "20"}}, {"code": "5002", "title": "Hong Kong, Macao,Taiwan Politics In Comparative Perspectives", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc in Government and Politics (Greater China) and students in MSSc in General Education only.", "description": "This course examines the government and politics of Hong Kong, Macao and Taiwan from comparative perspectives. The wide ranging topics include their postcolonial political development; democratization: institutions, processes and participation; state-society relations; politics and interactions of the three regions with China, etc.", "outcome": "Knowledge outcomes:                   (A) Exposure to the critical political issues in Hong Kong, Macao and Taiwan.  (B) Basic understanding of the literatures, concepts and analytical approaches in this field. Skill outcomes:  (A) Ability to think critically.  (B) Ability to think creatively.  (C) Communication and interpersonal skills to work in a team.  (D) Presentation skills to convey political concepts and analysis.       ", "syllabus": "Hong Kong Late colonial situations and the setting up of postcolonial political systems Political system, political development and democratization State-society relations Political culture Relations with ChinaMacao Late colonial situations and the setting up of postcolonial political systems Political culture, state-society relations and political developmentTaiwan Postcolonial political development Democratization and Democratic institutions Identity and relations with mainland China", "required_readings": "Ma, Ngok, Political Development in Hong Kong: State, Political Society, and Civil Society (Hong Kong University Press, 2007)  Lo, Sonny Shiu-Hing, Political Change in Macao (Routledge, 2008).  Yee, Herbert S., Macau in Transition: From Colony to Autonomous Region (Palgrave, 2001).  Yoshida, Katutugu, Taiwan's Long Road to Democracy: Bitter Taste of Freedom, (Edward Elgar, 2009)  戴寶村,《臺灣政治史》（臺北：五南圖書, 2005）  Sing, Ming, Hong Kong's Tortuous Democratization: A Comparative Analysis (Routledge Curzon, 2004)  Fell, Dafydd, Party Politics in Taiwan: Party Change and the Democratic Evolution of Taiwan, 1991-2004 (Routledge, 2005)  Paolino, Philip and Meernik, James, Democratization in Taiwan: Challenges in Transformation (Ashgate, 2008)  Stephen Wing Kai Chiu and Tai Lok Lui eds., The Dynamics of Social Movement in Hong Kong (Hong Kong University Press, 2002)  Muthiah Alagappa ed. Civil Society and Political Change in Asia (Stanford University Press, 2007)  Ghai, Yash, Hong Kong’s New Constitutional Order(Hong Kong University Press, 1999)  Hsin-Huang Michael Hsiao and Cheng-yi Lin eds., Rise of China: Beijing's strategies and implications for the Asia-Pacific  (Routledge, 2009)", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (3567)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [2], "locations": ["Lee Shau Kee Building LT2"], "instructors": ["Dr. LEE Ka Kiu"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 2": {"--LEC (2073)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [4], "locations": ["Yasumoto Int'l Acad Park LT5"], "instructors": ["Dr. LEE Ka Kiu"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Essays": "40", "Essay test or exam": "30", "Others": "10", "Presentation": "20"}}, {"code": "5003", "title": "Greater China and the World", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc in Government and Politics (Greater China)", "description": "This course is designed to survey and analyze the rise of China and its role in the global system in multiple dimensions as well as its relations with the rest of the world. The lectures begin with the discussion of China’s rise in economic, political, diplomatic and military aspects. We will next examine China’s evolving attitude towards the outside world and its diplomatic relations with other countries and international organizations as well as its soft influence. We will assess the challenges that China faces in the era of globalization towards the end of the course.", "outcome": "(A) To have a deep understanding about the rise of China in multiple dimensions and its consequences (B) To acquire the ability to critically analyze international political economic affairs especially in relation to greater China (C) To cultivate the ability to clearly define research questions regarding specific political and/or economic issues and to conduct   rigorous independent research to answer the questions. ", "syllabus": "PART I. RISE OF CHINATopic 1 Is the Rise of China a Problem to the World Order?Topic 2 Theoretical PerspectivesTopic 3 China’s Economic RiseTopic 4 China’s Political RiseTopic 5 China’s Military RisePART II: CHANGING NORMS AND DIPLOMATIC RELATIONSTopic 6 Is China a Norm-Maker – China and the One Belt One RoadTopic 7 Great Power RelationsTopic 9 Natural AllyTopic 10 Middle Man: Hong Kong, Macau and TaiwanTopic 11 Socialization with or by International Organizations?PART III: CHINA AND GLOBALIZATION: CHALLENGES AND PROSPECTSTopic 12 Soft Power and Public DiplomacyTopic 13 Discrepancy of Chinese Foreign Policy", "required_readings": "Oded Shenkar, 2005, The Chinese Century  Susan Shirk, 2007, China: Fragile Superpower  Martin Jacque, 2009, When China Rules the World  Barry Naughton, 2005, in The Chinese Economy  Stefan Halper, 2010, The Beijing Consensus  Yong Deng, 2008, China’s Struggle for Status  Joshua Kurlantzick, 2007, Charm Offensive  Alastair Iain Johnston and Robert S. Ross eds., 2006, New Directions in the Study of China’s Foreign Policy  Shaun Breslin, “Power and production: rethinking China’s global economic role”,  Review of International Studies 31:4 (Oct 2005), pp. 735–753  Evan S. Medeiros and M. Taylor Fravel, “China’s New Diplomacy,” Foreign Affairs  82:6 (November/December 2003), pp. 22-25  Andrew Erickson, Lyle Goldstein & Carnes Lord, “China Sets Sail”, The American Interest Magazine  (May/June 2010), pp. 27-34  David Scott, “China’s Security-Military Challenges”, in ‘The Chinese Century’? pp. 28-50  Niall Ferguson, “What ‘Chimerica’ Hath Wrought,” The American Interest Magazine  (January/February 2009)  Elizabeth Economy and Adam Segal, “The G-2 Mirage”, Foreign Affairs, May/June 2009, pp. 14-23  Suisheng Zhao, “China's Approaches toward Regional Cooperation in East Asia: Motivations and  Calculations”, Journal of Contemporary China 20: 68 (2011), pp. 53-67  Lowell Dittmer, “China’s New Internationalism”, in Guoguang Wu and Helen Lansdowne eds.,  China Turns to Multinationalism: Foreign Policy and Regional Security, pp. 21-34  Graeme Lang and Cathy Hiu Wan Chan, “China's impact on forests in Southeast Asia,”  Journal of Contemporary Asia 36:2 (2006), pp. 167-194  Allen Carlson, “Moving beyond Sovereignty?” Journal of Contemporary China 20:68 (2011), pp. 89-102", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (3451)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [4], "locations": ["Yasumoto Int'l Acad Park LT8"], "instructors": ["Professor ZHAN Jing Vivian"], "meetingDates": ["10/9", "17/9", "24/9"]}}, "2021-22 Term 1": {"--LEC (1997)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [1], "locations": ["Yasumoto Int'l Acad Park LT4"], "instructors": ["Professor ZHAN Jing Vivian"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Essays": "40", "Essay test or exam": "30", "Others": "10", "Presentation": "20"}}, {"code": "5004", "title": "Public Policy And Administration In Greater China", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc in Government and Politics (Greater China)", "description": "The course offers critical examination and understanding to some of the most salient issues on public policy and administration in Mainland China, Hong Kong and Taiwan. A few selected public policies such as anti-corruption policy, personnel management system, higher educational policy, medical reform policy, policy on the neighborhood community, and local administrative reform, among many others, will be examined. A comparative approach will be used to locate all these issues within an international context to shed light on the uniqueness and complexities of the Chinese public policy and administration.", "outcome": "(A) To acquire basic understandings of the basic concepts, themes, hypotheses, and theoretical approaches to the study of public policies and administration. (B) To be able to apply these theories and concepts in Greater China context. (C) To be able to comprehend the complexity and the non-monolithic nature of public policy and administration in Greater China.", "syllabus": "Topic 1: Introduction, Requirements and the Nature and the Characteristics of the Public Administration & Public Policy in Greater ChinaTopic 2: Conceptual Foundations-What is comparative public policy?-Why do we study comparative public policy?-Globalization, regionalizatism and Public PolicyTopic 3: Comparative Anti-Corruption PolicyTopic 4: Comparative Higher EducationTopic 5: Comparative Ageing PoliciesTopic 6: Comparative Bureaucratic Systems and ReformTopic 7: Poverty IssuesTopic 8: Inequality ", "required_readings": "Chandler, J. A. (ed.), 2000. Comparative Public Administration . London: Routledge.  Dunn, William N., 2004 Public Policy Analysis. Upper Saddle River, N.J.: Pearson Hall.  Lane, Jan-Erik 2000. The Public Sector: Concepts, Models and Approaches. London; Thousand Oaks, Calif. : Sage Publications.  張文壽編，《中國行政管理體制改革─研究與思想》，北京：當代中國出版社，1994年  劉建軍，《單位中國》，天津：天津人民出版社，2000年  汪玉凱：《中國行政體制改革20年》中洲左籍出版社，1998年。  Yang, Rui., 2003. Third Delight: The Internationalization of Higher Education in China. New York & London: Routledge.  Lee, Hong Yung. 1991. From Revolutionary Cadres to Party Technocrats. Berkeley and Los Angeles: University of California Press.  Hamrin, Carol Lee and Suisheng Zhao. 1995. Decision-Making in Deng's China M. E. Sharpe, Inc.  Amsden, A. H. and W. Chu. 2003. Beyond Late Development: Taiwan's Upgrading Policies. MIT University Press.  Fell, D. 2011. Government and Politics in Taiwan. Routledge.  Scott, I. 2005. Public Administration in Hong Kong: Regime Change and its Impact on the Public Sector (Marshall Cavendish).  Scott I. 2010. The Public Sector in Hong Kong (Hong Kong: Hong Kong University Press).  Richards, D. & Smith, M. 2002. Governance and Public Policy in the UK, Oxford: Oxford University Press", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (2029)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [2], "locations": ["Lee Shau Kee Building LT2"], "instructors": ["Professor TSAO King Kwun"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}}, "2021-22 Term 1": {"--LEC (1710)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [5], "locations": ["Yasumoto Int'l Acad Park LT7"], "instructors": ["Professor TSAO King Kwun"], "meetingDates": ["10/9", "17/9", "24/9"]}}}, "assessments": {"Essays": "30", "Essay test or exam": "40", "Presentation": "30"}}, {"code": "5005", "title": "Methods In Social Science Research", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc in Government and Politics (Greater China)", "description": "This course introduces common methods used in social science research, with a special focus on quantitative methods. In particular, it will teach students practical tools to conduct causal analysis, using both observational and experimental data. These tools include basic descriptive statistics, multiple regression analysis, and the application of instrumental variables.", "outcome": "(1) To understand the basic concepts of social science research. (2) To be able to conduct basic social science research. (3) To be able to appreciate rigorous social science studies.", "syllabus": "Topic 1: Introduction: A User’s Perspective on Methodology                     Topic 2: The Logic of Scientific Research Topic 3: Designing Political Research   Topic 4: Natural Experiment: Overcoming Endogeneity Topic 5: Comparative Methods Topic 6: Qualitative Methods: Interviewing TechniquesTopic 7: Qualitative Methods: Discourse Analysis Topic 8: Quantitative Methods: Basic Concepts Topic 9: Quantitative Methods: Univariate Analysis, Selection of Observations and Selection BiasesTopic 10: Quantitative Analysis: Bivariate AnalysisTopic 11: Quantitative Analysis: Multivariate Analysis", "required_readings": "King, G., R. O. Keohane, and S. Verba (1994) Designing Social Inquiry. Princeton University Press.  Gerring, J. (2007). Case Study Research. Cambridge University Press.  Mendenhall, W., R. J. Beaver, and B. M. Beaver (2006) Probability and Statistics, 13th eds. Brooks/Cole Cengage Learning.  Morton, R. and K. C. Williams (2010). Experimental Political Science and the Study of Causality. Cambridge University Press.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (2333)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [1], "locations": ["Science Centre L2"], "instructors": ["Professor LI Lianjiang"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}, "2021-22 Term 1": {"--LEC (3237)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [2], "locations": ["Cheng Yu Tung Building LT1B"], "instructors": ["Dr. James Floyd DOWNES"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}, "assessments": {"Essays": "40", "Others": "20", "Presentation": "20", "Short answer test or exam": "20"}}, {"code": "5101", "title": "Political Economy And Business Environment In Greater China", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc in Government and Politics (Greater China)", "description": "This course applies theories and methods of contemporary political economy to important topics about business environment in Greater China. For pedagogical purposes, course content is organized by theme rather than geographycial location or time span. Specifically, I divide course content into six thematic fields. They are general legal system, protection of commercial activities,financial institutions, state-market relations, sustainable development, and defense industry base. All thematic fields further include sub-literatures that I am going to cover in each week.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5102", "title": "Politics of Transition And Greater China", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc in Government and Politics (Greater China)", "description": "This course will focus on the political economy of transition of former communist countries and reforming socialist countries, with Greater China situated in this context. It will examine the major political, economic, and social transformations of these countries, and discuss the major patterns of changes.", "outcome": "(A) A general understanding of the transformation of post-communist and reforming-socialist countries. (B) The ability to analyse Greater China's political economy and culture in the above context. (C) Mastery of the theoretical frameworks and issues related to A and B above.", "syllabus": "Part 1: Totalitarian and Authoritarian Systems. The Concept of Leninist One-party StatePart 2: Soviet Studies and China Studies on Establishment, Evolution and Reform in State Socialist Systems. The Concept of “Post-Totalitarian Society”Part 3: Attempts of Market Transitions in the Countries of the “Soviet Block”Part 4: Historical Dynamics of Market Reforms in the People’s Republic of ChinaPart 5: Market Reforms in Totalitarian and Authoritarian Systems: What is Common, What is Different?Part 6: Constellation of Systemic Actors in Totalitarian and Authoritarian Market Reforms Models. Reasons for Chronic Macro Economic Problems in Reformed State Socialism", "required_readings": "Minton F. Goldman, Revolution and Change in Central and Eastern Europe (M.E. Sharpe, 1997)  Karen Henderson and Neil Roberson, Post-Communist Politics: An Introduction (Prentice Hall, 1997).  Leslis Holmes, Post-Communism: An Introduction (Polity Press, 1997).  Anders Aslund, Building Capitalism: The Transformation of the Former Soviet Bloc (Cambridge University Press, 2002). Marie Lavigne, The Economics of Transition: From Socialist Economy to Market Economy (MacMillan, second edition, 1999). Joseph R. Blasi, Maya Kroumova, and Douglas Kruse, Kremlin Capitalism (Cornell University Press, 1997).  Thane Gustafson, Capitalism Russian-Style (Cambridge University Press, 1999).  Andrei Shleifer and Daniel Treisman, Without a Map (The MIT Press, 2000).  Shu-Yun Ma, Shareholding System Reform in China: Privatization by Groping for Stones (Edward Elgar, 2010).  Barry Naughton, The Chinese Economy: Transitions and Growth (The MIT Press, 2007).  Shahid Yusuf, Kaoru Nabeshima, and Dwight H. Perkins, Under New Ownership(The World Bank, 2006).  Carl E. Walter and Fraser J.T. Howie, Privatizing China: Inside China’s Stock Markets (John Wiley and Sons,2006). ", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (1608)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [6], "locations": ["Online Teaching"], "instructors": ["Professor QIN Hui"], "meetingDates": ["12/9", "19/9", "26/9", "3/10"]}}, "2021-22 Term 2": {"--LEC (3090)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [6], "locations": ["Wu Ho Man Yuen Bldg 407"], "instructors": ["Professor QIN Hui"], "meetingDates": ["15/1", "22/1", "29/1"]}}}, "assessments": {"Essays": "40", "Others": "20", "Presentation": "40"}}, {"code": "5103", "title": "Anti-Corruption In Comparative Perspective", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc in Government and Politics (Greater China)", "description": "This course presents an in-depth survey of best practices adopted by governments, non-governmental organizations (NGOs), and other stakeholders to eradicate corruption and promote transparency. The course reviews elements in public sector management commonly known as \"\"good governance,\"\" the causes and effects of corruption, and undertakes a comparative study of domestic and multilateral anti-corruption efforts.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5104", "title": "Taiwan In Comparative Perspective", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc in Government and Politics (Greater China)", "description": "This course introduces the history, society, politics, and economy of Taiwan. In particular, it will focus the dramatic economic and political transformations that Taiwan has experienced in the post-war era. It will also examine key issues confronting contemporary Taiwanese society, including identity politics, cross-strait relations, democratization and democratic consolidation, and economic restructuring.", "outcome": "(A) To gain a basic understanding of Taiwan's history and society. (B) To become familar with Taiwan's politics and major political players. (C) To understand the domestic and foreign affecting the Cross-Strait relations.", "syllabus": "Topic 1 From Authoritarianism to DemocracyTopic 2 Political Parties and Elections: Taiwan and Asian New DemocraciesTopic 3 Changing Identity Politics: Taiwan and Hong KongTopic 4 Democratic Transformation and Consolidation: Taiwan and South KoreaTopic 5 Economic Miracle: The Underlying FactorsTopic 6 Developmental State and Economic Transformation in East AsiaTopic 7 Economic Integration within Greater China: Opportunities and Challenges Topic 8 Ethnic Groups and Inequalities: Between Mainlanders and IslandersTopic 9 Social Stratification and Mobility: Taiwan and Hong KongTopic 10 Sunflower Movement and Umbrella Movement: Taiwan and Hong KongTopic 11 China Factor and its ImplicationTopic 12 Opportunities and Challenges", "required_readings": "Roy, D. (2003) Taiwan: A Political History. Cornell University Press.  Rigger, S. (2001) From Opposition to Power: Taiwan's Democratic Progressive Party. Lynne Rienner Publishers.  Copper, J. F. (2008) Taiwan: Nation-State or Province? Westview Press.  Rubinstein, M. (2006) Taiwan: A New History. M. E. Sharpe.  Tucker, N. B. (2011) Straint Talk: United States - Taiwan Relations and the Crisis with China. Harvard University Press.  Amsden, A. H. and W. Chu (2003) Beyond Late Development: Taiwan's Upgrading Policies. MIT University Press.  Wu, Y. (2005) A Political Explanation of Economic Growth: State Survival, Bureaucratic Politics, and Private Enterprises  in the Making of Taiwan's Economy, 1950 - 1985. Harvard University Asia Center.  Wachman, A. (2007) Why Taiwan? Geostrategic Rationales for China's Territorial Integrity. Stanford University Press.  Goldstein, S. and J. Chang (2008). Presidential Politics in Taiwan: The Administration of Chen Shui-bian. Eastbridge.  Fell, D. (2005) Party Politics in Taiwan: Party Change and Democratic Evolution of Taiwan, 1991 - 2004. Routledge.  Fell, D. (2011) Government and Politics in Taiwan. Routledge.  Kastner, S. (2009) Political Conflict and Economic Interdependence Across the Taiwan Strait and Beyond. Stanford University Press.  陳佳宏 (2006) 台灣獨立運動史，玉山社。  Chin, K. L. (2003). Heijin: Organized Crime, Business, and Politics in Taiwan. M. E. Sharpe.  許世楷 (2006) 日本統治下的台灣，玉山社。", "recommended_readings": "", "terms": {"2021-22 Term 2": {"--LEC (3176)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [2], "locations": ["Yasumoto Int'l Acad Park 502"], "instructors": ["Staff"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Essays": "50", "Essay test or exam": "30", "Presentation": "20"}}, {"code": "5105", "title": "Public Governance And Civil Service in Hong Kong", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc in Government and Politics (Greater China)", "description": "This course introduces the theory and practice of public governance and civil service in Hong Kong. Public governance can be analysed in various ways. This course will concentrate on the external environment, including the historical, political, economic, institutional and structural factors, interact with micro-level factors to shape policy and administration in Hong Kong. It will also examine how the government responds to external challenges, thereby resulting in change in public policy and governance system. ", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5106", "title": "State-Society Relations In Greater China", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc in Government and Politics (Greater China)", "description": "This course is designed to expose graduate students to major debates over state-society relationships in the study of contemporary Greater China's politics, such as \"\"the reach of the state,\"\" citizenship and rights, civil society and democratization.The course also encourages students to consider how well the state-society paradigm works in Greater China studies.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5107", "title": "Environmental Politics of Greater China", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc in Government and Politics (Greater China)", "description": "This course is designed as both an introduction of environmental politics and a sectoral analysis of general politics in the context of contemporary Greater China. On the one hand, it introduces environmental governance and politics in general in the mainland, Hong Kong and Taiwan. On the other hand, it uses the case of environmental politics to teach students about political changes in the three places in the past three decades.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5108", "title": "Political Thought In Contemporary China", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc in Government and Politics (Greater China)", "description": "This course examines the development of contemporary Chinese political thought from a historical and philosophical perspective. It introduces the social and cultural background that political thought arises, and evaluates the arguments of different schools.These schools include conservatism, neo-Confucianism, liberalism, Marxism, nationalism and different forms of utopianism. The focus will be on how they respond to the challenge of modernity with different proposals.", "outcome": "(A) To understand the major debates of modern Chinese political thought in a historical context.   (B) To understand important ideologies central to political development of modern China.   (C) To be able to apply ideas and theories to make sense of Chinese politics.   (D) To cultivate intellectual interest in theoretical thinking.  ", "syllabus": "(This course will be conducted in Putonghua and only Chinese version of syllabus is available.) 中國近代史及思想史發展    從傳統到現代 港台新儒家 儒家、德性與民主 反思政治儒學 胡適與中國早期自由主義 新左派vs.自由派                  自由主義左翼 中國施特勞斯學派               民主社會主義 激進與保守論爭", "required_readings": "Bell, Daniel ed. (2008). Confucian Political Ethics (Princeton: Princeton University Press)  Fung, Edmund S.K. (2010). The Intellectual Foundations of Chinese Modernity (Cambridge: Cambridge University Press)  Hsiao, Kung-Chiao (1979). A History of Chinese Political Thought, trans. By F.W. Mote (Princeton: Princeton University Press)  Lin, Yü-sheng (1979). The Crisis of Chinese Consciousness : Radical Antitraditionalism in the May Fourth Era  (Madison :U of Wisconsin Press)  Schwartz, Benjamin (1964). In Search of Wealth and Power: Yen Fu and the West (Cambridge : Harvard University Press)  Spence, Jonathan (1990). The Search for Modern China (New York: W.W.Norton)  Tan, Chester C. (1971). Chinese Political Thought in Twentieth Century(New York: Doubleday)  Zhao, Shui-Sheng (2004). A Nation-State by Construction: Dynamics of Modern Chinese Nationalism  (Stanford: Stanford University Press)  金觀濤、劉青峰 (2000).《中國現代思想的起源》，第一卷（香港：中文大學出版社）  丁守和 編 (1999). 《中國近代啟蒙思潮》，三卷　（北京：社會科學文獻出版社）  李澤厚 (1990).《中國現代思想史論》（台北：風雲時代）  牟宗三 (1991). 《政道與治道》（臺北：學生書局）  徐中約 (2001).《中國近代史》（香港：中文大學出版社）  余英時 (2002). 《現代儒學的回顧與展望》（北京：三聯書店）.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (1280)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [1], "locations": ["Wu Ho Man Yuen Bldg 403"], "instructors": ["Professor CHOW Po Chung"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}}, "2021-22 Term 1": {"--LEC (4293)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [6], "locations": ["Wu Ho Man Yuen Bldg 304"], "instructors": ["Professor CHOW Po Chung"], "meetingDates": ["11/9", "18/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11", "4/12"]}}}, "assessments": {"Essays": "40", "Essay test or exam": "30", "Others": "10", "Presentation": "20"}}, {"code": "5109", "title": "Human Rights And Constitutionalism In Greater China", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc in Government and Politics (Greater China)\nFor students in MSSc in Public Policy", "description": "The course offers students an opportunity to explore the important themes of human rights and constitutionalism in Greater China. As the only region without a regional human rights regime, Asia has relied more completely on domestic constitutionalism and legislative enactment to articulate and implement human rights commitments. This has often made the human rights debate a matter of local politics. In this respect, China has had a noteworthy engagement with some of the central themes in the human rights debate, relating human rights to culture, to the political economy of development, democratization, international relations, and civil society. The course will explore these rich Chinese themes and efforts.*Teachers will have the freedom to provide detailed descriptors for each individual assessment of the course when they offer it.", "outcome": "(A) To introduce students to the theory and practice of constitutionalism and human rights; (B) To explore Chinese debates about human rights, the rule of law and democracy; (C) To explore the role and challenges facing international and local civil society activists in China;  (D) To enhance the student critical facility in applying general ideas and principles to specific problems in achieving constitutional  and human rights objectives; and  (E) To assist the student’s capacity in research, writing, presentation and critical analysis.", "syllabus": "What Are Human Rights? Are Human Rights ‘Western’ Concepts? Human Rights, Asian Values, and China Human Rights and Foreign Policy Human Rights Regimes Humanitarian Intervention Constitutionalism and the Rule of Law in Greater China Democracy and Deliberation in China Group Rights and Regional Autonomy: The Case of Tibet Human Rights in China", "required_readings": "1. What Are Human Rights?#Sabine Carey, Mark Gibney, and Steven Poe, The Politics of Human Rights: The Quest for Dignity (Cambridge University Press 2010), ch. 1.*Jack Donnelly, Universal Human Rights: In Theory and Practice 2nd Edition (Cornel University Press, 2003), ch. 1.Chris Brown, ‘Universal Human Rights: A Critique’, The International Journal of Human Rights, 1:2 (1997) 41-65.John O. Nelson, ‘Against Human Rights’ Philosophy 65 (1990) 341-8.Raymond Guess, History and Illusion in Politics (Cambridge University Press 2001), pp. 138-46. Michael Freeman, Human Rights 2nd Edition (Polity 2010), introduction.Andrew Clapham, Human Rights: A Very Short Introduction (Oxford University Press, 2007), chapter 1.James Griffin, On Human Rights (Oxford University Press, 2008) chapter 1.Michael Perry, The Idea of Human Rights (Oxford University, Press 2000), introduction.James Nickel, Making Sense of Human Rights (University of California Press, 1987), ch. 1-2.Maurice Cranston, ‘Are There Any Human Rights?’ Daedalus, 112:4 (1983) 1-17.Nicholas Wolterstorff, Justice: Rights and Wrongs (Princeton University Press, 2008), ch. 14.Geoffrey Robertson, Crimes Against Humanity: The Struggle for Global Justice 2nd edition (Penguin 2002), ch. 1.2. Are Human Rights ‘Western’ Concepts?#Jack Donnelly, Universal Human Rights: In Theory and Practice 2nd Edition (Cornel University Press, 2003), ch. 5 (see also ch. 4). *Joshua Cohen, ‘Minimalism About Human Rights: The Best We Can Hope For?,’ The Journal of Political Philosophy, 12, (2004) 190-213, especially 202-10.Daniel A. Bell, East Meets West: Human Rights and Democracy in East Asia (Princeton University Press, 2000), ch. 2.Jack Donnelly ‘Human Rights and Human Dignity: An Analytic Critique of Non-Western Human Rights Conceptions’ American Political Science Review, 76:2 (1982) 433-49.Michael Ignatieff, Human Rights as Politics and Idolatry (Princeton University Press 2001) pp. 53-98.Tony Evans, The Politics of Human Rights: A Global Perspective 2nd Edition, (Pluto Press 2005), chapter 1.Richard Falk, Human Rights Horizons: The Pursuit of Justice in a Globalizing World, (Routledge 2000), ch. 5.James Griffin, On Human Rights (Oxford University Press 2008), chapter 7.Sally Merry Human Rights and Gender Violence: Translating International Law into Local Justice (University of Chicago Press, 2006), chapters.1-2.Micheline Ishay, The History of Human Rights: From Ancient Times to the Globalization Era (University of California Press, 2004), introduction.Bernard Williams, In the Beginning was the Deed: Realism and Moralism in Political Argument (Princeton University Press 2005), chapter 6.David Kennedy, The Dark Sides of Virtue: Reassessing International Humanitarianism (Princeton University Press 2004), ch. 1 (at: http://press.princeton.edu/chapters/s7711.pdf)  Sabine Carey, Mark Gibney, and Steven Poe, The Politics of Human Rights: The Quest for Dignity (Cambridge University Press 2010), ch. 1.Michael Davis, ‘The Political Economy and Culture of Human Rights in Asia’, in S. Joseph and A. McBeth (eds.), Research Handbook on International Human Rights Law, (Edward Elgar, 2010).Joseph Chan, ‘A Confucian Perspective on Human Rights for Contemporary China’, in J. R. Bauer & D. A. Bell (eds.) The East Asian Challenge for Human Rights, (Cambridge: CUP 1999).Executive Board of the American Anthropological Association, ‘Statement on Human Rights’, American Anthropologist, NS 49 (1947) 539-43.American Anthropological Association, ‘Declaration on Anthropology and Human Rights’ (1999) http://www.aaanet.org/about/Policies/statements/Declaration-on-Anthropology-and-Human-Rights.cfm (accessed 1/10/2013).  3. Human Rights, Asian Values, and China #Chan, Joseph (1997) ‘Hong Kong, Singapore, and Asian Values: An Alternative View’ Journal of Democracy 8:2 35-48. *Daniel A. Bell and Joseph H. Carens, ‘The Ethical Dilemmas of International Human Rights and Humanitarian NGOs: Reflections on a Dialogue between Practitioners and Theorists’, Human Rights Quarterly, Vol. 26, No. 2 (May, 2004), pp. 300-29.Daniel A. Bell, Beyond Liberal Democracy: Political Thinking for an East Asian Context (Princeton University Press, 2006), ch. 3-4.Daniel A. Bell, East Meets West: Human Rights and Democracy in East Asia (Princeton University Press, 2000), ch. 1-3.Jack Donnelly, Universal Human Rights: In Theory and Practice 2nd Edition (Cornel University Press, 2003), ch. 7.Michael Davis, ‘Constitutionalism and Political Culture: The Debate over Human Rights and Asian Values, Harvard Human Rights Journal, 11: (1998) 109-47.Stephen Angle, Human Rights and Chinese Thought: A Cross-Cultural Inquiry (Cambridge University Press, 2002), ch. 1 (nb. The bibliography contains an extensive list of Chinese language texts related to human rights).Stephen Angle, ‘Decent Democratic Centralism’, Political Theory 33:4 (2005).Stephen Angle, ‘Human Rights and Harmony’, Human Rights Quarterly 30:1 (2008).Joanne R. Bauer and Daniel A. Bell, (eds.) The East Asian Challenge for Human Rights, (Cambridge University Press, 1999).Birgit Lindsnæs, Hans-Otto Sano, & Hatla Thelle, ‘Human Rights in Action: Supporting Human Rights Work in Authoritarian Countries’, in Daniel A. Bell & Jean-Marc Coicaud (eds.) Ethics in Action: The Ethical Challenges of International Human Rights Nongovernmental Organizations, (Cambridge University Press, 2007).Sun Zhe, ‘Normative compliance and hard bargaining: INGOs and China's response to international human rights criticism’, in Daniel A. Bell and Jean-Marc Coicaud (eds.) Ethics in Action: The Ethical Challenges of International Human Rights Nongovernmental Organizations, (Cambridge University Press, 2007).Roger Ames, ‘Continuing the Conversation on Chinese Human Rights’, Ethics and International Affairs 11 (1997) 177-205.Jack Donnelly, ‘Conversing with Straw Men while Ignoring Dictators: A Reply to Roger Ames’. Ethics & International Affairs 11 (1997) 207–213.Amartya Sen, ‘East and West: The Reach of Reason’, New York Review of Books, XLVII, 12, 20 July.Amartya Sen, ‘Human Rights and Asian Values’ Sixteenth Annual Morgenthau Memorial Lecture on Ethics and Foreign Policy, (1997), available at:http://www.cceia.org/resources/publications/morgenthau/254.htmlJoseph Chan, ‘The Asian Challenge to Universal Human Rights: A Philosophical Appraisal’, in James T. H., Tang, (ed.) Human Rights and International Relations in the Asia-Pacific Region. (London: Pinter, 1995).Randall Peerenboom, ‘What’s Wrong with Chinese Rights? Toward a Theory of Rights with Chinese Characteristics’, Harvard Human Rights Journal 6 (1993) 29–57.Henry S. Rowen, ‘When Will the Chinese People be Free?’ Journal of Democracy, 18:3, (2007) 38-64 (including comments by Minxin Pei and Dali Yang).Thomas Carothers, ‘How Democracies Emerge: the ‘Sequencing’ Fallacy,’ Journal of Democracy, 18:1 (2007).Edward D. Mansfield and Jack Snyder, ‘The Sequencing “Fallacy”’, Journal of Democracy, 18:3, (2007). Minxin Pei, China’s Trapped Transition, The Limits of Developmental Autocracy, (Harvard University Press, 2006). Ann E. Kent, Between Freedom and Subsistence: China and Human Rights (Hong Kong: Oxford University Press, 1992).4. Human Rights and Foreign Policy#Erin Kelly, ‘Human Rights as Foreign Policy Imperatives’ In D. Chatterjee (ed.) The Ethics of Assistance: Morality and the Distant Needy. (Cambridge University Press, 2004), pp. 177-192.*Hans J. Morgenthau, ‘Human Rights and Foreign Policy’ CRIA First Distinguished Lecture on Morality and Foreign Policy, (1979) available at:http://www.cceia.org/resources/publications/1979_lecture_by_morgenthau/index.html*Jack Donnelly, Universal Human Rights: In Theory and Practice 2nd Edition (Cornel University Press, 2003), ch. 9.Michael Ignatieff, Human Rights as Politics and Idolatry (Princeton University Press 2001), pp. 3-52.Sabine Carey, Mark Gibney, and Steven Poe, The Politics of Human Rights: The Quest for Dignity (Cambridge University Press 2010), ch. 2.David P. Forsythe, Human Rights in International Relations 2nd Edition (Cambridge University Press 2006), ch. 2, 6.Joshua Cohen, ‘Minimalism About Human Rights: The Best We Can Hope For?,’ The Journal of Political Philosophy, 12, (2004), 190-213.Chris Brown, Sovereignty, Rights and Justice: International Political Theory Today, (Polity, 2002), chapters 7, 10.Henry Shue, Basic Rights: Subsistence, Affluence, and U.S. Foreign Policy, Second Edition. (Princeton University Press, 1996), ch. 1.Onora O’Neill, Bounds of Justice. (Cambridge University Press, 2000), ch. 7. John Rawls, The Law of Peoples (Harvard University Press, 1999), part II.Andrew Kuper, ‘Rawlsian Global Justice: Beyond The Law of Peoples to a Cosmopolitan Law of Peoples’ Political Theory, 28, (2000) 640-674.Charles Beitz, ‘Human Rights as a Common Concern’, American Political Science Review 95 (2001), pp. 269-282.Charles Beitz, The Idea of Human Rights (Oxford University Press, 2009), ch. 6.Simon Caney, Justice Beyond Borders: A Global Political Theory. (Oxford University Press, 2005), chapter 3.Peter R. Baehr and Monique Castermans-Holleman, The Role of Human Rights in Foreign Policy 3rd Edition (Palgrave-Macmillan, 2004), ch.1-4.Philip Alston, ‘Conjuring Up New Human Rights: A Proposal for Quality Control’, American Journal of International Law, 78 (1984) 607-21.Stanley Hoffman, ‘Reaching for the Most Difficult: Human Rights as a Foreign Policy Goal’, Daedalus, 112:4 (1983) 93-110. James Griffin, On Human Rights (Oxford University Press 2008) ch. 11.5. Human Rights Regimes#Jack Donnelly, Universal Human Rights: In Theory and Practice 2nd Edition (Cornel University Press, 2003), ch. 8 (ch. 9-10 are also relevant) AND/OR Jack Donnelly, ‘International Human Rights: A Regime Analysis’, International Organization 40 (1986) 599-642.*James W. Nickel, ‘Is Today’s International Human Rights System a Global Governance Regime?’ Journal of Ethics 6 (2009) 353-71.Chris Brown, Sovereignty, Rights and Justice: International Political Theory Today, (Polity, 2002) ch. 7.Richard Falk, Human Rights Horizons: The Pursuit of Justice in a Globalizing World, (Routledge 2000), ch. 2-4.Rosemary Foot, Rights Beyond Borders: The Global Community and the Struggle for Human Rights in China (Oxford University Press, 2000), ch. 2. Charles Beitz, The Idea of Human Rights (Oxford University Press, 2009), ch. 2.David P. Forsythe, Human Rights in International Relations 2nd Edition (Cambridge University Press 2006), ch. 3, 5, 7.Jan Herman Burgers, ‘The Road to San Francisco: The Revival of the Human Rights Idea in the Twentieth Century’, Human Rights Quarterly, 14 (1992) 447-77.Susan Waltz, ‘Universalizing Human Rights: The Role of Small States in the Construction of the Universal Declaration of Human Rights’, Human Rights Quarterly, 23 (2001) 44-72.   Mary Ann Glendon, A World Made New: Eleanor Roosevelt and the Universal Declaration of Human Rights (Random House, 2001), especially ch. 10.Eleanor Roosevelt, ‘The Promise of Human Rights’, Foreign Affairs, 26 (1948) 470-77.Paul Gordon Lauren, The Evolution of International Human Rights: Visions Seen 3rd Edition (University of Pennsylvania Press, 2011), ch. 7.Geoffrey Best, ‘Justice, International Relations and Human Rights’, International Affairs, 71 (1995) 775-99.Philip Alston, ‘Reconceiving the U.N. Human Rights Regime: Challenges Confronting the New U.N. Human Rights Council’, Melbourne Journal of International Law, 7 (2006) 185-224.Steven Greer, The European Convention on Human Rights: Achievements, Problems, and Prospects (Cambridge University Press, 2006).Andrew Moravcsik ‘The Origins of Human Rights Regimes: Democratic Delegation in Postwar Europe’, International Organization, 54 (2000) 217-52. Peter R. Baehr and Monique Castermans-Holleman, The Role of Human Rights in Foreign Policy 3rd Edition (Palgrave-Macmillan, 2004), ch. 5-6.Emilie M. Hafner-Burton and Kiyoteru Tsutsui, ‘Human Rights in a Globalizing World: The Paradox of Empty Promises’, American Journal of Political Science 110 (2005) 1373-411.Sidney Tarrow, The New Transnational Activism (Cambridge University Press 2005), ch. 10.Stephen Krasner, ‘Structural Causes and Regime Consequences: Regimes as Intervening Variables’, International Organization 36 (1982) 185-206.Robert Keohane, ‘The Demand for International Regimes’, International Organization 36 (1982) 325-55.Geoffrey Robertson, Crimes Against Humanity: The Struggle for Global Justice 2nd edition (Penguin 2002), ch. 2-3.Antonio Cassese, International Law (Oxford University Press 2001), ch. 16.Henry J. Steiner and Philip Alston (eds.), International Human Rights in Context, Law, Politics, Morals 3rd edition (Oxford: Oxford University Press, 2008), pp. 1420-34 (on NGOs – see table of contents for other sections and chapters relevant for human rights enforcement).  6. Humanitarian Intervention#Nicholas Wheeler Saving Strangers: Humanitarian Intervention in International Society (Oxford University Press, 2000), ch. 1.* Alex J. Bellamy ‘The Responsibility to Protect—Five Years On’, Ethics & International Affairs, 24:2 (2010) 143-69.Jack Donnelly, Universal Human Rights: In Theory and Practice 2nd Edition (Cornel University Press, 2003), ch. 14.Sabine Carey, Mark Gibney, and Steven Poe, The Politics of Human Rights: The Quest for Dignity (Cambridge University Press 2010), ch. 6.D. Chatterjee and D. Scheid (eds.) Ethics and Foreign Intervention (Cambridge University Press, 2005).J. L. Holzgrefe and R. O. Keohane (eds.) Humanitarian Intervention: Ethical, Legal, and Political Dilemmas (Cambridge University Press, 2005).Danielle Archibugi, ‘Cosmopolitan Guidelines for Humanitarian Intervention’, Alternatives: Global, Local, Political, (2004), 29:1, pp. 1-22.Danielle Archibugi (ed.), Debating Cosmopolitics (Verso 2003) chapters 1-4.Simon Caney, Justice Beyond Borders (Oxford University Press, 2005), ch. 7.Daniel Moellendorf, Cosmopolitan Justice (Boulder, Col.: Westview Press, 2002), Ch. 5.Chris Brown, Sovereignty, Rights and Justice: International Political Theory Today, (Polity, 2002) ch. 8.Mary Kaldor New and Old Wars: Organized Violence in a Global Era: 2nd edition, (Polity, 2001), ch. 6, 7.Richard Falk, Achieving Human Rights, (Routledge, 2009) ch. 11.David Chandler, From Kosovo to Kabul: Human Rights and International Intervention (Pluto Press 2002).D. Zolo, Invoking Humanity: War, Law and Global Order. (Continuum 2002).ICISS ‘The Responsibility to Protect: Report of the International Commission on Intervention and State Sovereignty’ at http://www.iciss.ca/report-en.asp.Gareth Evans, The Responsibility to Protect: Ending Mass Atrocity Crimes Once and For All (Brookings Institute Press, 2008).Alex J. Bellamy ‘Whither the Responsibility to Protect? Humanitarian Intervention and the 2005 World Summit’, Ethics & International Affairs, 20:2 (2006) 143-69.Edward C. Luck, ‘The Responsibility to Protect: Growing Pains or Early Promise?’ Ethics & International Affairs, 24:4 (2010) 349–365.Geoffrey Robertson, Crimes Against Humanity: The Struggle for Global Justice 2nd edition (Penguin 2002), ch. 11.7. Constitutionalism and the Rule of Law in Greater China#Luoji Guo, ‘A Human Rights Critique of the Chinese Legal System’, Harvard Human Rights Journal, 9:1 (1996), pp.1-14.*Wei Pan, ‘Toward a Consultative Rule of Law Regime in China’, in Zhao Suisheng ed. (2006) Debating Political Reform in China: Rule of Law vs. Democratization, Armonk, N.Y.: M.E. Sharpe Inc.John Rawls, A Theory of Justice (Oxford University Press 1972) sections 36 and 38.Tom Ginsburg, Judicial Review in New Democracies, Constitutional Courts in Asian Cases (Cambridge: Cambridge University Press, 2003) ch. 1-3.Rod Hague and Martin Harrop, Comparative Government and Politics: An Introduction (Basingstoke: Palgrave, 2007), ch. 13.Alan R. Ball & B. Guy Peters, Modern Politics and Government, 6th edition (Basingstoke: Palgrave, 2005), ch. 12.Albert Weale, Democracy (Basingstoke: Palgrave, 1999), ch. 9.Jeremy Waldron, ‘Judicial Review and the Conditions of Democracy’, The Journal of Political Philosophy, 6:1 (1998), pp. 335-355.Yash Ghai, Hong Kong’s New Constitutional Order: The Resumption of Chinese Sovereignty and the Basic Law (Hong Kong: Hong Kong University Press, 1997), pp.138-151.Alexander Bickel, The Least Dangerous Branch, The Supreme Court at the Bar of Politics, 2nd Edition (New Haven: Yale University Press, 1986) ch. 1 and 4.Richard Bellamy, Political Constitutionalism: A Republican Defence of the Constitutionality of Democracy (Cambridge: Cambridge Univ. Press, 2007). Mauro Cappelletti, Judicial Review in the Contemporary World (Indianapolis: The Bobbs –Merrill Company, 1971).Ran Hirschl, Towards Juristocracy, The Origins and Consequences of the New Constitutionalism (Cambridge: Harvard University Press, 2004).Randall Peerenboom, ed., Asian Discourses of Rule of Law: Theories and Implementation of Rule of Law in Twelve Asian Countries, France and the U.S. (New York: Routledge, 2004).Fareed Zakaria, The Future of Freedom, Illiberal Democracy at Home and Abroad (New York: W.W. Norton and Company, 2003).8. Democracy and Deliberation in China# Baogang He and Mark Warren, ‘Authoritarian Deliberation: The Deliberative Turn in Chinese Political Development’, Perspectives on Politics, 9 (2011), pp. 269-289  *William Smith, ‘Deliberation without Democracy? Reflections on Habermas, Mini-Publics and China’, in T. Bailey (ed.) Deprovincializing Habermas: Global Perspectives, (London: Routledge, 2013), pp. 96-114.    James S. Fishkin, Baogang He, Robert C. Luskin and Alice Siu, ‘Deliberative Polling in an Unlikely Place: Deliberative Polling in China’, British Journal of Political Science, 40(2): 435-448.Baogang He, ‘Deliberative Culture and Politics: The Persistence of Authoritarian Deliberation in China’, Political Theory, November (2013), online first (available via journal website).Baogang He, ‘How can deliberative institutions be sustainable in China?’, in Zheng Yongnian, and Joseph Fewsmith, (eds), China's opening society : the non-state sector and governance, (Routledge, 2008), pp. 185-195.Steve Hess, ‘Deliberative Institutions as Mechanisms for Managing Social Unrest: The Case of the 2008 Chongqing Taxi Strike’, China: An International Journal 7: (2009), pp. 336-352.Stephen C. Angle, ‘Decent Democratic Centralism’, Political Theory, 33, (2005) pp. 518-46.Ethan Lieb and Baogang He (eds.) The Search for Deliberative Democracy in China, (New York: Palgrave Macmillan 2006).John Dryzek, Foundation and Frontiers of Deliberative Governance, (Oxford University Press, 2010), ch. 7.Amy Gutmann & Dennis Thompson, Why Deliberative Democracy? (Princeton University Press, 2004), Ch. 1.Robert E. Goodin, and John S. Dryzek, “Deliberative Impacts: The Macro-Political Uptake of Mini-Publics,” Politics & Society 34:2 (2006), pp.219-44.Daniel A. Bell Beyond Liberal Democracy: Political Thinking for an East Asian Context, (Princeton University Press 2006) Ch. 6.James S. Fishkin, ‘The Nation in a Room: Turning Public Opinion into Policy’, The Boston Review, March/April 2006.Archon Fung, Empowered Participation: Reinventing Urban Democracy (Princeton UP, 2004)Archon Fung, “Recipes for public spheres: Eight institutional design choices and their consequences,” The Journal of Political Philosophy 11, 3 (2003): 338-367.Mark B. Brown, “Citizen panels and the concept of representation,” The Journal of Political Philosophy 14, 2 (2006): 203-225.Stephen Mark, “Citizens as representatives: Bridging the democratic theory divides,” Politics and Policy 32, 1 (2004): 118-135. Graham Smith and Corinne Wales, “Citizens’ juries and deliberative democracy,” Political Studies 48 (2000): 51-65.Robert Luskin, James Fishkin, and Roger Jowell, “Considered Opinions: Deliberative Polling in Britain,” British Journal of Political Science 32 (2002): 455-487. James Fishkin, The Voice of the People: Public Opinion and Democracy, 2nd edition (Yale University Press, 1997), pp. 161-203.John Parkinson, Deliberating in the Real World: Problems of Legitimacy in Deliberative Democracy (Oxford University Press, 2006), Chs. 1, 2, and 7.9. Group Rights and Regional Autonomy: The Case of Tibet#Michael Davis, ‘Establishing a Workable Autonomy in Tibet’, Human Rights Quarterly, 30 (2008) 227-58.* Baogang He, ‘The Dalai Lama's autonomy proposal: a one-sided wish?’ in Barry Sautman & June Teufel Dreyer (eds.) Contemporary Tibet: Politics, Society and Development in a Disputed Region, (M.E. Sharpe, 2006).Jack Donnelly, Universal Human Rights: In Theory and Practice 2nd Edition, (Cornel University Press, 2003), ch. 12.Geoffrey Robertson, Crimes Against Humanity: The Struggle for Global Justice 2nd edition (Penguin 2002), pp. 159-67.Warren Smith, China’s Policy on Tibetan Autonomy (East-West Center Washington Working Papers, No. 2, 2004), available at: http://eastwestcenter.org/fileadmin/stored/pdfs/EWCWwp002.pdfRichard Falk, Human Rights Horizons: The Pursuit of Justice in a Globalizing World, (Routledge 2000), ch. 6.John Charvet & Elisa Kaczynska-Nay, The Liberal Project and Human Rights: The Theory and Practice of a New World Order, (Cambridge University Press, 2008), ch. 5.Roland Burke, Decolonization and the Evolution of International Human Rights, (University of Pennsylvania Press, 2010), ch. 2.Roland Burke, ‘From Individual Rights to National Development: The First UN International Conference on Human Rights, Tehran 1968’, Journal of World History 19: 3 (2008): 275-296.Roland Burke, ‘The Compelling Dialogue of Freedom: Human Rights at the 1955 Bandung Conference’. Human Rights Quarterly 28: 4 (2006): 947-965.Barry Sautman and June Teufel Dreyer, eds., Contemporary Tibet: Politics, Development and Society in a Disputed Region (Armonk, N.Y.: M.E. Sharpe, Inc, 2006).Hurst Hannum, Autonomy, Sovereignty and Self-determination, The Accommodation of Conflicting Rights (1996), part one, especially ch. 6.Will Kymlicka, Multicultural Citizenship: A Liberal Theory of Minority Rights, (Oxford University Press, 1995), ch. 1David Miller, Citizenship and National Identity, (Polity Press, 2000), ch. 2 and 4.  ", "recommended_readings": "Alexander Bickel, The Least Dangerous Branch, The Supreme Court at the Bar of Politics, 2nd Edition (Yale University Press, 1986)Mauro Cappelletti, Judicial Review in the Contemporary World (Indianapolis: The Bobbs –Merrill Company, 1971)Tom Ginsburg, Judicial Review in New Democracies, Constitutional Courts in Asian Cases (Cambridge:Cambridge University Press, 2003)Charles Beitz, The Idea of Human Rights, (Oxford: Oxford University Press, 2009)Michael Ignatieff, Human Rights as Politics and Idolatry (Princeton: Princeton University Press,, 2001)Joanne R. Bauer and Daniel A. Bell, eds., The East Asian Challenge for Human Rights (New York: Cambridge University Press, 1999)Daniel A. Bell Beyond Liberal Democracy: Political Thinking for an East Asian Context, (Princeton: Princeton University Press 2006)Ethan Lieb and Baogang He (eds.) The Search for Deliberative Democracy in China, (New York: Palgrave Macmillan 2006)Margaret E. Keck and Kathryn Sikkink, Activists Beyond Borders (Cornell: Cornell University Press, 1998)Asian Human Rights Commission, The State of Human Rights in Eleven Asian Nations, 2006 (Hong Kong: Asian Human RightsCommission, 2007)", "terms": {"2020-21 Term 2": {"--LEC (2888)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 304"], "instructors": ["Miss TANG Tin Wai Tina, \n\rProfessor William James Clark SMITH"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}}, "assessments": {"Essay test or exam": "70", "Presentation": "30"}}, {"code": "5110", "title": "Selected Topic in Government and Politics of Greater China (I)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc in Government and Politics (Greater China)", "description": "This course conducts graduate level studies on some important topics in government and politics of Greater China. The topics may include issues such as electoral studies, inter-governmental relations, contentious politics, and gender and politics. The focus of the course may vary from year to year according to the area of expertise of the instructor and the interests of the class.", "outcome": "1. A broad knowledge of Greater China, and the ability to comment on Chinese government and politics for both specialist and   general audiences.  2. Awareness of disciplinary thinking, concepts, terminology and methodology.  3. The ability to carry out independent and academic-quality research. ", "syllabus": "This course conducts graduate level studies on some important topics in government and politics of Greater China. The topics may include issues such as electoral studies, inter-governmental relations, contentious politics, and gender and politics. The focus of the course may vary from year to year according to the area of expertise of the instructor and the interests of the class.", "required_readings": "Immanuel Hsü, The Rise of Modern China, Oxford UP, 2000, chap. 6, 10 and 16.Gao Hua, How the Red Sun Rose: The Origin and Development of the Yan’an Rectification Movement, 1930-1945, chapter 11, sections 6 and 7.M. Bonnin, “The Threatened History and Collective Memory of the Cultural Revolution’s Lost Generation”, China Perspectives, 2007, 4, p. 52-64.M. Bonnin, “Restricted, Distorted but Alive: the Memory of the Lost Generation of Chinese Rusticated Youth”, The China Quarterly, September 2016, n° 227, p.752-772.Goldman, Merle and Roderick MacFarquhar, eds., 1999. The Paradox of China’s Post-Mao Reforms. Harvard University Press.  Yang Guobin, “China’s Zhiqing Generation – Nostalgia, Identity and Cultural Resistance in the 1990s”, Modern China, Vol 29 N° 3, July 2003, p. 285-289.Thurston, Anne F. and Burton Pasternak, eds., 1984. The Social Sciences and Fieldwork in China. Westview Press.  Walder, Andrew G. 1986. Communist Neo-Traditionalism: Work and Authority in Chinese Industry.  University of California Press.   ", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (1292)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor Michel Paul Emile BONNIN"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2021-22 Term 2": {"--LEC (1739)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 402"], "instructors": ["Professor Michel Paul Emile BONNIN"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Essays": "40", "Others": "20", "Presentation": "40"}}, {"code": "5111", "title": "Political Communication in Practice", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc in Government and Politics (Greater China)", "description": "Political communication is a vital part of the daily work of politicians. They need to share their visions with the public. They need to help people understand complex public policy questions and solutions. They need to rally people to support certain courses of actions. And most important, they need to convince the voters in order to get elected and remain in power. To achieve these, effective communication is very important. This course aims at introducing students the basic theories and practices of political communication. It would explore the ways in which political messages are sent and received so that students can better understand how their lives are shaped, and then have a better reflection of real life politics. Moreover, while political communication becomes a rising profession, this course can provide a basic training to those students who want to begin their careers in this field.", "outcome": "(A) Understand major concepts, ideas and theories in political communication.  (B) Learn basic principles and skills in areas such as speech writing and delivering, election debate, political   advertising, and media handling.   (C) Understand the new political phenomenon of political spinning.  (D) Learn how to apply knowledge taught in the course in real political life. ", "syllabus": " Political Communication in the Era of Professionalization  Changes in Political News Coverage: Personalization, Conflict and Negativity  The Changing Culture and Environment of African Political Communication  Professionalism of Political Communication Visual Political Communication  Political Marketing  Social Media and the Organization of Collective Action News Framing  Negative Advertising and Election", "required_readings": "Alan Schroeder (2000), Presidential Debates: Forty Years of High-Risk TV, (NY: Columbia University Press).  Edwin Diamond and Stephen Bates (1992), The Spot: the Rise of Political Advertising on Television, (Massachusetts: MIT Press).  Frank W. Baker (2009), Political Campaigns and Political Advertising, (Santa Barbara: Greenwood Press).  James C. Hume (2002), Speak Like Churchill, Stand Like Lincoln: 21 Powerful Secrets of History's Greatest Speakers,  (NY: Three Rivers Press).  Judith S. Trent & Robert V. Friedenberg (2007), Political Campaign Communication: Principles & Practices (6th edition),  (NY: Rowman & Littlefield).  Lauren Cohen Bell, Joan L. Conners, and Theodore F. Sheckels (2008), Perspectives on Political Communication:  A Case Approach, (Boston: Pearson Education, Inc.).  Max Atkinson (2005), Lend Me Your Ears, All you Need to Know about Making Speeches and Presentations,  (Oxford: Oxford University Press).  Michael E. Eidenmuller (2008), Great Speeches for Better Speaking: Listen and Learn from History’s Most  Memorable Speeches, (NY: McGraw Hill).", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (1749)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [4], "locations": ["Wu Ho Man Yuen Bldg 304"], "instructors": ["Mr. CHOY Chi Keung Ivan"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 1": {"--LEC (3047)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 402"], "instructors": ["Mr. CHOY Chi Keung Ivan"], "meetingDates": ["8/9", "15/9"]}}}, "assessments": {"Essays": "40", "Essay test or exam": "30", "Presentation": "30"}}, {"code": "5112", "title": "Selected Topic in Government and Politics of Greater China (II)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc in Government & Politics (Greater China).", "description": "This course conducts graduate level studies on some important topics in government and politics of Greater China. The topics may include issues such as government reforms, global governance, democratization, and politics and mass media. The focus of the course may vary from year to year according to the area of expertise of the instructor and the interests of the class.", "outcome": "1. A broad knowledge of Greater China, and the ability to comment on Chinese government and politics for both specalist and general audiences. 2. Awareness of disciplinary thinking, concepts, terminology and methodology. 3. The ability to carry out independent and academic-quality research.", "syllabus": "This course conducts graduate level studies on some important topics in government and politics of Greater China.  The topics may include issues such as government reforms, global governance, democratization, and politics and mass media.  The focus of the course may vary from year to year according to the area of expertise of the instructor and the interests of the class.", "required_readings": "Graham T. Allison：《註定一戰?: 中美能否避免修昔底德陷阱》，包淳亮譯，八旗文化出版, 2018Samuel P. Huntington：《文明的衝突與世界秩序的重建》，周琪譯，新華出版社, 1998Douglas A. Irwin，Clashing over Commerce: A History of U.S. Trade Policy. University of Chicago Press, 2017S.L.恩格爾曼、R.E.高爾曼主編：《美國經濟史（第二卷）：漫長的19世紀》，中國人民大學出版社2008年秦暉：《福利的“高低”、“正負”與中國的轉型》，香港中文大學《二十一世紀》雙月刊總139期，2013年丁建定、楊鳳娟：《英國社會保障制度的發展》，中國勞動社會保障出版社2004年和春雷等：《當代德國社會保障制度》，法律出版社2001年David Edgerton, Warfare State: Britain, 1920-1970. Cambridge University press, 2006秦暉：《南非的啟示》，江蘇鳳凰出版集團2013年秦暉：《問題與主義》，長春出版社1999年", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (1644)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor QIN Hui"], "meetingDates": ["11/9", "18/9", "25/9"]}}, "2021-22 Term 2": {"--LEC (2873)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [5], "locations": ["Yasumoto Int'l Acad Park LT7"], "instructors": ["Professor QIN Hui"], "meetingDates": ["14/1", "21/1", "28/1"]}}}, "assessments": {"Essays": "40", "Others": "20", "Presentation": "40"}}]