[{"code": "5003", "title": "Nutrition for Public Health", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg students in Master of Public Health.", "description": "Description Public health nutrition is the promotion and maintenance of nutrition-related health and wellbeing of populations through organized efforts and informed choices of society. To be effective, public health nutritionists must first connect the principles of nutritional science to the realm of public health practice in ways that emphasize the multi-factorial origins of actual nutritional problems in modern societies. In this course, students will be introduced to various essential elements of food and nutritional sciences. The current nutrition issues at both local and global levels will be discussed. The application of these on promoting nutrition health of the population will be illustrated.", "outcome": "By the end of this module, students are expected to be able to: - acquire some understanding of the basic elements of food and nutritional sciences; - describe and explain the current nutrition problems in developed, developing and third-world countries; - make use of the above knowledge to design strategies to promote nutritional health of populations.", "syllabus": "   Introduction to Public Health Nutrition   Fundamentals (I) Basics of Nutritional Science   Fundamentals (II) Nutrition across the lifespan   Fundamentals (III) Nutrition Assessment in Individuals and Populations   Issues associated with over-nutrition   Issues associated with undernutrition   Food safety and major nutritional concerns in the modern world   Promoting Healthy Nutrition  ", "required_readings": "Please refer to the course outline provided by course teacher.", "recommended_readings": "1. Gibney MJ, Margetts BM, Kearney JM and Arab L. Public Health Nutrition, Blackwell Publishing, 2004 ISBN 0-632-05627-42. Diet, Nutrition and the Prevention of Chronic Diseases WHO Technical Report No. 916, 2003 www.who.int/dietphysicalactivity/publications/trs916/download/en3. Truswell A. Stewart. ABC of nutrition, BMJ: London, 2003 ISBN 0727916645", "terms": {"2021-22 Term 1": {"--LEC (2472)": {"startTimes": ["18:30", "18:30"], "endTimes": ["21:30", "21:30"], "days": [5, 1], "locations": ["Prince of Wales Hospital", "Prince of Wales Hospital"], "instructors": ["Dr. YUNG Ka Chun", "Dr. YUNG Ka Chun"], "meetingDates": ["12/11", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11"]}}}, "assessments": {"Essay test or exam": "60", "Homework or assignment": "40"}}, {"code": "5006", "title": "Medical Sociology", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg student in –;Master of Public Health;MSc/PgD in Epidemiology and Biostatistics", "description": "The course provides an opportunity to students to understand issues of health care in society from sociological perspectives. Individuals are social beings who are subject to the influence of social forces and interpersonal relationships. Concerning health and illness, other than the pathological elements, the sick person is inevitably affected by a wide range of social variables and personal behaviour. The macroscopic and microscopic perspectives in understanding the issues of health and illness in context are important in the course of service delivery and policy making.", "outcome": "Student should be able to: 1. analyse concepts and ideas about health and illness in context 2. suggest effects of human agency, social groups and social institutions in shaping individuals' health and illness behaviour 3. synthesize sociological perspectives in understanding issues of health and health care delivery in society", "syllabus": "   1.        Getting Started: Introduction to Sociological Perspectives and Concepts2.        Sociological Understanding on Health and       Illness3.        Discussion Tutorial   1.        Responses to Health and Illness 2.        Discussion Tutorial   1.        Experiencing Health and Illness2.        Interactions between Professionals and Clients in Health Care Settings3.        Discussion Tutorial   Reading Week   1.        Social Patterning on Health and Illness2.        Discussion Tutorial   1.        Disease Label, Medicine and Social Control2.        Discussion Tutorial   1.        Health Care in Political and Economic Contexts2.        Course Summary  ", "required_readings": "Scambler, G. (Ed.) (2008). Sociology as applied to medicine. Edinburgh: Saunders.", "recommended_readings": "Bird, C. E., Conrad, P., Fremont, A. M., & Timmermans, S. (Eds.) (2010). Handbook of medical sociology. Nashville: Vanderbilt University Press.Cockerham, C. W. (2010). The new Blackwell companion to medical sociology. Oxford, UK: Wiley‐Blackwell.Cockerham, C. W., Dingwall, R., & Quah, S. R. (Eds.) (2014). The Wiley Blackwell encyclopedia of health, illness, behavior, and society. Chichester, West Sussex: Wiley Blackwell.Gabe, J., & Monaghan, L. F. (Eds.) (2013). Key concepts in medical sociology. London: Sage. Other reading material will be given at the beginning of the course.", "terms": {"2020-21 Term 3": {"--LEC (1154)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [1], "locations": ["TBA"], "instructors": ["Dr CHENG Yeung Hung, \n\rMiss CHONG Chung Yan, \n\rMiss YUEN Rebacca, \n\rMs. SO Tsz Ning Cherryline, \n\rMs. TANG Hoi Ying Dior"], "meetingDates": ["19/4", "26/4", "3/5", "10/5", "17/5", "24/5", "31/5", "7/6"]}}, "2021-22 Term 3": {"--LEC (1020)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["Prince of Wales Hospital"], "instructors": ["Dr CHENG Yeung Hung"], "meetingDates": ["21/4", "28/4"]}}}, "assessments": {"Discussion": "20", "Essay test or exam": "80"}}, {"code": "5007", "title": "Health for Special Population", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg students in Master of Public Health", "description": "Health needs vary according to characteristics of population. This course underlies key health issues and needs among different population subgroups. Specifically, health needs of special and vulnerable population groups would be explored and discussed. Features related to planning, implementation and evaluation for programs target to special health needs would be highlighted.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5008", "title": "Medical Anthropology", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "Medical Anthropology is the sub-discipline of social anthropology that examines the social processes and cultural representations of health, illness and the health care practices. Using primarily qualitative and ethnographic methods, medical anthropologists specifically examine: 1) the development of systems of medical knowledge and medical care, 2) the relationship between healthcare provider and patients 3) the integration of alternative medical systems in culturally diverse environments, 4) the interaction of social, environmental and biological factors which influence health and illness, and 5) the impact of biomedicine and biomedical technologies in non-Western settings. This course will draw upon lectures and readings to illustrate the applicability of medical anthropology to current public health research.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5103", "title": "Lecture Series in Non-Communicable Diseases as Public Health Concerns", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "This course aims to Introduce to students how non-communicable diseases (NCDs) become a major public health concern in the past decades, the trend of common NCDs, and prevention strategies.", "outcome": "After the course, students will be able to examine different health promotion strategies and approach to minimize the risk factors and enhance the protective to combat the growing epidemics of NCD.", "syllabus": "   Impact of rapid urbanization and socio-economic burden on health   Mental health across lifespan   Poverty and health   Dietary prevention for non-communicable diseases   Patient self-management for non-communicable diseases   Physical activity, people, and the environment Part 1 & Part II   Prevention of NCD amongst marginalized population and vulnerable group   Group exercise on specific topics   Group exercise preparation for presentation   Blocked time for problem solving questions   Presentation and assessment  ", "required_readings": "Please refer to the course outline provided by course teacher", "recommended_readings": "NA", "terms": {"2020-21 Summer Session": {"--LEC (1100)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor LEE Albert"], "meetingDates": ["14/06/2021 - 21/06/2021"]}}}, "assessments": {"Homework or assignment": "40", "Presentation": "40", "Participation": "20"}}, {"code": "5210", "title": "Social Marketing Methods", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "The course aims at providing participants an overview of social marketing as an approach to health promotion. The course will cover key concepts and elements of social marketing, as well as the benchmark criteria for a social marketing initiative. The course will be conducted in a combined format of lecture and workshop. Examples of application of social marketing in health promotion will be illustrated in the course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5212", "title": "Motivational Interviewing", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "", "description": "Motivational interviewing is one of the new but promising approaches in counselling clients when treating their lifestyle problems and disease. It is a directive and client-centred counselling style to elicit clients’ awareness to current problems and readiness to change their behaviour. The course will train participants to conduct motivational interview.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6900", "title": "Practicum / Project on Health Promotion and Health Education", "career": "Postgraduate - Research", "units": "6.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For MSc Health Education", "description": "Enables students to apply the principles, knowledge and skills learned in an academic setting through a supervised field training experience in a public health setting and the preparation of a monograph embodying original research applicable to health promotion and health education.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]