[{"code": "5001", "title": "Health Systems, Policy and Management", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg student ;- Master of Public Health / Postgraduate Diploma in Public Health;- MSc/PgD in Epidemiology and Biostatistics; - MSc/PgD in Health Services Management;- MSc/PgD in Health Promotion and Behavioural Health Programme.", "description": "This course is an introduction to the basic principles of management, strategic planning, quality assurance, health economics and financing, and health policy analysis that serves as a foundation to more advanced coursework in health policy & management. This course is benchmarked to meet certain part of the competencies of the Part A, Diplomate Membership level of the UK Public Health Examination, the US Certified Public Health Exam of the Association of Schools of Public Health as well as Part I Examination in Administrative Medicine of the HK College of Community Medicine.", "outcome": "The objective of this course is to acquire an understanding of the basic principles of healthcare system, policy, financing, and health economics. Students will become familiar with the basic management theories and concepts that underlie the operations of healthcare organizations. The course will familiarize students to structure, process and outcomes of health services and students will learn to apply systems thinking to resolve organizational issues.", "syllabus": "   Healthcare Policy and Management 1   Healthcare Policy and Management  2   Healthcare Policy and Management 3   Healthcare Policy and Management 4   Health Economics & Healthcare Financing 1: Economics in Health Care (1)   Health Economics & Healthcare Financing 2: Economics in Health Care (2)   Health Economics & Healthcare Financing 3: Economic Evaluation   Health Economics & Healthcare Financing 4: Economic Evaluation   Healthcare Management & Organization 1:  Healthcare Organizations   Healthcare Management & Organization 2 : Managing People in Health Care   Healthcare Management & Organization 3:  Quality & Performance Management   Healthcare Management & Organization 4:  Strategy & Planning  ", "required_readings": " Health Systems Policy, Finance and Organization, edited by Guy Carrin, Kent Buse, Harald Kristian heggenhougen, and Stella R. Quah. Elsevier, 2009.Hong Kong's Health System : reflections, perspectives and visions by Leung GM and Bacon Shone J", "recommended_readings": " Essentials of Health Services Stephen J Williams pub Delmar 2001 Health Economics, by Frank A. Sloan and Chee-Ruey Hsieh, MIT Press 2012 Healthcare Management – Organization Design and Behavior (5th edition) written by Stephen M Shortell and Arnold D. Kaluzny Images of Organization: Gareth MorganManagement: Stephen P. Robbins (2nd Edition)", "terms": {"2020-21 Term 1": {"F-LEC (1838)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Miss YUEN Rebacca, \n\rMr ZHOU Yitao, \n\rMs. SO Tsz Ning Cherryline, \n\rMs. TANG Hoi Ying Dior, \n\rProfessor YIP Hon Kei"]}}, "2020-21 Term 2": {"HS-LEC (4543)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor LEUNG Yee Man, \n\rProfessor YEOH Eng Kiong, \n\rProfessor YIP Hon Kei"]}, "P-LEC (1475)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [1], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor LEUNG Yee Man, \n\rProfessor YEOH Eng Kiong, \n\rProfessor YIP Hon Kei"]}}}, "assessments": {"Essays": "35", "Examination": "60", "Participation": "5"}}, {"code": "5002", "title": "Healthcare Organisation & Management", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health, MSc Health Services Management, PgD in Health Services Management", "description": "This course aims to equip students with a broad base of knowledge and concepts in health services management, as well as to develop their competency in applying the knowledge and learning to appraise day-to-day management and operational problems in healthcare organisations. Basic financial management concept is also introduced in the course. The course emphasizes on learning through reflection and practical application of key concepts in organisation and management supported by real case examples. This course is designed to meet most of the Basic Specialist Training and Part I Examination curriculum in Administrative Medicine of the HK College of Community Medicine.", "outcome": "Student should be able to:  1. Understand the broad base of knowledge and key concepts in healthcare organisations and health services management  2. Apply the knowledge and learning to appraise the problems the student faces in day-to-day management and operations in healthcare organisations", "syllabus": "   Introduction to the Course/ Organisational management         Managing human resources and change         Healthcare leadership             Governance and accountability             Resource allocation and performance management             Quality management         Financial management I          Financial management II         HSYS6900 Introduction     Project planning & evaluation         ", "required_readings": "Reading list will be announced when the course started.", "recommended_readings": "Reading list will be announced when the course started.", "terms": {"2020-21 Term 3": {"--LEC (1019)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["TBA"], "instructors": ["Professor HUNG Chi Tim, \n\rProfessor LEUNG Yee Man"]}}}, "assessments": {"Essays": "30", "Examination": "60", "Homework or assignment": "10"}}, {"code": "5003", "title": "Health Economics: Economics Evaluation", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health, MSc Health Services Management, PgD in Health Services Management", "description": "There is a fundamental question asked in public health and health care in general: how can we get the best results, in terms of better health, from the resources which are available in the community? Health Economics, as a field, attempts to provide an explicit and rationale framework to improve the efficient and equitable allocation of health care resources. In this course, we will examine selected topics in health economics that have major implications for healthcare delivery, financing and clinical and public health research. Essential economic theories and methods for exploring each topic will be discussed, along with the role of markets and government. We will go through different models of healthcare financing from a policymaking perspective, applying measures such as equity and efficiency to evaluate them. In addition, basic skills of conducting economic evaluation, such as cost-effectiveness analysis, will also be introduced.", "outcome": "Upon successfully completing this course, students will be able to:1. describe and apply essential economic theories and methods relevant to the study of health care system and the improvement of public health2. conduct basic economic evaluation in practice 3. describe how healthcare can be financed and resources can be allocated to achieve efficiency, equity, sustainability and responsiveness", "syllabus": "There is a fundamental question asked in public health and health care in general: how can we get the best results, in terms of better health, from the resources which are available in the community? Health Economics, as a field, attempts to provide an explicit and rationale framework to improve the efficient and equitable allocation of health care resources. In this course, we will examine selected topics in health economics that have major implications for healthcare delivery, financing and clinical and public health research. Essential economic theories and methods for exploring each topic will be discussed, along with the role of markets and government. We will go through different models of healthcare financing from a policymaking perspective, applying measures such as equity and efficiency to evaluate them. In addition, basic skills of conducting economic evaluation, such as cost-effectiveness analysis, will also be introduced.", "required_readings": "Reading list will be announced when the course started.", "recommended_readings": "Reading list will be announced when the course started.", "terms": {"2020-21 Term 1": {"--LEC (1837)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["TBA"], "instructors": ["Miss CHONG Chung Yan, \n\rMiss YUEN Rebacca, \n\rMr ZHOU Yitao, \n\rMs. SO Tsz Ning Cherryline, \n\rMs. TANG Hoi Ying Dior, \n\rProfessor YIP Hon Kei"]}}}, "assessments": {"Examination": "80", "Homework or assignment": "20"}}, {"code": "5004", "title": "Health Systems & Policies", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg student under: ;- Master of Public Health / Postgraduate Diploma in Public Health;- MSc/PgD in Epidemiology and Biostatistics;- MSc/PgD in Health Services Management; - MSc/PgD in Health Promotion and Behavioural Health Programme.", "description": "This course will build on the content of HSYS5001, and students will gain advanced understanding on the structural and functional characteristics of health systems and policy framework. Through in- class interactive discussions and group presentation, students will acquire competency in analyzing factors which impact on health service delivery and health policy making process. Students will also be exposed to basic methodology in health policy research & analysis.", "outcome": "Through studying this course students will be able to : 1. Apply systems thinking in analyzing healthcare systems and policy within and between countries.  2. Understand the influence of the global and political context in policy making process. 3. Articulate current issues in health system reforms in different health systems. 4. Understand the role of theory in framing health policy questions, and apply using case study methodology in conducting policy analysis.", "syllabus": "     Healthcare Delivery System   Service delivery models Role of person-centred, primary and integrated care Transitions between health and long-term care       Pluralistic Health Systems for Universal Health Coverage (UHC)   Roles of government, private sector and civil society Public private engagement, interfaces and partnership District health system       Policy System and Structure (1)   Political system Policy institutions   Case study (1)       Evidence-based Public Health Policy and Practice       Policy System and Structure (2)   Policy actors Policy instruments       Policy Process: An Overview Agenda Setting       Policy Formulation and Decision Making Case Study (2)       Policy Implementation       Policy Evaluation & Learning Policy Studies Revision on Policy       Student Case Study Presentation & Discussion (1)       Student Case Study Presentation & Discussion (2)       Health System Challenges and Strategies for UHC   Functioning, performance, strengthening & reform in pluralistic health system   Revision on Systems    ", "required_readings": "Please refer to the course outline provided by course teacher", "recommended_readings": " Griffiths SM, Tang JL, & Yeoh EK (2014), eds.  Routledge Handbook of Global Public Health in Asia.  Oxford: Routledge publisher. ISBN 978-0-415-64382-5. Harding, April. (2003). Introduction to the Private Participation in Health Services Handbook. Chapter 1 in Harding A & Preker A (Eds.), Private Participation in Health Services. World Bank: Health, Nutrition and Population Department. Lucy Gilson (2012). Health Policy and Systems Research: A methodology reader. Alliance for Health Policy and Systems Research and World Health Organizaton. Howlett M & Ramesh M (2009). Studying public policy: policy cycles and policy subsystems. Don Mills, Ont.: Oxford University Press. Our Hong Kong Foundation (2018). Fit for Purpose: A Health System for the 21st Century. (2018-11-30) Gillian W (1994). Health policy: An introduction to process and power. Johannesburg: Witwatersrand University Press; London; Atlantic Highlands, N.J.: Zed Books. Wong ELY, Yeoh EK, Chau PYK, Yam CHK, Cheung AWL, Fung H. How shall we examine and learn about public-private partnerships (PPPs) in the health sector?  Realist evaluation of PPPs in Hong Kong Special Administrative Region. Social Sciences & Medicine 2015, 147: 261–269. World Health Organization (2000). The World Health Report - Health systems: improving performance. World Health Organization (2007). Everybody’s business: Strengthening health systems to improve health outcomes: WHO’s framework for action.  World Health Organization (2015). WHO Global strategy on people-centred and integrated health services. World Health Organization and The World Bank (2017). Tracking Universal Health Coverage: 2017 Global Monitoring Report", "terms": {"2020-21 Term 3": {"--LEC (1180)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Dr. YAM Ho Kwan, \n\rProfessor YEOH Eng Kiong, \n\rProfessor YEUNG Pui Shan"]}}}, "assessments": {"Examination": "60", "Homework or assignment": "15", "Presentation": "25"}}, {"code": "5005", "title": "Healthcare Financing", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health, MSc Health Services Management, PgD in Health Services Management", "description": "This course introduces the key policy and economic principles that underpin the approaches to healthcare financing and the performance of health systems in relation to Universal Health Coverage.", "outcome": "Upon successfully completing this course, students will be able to: 1. Understand the policy and economic principles underpinning different healthcare financing models; 2. Understand how different healthcare financing models could influence health system performance and achievement of Universal Health Coverage; 3. Develop insights on the historical development and evolution of healthcare reforms in Hong Kong; and 4. Develop competencies in assessing the performance of different health systems in relation to Universal Health Coverage.", "syllabus": "   Introduction to healthcare financing and Universal Health Coverage          Healthcare financing models and health system performance          Mixed health systems, private health insurance, and payment systems         Health system evolution in Hong Kong and Singapore          ", "required_readings": " Barbara McPake, Charles Normand, Samantha Smith. “Health Economics: An International Perspective” (Third Edition). Routledge, 2013.", "recommended_readings": " WHO Western Pacific Regional Office. Universal Health Coverage: Moving Towards Better Health – Action Framework for the Western Pacific Region, 2016. WHO/World Bank. Health Systems for Universal Health Coverage – A Joint Vision for Healthy Lives, 2017. Country references provided on Blackboard as references for the Group Presentation and Assignment. Case study readings", "terms": {"2020-21 Term 1": {"--LEC (2449)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["TBA"], "instructors": ["Miss CHONG Chung Yan, \n\rMiss YUEN Rebacca, \n\rMr ZHOU Yitao, \n\rMs. SO Tsz Ning Cherryline, \n\rMs. TANG Hoi Ying Dior, \n\rProfessor FUNG Hong"]}}}}, {"code": "5006", "title": "Managing in Healthcare", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health and MSc in Health Services Management", "description": "This course focuses on the practical aspects of management, and supplements the theories presented in HSYS5001, HSYS5002 and HSYS5012, to further the training in healthcare management. Teaching will include lectures, case studies and small-group discussions, as well as exercises and interactive games to enhance management insights.(Pre-requisite: preferably have at least two years working experience, though not necessarily in the healthcare field.)", "outcome": "Student should be able to: 1. Acquire knowledge, skills and tools in the day-to-day management in healthcare disciplines; 2. Have the basic capabilities to run a healthcare team together with other management concentrations; 3. Apply these capabilities in their positions with action plans to improve their service(s); 4. Have the means to develop them and attain further management insights.", "syllabus": "   Course IntroductionHealthcare Management & Customer Concept   In class case-study discussion   Lecture: Service & Marketing   In class case-study discussion   Lecture: People Management   In class case-study discussion   Lecture: Teams dynamics & Learning; Change & Stability   In class case-study discussion   Lecture: Conflict management & NegotiationProject Management   In class case-study discussion   Lecture: Communication   In class case-study discussion   Lecture: Decision making   In class case-study discussion   Lecture: Self-management  ", "required_readings": "Please refer to the course outline provided by course teacher", "recommended_readings": " Drucker P. (2001) The Essential Drucker. New York: Collins Fisher R., Ury W. & Patton B.. (1991) Getting to Yes. New York: Penguin Covey  S. (1990) 7 Habits of Highly Effective People. New York: Simon & SchusterLecture notes and additional papers will be posted on the Blackboard.", "terms": {"2020-21 Term 2": {"--LEC (3301)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [1], "locations": ["Prince of Wales Hospital"], "instructors": ["Dr FUNG Shu Yan Anthony"]}}}, "assessments": {"Examination": "40", "Homework or assignment": "30", "Others": "20", "Participation": "10"}}, {"code": "5008", "title": "Public Private Partnerships in Health", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "This course examines existing approaches towards Public Private partnerships in healthcare and aims at providing tools that will help them to understand health policies that involve the private sector. It will provide students with a framework both for analyzing the opportunities for Public Private Partnership in a health system as well as for designing strategies and approaches for engaging the private sector.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5011", "title": "Health Informatics", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students who are studying the following programmes:;- MSc Health Services Management;- PgD Health Services Management;- Master of Public Health", "description": "This course introduces the principles of healthcare information systems, role of informatics in risk management, quality improvement and basic understanding of technical aspects.", "outcome": "Student should be able to:1. understand the roles and importance of health informatics in the healthcare industry;2. understand and appreciate how health IT is applied to advance quality healthcare delivery;3. understand the current development of health IT and the challenges ahead.", "syllabus": "This course introduces the principles of healthcare information systems, role of informatics in risk management, quality improvement and basic understanding of technical aspects.", "required_readings": "Reading list will be announced when the course started.", "recommended_readings": "Reading list will be announced when the course started.", "terms": {"2020-21 Term 2": {"--LEC (2915)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [5], "locations": ["Sch of Pub Health KCTCRC"], "instructors": ["Dr CHEUNG Ngai Tseung, \n\rMiss LO Sze Yu Shirley, \n\rMr ZHOU Yitao, \n\rMr. LEUNG Chun Man, \n\rMs. SO Tsz Ning Cherryline"]}}}}, {"code": "5012", "title": "Human Resource Management", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "The pre-requisites: HSYS5001 and HSYS5002 ;For student in Master of Public Health and MSc in Health Services Management", "description": "Most health services managers find people management difficult to master. This course covers the key aspects of human resource management in healthcare including basic understanding of the behavior of health professionals.", "outcome": "Student should be able to:1. Understand the significance, scope and dimensions of human resources management in healthcare2. Understand the nature and characteristics of professionalism, and professional behaviours in healthcare3. Understand the key concepts and practices in generic HR management4. Understand the application of HR management principles and special features of HR management in healthcare", "syllabus": "Most health services managers find people management difficult to master.  This course covers the key aspects of human resource management in healthcare including basic understanding of the behavior of health professionals.", "required_readings": "Reading list will be announced when the course started.", "recommended_readings": "Reading list will be announced when the course started.", "terms": {"2020-21 Term 3": {"--LEC (1069)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Sch of Pub Health KCTCRC"], "instructors": ["Professor HO Shiu Wei William, \n\rProfessor LEUNG Yee Man"]}}}, "assessments": {"Examination": "50", "Others": "5", "Presentation": "20", "Report": "25"}}, {"code": "5013", "title": "Financial Management", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health and MSc in Health Services Management", "description": "This course focuses on essential competencies of health services managers to understand, interpret and manage financial resources. It covers the basic knowledge and concepts in Management Accounting and Financial Management. Topics include understanding of accounting principles and standards, financial statements, financial performance and budgeting, revenue generation and financial decision making.", "outcome": "Student should be able to:1. develop sufficient familiarity and understanding of basic concepts of financial management in health care organizations2. be cognizant of the need for competent financial management in managing health care services3. be aware of tools and techniques that can be used for financial management4. have a good understanding of the role of finance managers in the health care organization and be able to evaluate the performances", "syllabus": "This course focuses on essential competencies of health services managers to understand, interpret and manage financial resources.  It covers the basic knowledge and concepts in Management Accounting and Financial Management.  Topics include understanding of accounting principles and standards, financial statements, financial performance and budgeting, revenue generation and financial decision making.", "required_readings": "Reading list will be announced when the course started.", "recommended_readings": "Reading list will be announced when the course started.", "terms": {"2020-21 Term 2": {"--LEC (2978)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["Sch of Pub Health KCTCRC"], "instructors": ["Professor TSE Sau Ling"]}}, "2020-21 Term 3": {"--LEC (1113)": {"startTimes": ["18:30", "18:30"], "endTimes": ["21:30", "21:30"], "days": [1, 4], "locations": ["Sch of Pub Health KCTCRC", "Sch of Pub Health KCTCRC"], "instructors": ["Professor TSE Sau Ling", "Professor TSE Sau Ling"]}}}, "assessments": {"Essays": "20", "Homework or assignment": "30", "Presentation": "40", "Participation": "10"}}, {"code": "5014", "title": "Quality and Safety Management", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health, Master of Science in Health Services Management and Postgraduate diploma in Health Services Management", "description": "This course introduces students to (1)the concept, framework, practical approaches and current movement for safe, efficient, effective, and patient-centred healthcare;(2)principle and practices of incident management and patient relations;(3)concepts of errors in healthcare and principles and strategies in quality improvement", "outcome": "1a. Understand the discipline of risk management, patient safety and patient relations 1b. Apply the concept and approach to (i) identify and manage clinical risks, (ii) manage adverse event, (iii) enhance patient-engagement and relations, and (iv) lead change (in quality and safety).2a. Apply concepts of errors in healthcare improvements.2b.  Apply principles, tools, evaluation strategies and documentation method in quality improvement", "syllabus": "This course introduces students to (1) the concept, framework, practical approaches and current movement for safe, efficient, effective, and patient-centred healthcare;(2) principle and practices of incident management and patient relations;(3) concepts of errors in healthcare and principles and strategies in quality improvement;", "required_readings": "Reading list will be announced to students before the course starts.", "recommended_readings": "Reading list will be announced to students before the course starts.", "terms": {"2020-21 Term 1": {"--LEC (2292)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [1], "locations": ["No Room Required"], "instructors": ["Miss LO Sze Yu Shirley, \n\rMr ZHOU Yitao, \n\rMr. LEUNG Chun Man, \n\rMs. SO Tsz Ning Cherryline, \n\rProfessor LAI Bo San Paul"]}}}, "assessments": {"Essays": "40", "Presentation": "60"}}, {"code": "5015", "title": "Medico-legal Management", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "for students in Master of Public Health, Master of Science in Health Services Management and Postgraduate diploma in Health Services Management", "description": "This course covers the principles and practices of medico-legal management in modern healthcare. The course uses case studies to cover important topics in medico-legal management including theory and principles of complaints handling and investigation, clinical negligence and responsibility, and risk management strategies.", "outcome": "1.    Learn the legal principles and issues in relation to medical treatment from birth to death2.    Learn the application of legal knowledge in handling complaints, clinical negligence, risk management and other aspects of health services management", "syllabus": "This course covers the principles and practices of medico-legal management in modern healthcare. The course uses case studies to cover important topics in medico-legal management including theory and principles of complaints handling and investigation, clinical negligence and responsibility, and risk management strategies.", "required_readings": "Reading list will be announced to students before the course starts.", "recommended_readings": "Reading list will be announced to students before the course starts.", "terms": {"2020-21 Term 1": {"--LEC (1701)": {"startTimes": ["10:00", "18:30"], "endTimes": ["17:00", "21:30"], "days": [6, 5], "locations": ["Sch of Pub Health KCTCRC", "Sch of Pub Health KCTCRC"], "instructors": ["Miss LO Sze Yu Shirley, \n\rMr ZHOU Yitao, \n\rMr. LEUNG Chun Man, \n\rMs. SO Tsz Ning Cherryline, \n\rProfessor HUNG Chi Tim", "Professor HUNG Chi Tim"]}}}, "assessments": {"Essays": "70", "Presentation": "30"}}, {"code": "5016", "title": "Health Services Planning", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health, Master of Science in Health Services Management and Postgraduate diploma in Health Services Management", "description": "This course aims to enrich students with the knowledge and acquire competencies in health services planning. The scope of the course ranges from planning for the health of the population to planning of physical facilities. Students will learn to appraise the planning issues of a region or hospital through a case study, group presentation and class discussion.", "outcome": "Student should be able to:1. Understand the principles in assessing the healthcare needs of a population2. Plan the delivery system and capacity to meet the healthcare needs of a population 3. Apply the principles of physical planning to improve patient care and patient safety4. Appraise the planning challenges of a healthcare facility", "syllabus": "This course aims to enrich students with the knowledge and acquire competencies in health services planning. The scope of the course ranges from planning for the health of the population to planning of physical facilities. Students will learn to appraise the planning issues of a region or hospital through a case study, group presentation and class discussion.", "required_readings": "Reading list will be announced to students before the course starts.", "recommended_readings": "Reading list will be announced to students before the course starts.", "terms": {"2020-21 Term 2": {"--LEC (2479)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["Sch of Pub Health KCTCRC"], "instructors": ["Miss LO Sze Yu Shirley, \n\rMr ZHOU Yitao, \n\rMr. LEUNG Chun Man, \n\rMs. SO Tsz Ning Cherryline, \n\rProfessor FUNG Hong"]}}}, "assessments": {"Essays": "70", "Participation": "30"}}, {"code": "5017", "title": "Health Innovation and Technology Management", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health, Master of Science in Health Services Management and Postgraduate diploma in Health Services Management", "description": "This course aims to enrich students with the knowledge in health innovation and technology management. The course will involve active learning from the students with a workshop on design thinking and a case study on health technology management.", "outcome": "Student should be able to:1. Learn the natutre of innovation and approaches to health system innovations2. Understand and apply the principles of Design Thinking on health services3. Understand the approaches and issues in Health Technology Assessment4. Learn how to manage Innovation and Technology in healthcare organizations", "syllabus": "This course aims to enrich students with the knowledge in health innovation and technology management. The course will involve active learning from the students with a workshop on design thinking and a case study on health technology management.", "required_readings": "Reading list will be announced to students before the course starts.", "recommended_readings": "Reading list will be announced to students before the course starts.", "terms": {"2020-21 Term 2": {"--LEC (2478)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["Sch of Pub Health KCTCRC"], "instructors": ["Miss LO Sze Yu Shirley, \n\rMr ZHOU Yitao, \n\rMr. LEUNG Chun Man, \n\rMs. SO Tsz Ning Cherryline, \n\rProfessor FUNG Hong"]}}}}, {"code": "5018", "title": "Healthcare Ethics", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health, Master of Science in Health Services Management and Postgraduate diploma in Health Services Management", "description": "This module introduces and discusses major health care ethics issues and provide perspectives for health services management. The issues are discussed based on cases and dilemmas.", "outcome": "Student should be able to:1. Understand the theories and principles underlying ethical reasoning 2. Develop approach to integrate ethical considerations into decision-making in health services management rather than standalone philosophical ethical analysis.", "syllabus": "This module introduces and discusses major health care ethics issues and provide perspectives for health services management.  The issues are discussed based on cases and dilemmas.", "required_readings": "Reading list will be announced to students before the course starts.", "recommended_readings": "Reading list will be announced to students before the course starts.", "terms": {"2020-21 Term 1": {"--LEC (1854)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [5], "locations": ["No Room Required"], "instructors": ["Dr. AU Kit Sing Derrick, \n\rMiss LO Sze Yu Shirley, \n\rMr ZHOU Yitao, \n\rMr. LEUNG Chun Man, \n\rMs. SO Tsz Ning Cherryline"]}}}, "assessments": {"Essays": "70", "Homework or assignment": "30"}}, {"code": "5019", "title": "Operation Management", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health, Master of Science in Health Services Management and Postgraduate diploma in Health Services Management", "description": "This elective course introduces students to key concepts in operations management including LEAN and 6-sigma in the healthcare settings.", "outcome": "Student should be able to:1.  Understand the contribution of operations management to quality management in healthcare, and be able to apply the principles of operations management including LEAN and 6-sigma to improve healthcare quality.", "syllabus": "This elective course introduces students to key concepts in operations management including LEAN and 6-sigma in the healthcare settings.", "required_readings": "Reading list will be announced to students before the course starts.", "recommended_readings": "Reading list will be announced to students before the course starts.", "terms": {"2020-21 Term 1": {"--LEC (1107)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["Sch of Pub Health KCTCRC"], "instructors": ["Miss LO Sze Yu Shirley, \n\rMr ZHOU Yitao, \n\rMr. LEUNG Chun Man, \n\rMs. SO Tsz Ning Cherryline, \n\rProfessor HUNG Chi Tim, \n\rProfessor LEUNG Yee Man"]}}}, "assessments": {"Essays": "40", "Presentation": "60"}}, {"code": "5020", "title": "Corporate Communication and Marketing", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health, Master of Science in Health Services Management and Postgraduate diploma in Health Services Management", "description": "This course introduces students to the principles and practices of today’s corporate communication and marketing in healthcare. Examples and case studies, from healthcare where appropriate, are used to illustrate the up-to-date treatment of the key aspects of corporate communication and marketing.", "outcome": "Student should be able to:1. Understand the principles and practices of corporate communication2. Learn how to develop strategies to specific areas of corporate communication including media relations, internal communication, crisis communication and public affairs3. Acquire basic skills in media handling through role play4. Learn how to develop strategies in corporate advertising and marketing", "syllabus": "This course introduces students to the principles and practices of today’s corporate communication and marketing in healthcare. Examples and case studies, from healthcare where appropriate, are used to illustrate the up-to-date treatment of the key aspects of corporate communication and marketing.", "required_readings": "Reading list will be announced to students before the course starts.", "recommended_readings": "Reading list will be announced to students before the course starts.", "terms": {"2020-21 Term 1": {"--LEC (2448)": {"startTimes": ["9:30"], "endTimes": ["17:00"], "days": [6], "locations": ["Sch of Pub Health KCTCRC"], "instructors": ["Miss LO Sze Yu Shirley, \n\rMr ZHOU Yitao, \n\rMr. LEUNG Chun Man, \n\rMs. SO Tsz Ning Cherryline, \n\rProfessor FUNG Hong"]}}, "2020-21 Summer Session": {"--LEC (1099)": {"startTimes": ["10:00"], "endTimes": ["17:00"], "days": [6], "locations": ["Sch of Pub Health KCTCRC"], "instructors": ["Professor FUNG Hong"]}}}, "assessments": {"Homework or assignment": "70", "Participation": "30"}}, {"code": "5021", "title": "Advanced Organization Management", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health, Master of Science in Health Services Management and Postgraduate diploma in Health Services Management", "description": "This course aims to equip students with a more in-depth knowledge in organizational management by going into areas of organizational health and organizational culture. Organizational health and organizational culture are important and related concepts affecting the performance of the organization with respect to external and internal stakeholders. The course emphasizes on learning through reflection and practical application of key concepts in organizational health and culture supported by case studies.", "outcome": "1.Understand the broad base of knowledge and key concepts in organizational health and organizational culture. 2.Apply the knowledge and learning to appraise the problems the student faces in day-to-day management and operations in healthcare organizations", "syllabus": "This course aims to equip students with a more in-depth knowledge in organizational management by going into areas of organizational health and organizational culture.  Organizational health and organizational culture are important and related concepts affecting the performance of the organization with respect to external and internal stakeholders. The course emphasizes on learning through reflection and practical application of key concepts in organizational health and culture supported by case studies.", "required_readings": "Reading list will be announced to students before the course starts.", "recommended_readings": "Reading list will be announced to students before the course starts.", "terms": {"2020-21 Summer Session": {"--LEC (1083)": {"startTimes": ["10:00"], "endTimes": ["17:00"], "days": [0], "locations": ["Sch of Pub Health KCTCRC"], "instructors": ["Professor HUNG Chi Tim"]}}}, "assessments": {"Essays": "60", "Presentation": "40"}}, {"code": "5022", "title": "Patient-Centred Health System", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health, Master of Science in Health Services Management and Postgraduate diploma in Health Services Management", "description": "The course will introduce students to the principles and practices of patient-centred care, and application of design thinking concepts in the development towards a patient-centred health system.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5023", "title": "Local Visits", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Others", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health, Master of Science in Health Services Management and Postgraduate diploma in Health Services Management", "description": "This course aims to give students a broader and deeper exposure to service management through observing management in action in both healthcare and non-healthcare settings. Management in non-healthcare settings can often shed useful insights to healthcare management. The ability to observe and identify good practices or rooms for improvement, and to evaluate different practices are important skills for health service managers and the group interactions would help to sharpen these skills. These local visits supplement the classroom teaching. The work of summarising and presenting their observations would help to consolidate the learning from visiting these organisations. To satisfy the requirement for this course, the student needs to participate in one local visit to healthcare organization, and one local visit to a non-healthcare organization, participate in one presentation session and submit a reflective essay.", "outcome": "Student should be able to:1. Sharpen their skills in observation 2. Learn good management practices from visiting different organisations", "syllabus": "This course aims to give students a broader and deeper exposure to service management through observing management in action in both healthcare and non-healthcare settings. Management in non-healthcare settings can often shed useful insights to healthcare management. The ability to observe and identify good practices or rooms for improvement, and to evaluate different practices are important skills for health service managers and the group interactions would help to sharpen these skills. These local visits supplement the classroom teaching. The work of summarising and presenting their observations would help to consolidate the learnings from visiting these organisations.  To satisfy the requirement for this course, the student needs to participate in one local visit to healthcare organization, and one local visit to a non-healthcare organization, participate in one presentation session and submit a reflective essay.", "required_readings": "Reading list will be announced to students before the course starts.", "recommended_readings": "Reading list will be announced to students before the course starts.", "terms": {"2020-21 Term 3": {"-O01-OTH (1188)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["No Room Required"], "instructors": ["Professor HUNG Chi Tim"]}}}, "assessments": {"Essays": "50", "Presentation": "50"}}, {"code": "5024", "title": "Driving Healthcare Improvement with Data", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health and MSc in Health Services Management", "description": "This course introduces students to (1) The concept and practice of data-driven healthcare improvement in the context of interprofessional teamwork;(2) Data visualization and analytic tools that inform decision making in the context of clinical practices (for example, run charts and control charts);(3) Data and change management: Feedback and improving the whole process", "outcome": "Student should be able to: 1.  Understand the value of data management in healthcare management  2.  Apply the concept and approach of data management to  (i) identify and manage clinical and non-clinical care in the healthcare environment, and to  (ii) improve healthcare services using the appropriate tool", "syllabus": "This course introduces students to  (1) The concept and practice of data-driven healthcare improvement in the context of interprofessional teamwork; (2) Data visualization and analytic tools that inform decision making in the context of clinical practices (for example, run charts and control charts); (3) Data and change management: Feedback and improving the whole process", "required_readings": "Reading list will be announced to students before the course starts.", "recommended_readings": "Reading list will be announced to students before the course starts.", "terms": {"2020-21 Term 1": {"--LEC (1119)": {"startTimes": ["18:30", "18:30"], "endTimes": ["21:30", "21:30"], "days": [1, 2], "locations": ["Sch of Pub Health KCTCRC", "Sch of Pub Health KCTCRC"], "instructors": ["Miss LO Sze Yu Shirley, \n\rMr ZHOU Yitao, \n\rMr. LEUNG Chun Man, \n\rMs. SO Tsz Ning Cherryline, \n\rProfessor HUNG Chi Tim, \n\rProfessor LEUNG Yee Man", "Miss LO Sze Yu Shirley, \n\rMr. LEUNG Chun Man, \n\rMs. SO Tsz Ning Cherryline, \n\rProfessor HUNG Chi Tim, \n\rProfessor LEUNG Yee Man"]}}}, "assessments": {"Essays": "60", "Presentation": "40"}}, {"code": "6900", "title": "Master-Level Guided Case Study", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "Interactive Tutorial", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For student in MSc in Health Services Management", "description": "Each student is required to develop and complete an individual project of a healthcare services problem, under the direction of a supervisor at the School of Public Health and Primary Care.", "outcome": "Each student is required to develop and complete an individual project of a healthcare services problem, under the direction of a supervisor at the School of Public Health and Primary Care.", "syllabus": "Each student is required to develop and complete an individual project of a healthcare services problem, under the direction of a supervisor at the School of Public Health and Primary Care.", "required_readings": "Reading list will be announced when the course started.", "recommended_readings": "Reading list will be announced when the course started.", "terms": {"2020-21 Term 3": {"-T01-TUT (1067)": {"startTimes": ["8:30"], "endTimes": ["14:00"], "days": [6], "locations": ["Sch of Pub Health KCTCRC"], "instructors": ["Professor FUNG Hong, \n\rProfessor HO Shiu Wei William, \n\rProfessor HUNG Chi Tim"]}}}, "assessments": {"Presentation": "30", "Report": "70"}}]