[{"code": "2600", "title": "Investigating Hong Kong Through Multidisciplinary Lens", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "DiscussionField Studies/Field-tripLecture", "campus": "Main Campus", "academic_group": "International Asian Studies PC", "requirements": "", "description": "This is an introductory course on Hong Kong society with a particular focus on examining the social and cultural dynamics of contemporary Hong Kong. Some of the central questions addressed by the course are: What is so unique about Hong Kong? How do a Hong Kong in the past and some of the special features of the Hong Kong society contribute to a transforming China? What are some of the social and political impacts on the Hong Kong society in the trajectory of China’s pivotal reform and globalisation? Through readings, lectures, discussions and field trips, students will come to appreciate the significant impact of macro-level processes of social change and continuity on individuals, groups, communities and society.Topics in the course may include: (1) historical trajectory of Hong Kong; (2) identity formation: from migrants to local Hong Kong; (3) the making of Hong Kong: urban development as a case; (4) the paradise of capitalism and the Hong Kong miracle; (5) governance and politics; (6) foodways and heritage; (7) religion and folk beliefs; (8) the great transformation: Guangdong-Hong Kong-Macao Greater Bay Area initiatives \r", "outcome": "To be familiarised with the historical, social, political and cultural attributes of Hong Kong so that an interdisciplinary approach can be appreciated\r  To be able to critically and empirically evaluate major academic and non-academic debates and discourses of Hong Kong society\r  To appreciate the uniqueness of Hong Kong and be able to delineate its similarities and differences with other major cities and regions \r  To reflect upon the opportunities and challenges faced by Hong Kong in the context of “one-country-two-systems”\r  To develop transferable skills: collaborative learning, academic writing, and professional presentation", "syllabus": "Topics in the course may include:\r (1) historical trajectory of Hong Kong\r (2) identity formation: from migrants to local Hong Kong\r (3) the making of Hong Kong: urban development as a case\r (4) the paradise of capitalism and the Hong Kong miracle\r (5) governance and politics\r (6) foodways and heritage\r (7) religion and folk beliefs\r (8) the great transformation: Guangdong-Hong Kong-Macao Bay Area initiatives.", "required_readings": "(1) Historical Trajectory of Hong Kong\r Hayes, James. 2015. Hong Kong Island before 1841. In John M. Carroll and Chi-kwan Mark, eds, Critical Readings on the Modern History of Hong Kong. Leiden and Boston: Brill.\r  Ngo, Tak-wing. 1999. “Colonialism in Hong Kong revisited.” In Tak-wing Ngo (ed.), Hong Kong’s History: State and Society under Colonial Rule. London: Routledge.\r  Carroll, John, M.. 2007. “Colonialism and Nationalism,” pp. 63-88 in A Concise History of Hong Kong. Lanham: Rowmand and Littlefield.\r  (2) Identity Formation: From Migrants to Local Hong Kong\r Lau, Siu-kai. 2000. “Hongkongese or Chinese: The Problem of Identity on the Eve of Resumption of Chinese Sovereignty over Hong Kong,” pp. 255-284, in Lau Siu-kai (ed.) Social Development and Political Change in Hong Kong. Hong Kong: The Chinese University of Hong Kong.\r  Mathews, Gordon, Eric Kit-wai Ma and Tai-lok Lui. 2008. “Hong Kong’s market-basd national identity: harbinger of a global culture?” pp. 148-167 in Hong Kong, China: Learning to Belong to a Nation. London: Routledge.\r  Ward, Barbara. 1985. Through Other Eyes. Hong Kong: Chinese University Press.\r  (3) The Making of Hong Kong: Urban Development as a Case\r Ho, Pui-yin. 2018. Making Hong Kong: A History of its Urban Development. Cheltenham: Edward Elgar.\r  (4) The Paradise of Capitalism and the Hong Kong Miracle\r Sung, Yun-wing. 2000. \"Growth of Hong Kong Before and After Its Reversion to China: The China Factor\", Pacific Economic Review, Vol. V, no. 2, June 2000, pp. 201-228 (co-authored with Wong Kar-yiu).\r  Sung, Yun-wing. 1997. \"The Hong Kong Economy through the 1997 Barrier\", Asian Survey, Vol. 37, No. 8, August 1997, pp. 705-719\r  Sung, Yun-wing. 2011. “Hong Kong and Shanghai: rivalry or complementarity among Asia’s international service hubs?” in Gipouloux Francois ed., Gateways to Globalisation: Asia’s International Trading and Finance Centres, Edward Elgar, 2011, pp. 101 – 116.\r  Sung, Yun-wing, Alex C.Y. Ng, Yuhao Wu, and Alex W.H. Yiu. 2015. “The Economic Benefits of Mainland Tourists for Hong Kong: The Individual Visit Scheme (IVS) and Multiple Entry Individual Visit Endorsements (M-Permit)”, Occasional Paper 34, Shanghai-HK Development Institute, Fudan University and Chinese University of Hong Kong, September 2015.\r  Chiu, Stephen W.K. 1996. “Unravelling Hong Kong’s Exceptionalism: The Politics of Laissez-faire in the Industrial Take-off.” Political Power and Social Theory, Vol. 10, pp. 229-256.\r  Lau, Lawrence J.. 2018. “The Chinese Economy in the New Era,” Working Paper no.69. Lau Chor Tak Institute of Global Economics and Finance, The Chinese University of Hong Kong, July 2018.\r  (5) Governance and Politics\r Lai, Siu-kai. 1982. Society and Politics in Hong Kong. Hong Kong: The Chinese University Press. Chapter 2, The Bureaucratic Polity, pp.25-66.\r  Lai, Siu-kai. 2000. “Democratization, poverty of political leaders, and political inefficacy in Hong Kong,” in Siu-kai Lau (Ed.). Social Development and Political Change in Hong Kong. Hong Kong: The Chinese University Press, pp.355-375.\r  Lui, Tai-lok. 2009. “Hong Kong’s changing opportunity structures: Political concerns and sociological observations” In Kwok-bun Chan, Agnes S. Ku and Yin-wah Chu (Ed.). Social Stratification in Chinese Societies. Leiden: Brill, pp.141-163.\r  (6) Foodways and Heritage\r Cheung, Sideney C.H. and Tang Chee Beng (eds.). Food and Foodways in Asia: Resource, Tradition and Cooking. Oxon: Routledge. \r  Cheung, Sideney C.H. 2005. Consuming “Low” Cuisine after Hong Kong’s Handover: Village Banquets and Private Kitchens. Asian Studies Review, 29(3): 259-273.\r  Cheung, Sideney C.H. 2013. From Foodways to Intangible Heritage: A Case Study of Chinese Culinary Resource, Retail and Recipe in Hong Kong. International Journal of Heritage Studies, 19(4): 353-364.\r  Chan, Selina Ching. 2010. “Food, Memories, and Identities in Hong Kong,” In Identities: Global Studies in Culture and Power 17: 204-227.\r  (7) Religion and Folk Beliefs\r Berger, Peter. 1990 ‘An East Asia development model?’ in Berger, P and Hsiao, MHH (eds) In Search of An East Asian Development Model, New Jersey: Transaction Publications, 3–11.\r  Ho, WY. 2013. Islam and China’s Hong Kong: Ethnic Identity, Muslim Networks and the New Silk Road, London: Routledge.\r  Lang, G and Ragvald, L. 1988. ‘Upward mobility of a refugee god: Hong Kong’s Huang Daxian’, Stockholm Journal of East Asian Studies, 1: 54–87.\r  Leung, B and Chan, SH. 2003. Changing Church and State Relations in Hong Kong, 1950-2000, Hong Kong: Hong Kong University Press.\r  O’Connor, P. 2012. Islam in Hong Kong: Muslims and Everyday Life in China’s World City, Hong Kong: Hong Kong University Press.\r  Watson, JL. 1985. ‘Standardizing the gods: The promotion of T’ien Hou (“Empress of heaven”) along the South China coast, 960-1960’ in Johnson, D, Nathan, AJ and Rawski, ES (eds) Popular Culture in Late Imperial China, Berkeley: University of California Press, 292–324.\r  Ciao, Chien. 1986. “Beating the Petty Person: A Ritual of Hong Kong Chinese.” Special Issue on Anthropological Studies of China, New Asia Acdemic Bulletin 6: 211-218\r  Liu, Tik-sang. 2003. “A Nameless but Active Religion: An Anthropologist’s View of Local Religion in Hong Kong.” China Quarterly, 174: 373-394.\r  (8) The Great Transformation: Guangdong-Hong Kong-Macao Bay Area Initiatives\r Lau, Lawrence J.. 2018. “The Chinese Economy in the New Era,” Working Paper no.69. Lau Chor Tak Institute of Global Economics and Finance, The Chinese University of Hong Kong, July 2018.\r  https://www.bayarea.gov.hk/en/about/overview.html", "recommended_readings": "", "terms": {"2021-22 Term 1": {"--LEC (7674)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [5], "locations": ["Esther Lee Bldg 204"], "instructors": ["Professor WONG Suk Ying Veronica"], "meetingDates": ["10/9", "17/9", "24/9"]}}}, "assessments": {"Discussion": "25", "Homework or assignment": "50", "Presentation": "25"}}, {"code": "4090", "title": "Independent Research on International Studies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Independent StudyProject", "campus": "Main Campus", "academic_group": "International Asian Studies PC", "requirements": "", "description": "This course is tailor-made for International Asian Studies Programme (IASP) students who want to engage in a short-term project. Students taking this course are required to write a research paper on a topic in international studies under the supervision of an academic staff member.", "outcome": "After completing this course, students should be able to:  Deepen their understanding on a specific topic in international studies. Enhance their research skills and techniques. Possess the skills to present their ideas and findings via reports and papers.", "syllabus": "To be decided by supervisors and students.", "required_readings": "To be decided by supervisors and students.", "recommended_readings": "To be decided by supervisors and students.", "terms": {"2020-21 Term 1": {"-J01-PRJ (7807)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Staff"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-J01-PRJ (6673)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Staff"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2020-21 Summer Session": {"-J01-PRJ (1537)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["30/06/2021 - 18/08/2021"]}}, "2021-22 Term 1": {"-J01-PRJ (6571)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-J01-PRJ (6773)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Discussion": "10", "Report": "90"}}, {"code": "4280", "title": "International Asian Studies Programme Senior Seminar Course", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureProjectSeminar", "campus": "Main Campus", "academic_group": "International Asian Studies PC", "requirements": "", "description": "This is a project-based course in which students will be grouped into different teams. Members of each group shall come from different disciplines in at least two different faculties and comprised of both international and local students as far as possible. Each member of the research group should approach the topic from their own discipline and a comparative analysis should be made of varying Chinese and Western perspectives. By doing so, each student will gain an all-round knowledge and diverse perspective of the topic.", "outcome": "After completing this course, students should be able to:  Deepen their understanding of current affairs and cultural issues pertaining to Chinese and Asian societies. Possess the skills to conduct an effective and collaborative research. Demonstrate effective cross-cultural exchange with both international and local students. Develop and enhance the skills of inter-disciplinary research and discussion.", "syllabus": " The scope of the research topic to be selected is very wide. Some suggested areas include: Philosophy and anthropology University, society, Hong Kong, and global issues Political, economic, societal, moral, technological and arts issues Developments and discoveries in different fieldsExact topic are subject to the discussion between team members.", "required_readings": "To be decided by course lecturers and students.", "recommended_readings": "To be decided by course lecturers and students.", "terms": {"2021-22 Term 2": {"AS01-SEM (4885)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Yasumoto Int'l Acad Park 402"], "instructors": ["Staff"], "meetingDates": ["14/1", "21/1", "28/1"]}, "BS01-SEM (5028)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Yasumoto Int'l Acad Park 502"], "instructors": ["Staff"], "meetingDates": ["14/1", "21/1", "28/1"]}}}, "assessments": {"Discussion": "20", "Presentation": "30", "Report": "50"}}, {"code": "5090", "title": "Independent Research on International Studies", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Office of Academic Links", "requirements": "", "description": "This course is tailor-made for International Asian Studies Programme (IASP) students who want to engage in a short-term project. Students taking this course are required to write a research paper on a topic in international studies under the supervision of an academic staff member.", "outcome": "After completing this course, students should be able to:1. Deepen their understanding on a specific topic in international studies.2. Enhance their research skills and techniques.3. Possess the skills to present their ideas and findings via reports and papers.", "syllabus": "To be decided by supervisors and students.", "required_readings": "To be decided by supervisors and students.", "recommended_readings": "To be decided by supervisors and students.", "terms": {"2020-21 Term 1": {"-J01-PRJ (2200)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Staff"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-J01-PRJ (1359)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-J01-PRJ (1440)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-J01-PRJ (1144)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Discussion": "10", "Report": "90"}}]