[{"code": "1000", "title": "Invitation to Linguistics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "The course invites students to explore the central components of linguistics. Students will have an overview of the properties of language and the various fields of linguistics, looking at the grammatical aspects of language, which include the studies of sounds and sound system, words and word formation, sentence patterns, and meaning. The psychological and biological foundations of language and applications of linguistics to other fields will also be covered.\r", "outcome": "• to expose students to the core aspects of linguistics and introduce fundamental concepts in linguistics;  • to develop students’ sensitivity toward language phenomena and shape their understanding of the \r  systematic properties in sound, meaning and structure; • to familiarize students with basic linguistic terminology in lectures and assigned readings; • to train students to tackle linguistics problems with basic technical skills and make presentations", "syllabus": "    Topic   Contents/ Fundamental concepts   Introduction Tongue, language, how to approach languages; what linguistics studies; root, stem, affixes; sub-areas in linguistics   Language universals and language specificities Language as a feature system; linguistic universals; language typology; consonant, vowel, syllable; compound; word order   Sounds & words (1) Articulation; phone, phoneme, allophone,  morpheme, morphophonemics; minimal pair, complementary distribution   Sounds & words (2) Derivational and inflectional morphemes; free & bound morphemes; lexical & grammatical morphemes   Forms of words (1)  Word vs. morpheme; order in word derivation; word structure; lexical vs. functional words; functional morpheme (agreement)    Forms of words (2)  Prefix, infix, suffix, circumfix; grammatical function of words & morphemes; tense, aspect & case morphology, subject-verb agreement morphology    Meaning (1)   Word meaning; ambiguity in word meaning,  polysemy; meaning & sense; semantic primitives; structural ambiguity; garden path sentences    Meaning (2)  Word vs. lexeme; semantic sense relationship; synonym, antonym, hyponym, hypernym; semantic hierarchy; semantic feature analysis; categorical features; mass vs. count distinction    Structures (1)  Constituency of phrase structure; head, complement & specifier; determiner & complementizer as heads    Structures (2)  Hierarchical structure in syntax; structural relations; labeled brackets & tree diagrams; binary branching & X’ syntax    Language & brain  Left & right hemispheres of the brain; Broca’s  area and Wernicke’s area; acquired and developmental aphasia; agrammatism, sensory aphasia, anomia    ", "required_readings": " Textbooks\r a. An Introduction to Language, 9th edition. Victoria Fromkin, Robert Rodman, and Nina Hyams. 2011. Harcourt, Canada. \r (URL for the supplementary materials (based on the 8th edition of the book 2007) : http://www.heinle.com/cgi-wadsworth/course_products_wp.pl?fid=M20b&product_isbn_issn=9781413017731&discipline_number=300)\r   b. The Cambridge Encyclopedia of Language. 2nd edition. David Crystal. 1997. Cambridge University Press.", "recommended_readings": " Reference books\r a. How to Study Linguistics: A guide to understanding language. Geoffrey Finch, John Peck and Martin Coyle. 2003. Palgrave.\r  b. The Language Instinct. Steven Pinker. 1995. HarperPerennial.\r   Interactive PPT files/lecture notes \r  DVD (A case study on aphasia)\r  Videos: The human language series, parts 1-3 (UC library, Call No.: P106 H85)\r  Paper of the Week (materials posted on the course Moodle for leisure reading about language related \r  topics)", "terms": {"2020-21 Term 1": {"--LEC (7213)": {"startTimes": ["15:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor SZE Yim Binh"], "meetingDates": ["10/9", "17/9", "24/9"]}, "-T01-TUT (7178)": {"startTimes": ["17:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor SZE Yim Binh"], "meetingDates": ["10/9", "17/9", "24/9"]}, "-T02-TUT (7212)": {"startTimes": ["17:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor SZE Yim Binh"], "meetingDates": ["10/9", "17/9", "24/9"]}, "-T03-TUT (7211)": {"startTimes": ["17:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor SZE Yim Binh"], "meetingDates": ["10/9", "17/9", "24/9"]}, "-T05-TUT (7208)": {"startTimes": ["17:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor SZE Yim Binh"], "meetingDates": ["10/9", "17/9", "24/9"]}, "-T06-TUT (7209)": {"startTimes": ["17:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor SZE Yim Binh"], "meetingDates": ["10/9", "17/9", "24/9"]}, "-T07-TUT (7210)": {"startTimes": ["17:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor SZE Yim Binh"], "meetingDates": ["10/9", "17/9", "24/9"]}}, "2021-22 Term 1": {"--LEC (8517)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [4], "locations": ["Yasumoto Int'l Acad Park LT4"], "instructors": ["Dr. CAO Wenling"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}, "-T01-TUT (8516)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Yasumoto Int'l Acad Park 501"], "instructors": ["Dr. CAO Wenling"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}, "-T02-TUT (8515)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Yasumoto Int'l Acad Park 508"], "instructors": ["Dr. CAO Wenling"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}, "-T03-TUT (8514)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Yasumoto Int'l Acad Park 511"], "instructors": ["Dr. CAO Wenling"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Essays": "45", "Essay test or exam": "20", "Others": "10", "Presentation": "25"}}, {"code": "1001", "title": "Exploring Grammar: Mandarin", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course aims to develop students’ awareness of Chinese grammar. Students will explore the grammatical properties of the Chinese language through application of a descriptive approach to the analysis of Chinese data. Students are expected to achieve a sophisticated understanding of the language for further linguistic investigation in the future.\r", "outcome": "Category A  Professional/academic knowledge and skills\r - apply the concepts of morphological and syntactic analysis to describe the structure, meaning and actual use of Chinese words, phrases and sentences; - generalize from findings to establish rules; - identify and analyze various forms and sentence patterns.\r  Category B  Attributes for all-roundedness\r - understand and consequently use Chinese effectively and accurately; - through the application of grammatical analysis and critical evaluation, have a more grounded sense of social, cultural and national responsibility; - have developed strategies for learning autonomously and collaboratively.", "syllabus": "    LING1001       Topic   Contents/ Fundamental concepts   1．語言、方言和現代漢語 語言，漢語，現代漢語，方言，辭彙，語法   2．語素、詞和詞匯  語素，自由語素，粘著語素，詞，短語，單純詞，合成詞，詞根，詞綴   3．詞類的劃分 詞的語法功能，主要的句法成分， 實詞，虛詞，體詞，謂詞，辭彙詞，功能詞   4．語法關係與句子的分類 主語，謂語，賓語，定語，狀語，補語，句類，陳述句，疑問句，祈使句，感歎句，句型   5．短語結構理論 樹狀圖，投射，x杠理論，中心語，指定語，補足語，功能詞短語   6．名詞短語的句法分析 名詞，量詞，數詞，代詞，有定，無定，有指稱，無指稱   7．謂語的句法分析 名詞，量詞，數詞，代詞，有定，無定，有指稱，無指稱   8．賓語和補語 賓語和補語的區別，結果補語，程度補語，情態補語，趨向補語，可能補語   9．體和語氣 狀態，活動，達成，完結，辭彙體，語法體，完成體，非完成體，經歷體，句末助詞與語氣   10．狀語與定語 偏正結構，定語，狀語，附接語，時間狀語，方式狀語，態度狀語   11．多義短語的分析 單義短語，多義短語，歧義，結構歧義，辭彙歧義   12．複句 聯合複句，偏正複句，並列複句，順承複句，因果，目的，選擇，遞進，轉折，條件     ", "required_readings": "Textbooks\r 黃伯榮、廖序東。2002。《現代漢語》（增訂三版）。北京：高等教育出版社。\r 馬真。1997。《簡明實用漢語語法教程》。北京：北京大學出版社。", "recommended_readings": "Useful references\r 鄧思穎。2003。《漢語方言語法的參數理論》。北京：北京大學出版社。\r 陸儉明。2003。《現代漢語語法研究教程》。北京：北京大學出版社。\r 徐烈炯。1999。《共性與個性：漢語語言學中的爭議》。北京：北京語言與文化大學出版社。\r 朱德熙。1982。《語法講義》。北京：商務印書館。\r Fromkin, Victoria, Robert Rodman, and Nina Hyams. 2003. An Introduction to Language (7th edition). Boston, Heinle.\r Li, Charles N., and Sandra A. Thompson. 1981. Mandarin Chinese: a functional reference grammar. Berkeley and Los Angeles: University of California Press.\r Sun, Chaofen. 2006. Chinese: A Linguistic Introduction. Cambridge: Cambridge University Press. \r  Reading list\r University Library (reserved books)\r Moodle (http://moodle.cuhk.edu.hk/login/index.php)", "terms": {"2020-21 Term 1": {"--LEC (7600)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor YOU Shuxiang"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}, "-T01-TUT (7599)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor YOU Shuxiang"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}}, "assessments": {"Essays": "50", "Essay test or exam": "30", "Others": "20"}}, {"code": "1002", "title": "Exploring Grammar: Cantonese", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course introduces the basic features of Cantonese grammar taking a primarily descriptive approach. The areas covered include Cantonese phonology, morphology, aspectual system, grammatical constructions and sentence final particles. Students should develop a sharpened sensitivity to the characteristics of Cantonese grammar and be able to appreciate its complexities and their own intuitions about the language.\r", "outcome": "- Have a better understanding of the value of the studies of Cantonese and its grammar in linguistics and multilingual societies\r - Become familiar with common grammatical concepts and terms, with reference to the traditional grammatical framework and the generative framework\r - Describe language phenomena and apply the grammatical concepts to analyzing the phonological, morphological and syntactic structures of Cantonese\r - Become familiar with the salient grammatical features of Cantonese and the similarity and differences between Cantonese and Mandarin", "syllabus": "    Topic   Contents/ Fundamental concepts   Linguistic status of Cantonese Dialects vs. Languages, Cantonese as a Chinese dialect(?!), multi-lingual society, value of Cantonese in linguistics research   Phonology  Descriptive vs. prescriptive (正音), Cantonese phonological system, tones, phonotactic rules, dialectal variations, Jyutping   Morphology Classification of morphological structure in traditional Chinese grammar, e.g. 偏正, 動補, 並列, etc., word categories, tagging   Topic comment structure Contrast between subject- vs. topic-prominent languages (e.g. English and Cantonese), various constraints of topicalization   Sentence particles Sentence particles vs phrase particles, semantics and pragmatics of particles    Nominals and Classifiers  Nominal structure, classifier types, (in)definiteness of nominals, differences between Cantonese and Mandarin    Verbal suffixes/ particles  Syntax and semantics of zo 咗, gwo 過, gan 緊, hoi 開, faan 翻, etc.     Ditransitive construction  Word order of ditransitive, Thematic roles, weight    Wh-interpretation  Various use of wh-words in Cantonese, e.g. wh-indefinite, negative wh-words, wh-placeholders, surprise wh¬-interpretation, etc.    Right Dislocation  Focus, syntax of sentence particles and implications to Chinese clausal structure    ", "required_readings": "Textbook:\r Matthews, S & V. Yip. (1994) Cantonese: a Comprehensive Grammar. London: Routledge.\r 張洪年 (1972) 香港粵語語法的研究. 香港中文大學碩士論文.", "recommended_readings": "General References:\r Bauer, Robert and Paul Benedict. Modern Cantonese Phonology. Berlin and New York: Mouton de Gruyter,1997.\r Other papers or book chapters will be assigned in each lecture.", "terms": {"2021-22 Term 1": {"--LEC (8534)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 306"], "instructors": ["Professor CHEUNG Yam Leung"], "meetingDates": ["8/9", "15/9"]}, "-T01-TUT (8535)": {"startTimes": ["17:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Y.C. Liang Hall G04"], "instructors": ["Professor CHEUNG Yam Leung"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Essays": "10", "Essay test or exam": "50", "Others": "5", "Presentation": "35"}}, {"code": "1003", "title": "Exploring Grammar: English", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course focuses on the grammatical structure of English and helps students explore the complexities of the structure of English sentences in a descriptive framework. Students will be exposed to a wide range of grammatical constructions and trained to apply the descriptive approach to analyse them. The training will enrich students’ understanding of the grammatical categories and structure of English while consolidating their foundational knowledge of the language. References are also made to common errors in students’ English to raise their awareness of the problems in learning English. The course will deepen students’ sensitivity toward the subtleties and complexities in the structure of English and enable them to improve their accuracy in the use of English.\r", "outcome": "Upon successfully completing the subject, students should be able to:\r 1. Become familiar with common grammatical concepts and terms; 2. Have a better understanding of the prominent grammatical structure of English and its relation to meaning; 3. Apply the grammatical concepts to analyze and generalize from English data\r 4. Understand and use English more effectively.", "syllabus": "    LING1003       Topic   Contents/ Fundamental concepts   Descriptivism vs. prescriptivism Descriptive vs. prescriptive grammar; spoken vs written; standard vs sub-standard; formality   Morphology  Morpheme; allomorphy; inflectional vs. derivational morphology; word formation (e.g. compounding, conversion, blending)   Tense and aspect     Constituency and phrases Basic concept of constituency; simple constituency tests (just enough to illustrate the idea)   Word classes and phrases Major word classes (e.g. nouns; verbs; determiners; adjectives, adverbs, prepositions) and the corresponding phrases (e.g. NP, VP, and so on)   Clause structure, complements, adjuncts subjects, objects, predicates; complement; adjuncts; expletive; agreement   Clause types Interrogatives (wh-questions, yes-no questions, inversion, affix hopping and do support); exclamatives; imperatives; subjunctives; negative inversion   Subordination, coordination and relatives Coordination; matrix vs. embedded clauses; noun clauses; adverb clauses; compound clauses; complex clauses; finite vs. nonfinite clauses; head word and gap; relative pronoun; restrictive vs. non-restrictive relatives   Rules There-insertion; clefts and pseudo-clefts; dative movement; heavy-NP shift   X-bar syntax, complements and adjuncts Introduction to the basic idea of X-bar syntax   Wh-movement Wh-words and gap   Passives Passive construction and its morphology; by-phrases; NP-movement     ", "required_readings": "1. Aarts, Bas. (2008) English Syntax and Argumentation. (Third Edition) Palgrave Macmillan.\r 2. Carstairs-McCarthy, Andrew. (2002) An introduction to English morphology : words and their structure. Edinburgh University Press.\r 3. Fromkin, Victoria, Robert Rodman and Nina Hyams. (2010) An Introduction to Language (9th ed.). Wadsworth Publishing.\r 4. Huddleston, R, and G. Pullum. (2005) A Student‘s Introduction to English Grammar. Cambridge University Press.\r 5. Leech, Geoffrey. (2004) Meaning and the English Verb (3rd Edition). Pearson.", "recommended_readings": "1. Aarts, Bas. (2008) English Syntax and Argumentation. (Third Edition) Palgrave Macmillan.\r 2. Carstairs-McCarthy, Andrew. (2002) An introduction to English morphology : words and their structure. Edinburgh University Press.\r 3. Fromkin, Victoria, Robert Rodman and Nina Hyams. (2010) An Introduction to Language (9th ed.). Wadsworth Publishing.\r 4. Huddleston, R, and G. Pullum. (2005) A Student‘s Introduction to English Grammar. Cambridge University Press.\r 5. Leech, Geoffrey. (2004) Meaning and the English Verb (3rd Edition). Pearson.", "terms": {"2020-21 Term 2": {"--LEC (8346)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr. FU Baoning"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}, "-T01-TUT (8343)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr. FU Baoning"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 2": {"--LEC (6173)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [3], "locations": ["Lady Shaw Bldg LT3"], "instructors": ["Dr. FU Baoning"], "meetingDates": ["12/1", "19/1", "26/1"]}, "-T01-TUT (6174)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Lady Shaw Bldg LT3"], "instructors": ["Dr. FU Baoning"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Essays": "30", "Essay test or exam": "60", "Others": "10"}}, {"code": "2003", "title": "Phonetics I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course introduces the study of sounds as an essential part of human language: how they are produced, and how they are perceived. Students will gain a solid understanding of articulatory mechanisms for speech sounds, become familiar with the International Phonetic Alphabet (IPA), and acquire techniques of elicitation and transcription of speech sounds with special focus on English, Putonghua, and Cantonese.\r", "outcome": "1. Students can distinguish speech sounds using phonetic conventions.\r 2. Students will understand the articulatory and acoustic nature of speech sounds, and be introduced to a speech analysis software (Praat). \r 3. Students will be introduced to issues in speech production and perception research, and understand the complex nature of everyday speech communication. \r 4. Students will acquire the skills of producing and transcribing the sounds of the IPA symbols.\r 5. Students will have acquired the background knowledge for LING2004 Phonology I and LING3102 Phonetics II.", "syllabus": "    LING2003       Topic   Contents/ Fundamental concepts   Speech production mechanism Different steps in the speech chain   Consonants Place and manner of articulation, voicing and VOT, airstream mechanisms   Vowels The vowel quadrilateral and its acoustic correlates   Suprasegmentals Tones, stress, intonation, speech rhythm   Basic phonological concepts Phonemes, allophones, features    Acoustic phonetics Sound waves, formants, fundamental frequencies   Speech production Coarticulation   Speech perception Categorical perception, the McGurk effect   Transcriptions  Production and transcription of IPA symbols, and the Jyutping system for Cantonese      ", "required_readings": "", "recommended_readings": "Ashby, M. and Maidment, J. (2005) Introducing Phonetic Science. Cambridge: Cambridge University Press. \r  Clark, J. and Yallop, C. (1995) An Introduction to Phonetics and Phonology (2nd edition). Oxford: Blackwell Publishers. \r  Clark, J., Yallop, C. and Fletcher, J. (2007) An Introduction to Phonetics and Phonology (3rd edition). Oxford: Blackwell Publishers.\r  Denes, P.B. and Pinson, E.N. (1993) The Speech Chain (2nd edition). New York: W.H. Freeman and Company.\r  Ladefoged, P. (2005a). A Course in Phonetics (5th edition). Boston: Heinle & Heinle. \r  Ladefoged, P. (2005b) Vowels and Consonants (2nd edition). Oxford: Blackwell Publishing.\r  The International Phonetic Association. (1999). Handbook of the International Phonetic Association: A guide to the use of the International Phonetic Alphabet. Cambridge: Cambridge University Press.\r  Trask, R.L. (1996). A Dictionary of Phonetics and Phonology. London: Routledge. \r  《粵語拼音字表》第二版，香港語言學學會，2002。 \r  http://www.sil.org/computing/ipahelp/ipaprvw2.htm (IPA Help)", "terms": {"2020-21 Term 1": {"--LEC (6998)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor MOK Pik Ki Peggy"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}, "-T01-TUT (6997)": {"startTimes": ["13:30"], "endTimes": ["14:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor MOK Pik Ki Peggy"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}, "-T02-TUT (6996)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor MOK Pik Ki Peggy"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}, "2021-22 Term 1": {"--LEC (7885)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Leung Kau Kui Bldg 101"], "instructors": ["Professor MOK Pik Ki Peggy"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}, "-T01-TUT (8866)": {"startTimes": ["13:30"], "endTimes": ["14:15"], "days": [1], "locations": ["Lee Shau Kee Building 304"], "instructors": ["Professor MOK Pik Ki Peggy"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}, "-T02-TUT (8867)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Lee Shau Kee Building 302"], "instructors": ["Professor MOK Pik Ki Peggy"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "60", "Others": "10", "Presentation": "10"}}, {"code": "2004", "title": "Phonology I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Pre-requisite: LING2003", "description": "This course introduces core concepts of phonology, with a strong emphasis on data analysis from a wide variety of languages. How do sounds pattern together to form a phonological system in a particular language? What kinds of sounds are commonly found in human languages? Are there universal principles governing sound patterns in different languages? This course will also explore the theory of phonological representations, including distinctive features, syllables, and tone.", "outcome": " Understand basic concepts of segmental phonology, such as phonemes, minimum pairs, alternations  Understand how segments are distributed within sound systems of different languages  Understand how surface sounds are derived from underlying forms by applying phonological rules  Be able to identify sound patterns and draw generalizations from different language data  Be able to apply phonological concepts into data analysis", "syllabus": "  Topic   Contents/ Fundamental concepts   Phoneme/ Allophone Distributions/ alternations(near) minimal pairs/free variations   Phonemic inventories Methos of establishing phonemic inventories of unknown languages   Phonological processes Assimulation/ Dissimilation/ Insertion/ Deletion/ Metatheses   Surface alternations Underlying representations/ morphonemic alternations   Distinctive features Definitions of distinctive Features/ Functions of Distinctive Features   Phonological Rules Notations and formalism of phonological rules   Rule interaction Rule ordering/ derivation from underlying forms to surface forms    ", "required_readings": "Hayes, B. (2009). Introductory phonology. West Sussex: Wiley-Blackwell.Odden, D. (2013). Introducing phonology. 2nd Edition. NY: Cambridge University Press. ", "recommended_readings": "Gussenhoven, Carlos. and Haike Jacobs. 1998. Understanding Phonology. Edward Arnold (Publishers) Limited. Foreign Language Teaching and Research Press. 2003.  ", "terms": {"2020-21 Term 2": {"--LEC (5471)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor LAI Yee King Regine"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}, "-T01-TUT (7749)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor LAI Yee King Regine"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}, "-T02-TUT (5181)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor LAI Yee King Regine"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (7350)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Y.C. Liang Hall 103"], "instructors": ["Professor LAI Yee King Regine"], "meetingDates": ["10/1", "17/1", "24/1"]}, "-T01-TUT (7620)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Y.C. Liang Hall 103"], "instructors": ["Professor LAI Yee King Regine"], "meetingDates": ["10/1", "17/1", "24/1"]}, "-T02-TUT (7621)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Y.C. Liang Hall 106"], "instructors": ["Professor LAI Yee King Regine"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Essays": "40", "Essay test or exam": "35", "Others": "10", "Short answer test or exam": "15"}}, {"code": "2005", "title": "Syntax I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course introduces some fundamental concepts in the study of syntax and looks at how the formation of phrases and sentences is principled and how syntactic rules are universal. These concepts will be introduced through grammatical structures accessible to the students, ranging from simple to complex constituents. The course enables students to see the capacity of the human linguistic system to form complex structures. Students will develop sensitivity toward natural language structures and gain hands-on experience of tackling syntactic problems in the form of a mini-project.\r", "outcome": "to familiarize students with basic goals and assumptions in universal grammar (UG); to train students to be able to identify structural patterns and make sensible generalizations; to train students in the rudiments of structural analysis and argumentation in syntax; to familiarize students with major structural properties in English and extend them to their native language(s) to bring into light the relevance of syntactic theories in UG and their applications to specific languages", "syllabus": "    LING2005       Topic   Contents/ Fundamental concepts   Fundamentals in syntax Grammar, syntax; competence vs. performance; I-languages vs. E-language; the language faculty; levels of adequacies in linguistic research; structural ambiguity; prescriptive vs. descriptive grammars; constituency structure and structural hierarchy   Structural relations Recursiveness in syntax; diagnostics for constituency structures; coordination, embedding, adjunction, replacement, cleftings, pseudo-clefting, fronting, & movement; VP, TP, & CP structures; motivating X-bar/X' theory   Binding theory Types of determiner phrases (DPs), anaphor, antecedent, reflexive, reciprocal & referential expression; difference between personal and reflexive pronouns; motivating structural dependencies and the Binding Theory: c-c-command, dominance & precedence relations   Empty categories & related theories Verb/predicate argument structure, null/covert categories; wanna contraction & PRO; motivating Projection Principle and Full Interpretation; proposition, tensed clause; agreement; control; adverb placement   Head movement & VP structure The VP-internal Subject hypothesis; V to T movement; lexical decomposition, motivating the VP Shell Hypothesis & light verb projection; V to v movement in Chinese as an illustration   A movement & related theories Theta Theory & the Theta Criterion, theta grid & thematic hierarchy; external vs. internal arguments; argumental vs. non- argumental noun phrases, expletive; Case Theory, Case Filter; structural vs. lexical Cases; structural configuration of Case assignment; [A] csv [-A]/A-bar positions; Burzio’s Generalization & related constructions; passive, middle & unaccusative; stative vs. eventive sentences   Raising VS. Control and related theories Difference between structural positions & arguments; raising construction; subject control vs. object control constructions; arbitrary PRO; exceptional Case marking construction   Wh-movement & related theories Clause types and complementizers; Move-a, Xo (head) movement, XP (A & A’/A-bar movement); relative clause vs. appositive clause; movement and c-command     ", "required_readings": "1. Textbooks Carnie, A. 2007. Syntax: A Generative Introduction. 2nd edition. Blackwell. Radford, A. 1997. Syntactic Theory and the Structure of English: A Minimalist Approach. Cambridge University Press.", "recommended_readings": "2. Reference books (On reserve) Tallerman, M. 2005. Understanding Syntax. Arnold. Cook, V. and M. Newson. 2007. Chomsky’s Universal Grammar: An Introduction, 3rd edition. Blackwell. Haegeman, L. 2006. Thinking Syntactically: A Guide to Argumentation and Analysis. Blackwell. 3. PPT files with animated tree diagrams and derivations to accompany teaching notes", "terms": {"2020-21 Term 2": {"--LEC (4882)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor CHEUNG Yam Leung"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}, "-T01-TUT (4855)": {"startTimes": ["13:30"], "endTimes": ["14:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor CHEUNG Yam Leung"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}, "-T02-TUT (8813)": {"startTimes": ["13:30"], "endTimes": ["14:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor CHEUNG Yam Leung"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}, "-T03-TUT (8814)": {"startTimes": ["13:30"], "endTimes": ["14:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor CHEUNG Yam Leung"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (7342)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [1], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Professor CHEUNG Yam Leung"], "meetingDates": ["10/1", "17/1", "24/1"]}, "-T01-TUT (6199)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [1], "locations": ["William M W Mong Eng Bldg 408"], "instructors": ["Professor CHEUNG Yam Leung"], "meetingDates": ["10/1", "17/1", "24/1"]}, "-T02-TUT (6200)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [1], "locations": ["William M W Mong Eng Bldg 706"], "instructors": ["Professor CHEUNG Yam Leung"], "meetingDates": ["10/1", "17/1", "24/1"]}, "-T03-TUT (7162)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [1], "locations": ["William M W Mong Eng Bldg 713"], "instructors": ["Professor CHEUNG Yam Leung"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Essays": "30", "Essay test or exam": "30", "Others": "10", "Presentation": "15", "Short answer test or exam": "15"}}, {"code": "2006", "title": "Semantics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "How are expressions in a language system interpreted? What are the approaches towards decoding mechanisms in the study of meaning in natural languages? How does one account systematically for ambiguities in the meaning of sentences? To what extent is the study of meaning independent of language context and use? This course examines how meaning is systematically coded in the grammar of natural languages through structural and empirical methods of semantic analysis at the word, sentence and utterance levels. Basic concepts such as sense and reference, lexical semantics, truth functionality in conjunction, disjunction, implication and contradiction, events and entities, as well as quantification will be included.\r", "outcome": "Students who complete this course will:\r • gain familiarity with a diverse range of semantic phenomena\r • engage in the incremental construction of a formally explicit theory of truth-conditional semantics that captures these facts; • have an opportunity to apply and possibly extend this theory towards the (further) description and analysis of a semantic phenomenon that particularly interests them.", "syllabus": "What is meaning?--some views on meaning, truth-condition, compositionality, entailment, contradiction, tautology\r Sets and functions--set, relations between sets (subset, proper subset, superset), operation on sets (intersection, union, complement), ordered pair, function\r Propositional logic--proposition, logical connectives, reasoning with truth tables, syntax and semantics of propositional logic\r Predicate logic--Predicate (one-place predicate, two-place predicate) vocabulary of predicate logic (e.g. existential quantifier, universal quantifier) syntax and semantics of predicate logic , translations between predicate logic and natural language\r Compositional semantics--type theory, composition rules: function application, predicate modification\r Quantification--meaning of quantifiers, scope ambiguity,quantifier raising, type shifting\r Polarity--entailment and monotonicity, negative polarity item\r Inferences--presuppositions, defninte determiner implicatures and Gricean Maxims\r Plural-- Commulativity, lattice structure", "required_readings": "Chierchia, Gennaro and Sally McConnell-Ginet. 2000. Meaning and grammar: An introduction to semantics (2nd edition). The MIT Press.\r Elizabeth Coppock and Lucas Champollion. (In progress). Formal Semantics Boot Camp. [a draft textbook available at http://eecoppock.info/semantics-boot-camp.pdf]\r Kearns, Kate. 2011. Semantics (2nd ed.), Modern linguistics series. Palgrave Macmillan.", "recommended_readings": "1. Cruse, Alan. 2011. Meaning in language: An introduction to semantics and pragmatics (3rd edition). Oxford University Press.\r 2. Hurford, James, Brendan Heasley & Michael Smith. 2007. Semantics: a course book. Cambridge University Press.\r 3. Jaszczolt, K. 2002. Semantics and pragmatics: Meaning in language and discourse. Longman. (Peking University Press edition available on Taobao)\r 4. Lyons, Christopher. 1999. Definiteness. Cambridge University Press. (ebook available via lib)\r 5. Lyons, John. 1977. Semantics. Vol 1 & II. Cambridge University Press.\r 6. Lyons, John. 1995. Linguistic semantics: an introduction. Cambridge University Press. (Peking University Press edition available on Taobao as well)\r 7. Portner, Paul. 2005. What is meaning?: Fundamentals of formal semantics. Blackwell Publishing.\r 8. Riemer, Nick. 2010. Introducing semantics. Cambridge University Press.", "terms": {"2020-21 Term 1": {"--LEC (4926)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. XU Ting"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}, "-T01-TUT (4927)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. XU Ting"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}, "-T02-TUT (4925)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. XU Ting"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}, "2021-22 Term 2": {"--LEC (8016)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [4], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Staff"], "meetingDates": ["13/1", "20/1", "27/1"]}, "-T01-TUT (6175)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [4], "locations": ["William M W Mong Eng Bldg 706"], "instructors": ["Staff"], "meetingDates": ["13/1", "20/1", "27/1"]}, "-T02-TUT (6176)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [4], "locations": ["William M W Mong Eng Bldg 713"], "instructors": ["Staff"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Essay test or exam": "25", "Homework or assignment": "55", "Short answer test or exam": "20"}}, {"code": "2007", "title": "Linguistic Argumentation I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Not for students who have taken LING2001", "description": "The course aims to train students in the articulation of ideas related to language issues. It will engage students in critical reflections on the character of linguistic units at various levels of grammar, as well as systematic observations and descriptions of language phenomena. Students will be introduced to the structure and norms of academic writing in the linguistic sciences, and will receive intensive practice in the speaking and writing techniques essential for the reporting and analysis of language data, in both English and Chinese.\r", "outcome": "By the end of the course, students are expected to have achieved the following through intensive reading, intensive writing, and analysis of the structure of language and texts using linguistics concepts:\r a. An understanding of the complexities involved in the process of reading and writing, and the elements that contribute to effective reading and effective writing; b. The ability to articulate ideas in clear and precise language, and organize them coherently and logically in a text of extended length; c. The ability to write a thesis statement to express the controlling idea of a composition, and to write topic sentences of paragraphs, as a major strategy for academic writing; d. An understanding of how one can use paragraphing to help present one's ideas, and an awareness of larger textual patterns that enhance the richness of expressions and effectiveness in argumentation;  e. An enhanced knowledge of some of the typical errors of advanced Chinese learners of English, based on in-depth lexical and grammatical analysis; f. An elementary understanding of levels of formality and stylistic registers in writing; g. A basic command of the standard tools that are useful for writing: dictionaries, thesauruses, reference grammars, usage manuals, style sheets, and programs for preparing bibliographies.", "syllabus": "    LING2001     Week Topic Readings       Complexities of the writing process; elements of writing.  Documentation I:  Preparation of references and bibliographies; introduction to Mendeley.  Tools for writing I:  Important monolingual English dictionaries; English-Chinese dictionaries; thesauruses.    Crystal, David. 1997. Vanishing languages. Civilization, Feb/Mar, 1997, 40-45. Reprinted in About language: A reader for writers, eds. W. Roberts and G. Turgeon. 5th edition. Boston: Houghton Mifflin.  Ladefoged, Peter. 1992. Another view of endangered languages. Language, 68(4), 809-911. Hale, Kenneth. 1998. On endangered languages and the importance of language diversity. In Endangered languages: Language loss and community response, eds. L. Grenoble and L. Whaley. London: Cambridge University Press.        The complexity of the reading process; elements of reading; different levels of reading; competencies of an effective reader. Strunk, W. 2000. The elements of style, Ch. I \"Elementary rules of usage\"; Ch. II \"Elementary rules of composition\", pp. 1-33.  Adler, M. and C. van Doren. 1972. How to read a book, Part I \"Dimensions of reading\", pp. 1-56.        Grammar, diction and style for the advanced ESL learner.   Whorf, Benjamin Lee. 1940. Science and linguistics. Technological Review, 42:229-231, 247-248, no. 6 (April 1940).  Whorf, Benjamin Lee. 1956. The relation of habitual thought and behavior to language. In Language, thought and reality: Selected writings of Benjamin Lee Whorf, ed. John Carroll. Cambridge, MA: MIT Press. Reprinted in Linguistic anthropology: A reader, ed. Alessandro Duranti. Oxford: Blackwell.  Boroditsky, Lera. 2011. How language shapes thought. Scientific American, February, 2011, 63-65.       Argumentation I:  Paragraphing; paragraph structure; thesis statement; topic sentence; Reconstructing argumentation structure in note-taking.   Issues of Grammar and Style I:  Tense and agreement.     Strunk, W. 2000. The elements of style, Ch. V \"An approach to style (with a list of reminders)\", pp. 66-85.  Adler, M. and C. van Doren. 1972. How to read a book, Part II \"The second level of reading: Analytical reading\", pp. 59-136.  Pullum, Geoffrey. 1989. The great Eskimo vocabulary hoax. Natural Language and Linguistic Theory, 7(2), 275-281.        Documentation II: Avoiding plagiarism; citation; quotation.  Tools for writing II:  Usage handbooks and reference grammars.    Jakobson, Roman. 1960. Linguistics and poetics. In Style in Language, ed. Thomas Sebeok. Cambridge, MA: MIT Press. (Excerpt, pp. 62-73).  Halliday, M.A.K. 1970. Language structure and language function. In New Horizons in Linguistics, ed. John Lyons. London: Penguin.  Ferguson, Charles. 1959. Diglossia. Word 15, 329-340. Reprinted in Language and social context: Selected readings, ed. Pier Paolo Giglioli. 1972. London: Penguin.        Argumentation II:  Defining a term; elaboration; illustration; comparison and contrast.  Issues of Grammar and Style II:  Subclasses of verbs; Verbs for a specific purpose (unaccusative verbs, verbs of communication, cognitive verbs, etc.)  Austin, J. 1959. Constatives and performatives. In Problems in the Philosophy of Language. 1969. ed. T. Olshewsky, pp.242-250. New York: Holt, Rinehart and Winston.  Searle, John. 1965. What is a speech act? In Philosophy in America, ed. Max Black. Ithaca, NY: Cornell University Press. Reprinted in The Philosophy of language, ed. A. Martinich. 1990. Oxford: Oxford University Press.        Tools for writing III: Thesauruses; specialized dictionaries (collocation dictionaries; dictionaries of phrasal verbs)  Issues of Grammar and Style III:   Selected syntactic and semantic patterns relevant to advanced Chinese learners of English; articles and (in)definiteness.  Strunk, W. 2000. The elements of style, Ch. IV \"Words and expressions commonly misued\", pp. 39-65.  Adler, M. and C. van Doren. 1972. How to read a book, Part II \"The second level of reading: Analytical reading\", pp. 137-188.          Argumentation III: Repetition and restatement; parallelism and other rhetorical devices; writing introductions and conclusions; reporting results.  Issues of Grammar and Style IV:   Selected syntactic and semantic patterns relevant to advanced Chinese learners of English: word order, focus, and information structure.  Bernstein, Basil. 1971. Social class, language and socialization. In Class, codes, and control, Vol. 1. London: Routledge and Kegan Paul.  Labov, William. 1969. The logic of nonstandard English. In Language in the inner city. 1971. Philadelphia, PA: University of Pennsylvania Press.        Argumentation IV: The process of writing; drafting, revising, editing.  Issues of Grammar and Style V:   Selected syntactic and semantic patterns relevant to advanced Chinese learners of English: Reference and anaphora.  Kaplan, R. 1966. Cultural thought patterns in inter-cultural education. Language Learning 16. Reprinted in Landmark essays on ESL writing, eds. T. Silva and P. K. Matsuda. 2001. Mahwah, NJ, Lawrence Erlbaum Associates. Nisbett, Richard E. 2003. The geography of thought: How Asians and westerners think differently - and why. New York: Free Press. Ch. 6 \"Is the world made up of nouns or verbs?\"       Tools for writing IV: Linguistic terminology; linguistics dictionaries and encyclopedia.  Issues of Grammar and Style VI:   Levels of formality; genre and stylistic registers, intertextuality.  Ohashi, Yoshimasa. 1978. English style: Grammatical and semantic approach. Rowley, MA: Newberry House. Chs. 1-4, pp. 1-53.        Argumentation V: Linking words and transitional expressions; writing for an audience.  Issues of Grammar and Style VII:  Politeness norms and usage.  Ohashi, Yoshimasa. 1978. English style: Grammatical and semantic approach. Rowley, MA: Newberry House. Chs. 6-, pp. 54-89.       Argumentation VI: Academic writing, Chinese vs. English with respect to rhetorical patterns, stylistic register, and documentation.  Celce-Murcia, Marianne, and Diane Larsen-Freeman. 1999.  The grammar book: an ESL/EFL teacher's course. 2nd ed. (Excerpts).        A brief introduction to research design Heppner, P. Paul, and Mary J. Heppner. 2009. Writing your thesis, dissertation, and research. Beijing: Beijing University, pp. 39-52.      Final quiz based on lectures, reading materials and class discussions       ", "required_readings": "Strunk, William Jr. 2000. The elements of style; with revisions, an introduction, and a chapter on writing by E.B. white. 4th ed. Boston: Allyn and Bacon.\r Adler, Mortimer J., and Charles L. van Doren. 1972. How to read a book. New York: Simon and Schuster.", "recommended_readings": "Gibaldi, Joseph. 2009. MLA handbook for writers of research papers. 7th ed. New York: Modern Language Association of America.\r Murray, Neil. 2012. Writing essays in English language and linguistics: Principles, tips and strategies for undergraduates. Cambridge; New York: Cambridge University Press.\r Celce-Murcia, Marianne, and Diane Larsen-Freeman. 1999. The grammar book: an ESL/EFL teacher's course. 2nd ed. Boston, MA: Heinle ELT.\r Ilson, Robert. ed. 1985. Dictionaries, lexicography and language learning. Oxford: Pergamon.\r Ohashi, Yoshimasa. 1978. English style: Grammatical and semantic approach. Rowley, MA: Newberry House.\r Bauer, Laurie, and Peter Trudgill, eds. 1998. Language myths. London, England; New York, USA: Penguin Books.", "terms": {"2020-21 Term 2": {"--LEC (4883)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. LEI Ka Yan Margaret"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}, "-T01-TUT (4881)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. LEI Ka Yan Margaret"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 2": {"A-LEC (4473)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [2], "locations": ["Lady Shaw Bldg C5"], "instructors": ["Dr. LEI Ka Yan Margaret"], "meetingDates": ["11/1", "18/1", "25/1"]}, "AT01-TUT (4474)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Lady Shaw Bldg C5"], "instructors": ["Dr. LEI Ka Yan Margaret"], "meetingDates": ["11/1", "18/1", "25/1"]}, "B-LEC (6201)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [2], "locations": ["Lee Shau Kee Building 202"], "instructors": ["Staff"], "meetingDates": ["11/1", "18/1", "25/1"]}, "BT01-TUT (6202)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Lee Shau Kee Building 202"], "instructors": ["Staff"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Essays": "70", "Short answer test or exam": "30"}}, {"code": "2008", "title": "Linguistic Argumentation II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "1.Prerequisite: LING2007;2.Not for students who have taken LING2002", "description": "This course enhances students’ sensitivity to the structure of linguistic argumentation. Through critical discussion of selected cases, students will explore the ways in which one may arrive at generalizations based on linguistic evidence, how different analyses may apply to a given linguistic phenomenon, and the grounds on which one analysis may be judged to be superior to another. Standard arguments in linguistic analysis will be introduced with illustrations drawn from phonology, syntax and semantics. Concepts such as economy, internal consistency, pattern congruity, linguistically significant generalizations, and learnability will be highlighted.\r", "outcome": "By the end of the course, students are expected to have achieved the following, through intensive reading of linguistics articles in both English and Chinese, detailed discussion of the units and categories of language, and reflections on various phenomena related to phonology, syntax, and semantics: \r a) A clear understanding of the basic units and categories of language; phoneme and distinctive feature; morpheme and word; syntactic categories and phrasal structure; an ability to define these units and categories, and justify why particular words and phrases belong to them;  b) The ability to describe the structure of argumentation of a linguistics article, and respond to the ideas contained in it; c) An understanding of some standard arguments used in the analysis of sound patterns, sentence structure and meaning relations; d) An interest to observe the languages encountered in daily life, and some skills in tapping into one's own native language competence; e) A sensitivity to the possibility of alternative analyses for the same linguistic phenomena, and an elementary grasp of the methodological reasons for favoring one analysis over another, with reference to criteria such as economy, internal consistency, pattern congruity, linguistically significant generalizations and learnability;  f) Some familiarity with the standard Chinese linguistics terms used for basic concepts in general linguistics; some familiarity with the use of English as a meta-language to discuss data from other languages, in particular Chinese; g) An enhanced ability to write clear, well-organized and coherent expository papers on language, making use of techniques such as formulating thesis statements, paragraphing and self-editing; h) An enhanced knowledge of some of the typical errors of advanced Chinese learners of English, based on in-depth lexical and grammatical analysis; i) A basic command of the use of reference grammars for descriptive facts about a language.", "syllabus": "    LING2002     Week Topic Readings  (*indicates required readings)       - Basic units of phonology I: defining the phoneme - The nature of the English spelling system - Guide to Assignment 1 *Swadesh, Morris. 1934. The Phonemic Principle. Language 10 (2):117-129.  *Chomsky, Carol. 1970. Reading, writing and phonology, Harvard Educational Review 40(2), 287-309.        - Basic units of phonology II: defining the distinctive feature; evidence for the phoneme and the distinctive feature - Discussion of Swadesh (1934) and C. Chomsky (1970) *Fromkin, Victoria. 1971. The Non-Anomalous Nature of Anomalous Utterances. Language 47 (1), 27-52. *Shen, Jiaxuan. 1993. Slips of the tongue and the syllable structure of Chinese. In Essays on the Chinese language by contemporary Chinese scholars, edited by Yau Shun-chiu. Paris: Editions Langages Croises, pp. 139-162.       - Defining the morpheme and the word I - Discussion of Fromkin (1971) and Shen (1993)  *Bauer, Laurie. 1988. Introducing linguistic morphology. Ch. 4, \"Defining the word form\", pp. 45-55. *吕叔湘, 1962,「说『自由』和 『黏着」 ,载《汉语语法论文集》1984。 北京:商务。*呂叔湘, 1962,「說『自由』和 『黏著」 ,載《漢語語法論文集》1984。 北京:商務。       - Defining the morpheme and the word II - Discussion of Bauer (1988) and 呂 (1962) *Hockett, Charles. 1958. A course in modern linguistics. New York: Macmillan. Ch. 19, \"Words\", pp. 166-176.. *呂叔湘。 1979。 《漢語語法分析問題》北京: 商務印書館. 8-30節, pp. 14-26。        - Syntactic categories I: defining parts of speech in English - Guide to Assignment 2. - Conceptual issues in the creation of Chinese modern linguistics terminology - Discussion of Hockett (1958) and吕(1979).  *Aarts, Bas. 2001. English syntax and argumentation. 2nd ed. New York: Palgrave. Ch. 3, \"Form: words, word classes, and phrases\", pp. 25-52. *湯廷池,1992,「漢語語法研究的回顧與展望--兼談當代語法學的本土化」《漢語詞法句法三集》臺北:學生書局, pp. 93-129。        - Syntactic categories II: defining parts of speech in Chinese - Discussion of Aarts (2001) and 湯 (1992) *高名凱,1955,「關於漢語的詞類分別」,載《漢語的詞類問題》中國語言編輯部編。 北京:中華書局, pp. 43-52。  *Tai, James. 1982. Relevant categorical distinctions in Chinese. Papers from the Eighteenth Regional Meeting of the Chicago Linguistic Society. pp. 495-506. *McCawley, James. 1992. Justifying part-of-speech assignments in Mandarin Chinese. Journal of Chinese Linguistics 20(2), 211-245.       - Syntactic categories III: another look at some syntactic categories - Discussion of 高 (1995), Tai (1982) and McCawley (1992)    *Jackendoff, Ray. 1973. The base rules for prepositional phrases. In A festschrift for Morris Halle, edited by Stephen Anderson and Paul Kiparsky. New York: Holt, Rinehart and Winston, pp. 345-356. *Palmer, Frank. 1983. Semantics explanations for the syntax of the English modals. In Linguistic categories: auxiliaries and related puzzles, edited by Frank Heny and Barry Richards. Dordrecht: Reidel, pp. 205-217.       - Arguing for constituent structure I - Discussion of Jackendoff (1973) and Palmer (1983)   *Zwicky, Arnold. 1978. Arguing for constituents. In Papers from the Fourteenth Regional Meeting of the Chicago Linguistic Society, pp. 503-512. *Lakoff, George and John Robert Ross. 1976. Why you can't do so into the sink. In Syntax and Semantics: Notes from the Linguistic Underground, edited by J. McCawley. New York; San Francisco; London: Academic Press. 101-112.       - Arguing for constituent structure II - Discussion of Zwicky (1978) and Lakoff & Ross (1976)  *Aarts, Bas. 2001. English syntax and argumentation. 2nd ed. New York: Palgrave. Ch. 10, \"Syntactic argumentation\", pp. 171-192.        - Argumentation based on theory internal assumptions and general principles of theory construction I - Practice in syntactic argumentation: the case of idioms and transformations - Discussion of Aarts (2001)  *Fraser, Bruce. 1970. Idioms within a transformational grammar. Foundations of Language 6(1), 22-42.  * Quang, Phuc Dong. 1971. The Applicability of Transformations to Idioms. Papers from the Seventh Regional Meeting of the Chicago Linguistics Society. Reprinted in The best of CLS - A selection of out-of-print papers from 1968 to 1975, edited by E. Schiller, B. Need, D. Varley and W. H. Eilfort. 1988. Chicago: The Chicago Linguistic Society, pp. 95-100.       - Argumentation based on linguistically significant generalizations - Practice in syntactic argumentation: the scope of negation; lexical decomposition - Discussion of Fraser (1970) and Quang (1971)   *Lakoff, Robin. 1969. A syntactic argument for negative transportation. Papers from the Fifth Regional meeting of the Chicago Linguistic Society. Reprinted in Syntactic argumentation, edited by D. Napoi and E. Rando. 1979. Washington, D.C.: Georgetown University Press, pp. 91-106. * Fodor, Jerry. 1970. Three reasons for not deriving 'kill' from 'cause to die'. Linguistic Inquiry 1(4), 429-438. Reprinted in  Syntactic argumentation, edited by. D. Napoi and E. Rando. 1979. Washington, D.C.: Georgetown University Press.       - Argumentation based on empirical evidence I: child language - Discussion of Lakoff (1969) and Fodor (1970)  *Fromkin, Victoria. 1988. How Relevant is 'External Evidence' for a Thoery of Grammar? In On Language: Rhetorica, Phonologica, Syntactica: A Festschrift for Robert P. Stockwell from his friends and Colleagues, edited by C. Duncan-Rose and T. Vennemann. London: Routledge, pp. 52-65. *Klima, Edward and Ursula Bellugi. 1966. Syntactic regularities in the speech of children. In Psycholinguistic papers, edited by John Lyons and Roger Wales. Reprinted in Studies of child language development, eds. Charles Ferguson and Dan Slobin. New York: Holt, Rinehart and Winston, pp. 333-353.        - Final quiz (based on lectures, reading materials and class discussions).       ", "required_readings": "Aarts, Bas. 2001. English syntax and argumentation. 2nd ed. New York: Palgrave.\r Haegeman, Liliane M. V. 2006. Thinking syntactically: A guide to argumentation and analysis. Oxford: Blackwell.\r Larson, Richard K. and Kimiko Ryokai. 2010. Grammar as science. Cambridge, MA: MIT Press.", "recommended_readings": "For a clear explication of basic concepts in traditional linguistics:\r Hockett, Charles. 1958. A course in modern linguistics. New York: Macmillan.\r Palmer, Frank. 1984. Grammar. 2nd ed. Harmondsworth: Penguin.\r  For a glimpse of early transformational analyses of categories and structure; Bach, Emmon. 1974. Syntactic theory. New York: Holt, Rinehart and Winston.\r Culicover, Peter. 1982. Syntax. 2nd ed. New York: Academic Press.\r Postal, Paul M. 1968. Aspects of phonological theory. New York: Harper & Row, Publishers.\r  For further understanding of linguistic argumentation:\r Baker, Carl. 1995. English syntax. 2nd ed. Cambridge, MA: MIT Press. [E-resource]\r Perlmutter, David M., and Scott Soames. 1979. Syntactic argumentation and the structure of English. Berkeley: University of California Press.\r Napoli, Donna Jo, and Emily Norwood Rando. 1979. Syntactic argumentation. Washington, D.C.: Georgetown University Press. [available in HKALL]\r Kenstowicz, Michael. 1994. Phonology in generative grammar. Cambridge, Mass.: Blackwell.\r  For details of various aspects of English grammar: \r McCawley, James D. 1988. The syntactic phenomena of English. Chicago: University of Chicago Press. Vols. 1 and 2.\r Huddleston, Rodney, Geoffrey K. Pullum, and in collaboration with Laurie Bauer. 2002. The Cambridge grammar of the English language. Cambridge: Cambridge University Press.\r Quirk, Randolph, Sidney Greenbaum, Geoffrey Leech, and Janand Svartvik. 1985. A comprehensive grammar of the English language. London: Longman.\r  For details of various aspects of Chinese grammar:\r 丁聲樹等。 1961/1979。 《現代漢語語法講話》北京:商務。 呂叔湘。 1979。 《漢語語法分析問題》北京:商務。Chao, Yuen Ren. 1968. A grammar of spoken Chinese. Berkeley, CA: University of California Press.\r Li, Charles and Sandra Thompson. 1981. Mandarin Chinese: A functional reference grammar. Los Angeles, CA: University of California Press.\r Huang, C.T. James, Audrey Li and Yafei Li. 2009. The syntax of Chinese. Cambridge: Cambridge University Press.", "terms": {"2020-21 Term 1": {"--LEC (7704)": {"startTimes": ["11:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. LEI Ka Yan Margaret"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}, "-T01-TUT (7703)": {"startTimes": ["13:30"], "endTimes": ["14:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. LEI Ka Yan Margaret"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}}, "2021-22 Term 1": {"A-LEC (8817)": {"startTimes": ["11:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Chen Kou Bun Bldg UG04"], "instructors": ["Dr. LEI Ka Yan Margaret"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}, "AT01-TUT (8818)": {"startTimes": ["13:30"], "endTimes": ["14:15"], "days": [2], "locations": ["Chen Kou Bun Bldg UG04"], "instructors": ["Dr. LEI Ka Yan Margaret"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}, "B-LEC (8819)": {"startTimes": ["11:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Wu Ho Man Yuen Bldg 302"], "instructors": ["Staff"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}, "BT01-TUT (8820)": {"startTimes": ["13:30"], "endTimes": ["14:15"], "days": [2], "locations": ["Wu Ho Man Yuen Bldg 302"], "instructors": ["Staff"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}, "assessments": {"Essays": "70", "Others": "10", "Short answer test or exam": "20"}}, {"code": "2301", "title": "Sociolinguistics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course explores human language in the broader context of culture and society. How, for example, does language interact with social structure, gender and individual identity? To what extent do men and women talk differently? How does language reflect relations of power and status between the speakers? How are these relationships reflected in the use of politeness markers and other linguistic devices? Exploration of these topics aims to enhance students’ awareness of language as a cultural phenomenon and sharpen their sensitivity toward the nuances of language use in relation to cultural complexities, with special reference to the Hong Kong culture.\r", "outcome": "• An appreciation for language as a living, dynamic and complex system that evolves under internal and external pressures—the former due to semantic and structural pressures, and the latter due to social and cultural pressures. Students will focus on and in the process come to understand the social aspects of language use. \r • Students will have opportunities to reflect upon and discuss sociolinguistic issues, including: how and why language varies; how languages are established, maintained, lost, and revived; and the notions of power, status and face and their relationships to language. \r • Students will engage in activities and research exploring language variation within their own linguistic communities, including studying those language varieties to which they have access.", "syllabus": "    Topic   Contents/ Fundamental concepts   Language variation and the notion of ‘lects’ including dialects, socio-lects and ideo-lects   --regional and social variations or ‘styles’ of language use  --The notion of a ‘standard’ variety of language as opposed to other varieties  --National and official languages   --Accent vs. dialect  --Context and language: who we talk to influences what we say and how we say it.    Accent, register and style --bilingualism and multilingualism   --diglossia  --code-switching: using two or more languages or ‘codes’ in a single chunk of discourse.  --code-mixing: using two or more codes with a single utterance.    Language choice in multilingual communities  -- Language shift   --Social class and language   --Language and power: politeness and face  --Cultural differences regarding politeness  --Societal effects of language standardization  --Language use and media   Language shift and language death  --Language use and differences in language use between men and women.   --Variation within a language and changes over time.  --Factors influencing the spread of language change  --Reasons for language change  --Language change and social ideologies      Sociolinguistic patterns  --Language and educational policies  --Bilingual education—maintenance or assimilation?  --Immersion or submersion  --Multilingualism or semi-lingualism       Language and Power   --Distribution of pidgins and creole languages  --Origins and structures of pidgin languages  --the creole continuum  --Implications for multilingual acquisition       Language and Gender   --Signed languages and spoken languages  -- Language and identity        Language variation and Language change       Linguistic problems as societal problems      Pidgins and creoles      Language modality       ", "required_readings": "Mesthrie, Rajend, Swann, Joan, Deumert & Leap, William L. Introducing Sociolinguistics John Benjamins 2nd Ed. \r  Bauer, Robert S. 2000. Hong Kong Cantonese and the road ahead. In D.C.S. Li, A Lin & W.K. Tsang (eds.), Language and education in postcolonial Hong Kong, pp. 35-58. Linguistics Society of Hong Kong. \r  Bruche-Schulze, Gisela. 1997. ‘Fuzzy’ Chinese: the status of Cantonese in Hong Kong. Journal of Pragmatics, 27 295-314.\r  Chan, Hok-shing Brian. 1998. How does Cantonese-English code-mixing work? In M. Pennington (ed.) Language in Hong Kong at century’s end. Hong Kong: Hong Kong University Press. \r  Additional Readings may be assigned as necessary", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (9146)": {"startTimes": ["13:30"], "endTimes": ["15:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor David Philip THIERFELDER"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}, "-T01-TUT (9147)": {"startTimes": ["15:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor David Philip THIERFELDER"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}}, "assessments": {"Essays": "30", "Essay test or exam": "15", "Others": "20", "Presentation": "15", "Short answer test or exam": "20"}}, {"code": "3101", "title": "Morphology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course introduces students to major morphological processes, such as inflection, derivation, compounding and affixation that are commonly found in many languages. Students will be trained to analyse relevant morphological processes of familiar and unfamiliar languages to attain a good understanding of morphological universals. We will also explore the nature of morphology and its role in linguistics, i.e. how the formation of words involves the interaction between sounds, meaning and structure of natural languages through data-oriented problem-solving tasks.\r", "outcome": "To familiarize students with the major morphological processes in natural languages\r To equip students with the technical skills in morphological description and analysis\r To develop students’ awareness of the interactions between morphology and other components of the grammar", "syllabus": "    LING3101       Topic   Contents/ Fundamental concepts   Introduction What is morphology? What is a morpheme?    Words and lexemes What is a word? What is a lexeme?   What is derivation?  What is derivation? Other word formation processes   What is inflection? What is inflection? Inventory of inflectional morphology types   Inflection vs. derivation Similarities and differences between inflection & derivation   Morphology & phonology What is morphophonology? Allomorphy Prosodic morphology   Morphological analyses I Item and arrangement Item and process   Morphological analyses II Word and paradigm Extended word and paradigm   Morphology & argument structure Compounds vs. phrases Diagnostics for compoinds Types of compounds Classification of verbs and argument structure Interaction between argument structure and morphology   Compounding Internal structure of compounds Right hand head rule Compound stress rule   Morphology & syntax Introducing grammatical functions Differences between theta-roles and grammatical functions Grammatical function changing phenomena Mirror Principle     ", "required_readings": "Aronoff, Mark, and Kirsten Fudeman. 2005. What is Morphology? Blackwell.\r Carstairs-McCarthy, Andrew. 2002. An Introduction to English Morphology, 71-84. Edinburgh University Press.\r Spencer, Andrew. 1991. Compounds. Morphological Theory: An Introduction to Word Structure in Generative\r Grammar, 309-349. Cambridge, Mass.: Basil Blackwell.", "recommended_readings": "Bauer, Laurie. 2003. Introducing Linguistic Morphology. Washington, D.C.: Georgetown University Press.\r Carstairs-McCarthy, Andrew. 2002. An Introduction to English Morphology: Words and their Structure. Edinburgh:\r Edinburgh University Press. [e-book available]\r Li, Charles and Sandra Thompson. 1981. Mandarin Chinese: A Functional Reference Grammar. Berkeley:\r University of California Press.\r Spencer, Andrew, and Arnold M. Zwicky. 1998. The Handbook of Morphology. Oxford, UK; Malden, Mass.:\r Blackwell. [e-book available]\r 3. Recommended online web page: http://en.wikipedia.org/wiki/Main_Page\r 4. Powerpoints and links to required & recommended readings are available on Moodle\r 5. Required & recommended readings are on reserve at the UL library.", "terms": {"2020-21 Term 2": {"--LEC (7992)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Dr. LAW Paul S"], "meetingDates": ["15/1", "22/1", "29/1", "5/2"]}, "-T01-TUT (7993)": {"startTimes": ["9:30"], "endTimes": ["10:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. LAW Paul S"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}}}, "assessments": {"Essays": "25", "Essay test or exam": "35", "Others": "40"}}, {"code": "3102", "title": "Phonetics II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Prerequisite: LING2003.", "description": "This course builds on the phonetic knowledge acquired through LING2003. Issues in speech production and speech perception research will be introduced. Emphasis will be placed on acoustic analysis of speech sounds. Students will gain a solid knowledge of the physical nature of speech sounds and be familiar with the various connected speech processes. Students will gain hands-on experience of phonetic research in the form of a mini-project.\r", "outcome": "1. Students will have a good understanding of the complex nature of speech communication. \r 2. Students will be familiar with the major issues in both speech production and speech perception. \r 3. Students will be familiar with the acoustic properties of different types of consonants and vowels. \r 4. Students will acquire the skills for acoustic analysis, and learn how to use Praat for such analysis. \r 5. Students will develop independent research skills and critical thinking skills by doing a small group project on a topic of their choice. \r 6. Students will be ready to conduct further phonetic study, e.g. for their senior research thesis.", "syllabus": "    LING3102       Topic   Contents/ Fundamental concepts   acoustic phonetics acoustic properties of various speech sounds, simple digital signal processing     acoustic phonetics stress, rhythm, tone, intonation   connected speech processes  juncture, coarticulation, elision, assimilation etc   speech perception basic audition, normalisation, trading relations, theories of speech perception   speech synthesis software for simple synthesis   forensic phonetics individual differences and identity in speech     ", "required_readings": "", "recommended_readings": "Clark, J., Yallop, C. and Fletcher, J. (2007) An Introduction to Phonetics and Phonology (3rd edition). Oxford: Blackwell Publishers. \r  Denes, P.B. and Pinson, E.N. (1993) The Speech Chain (2nd edition). New York: W.H. Freeman and Company.\r  Di Paolo, M. and Yaeger-Dror, M. (eds) (2011) Sociophonetics: A Student’s Guide. London: Routledge. \r  Hayward, K. (2000) Experimental Phonetics. London: Longman.\r  Johnson, K. (2003) Acoustic and Auditory Phonetics (2nd edition). Oxford: Blackwell Publishers.\r  Ladefoged, P. (1996) Elements of Acoustics Phonetics (2nd edition). Chicago: University of Chicago Press.\r  Ladefoged, P. (2005a) A Course in Phonetics (5th edition). Boston: Heinle & Heinle. \r  Ladefoged, P. (2005b) Vowels and Consonants (2nd edition). Oxford: Blackwell Publishing.\r  Lass, N. (1996) Principles of Experimental Phonetics. London: Mosby. \r  Pickett J. (1999) The Acoustics of Speech Communication. London: Allyn and Bacon.\r  Reetz, H. and Jongman, A. (2009) Phonetics: Transcription, Production, Acoustics and Perception. Wiley-Blackwell.\r  Thomas, E. (2011) Sociophonetics: An Introduction. Palgrave Macmillan. \r  Trask, R.L. (1996). A Dictionary of Phonetics and Phonology. London: Routledge.", "terms": {"2021-22 Term 2": {"--LEC (6203)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Lady Shaw Bldg G34"], "instructors": ["Professor MOK Pik Ki Peggy"], "meetingDates": ["10/1", "17/1", "24/1"]}, "-T01-TUT (6225)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Lady Shaw Bldg G34"], "instructors": ["Professor MOK Pik Ki Peggy"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Essays": "30", "Essay test or exam": "30", "Others": "10", "Presentation": "10", "Selected response test or exam": "20"}}, {"code": "3103", "title": "Phonology II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Prerequisite: LING2004", "description": "This course focuses on the development of phonological theory, looking at general issues in the areas of tone, stress, syllable, prosody, and their interactions within the framework of autosegmental phonology. Students will learn how to analyse data from different languages, draw generalizations from a crosslinguistic perspective, and account for phonological patterns adequately.\r", "outcome": "• Understand basic concepts of prosody, such as tone, duration, syllable, and stress\r • Understand how segments are organized into prosodic unit\r • Understand how prosody interact with segmental phonology\r • Be able to identify key factors that trigger prosodic processes\r • Be able to apply phonological concepts into data analysis", "syllabus": "    LING3103       Topic   Contents/ Fundamental concepts   Tone Tone categories/tonal values/tonal patterns/Transcription methods    Representation of tone Tone-Bearing Unit/Association Convention/Spreading/Delinking    CV skeleton tier CV skeletal tier/Compensational lengthening/Weight-bearing unit    Syllable structure Onset/Rime/Nucleus/Coda/syllable weight/Sonority scale   Stress and feet Headedness/Boundedness/Q-sensitivity/Word tree/Extrametricality     ", "required_readings": "Gussenhoven, Carlos. and Haike Jacobs. 1998. Understanding Phonology. Edward Arnold (Publishers) Limited. Foreign Language Teaching and Research Press. 2003.\r  • Other readings will be distributed prior to relevant topics.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (8512)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor LAI Yee King Regine"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}, "-T01-TUT (8513)": {"startTimes": ["13:30"], "endTimes": ["14:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor LAI Yee King Regine"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}}, "assessments": {"Essays": "40", "Essay test or exam": "30", "Others": "10", "Short answer test or exam": "20"}}, {"code": "3104", "title": "Syntax II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Prerequisite: LING2005", "description": "Taking universal grammar to be a biologically based system within the language faculty of the human mind, the course aims to illustrate how constituent structures in syntax are generated and combined to form legitimate syntactic derivations, how lexical properties and pragmatics motivate syntax, and how relevant syntactic theories can attain explanatory power in addressing the hierarchical, generative, recursive and virtually infinite nature of the language system. Students will be trained to apply syntactic theories in their analysis of data drawn from various languages, formulate structural arguments, and confirm their arguments based on further empirical investigation.", "outcome": "This course continues to further the goals of syntax I and aims  • to familiarize students with the goals, core assumptions and technical notions in the P&P modal of the generative grammar; • to train students to be able to construct diagnostic tests to identify structural patterns, and become familiar with argumentation in syntax; • to familiarize students with major constructions that have important bearings on Universal Grammar and parametric differences; • To help students further develop skills in logical analysis and critical thinking.", "syllabus": "1) The Generative Enterprise: P&P modal (revision)  - Innateness of Language Faculty - Linguistics as a cognitive science - Mental grammar - Principles and Parameters modal 2) X'-Theory (revision) - Phrase structure - X’-theory (Why? How?) - Projections: NP, DP, VP, vP, IP/TP, CP, etc. 3) Theta Theory - Thematic structure - Theta role assignment, -criterion - Argument structures - A-positions, -positions  4) Case Theory - Theory of abstract Case - Government - Case filter, Visibility Hypothesis - NP-movement, VP-subject-internal hypothesis - Burzio’s generalization - ECM verbs - Dative shift - DP hypothesis  5) Binding Theory (revision) - Binding conditions - Coreference, referential dependency - Anaphora, pronouns, referential expressions - Control vs. Raising  6) Movement Theory - A-movement/NP-movement - Head-movement, Head-Movement Constraint - A'-movement, A'-positions, A'-dependency - Wh-movement, relativization, topicalization - Crossover effects (strong, weak)  - Reconstruction effects 7) Locality - Subjacency, barriers - Island constraints, island types (strong, weak) - Empty Category Principle (ECP), intermediate traces - Condition on Extraction Domain (CED) - Parasitic gap, adjunct island - Across-The-Board movement, coordination island 8) Logical Form - Quantifiers: ,  - Quantifier Raising (QR) - LF-movement - Indefinites", "required_readings": "1. Haegeman, Liliane (1994). Introduction to Government & Binding Theory (Second edition), Blackwell Publishing.  2. Ouhalla, Jamal (1999). Introducing Transformational Grammar: From Principles and Parameters to Minimalism (Second edition), Arnold Publishers.  - The authorized reprinted English version published by Waiyu Jiaoxue Yu Yanjiu Chubanshe Foreign Language Teaching and Researching Press. (This version is exactly the same as its original Second edition)", "recommended_readings": "A. Other useful textbooks for the Government & Binding Theory (GB) and for the Minimalist Program (MP) for the students who want to pursue syntax in the future.  1. Adger, David (2003). Core Syntax - A Minimalist Approach. Oxford University Press. 2. Hornstein Norbert, Jairo Nunes & Kleanthes Grohmann (2005) Understanding Minimalism. Cambridge University Press. 3. Bosković, Zeljko & Howard Lasnik (2007). Minimalist Syntax: The Essential Readings. Blackwell Publishing.  4. Carnie, Andrew. (2007/2012). Syntax: A Generative Introduction. 2nd/3rd edition. Blackwell.  5. Haegeman, Liliane. (2006). Thinking Syntactically: A Guide to Argumentation and Analysis. Blackwell. 6. Radford, Andrew (2009) Analysing English Sentences. Cambridge University Press.   B. Reference books and handbooks  7. Baltin, Mark and Chris Collins (2001). The Handbook of Contemporary Syntactic Theory. Blackwell. 8. Everaert, Martin and Henk van Riemsdijk (eds.) (2006/2018). The Blackwell Companion to Syntax. 1st/2nd editions, Blackwell. 9. Boeckx, Cedric (2011). The Oxford Handbook of Linguistic Minimalism. Oxford University Press. C. Chinese syntax  10. Huang, Cheng-Teh James. (1982). Logical relations in Chinese and the theory of grammar. PhD dissertation, MIT.  11. Huang, Cheng-Teh James. (1989). Pro-Drop in Chinese. In Osvaldo Jaeggli & Kenneth Safir (eds.), The Null Subject Parameter, Dordrecht: Kluwer Academic Publishers, 185-214.  12. Huang, C.-T. James, Audrey Li & Yafei Li. (2009). The Syntax of Chinese. Cambridge University Press. 13. Li, Yen-hui Audrey. (1992). Indefinite wh in Mandarin Chinese. Journal of East Asian Linguistics, Volume 1, 125-155.  14. Pan, Haihua. (1998). Closeness, prominence and binding theory. Natural Language & Linguistic Theory, Volume 16, 771-815.  15. Tsai,W.-T. Dylan. (1994). On economizing A-bar dependencies. Doctoral dissertation, MIT.", "terms": {"2020-21 Term 2": {"--LEC (5178)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor PAN Victor Junnan"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}, "-T01-TUT (5179)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor PAN Victor Junnan"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}}, "assessments": {"Essay test or exam": "40", "Homework or assignment": "30", "Short answer test or exam": "30"}}, {"code": "3107", "title": "Comparative Grammar", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Prerequisite: LING2005", "description": "This course aims at introducing to students a number of major similarities and differences between Chinese and other languages of interest. The emphasis will be on the basic grammatical characteristics of these languages. The lectures and discussions are intended to increase students’ sensitivity toward linguistic forms through practice in comparative and contrastive analyses. Students are encouraged to investigate languages of their interest and explore the typological differences between these languages through independent or collaborative work with their peers.\r", "outcome": "1. Enhance students’ sensitivity toward linguistic universals and variations.\r 2. Heighten students’ awareness of the linguistic universals and variations manifested in English, Mandarin and other languages of interest, and deepen their appreciation of a comparative approach to language study.\r 3.Gain basic analytic and research skills in comparative studies.", "syllabus": "    LING3107       Topic   Contents/ Fundamental concepts   Introduction - Comparative approaches to language study -The principles & parameters in syntactic theory -Universal Grammar   Nominal structure I: The DP hypothesis - NP vs. DP - The DP hypothesis - The syntactic statuses of articles & demostratives   Nominal structure II: Nominal expressions in Mandarin & Cantonese - Two competing analyses of nominal expressions in Mandarin & Cantonese: i) the DP hypothesis, and ii) the CIP hypothesis   Nominal structure III: Adjectives - Three analyses of adjectives: i) adjectives as heads selecting NPs; ii) adjunction analysis; iii) adjectives as Specifiers of FPs   Nominal structure IV: Adjectival modification in Mandarin - Attributive adjectival modification in Mandarin: Compunds or Phrases?   Wh-movement - Wh-question formation in English - Wh-movement   Wh in-situ - LF movement - Non-movement and unselective binding - Wh-indefinites   Passives - Passivization in English - Long and short passives in Mandarin   Clausal structure I: The Spilt-CP hypothesis - The structure of CP - Topic and focus - Operator vs. non-operator   Clausal structure II: Topic structures in Mandarin - Definitions of topics - Classification of topic structures - Movement or base-generation   Clausal structure III: Focus structures in Mandarin - Definition of focus - Syntactic properties of focus in Mandarin     ", "required_readings": "Badan, L. and F.Del Gobbo. To appear. On the syntax of topic and focus in Chinese. In P. Beninca and N. Munaro, eds., Mapping the Left Periphery, Oxford University Press.\r Cheng, L.-S. Lisa and Rint Sybesma. 1999. Bare and not-so-bare nouns and the structure of NP. Lingusistic Inquiry 30.4: 509-542.\r Haegeman, Liliane, and Jacqueline Gueron. 1999. English Grammar: A Generative Perspective. Oxford: Blackwell.\r Huang. C.-T. James, Audrey Li and Yafei Li. 2009. The Syntax of Chinese. Cambridge University Press.\r Li, Charles, and Sandra Thompson. 1981. Mandarin Chinese: A Functional Reference Grammar. Berkeley: University of California Press.\r Paul, Waltraud. 2005. Adjjectival modification in Mandarin Chinese and related issues. Linguistics 43: 757-793.\r Radford, Andrew. 1997. Syntactix Theory and the Structure of English: A Minimalist Approach. Cambridge University Press.[on reserve at CC}", "recommended_readings": "Bernstrin, Judy. 2001. The DP hypothesis: Identifying vlausal properties in the niminal domain, In Mark Baltin, and Chris Collins, eds., The Handbook of Contemporary Syntactic Theory, 536-561. Oxford: Blackwell.\r Huang, Shi-Zhe, 2006. Property theory, adjectives, and modification in Chinese. Journal of East Asian Linguistics 15:343-369.\r Matthews, Stephen and Virginia Vip. 1994. Cantonese: A Comprehensive Grammar. London: Routledge.", "terms": {"2021-22 Term 2": {"--LEC (6226)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Lee Shau Kee Building 201"], "instructors": ["Professor PAN Victor Junnan"], "meetingDates": ["10/1", "17/1", "24/1"]}, "-T01-TUT (6227)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Lee Shau Kee Building 201"], "instructors": ["Professor PAN Victor Junnan"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Essays": "30", "Essay test or exam": "30", "Others": "10", "Presentation": "20", "Selected response test or exam": "10"}}, {"code": "3108", "title": "Language Survey in the Field", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Prerequisite: LING2003.", "description": "This course aims to give students a taste of field linguistic research in the speech community. General issues and concerns in the conduct of language surveys in the field will be introduced and discussed. Students are expected to engage in field investigation activities that examine language-related aspects of the speech community. The course adopts an interactive, problem-based approach.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3201", "title": "First Language Acquisition", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course introduces issues in the study of first language acquisition from a linguistic perspective. The topics covered include universal stages in first language acquisition, examining the child’s phonological, lexical and syntactic development and language socialization. Major theories of language acquisition and the critical period hypothesis will be examined and evaluated. While the primary focus of the course is on monolingual acquisition, issues in the study of children acquiring two first languages simultaneously will also be addressed.\r", "outcome": "Students will gain an appreciation of innate and biological influences on language acquisition, and develop an understanding of the developmental milestones in first language acquisition. The course provides students with opportunities to conduct first-hand child language observation and data collection, and familiarizes students with some basic methods for analyzing child language data.", "syllabus": "    LING3201       Topic   Contents/ Fundamental concepts   Biological foundations of language  Innateness; learning by instinct; language faculty; critical period; maturation; selective language impairment.   The nature of language acquisition  Input; caretaker speech; positive and negative evidence; adult linguistic competence.   The nativist approach to language learning Learnability; the argument from poverty of stimulus; Universal grammar; abstract linguistic rules and structures.   Empiricist approaches to language learning  Cognitive principles for language learning; limited scope formulas; usage-based models of language learning; verb islands and lexically based patterns; connectionist approaches to language acquisition.   Methods in the study of language acquisition Naturalistic and experimental methods; methods for eliciting language production; methods for testing language comprehension.   Early lexical/semantic development Word spurt; indeterminacy in children's word meanings; innate biases for learning the meanings of words; early noun bias in lexical development.   Morphological acquisition  The acquisition of (regular or irregular) morphological rules; overgeneralizations; constraints on word formation.   The acquisition of categories and clause structure  Criteria for determining the acquisition of syntactic categories; abstract categories vs. lexically-based patterns.   Further on the acquisition of categories and clause structure The onset of functional categories in various languages; the continuity hypothesis in grammatical development; the development of inflection.   Pro-drop in child grammar Parameter setting in language development; Pro-drop in child and adult languages.   Children's knowledge of syntactic constraints Universal constraints on phrase structure, binding and anaphora.   Phonological acquisition  Jakobson's discontinuity theory of phonological development; phonological rules in children's speech; target language influence on infant speech perception and production.   Pragmatic development: The acquisition of definite/indefinite reference Linguistic form, word order and the signaling of (in)definiteness; referential knowledge of speaker and hearer; thematic structure in narrative patterns.     ", "required_readings": "Textbook\r Goodluck, Helen. 1991/2000. Language acquisition: a linguistic introduction. London: Blackwell (Beijing: Foreign Language Teaching and Research Press)", "recommended_readings": "Background reading on language acquisition:\r Easy-to-read texts:\r Foster-Cohen, Susan. 1999. An introduction to child language development. London: Longman. (Beijing: Foreign Language Teaching and Research Press)\r O'Grady, William. 2005. How children learn language. London: Cambridge University Press.\r  More challenging texts:\r Jackendoff, Ray. 1994. Patterns in the mind. New York. Basic Books.\r Pinker, Steven. 1994. The language instinct. New York: William Morrow.\r  Useful references [on UL reserve]:\r Lust, Barbara and Claire Foley. 2004. eds. First Language Acquisition: the essential readings. London: Cambridge University Press. \r Tomasello, Michael and Elizabeth Bates. 2001. eds. Language development: the essential readings. London: Blackwell. \r Bloom, Paul. 1993. ed. Language acquisition: core readings. New York: Harvester Wheatsheaf.\r Barrett, Martyn. 1999. ed. The development of language. Hove, East Sussex: Psychology Press.", "terms": {"2020-21 Term 2": {"--LEC (8776)": {"startTimes": ["13:30"], "endTimes": ["15:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. LEI Ka Yan Margaret"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}, "-T01-TUT (8777)": {"startTimes": ["15:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. LEI Ka Yan Margaret"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}}}, "assessments": {"Essays": "30", "Essay test or exam": "35", "Others": "15", "Presentation": "20"}}, {"code": "3202", "title": "Psycholinguistics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course studies language as a cognitive system which interfaces with other subsystems of mind. It examines the biological foundations of language and the nature of language competence from an evolutionary and developmental perspective. The ways in which language, thought and culture interact are explored. Emphasis will be placed on the principles and mechanisms that underlie speech perception, sentence processing and discourse comprehension, as well as structural factors in language production.\r", "outcome": "- students will have a good understanding of the mental processes involved in language production and perception, and can integrate knowledge acquired through other courses in linguistics;  - students will be introduced to the major models of language perception and processing, and be aware of the complexity involved in language communication; - students will analyse simple psycholinguistic data and develop critical thinking skills;  - students will develop the ability to discuss and work in groups;  - student will learn how to do small-scale research and develop oral presentation skills.", "syllabus": "    Topic   Contents/ Fundamental concepts   unique features of natural languages human languages versus animal communications   biological foundations of language vocal tract structure, brain lateralization, aphasia, ‘language gene’      psychological mechanisms memory, different types of processing     speech perception  categorical perception, the McGurk effect, models of speech perception     perception of written language   different writing systems, eye movements during reading, inner speech, models of word recognition     the mental lexicon  dimensions of word knowledge, organisation of the lexicon      utterance comprehension  garden path sentences, structural ambiguity     discourse comprehension    reference, coreference, genre, schema and discourse processing    language production  speech errors, linguistic plans     language and culture  language and thought, colour terms, taboos     ", "required_readings": "", "recommended_readings": "Carroll, D.W. (2008) Psychology of Language (5th edition). Thomson Wadsworth. \r  Chen, H.C. (1997) Cognitive Processing of Chinese and Related Asian Languages. Hong Kong: Chinese University Press. \r  Field, J. (2003) Psycholinguistics: A Resource book for students. London: Routledge.\r  Garman, M. (1990) Psycholinguistics. Cambridge: Cambridge University Press. \r  Gleason, J.B., Ratner, N.B. (eds.) (1998) Psycholinguistics (2nd edition). New York: Harcourt Brace College Publishers. \r  Harley, T. (2001, 2008) The Psychology of Language: From Data to Theory (2nd & 3rd edition). New York: Psychology Press. \r  Jay, T. B. (2003) The Psychology of Language. Prentice Hall.", "terms": {"2020-21 Term 1": {"--LEC (5265)": {"startTimes": ["15:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor CAI Zhenguang"], "meetingDates": ["10/9", "17/9", "24/9"]}, "-T01-TUT (5303)": {"startTimes": ["17:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor CAI Zhenguang"], "meetingDates": ["10/9", "17/9", "24/9"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "35", "Others": "10", "Presentation": "10", "Selected response test or exam": "25"}}, {"code": "3203", "title": "Language and Mind", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course explores central issues of language and cognition by investigating the complex relationships between language, thought and culture from an evolutionary and developmental perspective. How did language evolve as a component of mind in the history of mankind? How does language develop in the individual in relation to other cognitive capacities? In what ways is the organization of language similar to and distinct from other systems of cognition? To what extent does habitual thought depend on language, and to what extent does language enhance thought? These issues will be addressed, with emphasis on the interfaces between language structure and conceptual systems in the expression of reference, time, space, quantification, and modality.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3204", "title": "Second Language Acquisition", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "The course introduces students to the field of second language acquisition (SLA) and the research issues related to the development of learners’ language systems. Topics include theories of second language acquisition and cross-linguistic influence. Comparisons will be made between first and second language acquisition. Students will gain a solid understanding of the issues and methods adopted in current research.\r", "outcome": "• develop understanding of different theoretical perspectives proposed to describe and explain the process of second language acquisition and learning \r • understand the role that individual and social variables play in language acquisition and learning\r • think critically the effective ways to acquire a second language\r • explore the implications of SLA theories and research findings for language teaching\r • develop ability to conduct research on a SLA topic of the student’s choice", "syllabus": "    LING3204       Topic   Contents/ Fundamental concepts   Historical overview of SLA research Introduction to the key concepts and issues and the overview of the recent history of SLA research   Comparisons between L1 and L2 acquisition The differences between first and second language acquisition, and the role of the first language and age to second language acquisition   Learner language Introduction to interlanguage and basic methods of error analysis   Language universals Introduction and evaluation of universal grammar-based approaches to SLA   Cognitive theories Introduction and evaluation of theories of L2 processing, connectionism, including their views of language, language learning, and the language learners.   Input and interaction The role of environmental language in promoting L2 learning, including the input received by the learner, L2 output produced by the learner, and L2 interaction between the learner and the conversational partner.   Socio-cultural influences Introduction to L2 learning as a situated social practice.  Review studies on external variables, such as learner's identity and motivation as affective factors and the impact of culture, on L2 learning.   Second language instruction Introduction to the characteristics of different L2 learning conditions and their corresponding instructions, including classroom learning, immersionlearning, and distance learning     ", "required_readings": "• Textbook: \r Saville-Troike, M. (2005). Introducing Second Language Acquisition. NY: Cambridge.", "recommended_readings": "• Supplementary Books:\r Brown, H. D. (2000). Principles of Second Language Learning and Teaching (4th edition). White Plains, NY: Longman.\r Doughty, K., & Long, M. (2003). The Handbook of Second Language Acquisition. Malden, MA: Blackwell.\r Ellis, R. (2002). The Study of Second Language Acquisition. Oxford: Oxford University Press.\r Gass, S. & Selinker, L. (2008). Second Language Acquisition: An introductory course (3rd edition). Hillsdale, NJ: Erlbaum.\r Larsen-Freeman, D., & Long, M. (1991). An Introduction to Second Language Acquisition Research. New York: Longman.\r Lightbown, P. & Spada, N. (2006). How Languages Are Learned (3rd edition). Oxford: Oxford University Press.\r Mitchell, R., & Myles, F. (2004). Second Language Learning Theories (2nd ed). London: Edward Arnold.\r • Main SLA journals:\r Studies in Second Language Acquisition\r Language Learning\r The Modern Language Journal\r TESOL Quarterly\r Applied Linguistics\r Language Teaching Research\r Annual Review of Applied Linguistics\r • Other useful applied linguistics journals:\r Applied Psycholinguistics\r The Canadian Modern Language Review\r Foreign Language Annals\r International Review of Applied Linguistics (IRAL)\r Journal of Multilingual and Multicultural Development\r Journal of Second Language Writing\r Journal of Psycholinguistic Research\r Language Learning & Technology\r Language Testing\r Second Language Research", "terms": {"2021-22 Term 2": {"--LEC (8022)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Y.C. Liang Hall G04"], "instructors": ["Staff"], "meetingDates": ["14/1", "21/1", "28/1"]}, "-T01-TUT (8021)": {"startTimes": ["13:30"], "endTimes": ["14:15"], "days": [3], "locations": ["Lai Chan Pui Ngong LT"], "instructors": ["Staff"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Essays": "35", "Essay test or exam": "20", "Lab reports": "15", "Others": "20", "Presentation": "10"}}, {"code": "3206", "title": "Bilingualism", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course introduces basic concepts and issues in the study of bilingualism. What does it mean to be a bilingual speaker? How do children acquire two languages simultaneously? How are the patterns of bilingual development different from monolingual development? Other issues such as language choice, identity and education of bilinguals will be covered. Data from Cantonese-English bilingual children and adults will be used for illustration.\r", "outcome": "-acquire the basic concepts in the field of bilingualism\r -compare and contrast language development in bilingual and monolingual children\r -deepen students’ appreciation of the significance of bilingualism in the individual and society\r -raise students’ multilingual awareness in the age of globalisation\r -analyze bilingual data and evaluate the bilingual situation in the local community\r -develop ability to learn, discuss and work in a group", "syllabus": "    LING3206       Topic   Contents/ Fundamental concepts   Defining bilingualism, types of bilinguals different approaches to defining bilingualism and bilinguals, significance of bilingualism, individual and societal bilingualism   Bilingual and multilingual acquisition cross-linguistic influence, degrees of balance, language dominance, properties of dual input  theoretical issues and methods of data collection, developmental stages, compare monolingual and bilingual development   Languages in contact diversity of world’s languages, endangered languages, contact varieties of English, e.g. Singapore Colloquial English and Chinese Pidgin English   Bilingualism and cognition cognitive advantages of bilingual children and adults   Bilingualism in Hong Kong characteristics of Hong Kong bilinguals, code-mixing in bilingual speech   Bilingual education: trilingualism and biliteracy in Hong Kong medium of instruction in the classroom, language policy in local schools and higher education     ", "required_readings": "Baker, C. 2001. (3rd ed.) Foundations of Bilingual Education and Bilingualism. Multilingual Matters.\r Yip, V. & S. Matthews. 2007. The Bilingual Child: Early Development and Language Contact. Cambridge: Cambridge University Press. Book website:\r http://www.cuhk.edu.hk/lin/book/bilingualchild/", "recommended_readings": "Suggested readings:\r Pennington, M.(ed.) 1998. Language in Hong Kong at Century’s End. Hong Kong University Press.\r  Websites:\r Child Language Data Exchange System (CHILDES)\r http://childes.psy.cmu.edu/\r Childhood Bilingualism Research Centre (CBRC)\r http://www.cuhk.edu.hk/lin/cbrc/\r  Phonetics and bilingualism:\r http://liceu.uab.es/~joaquim/applied_linguistics/L2_phonetics/Fonetica_Biling_Bib.html\r  Journals\r Bilingualism: Language and Cognition\r International Journal of Bilingual Education and Bilingualism\r International Journal of Bilingualism\r International Journal of Multilingualism \r Journal of Child Language\r   Blogs\r Francois Grosjean: “Life as a Bilingual” \r  http://www.psychologytoday.com/blog/life-bilingual/201012/the-rose\r  Madalena Cruz-Ferreira: “Being Multilingual”\r http://beingmultilingual.blogspot.com/2010/10/being-multilingual.html", "terms": {"2021-22 Term 1": {"--LEC (7493)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [3], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Professor YIP Choy Yin Virginia"], "meetingDates": ["8/9", "15/9"]}, "-T01-TUT (7492)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [1], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Professor YIP Choy Yin Virginia"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Essay test or exam": "50", "Others": "15", "Presentation": "35"}}, {"code": "3207", "title": "Bilingual Acquisition", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course introduces students to the basic concepts and issues in the field of bilingual acquisition. How do children acquire two languages in the first years of life? What are the factors that shape their bilingual development? What is the impact of bilingualism on the bilingual child’s developing cognition and brain? The acquisition of different constructions and domains of grammar in bilingual children will be explored. Similarities and differences between monolingual and bilingual acquisition will also be discussed. Students will have the opportunity to work with language data from bilingual children acquiring Cantonese and English as well as other language pairs.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3208", "title": "Language Disorders", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course introduces students to language disorders in children and adults. Why do some children develop normally while others show language impairments? Why do some adults experience language disorders? What are the diagnostic linguistic features that characterize different groups of speakers with language disorders? What are the underlying linguistic and cognitive deficits? Students will examine the differences between normal and atypical language development with special reference to the Chinese context. Selective deficits will be covered including Specific Language Impairment, autism, Williams Syndrome, and dyslexia. Disorders affecting adults such as aphasia and acquired dyslexia will also be covered. The assessment and therapy of children and adults with language disorders across different acquisition contexts will be introduced. The impact on monolingual and bilingual speakers will also be explored and compared.\r", "outcome": "At the end of the course, students will be able to \r  Describe the fundamentals of language and communication, and basic characteristics of language disorders\r  Explain the etiology of different language disorders\r  Analyze patient signs and symptoms and attribute them to specific language disorder types", "syllabus": "    Course Outline Template          Course Title:  LING3208 Language Disorders     Description: This survey course introduces non-clinical students to fundamental concepts of language disorders in pediatric and adult populations.  Characteristics of primary language impairment, aphasia, dysarthria, and hearing impairments, as well as articulation, fluency, and voice and other related disorders affecting language are among the topics to be discussed.  Diagnostic techniques and treatment strategies are also introduced.          Content, highlighting fundamental concepts      Topic   Contents/fundamental concepts     Foundations of language and communication     Biological foundations of language     Psychometrics, normalcy & variation in language development and functions   Speech disorders     Language disorders in children     Neurogenic disorders in adults   Hearing impairment and language   Disorders in multi-lingual speakers   Systems of communication, classification of disorders   Anatomy & physiology of the vocal mechanism and the brain   Stages of speech, language, and literacy development   Articulation & phonological disorders in children, fluency disorders, voice disorders, and dysarthria   Primary language impairment, literacy problem, and genetic syndromes   Aphasia and cognitive-based communication disorders   Deafness, cochlear implant, and aging   Characteristics, assessment, and treatment             ", "required_readings": "Fogle, Paul T. (2019). Essentials of Communication Sciences & Disorders, 2nd Edition. Burlington, MA: Jones & Bartlett Learning.", "recommended_readings": "", "terms": {"2021-22 Term 1": {"--LEC (8822)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [3], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Professor WONG Patrick Chun Man"], "meetingDates": ["8/9", "15/9"]}, "-T01-TUT (8824)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [3], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Professor WONG Patrick Chun Man"], "meetingDates": ["8/9", "15/9"]}}}, "assessments": {"Essay test or exam": "65", "Homework or assignment": "15", "Others": "20"}}, {"code": "3302", "title": "Discourse Analysis", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course provides students with an opportunity to analyse actual sequences of talk and texts, and to identify both systematicity and variety in patterns or routines of talk/thought across different discourse genres. These include genres such as talk at home, talk in the workplace, legal language, political discourse, adversarial questioning in news interviews, public apologies, gossips, teenager teasing. Readings will also focus on recent studies on the relationship between participant interaction and the construction of grammar, and social interaction and the development of the human mind.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3401", "title": "Linguistics and Information Technology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course aims to introduce the applications of linguistics in the field of information technology. The focus of the course is on basic concepts in natural language processing, and ambiguities in human-machine interaction. Through hands-on experience, students will gain a better understanding of the problems with current speech recognition software and natural language processing systems, and of how linguistic knowledge can help provide solutions to some of these problems.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3403", "title": "Quantitative Methods for Linguistics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course introduces common statistical concepts and analyses used in linguistic research. It covers both descriptive and inferential statistics. Students will understand the basic knowledge through lectures and gain practical experience in conducting data analyses in tutorials. Students interested in doing quantitative research for their undergraduate theses should take this course.\r", "outcome": "On completion of this course, students will be able to:\r • Recognize the conceptual underpinnings of common statistical tests, and apply them appropriately to answer different research questions\r • Visualize, analyze, and summarize data through descriptive statistics, graphical methods, and inferential statistical tests using SPSS\r • Interpret and evaluate quantitative findings in linguistics", "syllabus": "   LING3403 Quantitative Methods for Linguistics   Course Syllabus                      Descriptive statistics and  tChi-Square test and other      Nominal, ordinal, and  Measures  of central tendency, variability, standard deviationSample and population, point and interval  The  Statistical  hypothesis, significance levels, one- and two-tailed testsIndependent  Correlation  One-way, factorial, and repeated measures ANOVA, post hoc testsSimple  Chi-Square test, Mann-Whitney test, Wilcoxon test          ", "required_readings": "Field, A. (2013). Discovering statistics using IBM SPSS statistics (4th ed.). London: Sage.\r Larson-Hall, J. (2016). A guide to doing statistics in second language research using SPSS and R. New York: Routledge.", "recommended_readings": "Grant, T., Clark, U., Reershemius, G., Pollard, D., Hayes, S., & Plappert, G. (2017). Quantitative research methods for linguists: A questions and answers approach for students. New York: Routledge.\r Eddington, D. (2015). Statistics for Linguistics: A step-by-step guide for novices. Newcastle upon Tyne: Cambridge Scholars Publishing.\r Pallant, H, (2010). SPSS survival manual (4th ed.). Maidenhead: McGraw-Hill.", "terms": {"2020-21 Term 1": {"--LEC (6502)": {"startTimes": ["11:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor CAI Zhenguang"], "meetingDates": ["10/9", "17/9", "24/9"]}, "-T01-TUT (6503)": {"startTimes": ["13:30"], "endTimes": ["14:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor CAI Zhenguang"], "meetingDates": ["10/9", "17/9", "24/9"]}}, "2021-22 Term 1": {"--LEC (8536)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Pi-Ch'iu Building Room 102"], "instructors": ["Professor CAI Zhenguang"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}, "-T01-TUT (8537)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Pi-Ch'iu Building Room 102"], "instructors": ["Professor CAI Zhenguang"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Essay test or exam": "30", "Homework or assignment": "40", "Project": "20", "Participation": "10"}}, {"code": "3405", "title": "Research Practicum I", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "The course provides students with an experiential learning opportunity and/or prepares them for thesis/capstone research. Students will work with a supervisor on design, execution, and/or presentation of a research project. Specific learning activities may include review of literature, preparation of experimental stimuli, data collection, data analysis, and spoken or written presentation of the results.Advisory: For Linguistics Major students only.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3406", "title": "Research Practicum II", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Prerequisite(s): LING3405", "description": "The course provides students with an experiential learning opportunity and/or prepares them for thesis/capstone research. Students will work with a supervisor on design, execution, and/or presentation of a research project. Specific learning activities may include review of literature, preparation of experimental stimuli, data collection, data analysis, and spoken or written presentation of the results.Advisory: For Linguistics Major students only.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4000", "title": "Research Project II", "career": "Undergraduate", "units": "6.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Pre-requisite: LING4001", "description": "This course provides an opportunity for students to undertake supervised study on a selected topic of interest. Students will examine aspects of the selected topic, conduct a critical literature review and a systematic investigation of the topic they have chosen. Students will be required to attend regular discussions with the teacher in order to discuss the findings of their research. They will also need to submit written progress reports as scheduled by the teacher and a complete project report at the end of the term.Advisory: For Major students only.", "outcome": "Upon successful completion of the course, students should be able to:  • evaluate and discuss research studies in one area of linguistics • design and execute research studies in linguistics with assistance • analyze and interpret research data with assistance", "syllabus": "Concepts and topics related to the student’s research project will be approved by the supervisor.", "required_readings": "Readings relevant to the student’s research project will be approved by the supervisor.", "recommended_readings": "Readings relevant to the student’s research project will be approved by the supervisor.", "terms": {"2020-21 Term 1": {"--LEC (7176)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor SZE Yim Binh, \n\rProfessor TANG Wai Lan Gladys, \n\rProfessor YOU Shuxiang"], "meetingDates": ["08/09/2020 - 01/12/2020"]}}, "2020-21 Term 2": {"--LEC (6748)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Dr. LEI Ka Yan Margaret, \n\rProfessor CAI Zhenguang, \n\rProfessor CHEUNG Yam Leung, \n\rProfessor LAI Yee King Regine, \n\rProfessor MOK Pik Ki Peggy, \n\rProfessor PAN Haihua, \n\rProfessor PAN Victor Junnan, \n\rProfessor WONG Patrick Chun Man, \n\rProfessor YIP Choy Yin Virginia, \n\rProfessor YOU Shuxiang"], "meetingDates": ["17/01/2021 - 25/04/2021"]}}, "2020-21 Summer Session": {"--LEC (1466)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor MOK Pik Ki Peggy, \n\rProfessor YIP Choy Yin Virginia"], "meetingDates": ["18/05/2021 - 29/06/2021"]}}, "2021-22 Term 2": {"--LEC (5826)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LEI Ka Yan Margaret, \n\rProfessor CAI Zhenguang, \n\rProfessor CHEUNG Yam Leung, \n\rProfessor LAI Yee King Regine, \n\rProfessor MOK Pik Ki Peggy, \n\rProfessor PAN Haihua, \n\rProfessor PAN Victor Junnan, \n\rProfessor WONG Patrick Chun Man, \n\rProfessor YIP Choy Yin Virginia, \n\rProfessor YOU Shuxiang"], "meetingDates": ["11/01/2022 - 19/04/2022"]}}}}, {"code": "4001", "title": "Research Project I", "career": "Undergraduate", "units": "0.00", "grading": "Multi-Term Course Grades", "components": "Project", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course provides an opportunity for students to undertake supervised study on a selected topic of interest. Students will examine aspects of the selected topic, conduct a critical literature review and a systematic investigation of the topic they have chosen. Students will be required to attend regular discussions with the teacher in order to discuss the findings of their research.\r", "outcome": "Upon successful completion of the course, students should be able to: \r • evaluate and discuss research studies in one area of linguistics\r • design and execute research studies in linguistics with assistance\r • analyze and interpret research data with assistance", "syllabus": "Concepts and topics related to the student’s research project will be approved by the supervisor.", "required_readings": "Readings relevant to the student’s research project will be approved by the supervisor.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"-J01-PRJ (5029)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Dr. LEI Ka Yan Margaret, \n\rProfessor CAI Zhenguang, \n\rProfessor CHEUNG Yam Leung, \n\rProfessor LAI Yee King Regine, \n\rProfessor MOK Pik Ki Peggy, \n\rProfessor PAN Haihua, \n\rProfessor PAN Victor Junnan, \n\rProfessor WONG Patrick Chun Man, \n\rProfessor YIP Choy Yin Virginia, \n\rProfessor YOU Shuxiang"], "meetingDates": ["13/09/2020 - 06/12/2020"]}}, "2021-22 Term 1": {"-J01-PRJ (6428)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LEI Ka Yan Margaret, \n\rProfessor CAI Zhenguang, \n\rProfessor CHEUNG Yam Leung, \n\rProfessor LAI Yee King Regine, \n\rProfessor MOK Pik Ki Peggy, \n\rProfessor PAN Haihua, \n\rProfessor PAN Victor Junnan, \n\rProfessor WONG Patrick Chun Man, \n\rProfessor YIP Choy Yin Virginia, \n\rProfessor YOU Shuxiang"], "meetingDates": ["07/09/2021 - 30/11/2021"]}}, "2021-22 Term 2": {"-J01-PRJ (7671)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}}, {"code": "4201", "title": "Neurolinguistics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This is an introductory course in neurolinguistics. Students will learn to identify brain systems subserving components of language as well as research methods for examining language representation, processing, and production in the brain. Key research findings in phonology, morphology, semantics, syntax, and language acquisition will be discussed.\r", "outcome": "Upon successful completion of the course, students should be able to: \r • Identify major structures in the brain, especially those that are relevant to language\r • Describe research methods used in neurolinguistics research\r • Discuss how language representation, processing, and production functions are enabled by the brain\r • Analyze research studies in neurolinguistics", "syllabus": "Topic (1) Neuroanatomy -- Contents/fundamental concepts (1) Major systems of the brain\r Topic (2) Research methods -- Contents/fundamental concepts (2) Lesion and neuroimaging methods\r Topic (3) Language components in the brain -- Contents/fundamental concepts (3) Associations between brain systems and language structures\r Topic (4) Language acquisition and the brain -- Contents/fundamental concepts (4) Neural consequences of first and second language acquisition", "required_readings": "Week 1 and Week 2:\r -Fuller et al. (2012). Anatomy and Physiology of the Nervous System (Chapter 4). Applied Anatomy and Physiology for Speech-Language Pathology and Audiology.\r  Week 3:\r -Gazzaniga et al. (2002). The Methods of Cognitive Neuroscience (Chapter 4). Cognitive Neuroscience: The Biology of the Mind.\r - Rorden, C. & Karnath, H-O. 2004. Using human brain lesions to infer function: a relic from a past era in the fMRI age? Nature Reviews Neuroscience, 5, 813-819. \r  Week 4: \r -Hickok, G. & Poeppel, D. (2000). Towards a functional anatomy of speech perception. Trends in Cognitive Science, 4, 131-138. \r -Blumstein, S.E., Myers, E.B. & Rissman, J. (2005). The perception of voice-onset time: An fMRI investigation of phonetic category structure. Journal of Cognitive Neuroscience, 17, 1353-1366.\r  Week 5:\r - Tan et al. (2005). Neuroanatomical correlates of phonological processing of Chinese characters and alphabetic words: a meta-analysis. Human Brain Mapping, 25, 83-91.\r   Week 7:\r -Ullman, M. T. (2001). A neurocognitive perspective on language: The declarative procedural model. Nature reviews –Neuroscience, 2, 719-726. \r -Kutas, M. and Federmeier, K.D. (2000). Electrophysiology reveals semantic memory use in language comprehension. Trends in Cognitive Sciences, 4, 463-470. \r  Week 8:\r -Stromswold, K., Caplan, D., Alpert, N. & Rauch, S. (1996). Localization of syntactic comprehension by positron emission tomography. Brain and Language, 52 (3), 452-473 \r -Just, M.A., Carpenter, P.A., Keller, T.A., Eddy, W.F., and Thulborn. (1996). Brain activation modulated by sentence comprehension. Science, 274, 114-116. \r  Week 9:\r -Brookshire (2007). Right Hemisphere Syndrome. (Chapter 10, pp391-413). Introduction to Neurogenic Communication Disorders.\r  Week 10:\r Kuhl, P. K. & Rivera-Gaxiola, M. (2008). Neural substrates of language acquisition. Annual Review of Neuroscience. 31, 511-534.\r  Week 11:\r -Kim et al. (1997). Distinct cortical areas associated with native and second languages. Nature, 388, 171-4.\r -Wong, P., Parsons, L., Martinez, M., &Diehl, R. (2004). The role of insular cortex in pitch pattern perception: The effect of linguistic contexts. The Journal of Neuroscience, 24(41), 9153-9160.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (6448)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor FENG Gangyi"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}, "-T01-TUT (6449)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor FENG Gangyi"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}}, "assessments": {"Essays": "5", "Essay test or exam": "55", "Presentation": "30", "Short answer test or exam": "10"}}, {"code": "4401", "title": "Special Topics in Linguistics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course furthers students’ understanding of the nature and use of language from different perspectives and/or disciplines. Students will explore issues in general linguistics and conduct empirical investigations. Topics will vary from year to year. Offerings with different subtitles can be taken up for credit, up to a maximum of two times.\r", "outcome": "Special Topics in Linguistics can be any course on language structure and language use. The topics are different in each offering. With the exposure in various topics which are not covered in the regular linguistic programme, students' knowledge and understanding in different areas of linguistics will be broadened and enhanced.\r - to introduce students to a particular area(s) of Linguistics; - to familiarize students with the literature of that particular area of Linguistics;  - to apply linguistics knowledge into the analysis of language-related phenomena.", "syllabus": "Depends on the topics", "required_readings": "Reading materials will vary according to the special topics on offer. Relevant reading materials will be provided to the students in Blackboard in advance.", "recommended_readings": "Recommended Reading materials will vary according to the special topics on offer. Relevant reading materials will be provided to the students in Blackboard in advance.", "terms": {"2021-22 Term 1": {"--LEC (8826)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [4], "locations": ["Y.C. Liang Hall G04"], "instructors": ["Staff"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}, "-T01-TUT (8862)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Y.C. Liang Hall G04"], "instructors": ["Staff"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Essay test or exam": "25", "Homework or assignment": "30", "Project": "45"}}, {"code": "4402", "title": "Special Topics in Applied Lingusitics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course introduces students to one or two particular aspects of applied linguistics, such as second language acquisition, language pedagogy, language policy, language processing, language and brain, so on and so forth. Topics will vary from year to year, depending on instructors’ expertise. Students will be able to apply linguistics knowledge into the analysis of language-related phenomena in the areas of Applied Linguistics. Offerings with different subtitles can be taken up for credit, up to a maximum of two times.\r", "outcome": "- to introduce students to a particular area(s) of Applied Linguistics; - to familiarize students with the literature of Applied Linguistics; - to apply linguistics knowledge into the analysis of language-related phenomena in Applied Linguistics.", "syllabus": "", "required_readings": "", "recommended_readings": "Textbooks\r Schmitt, N. (2002). An introduction to applied linguistics. London: Arnold.\r References\r Allen, J. P. B., Corder, S. P., & Davies, A. (1973). The Edinburgh course in applied linguistics. London: Oxford University Press. \r Archibald, J. (1998). Second Language phonology, phonetics and typology. Studies in Second Language Acquisition, 20, 189-211.\r Austin, J. L. (1973). Speech acts. In J. P. B. Allen, S. P. Corder & A. Davies (Eds.), The Edinburgh course in applied linguistics (pp. 37-52). London: Oxford University Press.\r Bayley, R. J., & Preston, D. R. (1996). Second language acquisition and linguistic variation. Amsterdam; Philadelphia: J. Benjamins.\r Biber, D., Conrad, S., & Reppen, R. (1998). Corpus linguistics: Cambridge.\r Birnbaum, H. (1975). Genetic, Typological and Universal Linguistics. Folia Linguistica, 1975, 7, 3-4, 7(3-4), 221-244.\r Brown, H. D., & Gonzo, S. T. (1995). Readings on second language acquisition. Englewood Cliffs, NJ: Prentice Hall Regents.\r Chu, C. C.-h. (1998). A discourse grammar of Mandarin Chinese. New York: P. Lang.\r Comrie, B. (1981). Language universals and linguistic typology. Chicago: University of Chicago Press.\r Cook, V. J., & Bassetti, B. (2005). An Introduction to researching second language writing systems. In Cook and Bassetti (eds). Second language writing systems (1st ed.). (pp. 1-67). Buffalo: Multilingual Matters.\r Croft, W. (2003). Typology and universals (2nd ed.). Cambridge: Cambridge University Press.\r Crystal, D. (1997). The Cambridge encyclopedia of language (2nd ed.). Cambridge; New York: Cambridge University Press.\r Davies, A. (1999). An introduction to applied linguistics: from practice to theory. Edinburgh: Edinburgh University Press.\r Davies, A., & Elder, C. (Eds.). (2004). The handbook of applied linguistics. Malden, MA: Blackwell.\r Hawkins, J. A. (1988). Explaining language universals. Oxford: Basil Blackwell.\r Hymes, D. H. (1972). On communicative competence. In J. B. Pride & J. Holmes (Eds.), Sociolinguistics: selected Readings. Harmondsworth, England: Penguin.\r Jakobson, R. (1973). Functions of language. In J. P. B. Allen, S. P. Corder & A. Davies (Eds.), The Edinburgh course in applied linguistics (pp. 53-57). London: Oxford University Press.\r Kaplan, R. B., & Bruthiaux, P. (2005). Directions in applied linguistics: essays in honor of Robert B. Kaplan. Clevedon [England] ; Buffalo [N.Y.]: Multilingual Matters.\r Larsen-Freeman, D., & Long, M. H. (2000). An introduction to second language acquisition research (1st ed.). Beijing: Foreign Language and Research Press.\r Lightbown, P., & Spada, N. M. (2006). How languages are learned (3rd ed.). Oxford; New York: Oxford University Press.\r Robinett, B. W., & Schachter, J. (1983). Second language learning: contrastive analysis, error analysis, and related aspects. Ann Arbor: University of Michigan Press.\r Rohsenow, J. S. (2004). Fifty years of script and written language reform in the PRC: the genesis of the Language Law of 2001. Language policy in the People's Republic of China : theory and practice since 1949. M. Zhou and H. Sun. Boston, Kluwer Academic Publishers: 21-43.\r Skehan, P. (2008). Interlanguage and language transfer. In B. Spolsky & F. M. Hult (Eds.), The handbook of educational linguistics (pp. 411-423). Malden, MA: Blackwell Pub.\r Zhou, Minglang & Heidi A. Ross. (2004). Fifty years of script and written language reform in the PRC: the genesis of the Language Law of 2001. Language policy in the People's Republic of China: theory and practice since 1949. M. Zhou and H. Sun. Boston, Kluwer Academic Publishers: 1-20.", "terms": {"2021-22 Term 2": {"--LEC (8023)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["William M W Mong Eng Bldg 803"], "instructors": ["Staff"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Others": "10", "Presentation": "45", "Short answer test or exam": "15", "Selected response test or exam": "30"}}, {"code": "5101", "title": "Foundations I: Phonetics and Phonology", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MA Linguistics or MA Chi Linguis & Language Acq or PgD in Communication Disorders and Sciences or MSc Speech-Language Pathology", "description": "This course introduces students to a unified approach to language as a complex structure represented in the minds of its speakers. Empirical linguistic data will be drawn across languages to enable students to understand the intimate relation between language and the human mind. On the basis of this understanding, students are led to explore the core areas of linguistics. The exploration starts with natural language sound systems and phonological components of grammar. These will be explained with basic concepts and recent theoretical advances in linguistic studies alongside new findings in language acquisition. Students will learn to apply these concepts and ideas to tackle linguistic problems.", "outcome": "By the end of the term, students should be able to: 1. Classify speech sounds according to articulatory criteria; 2. Use phonetic transcription to learn the pronunciation of new words; 3. Recognize and analyze the phonological structure of the word; 4. Be able to apply the phonological concepts into data analysis", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings. ", "recommended_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated recommended readings. ", "terms": {"2020-21 Term 1": {"A-LEC (3392)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [6], "locations": ["Online Teaching"], "instructors": ["Dr. FU Baoning"], "meetingDates": ["12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11", "5/12"]}, "B-LEC (3811)": {"startTimes": ["13:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. FU Baoning"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}, "2021-22 Term 1": {"A-LEC (3025)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [6], "locations": ["Yasumoto Int'l Acad Park LT8"], "instructors": ["Dr. FU Baoning"], "meetingDates": ["11/9", "18/9", "25/9", "2/10", "9/10", "16/10", "23/10", "30/10", "6/11", "13/11", "20/11", "27/11", "4/12"]}, "B-LEC (3026)": {"startTimes": ["16:30"], "endTimes": ["19:15"], "days": [2], "locations": ["Mong Man Wai Bldg 703"], "instructors": ["Dr. FU Baoning"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}, "assessments": {"Examination": "40", "Homework or assignment": "30", "Test or quiz": "30"}}, {"code": "5102", "title": "Foundations II: Syntax and Semantics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MA Linguistics or MA Chi Linguis & Language Acq or PgD in Communication Disorders and Sciences or MSc Speech-Language Pathology", "description": "This course is taught concurrently with LING5101 Foundations I: Phonetics and Phonology, aiming at introducing students to the core areas of linguistics. Taking a modular approach to the language system, this course examines the morphological, semantic and syntactic components of the grammar, as well as the interaction among them. The lectures are intended to provide students with a solid grounding in basic linguistic concepts, which will enable them to tackle linguistic problems, and formulate their own analyses to prepare them for further studies in the discipline. A wide range of data will be discussed to develop students’ sensitivity toward linguistic phenomena with systematic properties in form, meaning and structure.", "outcome": "1. Develop sensitivity toward language phenomena with systematic properties in form, meaning and structure. 2. Attain an understanding that individual languages are specific realizations of Universal Grammar. 3. Build foundations in syntax (e.g. constituent structure and basic syntactic operations motivated by morphology and semantics) and semantics (e.g. predicate-argument, reference, tense~aspect, proposition), and their interfaces (through morphology), to pave the way for further studies in the program. 4. Gain basic problem solving and analytical skills in the above areas to facilitate studies in more advanced courses.", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings. ", "recommended_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated recommended readings. ", "terms": {"2020-21 Term 1": {"A-LEC (3344)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor PAN Victor Junnan"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}, "AT01-TUT (1557)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [6], "locations": ["Online Teaching"], "instructors": ["Professor PAN Victor Junnan"], "meetingDates": ["12/9", "19/9", "26/9"]}, "B-LEC (2188)": {"startTimes": ["11:30"], "endTimes": ["14:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor PAN Haihua"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2021-22 Term 1": {"A-LEC (3027)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [2], "locations": ["Cheng Yu Tung Building 209A-B"], "instructors": ["Professor PAN Victor Junnan"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}, "B-LEC (1681)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [5], "locations": ["Science Centre L3"], "instructors": ["Professor PAN Haihua"], "meetingDates": ["10/9", "17/9", "24/9"]}}}, "assessments": {"Examination": "40", "Homework or assignment": "60"}}, {"code": "5103", "title": "Foundations in Language Acquisition", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MA Linguistics or MA Chi Linguis & Language Acq or PgD in Communication Disorders and Sciences or MSc Speech-Language Pathology", "description": "The acquisition of first language by children has been considered a remarkable feat. How do children accomplish this feat so rapidly and effortlessly? What are the stages they go through in mastering the different aspects of language? What does the development of language in children tell us about the human language faculty? These questions will be examined in light of modern linguistic theory, and nativist and interactionist accounts will be compared. Topics in second language acquisition will also be covered. Questions such as how interlanguage grammars develop in adults and the role of the mother tongue in the construction of interlanguage grammar will be addressed.", "outcome": "After completing the course, students will achieve some fundamental understanding of:  1. The nature of language and its acquisition by humans and primates.  2. The central issues involved in language acquisition inclusive of nature versus nurture, language attainment, cross-linguistic influence, linguistic evidence and the nature of input, as well as linguistic processing. 3. Language phenomena under exceptional circumstances involving language disorder and language attrition.", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings.", "recommended_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated recommended readings. ", "terms": {"2020-21 Term 1": {"A-LEC (3030)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. LEI Ka Yan Margaret"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}, "B-LEC (3600)": {"startTimes": ["13:30"], "endTimes": ["16:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr. LEI Ka Yan Margaret"], "meetingDates": ["10/9", "17/9", "24/9"]}}, "2021-22 Term 1": {"A-LEC (3085)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [4], "locations": ["Lee Shau Kee Building LT2"], "instructors": ["Dr. LEI Ka Yan Margaret"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}, "B-LEC (3086)": {"startTimes": ["11:30"], "endTimes": ["14:15"], "days": [1], "locations": ["Wu Ho Man Yuen Bldg 305"], "instructors": ["Dr. LEI Ka Yan Margaret"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Discussion": "10", "Examination": "40", "Homework or assignment": "20", "Project": "30"}}, {"code": "5104", "title": "Foundations in Sign Language Research", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MA Linguistics or MA Chi Linguis & Language Acq", "description": "This course provides an introduction to a relatively new area of linguistic exploration: sign language as a natural language system. We will lead students into a variety of disciplinary studies that adopt sign language as a focus of research. Examples of these disciplines are linguistics, language in education, language and brain, language and cognition, language development, language and society, and language and culture. The course aims to tackle these issues in light of the current developments in sign language research and see how they shed light on our understanding of deaf issues.", "outcome": "1. An understanding of the nature of sign language as a natural language. 2. An understanding of the nature of Deafness and modes of communication, and how they impact Deaf people’s life, education, culture and identity.", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings. ", "recommended_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated recommended readings. ", "terms": {"2020-21 Term 1": {"--LEC (3001)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor SZE Yim Binh"], "meetingDates": ["11/9", "18/9", "25/9"]}}, "2021-22 Term 1": {"--LEC (3087)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [5], "locations": ["Yasumoto Int'l Acad Park LT4"], "instructors": ["Professor SZE Yim Binh"], "meetingDates": ["10/9", "17/9", "24/9"]}}}, "assessments": {"Examination": "25", "Homework or assignment": "20", "Presentation": "10", "Project": "45"}}, {"code": "5201", "title": "Topics in Second Language Acquisition", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MA Linguistics or MA Chi Linguis & Language Acq", "description": "The course introduces major issues in the field of second language acquisition: how is a second language acquired by children and adults? In what ways is acquiring a second language different from acquiring a first language? Different theoretical perspectives on second language acquisition will be reviewed and methodologies will be surveyed. Data will be drawn mainly from English and Chinese as target languages.", "outcome": "By the end of the course, students should be able to:  1. Describe the general differences between first-language and second-language acquisition; 2. Explain and discuss the various factors – linguistic, psychological, social – which influence the learner’s acquisition of a second language; 3. Compare and discuss selected theories of second-language acquisition (SLA), and their implications for language teaching and learning; 4. Reflect critically on their personal second-language learning experience, and discuss and evaluate it in the light of current SLA theory and practice.", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings. ", "recommended_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated recommended readings. ", "terms": {"2020-21 Term 2": {"--LEC (1472)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [3], "locations": ["No Room Required"], "instructors": ["Dr. ZHOU Jiangling"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (3092)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [6], "locations": ["Yasumoto Int'l Acad Park LT4"], "instructors": ["Dr. ZHOU Jiangling"], "meetingDates": ["15/1", "22/1", "29/1"]}}}, "assessments": {"Examination": "20", "Homework or assignment": "20", "Presentation": "20", "Project": "40"}}, {"code": "5202", "title": "Topics in Bilingualism", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MA Linguistics or MA Chi Linguis & Language Acq", "description": "This course discusses general issues in the study of bilingualism from the linguistic perspective. Basic questions such as how to define and measure bilingualism, degrees of bilingualism, and types of bilinguals will be examined. Psycholinguistic and sociolinguistic aspects of bilingualism at the individual and societal levels will be covered within the larger context of language contact. Issues in bilingualism such as code-mixing, medium of instruction, bilingual education and language policy for bilingual society will be treated with special relevance to the Hong Kong context.", "outcome": "1. Acquire the basic concepts in the field of bilingualism 2. Compare and contrast language development in bilingual and monolingual children 3. Deepen students’ appreciation of the significance of bilingualism in the individual and society 4. Raise students’ multilingual awareness in the age of globalisation 5. Analyze bilingual data and evaluate the bilingual situation in the local community 6. Develop ability to learn, discuss and work in a group", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings. ", "recommended_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated recommended readings. ", "terms": {"2020-21 Term 2": {"--LEC (3811)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [1], "locations": ["No Room Required"], "instructors": ["Professor YIP Choy Yin Virginia"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}}, "2021-22 Term 2": {"--LEC (2744)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [1], "locations": ["Yasumoto Int'l Acad Park LT3"], "instructors": ["Professor YIP Choy Yin Virginia"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Discussion": "10", "Examination": "35", "Homework or assignment": "20", "Project": "35"}}, {"code": "5301", "title": "Linguistics and Language Teaching", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MA Linguistics or MA Chi Linguis & Language Acq", "description": "The course aims to highlight the relevance of linguistic studies to language teaching. Various pedagogical issues such as curriculum development, teaching methodology, language assessment, language development and professional teacher training will be discussed in light of theories of general and applied linguistics. Students are encouraged to reflect upon their language teaching experience and problems and seek an explanation from the perspective of theories and issues in general and applied linguistics.", "outcome": "1. Students should familiarize themselves with recent research in the key areas of language teaching. 2. Students should be able to apply the knowledge covered in the course to his/her own teaching practice. 3. Students should be able to undertake mini-research in an area of their choice.", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings. ", "recommended_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated recommended readings. ", "terms": {"2020-21 Summer Session": {"--LEC (1065)": {"startTimes": ["18:30", "18:30", "18:30"], "endTimes": ["21:15", "21:15", "21:15"], "days": [1, 5, 3], "locations": ["No Room Required", "No Room Required", "No Room Required"], "instructors": ["Dr. FU Baoning", "Dr. FU Baoning", "Dr. FU Baoning"], "meetingDates": ["10/5", "17/5", "24/5", "31/5", "7/5", "14/5", "21/5", "28/5", "4/6", "5/5", "12/5"]}}, "2021-22 Summer Session": {"--LEC (1071)": {"startTimes": ["18:30", "18:30"], "endTimes": ["21:15", "21:15"], "days": [1, 3], "locations": ["Yasumoto Int'l Acad Park LT6", "Yasumoto Int'l Acad Park LT6"], "instructors": ["Staff", "Staff"], "meetingDates": ["16/5", "23/5", "30/5", "6/6", "13/6", "20/6", "27/6", "18/5", "25/5", "1/6", "8/6", "15/6", "22/6", "29/6"]}}}, "assessments": {"Micro-teaching": "25", "Project": "50", "Participation": "10", "Report": "15"}}, {"code": "5302", "title": "Approaches to English Grammar", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MA Linguistics", "description": "This course introduces students to various approaches to the study of English grammatical constructions. The approaches adopted may include formal, functional or cognitive perspectives. Students are encouraged to analyze grammatical constructions in terms of form-function relationships, cognitive processing and information flow. This course is designed to enhance students’ sensitivity to the interactive aspects of grammatical analysis.", "outcome": "Upon successfully completing the subject, students should be able to: 1. To enhance students’ understanding of how meaning is made by means by grammar; 2. To foster students’ understanding of the place of grammar within a broader framework of communication; 3. To apply the concepts of syntactic analysis to describe the structure, meaning and use of English grammar; 4. To generalize from findings to establish rules; 5. To understand and use English effectively and accurately.", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme. ", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings. ", "recommended_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated recommended readings. ", "terms": {"2020-21 Term 2": {"--LEC (3580)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [2], "locations": ["No Room Required"], "instructors": ["Dr. FU Baoning"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 2": {"--LEC (3091)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [4], "locations": ["Yasumoto Int'l Acad Park LT4"], "instructors": ["Dr. FU Baoning"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Examination": "70", "Homework or assignment": "30"}}, {"code": "5403", "title": "Topics in Language Acquisition of Deaf Children", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MA Linguistics or MA Chi Linguis & Language Acq or MSc Speech-Language Pathology", "description": "This course focuses on the language acquisition of deaf children, involving both sign language and spoken language. It starts with a general introduction on the acquisition of sign language as a first language by deaf children, covering the developmental milestones in phonology, morphology and syntax. The second part of the course will explore how deaf children acquire spoken language in the context of bilingual acquisition and spoken language literacy development. No prior knowledge of a sign language is required.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5404", "title": "Sign Linguistics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MA Linguistics and MA Chi Linguis & Language Acq", "description": "This course provides a general introduction to the linguistic analysis of phonology, morphology and syntax in sign languages. It aims to demonstrate that the system of organization in sign language grammar reflects natural language properties and that sign language grammar is as complex and rule-governed as spoken languages. Focus will be placed on how the visual modality, availability of paired manual articulators, non-manual features as well as the use of signing space affect the organization of grammar at various linguistic levels. No prior knowledge of a sign language is required.", "outcome": "After completion of this course, students will be able to: 1. Given a sign,  a. Identify the five parameters of the sign.  b. State how common the form of each parameter is in the world’s sign languages.  c. Transcribe each of the five parameters using Stokoe Notation.  d. Transcribe each of the five parameters using modified Stokoe Notation.  e. Discuss the theoretical implications of the symbols they have chosen.  2. Distinguish phonetics and phonemics as they apply to sign languages, 3. Solve phonemic problems using sign language data, 4. Distinguish between classical phonemics and generative phonology, 5. Solve problems in generative phonology using sign language data, 6. Discuss the differences in explanatory power between classic phonemics and generative phonology, 7. Apply the concepts of phonological universals and markedness to 1 and 2 finger handshapes in sign languages, 8. Given a group of related signs,  a. Identify the formational processes that distinguish the signs.  b. Provide an explanation for the occurrence of the formational process.  c. Identify if the formational process is likely to result from historical change.  d. Arrange any historical changes in the likely order they occurred.  e. Discuss the implications of the formational process for linguistic analysis and language teaching. 9. Apply the concept of “syllable” as it relates to sign language data, 10. Provide examples of phonotactic rules in sign languages, 11. Provide examples of suprasegmentals in sign languages. 12. Coherently explain to a linguist what they have learned in this course.  13. Understand the morphological processes in sign languages 14. Understand the interaction between morphology, syntax and semantics in sign languages 15. Able to formulate their own analysis on tackle the linguistic problems 16. Able carry out critical evaluation on linguistic theories 17. Able to develop detailed research skills in different areas of sign linguistic enquiry.", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings. ", "recommended_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated recommended readings. ", "terms": {"2020-21 Term 2": {"--LEC (3822)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [5], "locations": ["Y.C. Liang Hall 104"], "instructors": ["Professor SZE Yim Binh"], "meetingDates": ["15/1", "22/1", "29/1", "5/2"]}}, "2021-22 Term 2": {"--LEC (3251)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [5], "locations": ["Yasumoto Int'l Acad Park LT4"], "instructors": ["Professor SZE Yim Binh"], "meetingDates": ["14/1", "21/1", "28/1"]}}}, "assessments": {"Examination": "40", "Homework or assignment": "60"}}, {"code": "5501", "title": "Topics in Chinese Phonetics and Phonology", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MA Linguistics or MA Chi Linguis & Language Acq or PgD in Communication Disorders and Sciences or MSc Speech-Language Pathology", "description": "This course introduces general aspects of modern Chinese phonetics and phonology, including both segmental and prosodic characteristics. Students will be trained to compare and analyze sound patterns of standard Chinese and other Chinese dialects from different theoretical approaches. The final goal of the course is to provide students with a solid foundation for further phonological research.", "outcome": "1. Understand basic concepts of articulation of Chinese sounds. 2. Understand Chinese segmental and tonal phonology, such as phonemes, minimal pairs, alternations. 3. Be able to transcribe sounds of standard Chinese, as well as sounds from different dialects. 4. Be able to identify sound patterns and draw generalizations from different language data. 5. Be able to apply phonological concepts into data analysis.", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings. ", "recommended_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated recommended readings. ", "terms": {"2020-21 Term 2": {"--LEC (3072)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["No Room Required"], "instructors": ["Professor YOU Shuxiang"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 2": {"--LEC (3117)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Hui Yeung Shing Bldg G05"], "instructors": ["Professor YOU Shuxiang"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Examination": "30", "Homework or assignment": "40", "Presentation": "20", "Participation": "10"}}, {"code": "5502", "title": "Topics in Chinese Syntax and Semantics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MA Linguistics or MA Chi Linguis & Language Acq or PgD in Communication Disorders and Sciences or MSc Speech-Language Pathology", "description": "This course aims to acquaint students with fundamental issues in the syntax and semantics of the Chinese language and the related theoretical implications. Through an investigation of a rich array of data, students will have the opportunity to appreciate the inner workings of the Chinese language with regard to its structural and semantic properties, to enrich and broaden their understanding of linguistic theories and methodologies, to develop skills in analyzing Chinese phrases and sentences, and to defend their analysis systematically.", "outcome": "The course aims to achieve the following goals: 1. to familiarize students with basic goals and assumptions in the study of Chinese syntax and semantics; 2. to train students to identify meaning components and structural patterns and make sensible generalizations; 3. to train students in the rudiments of linguistic analysis and argumentation in syntax and semantics and apply them to Chinese; 4. to familiarize students with major meaning and structural properties in Chinese and extend them to their native language(s) to bring into light the relevance of linguistic theories", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings. ", "recommended_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated recommended readings. ", "terms": {"2020-21 Term 2": {"--LEC (2137)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [3], "locations": ["No Room Required"], "instructors": ["Professor PAN Haihua"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (1721)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Hui Yeung Shing Bldg G05"], "instructors": ["Professor PAN Haihua"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Essays": "40", "Homework or assignment": "60"}}, {"code": "5503", "title": "Topics in Chinese Language Acquisition", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MA Linguistics or MA Chi Linguis & Language Acq or PgD in Communication Disorders and Sciences or MSc Speech-Language Pathology", "description": "This course aims to introduce the major tenets of generative and usage-based approaches to language acquisition, with a focus on the characteristics of the learner and the learning situation in first and second language. The course familiarizes students with the basic methodology and tools for analyzing acquisition data. It critically surveys the major findings on the acquisition of Chinese as a first language and as a second language.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5602", "title": "Special Topics in Linguistics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MA Linguistics or MA Chi Linguis & Language Acq or PgD in Communication Disorders and Sciences", "description": "From time to time, a course focusing on a specific area of linguistics that is not covered in the regular linguistic programme may be offered.  Students are allowed to take this course more than once, and gain the units each time they pass the course. However, students cannot take the course under the same topic twice.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5604", "title": "Topics in Sociolinguistics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MA Linguistics or MA Chi Linguis & Language Acq", "description": "This course explores human language in the broader context of culture and society. How does language relate to culture and world-view? How does language interact with social structure, gender and individual identity? To what extent do men and women talk differently? How does language reflect relations of power and status between the speakers? The use of pronouns, politeness markers and other linguistic features will be examined. Exploration of these topics aims to enhance students’ awareness of language as a cultural phenomenon and sharpen their sensitivity toward the nuances of language use in relation to cultural complexities, with special reference to Hong Kong culture.", "outcome": "This subject will enable students to specify societal and linguistic concerns with reference to the social functions of language. In focus is the description of language behaviours in the context of situations which the students of this subject find typical and noteworthy. Upon completion of this subject the students will be able to:  1. Design and conduct a domain analysis  2. Describe social situations by conducting an ethnographic microanalysis  3. Identify sociolinguistic variables in Chinese and English  4. Analyze sociolinguistic variables", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings. ", "recommended_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated recommended readings. ", "terms": {"2021-22 Term 2": {"--LEC (2259)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [3], "locations": ["Yasumoto Int'l Acad Park LT4"], "instructors": ["Staff"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Examination": "40", "Presentation": "20", "Project": "40"}}, {"code": "5606", "title": "Special Topics in Applied Linguistics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MA Linguistics or MA Chi Linguis & Language Acq", "description": "This course introduces applied linguistics from interdisciplinary perspectives, including theoretical linguistics, psychology, sociology, and pedagogy. Issues discussed in this course focus on the interface between theory and practice, including translating theory into practice and using practice to build theory.  Students are allowed to take this course more than once, and gain the units each time they pass the course. However, students cannot take the course under the same topic twice.", "outcome": "1. to acquire understandings of concepts, current issues and research methods in the core areas of applied linguistics; 2. to develop knowledge of theory and abilities to apply theory to professional and practical tasks in targeted areas of applied linguistics; 3. to lay a solid foundation for further studies in the field.", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme. ", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings. ", "recommended_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated recommended readings. ", "terms": {"2020-21 Term 2": {"-C01-CLW (2976)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [6], "locations": ["Online Teaching"], "instructors": ["Professor YOU Shuxiang"], "meetingDates": ["16/1", "23/1", "30/1", "6/2"]}}}, "assessments": {"Micro-teaching": "30", "Project": "30", "Participation": "10", "Report": "30"}}, {"code": "5607", "title": "Topics in Psycholinguistics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MA Linguistics or MA Chi Linguis & Language Acq", "description": "This course studies language as a cognitive system which interfaces with other subsystems of mind. Emphasis will be placed on linguistic properties rather than psychological mechanisms or various techniques in psycholinguistic studies. The principles and mechanisms that underlie speech perception, sentence processing and discourse comprehension, as well as structural factors in language production form the focus of this course. This course first examines the unique features of human languages and the biological foundations of language. It then explores the perception of various linguistic aspects (speech sounds, words, sentences and discourse) before touching on issues in language production. Major models of language production and perception will be introduced. After examining different aspects of our language competence, this course concludes with a discussion of language and culture. However, issues related to the origin of language and language acquisition will not be covered in this course. Students are expected to be familiar with the basic concepts in phonetics, phonology, morphology and syntax.", "outcome": "- students will have a good understanding of the mental processes involved in language production and perception, and can integrate knowledge acquired through other courses in linguistics;  - students will be introduced to the major models of language perception and processing, and be aware of the complexity involved in language communication; - students will analyse simple psycholinguistic data and develop critical thinking skills;  - students will develop the ability to discuss and work in groups;  - student will learn how to do research and develop oral presentation skills.", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings. ", "recommended_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated recommended readings. ", "terms": {"2020-21 Term 1": {"--LEC (2031)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor CAI Zhenguang"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}}, "2021-22 Term 2": {"--LEC (1773)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [2], "locations": ["Yasumoto Int'l Acad Park LT3"], "instructors": ["Professor CAI Zhenguang"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Examination": "50", "Presentation": "15", "Report": "20", "Test or quiz": "15"}}, {"code": "5608", "title": "Language Disorders", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MA in Linguistics or MA in Chinese Linguistics and Language Acquisition", "description": "This survey course introduces non-clinical students to fundamental concepts of language disorders in pediatric and adult populations. Characteristics of primary language impairment, aphasia, dysarthria, and hearing impairments, as well as articulation, fluency, and voice and other related disorders affecting language are among the topics to be discussed. Diagnostic techniques and treatment strategies are also introduced. Research studies in language disorders will be reviewed.", "outcome": "At the end of the course, students will be able to   Describe the fundamentals of language and communication, and basic characteristics of language disorders  Explain the etiology of different language disorders  Analyze patient signs and symptoms and attribute them to specific language disorder types  Search and summarize clinical research evidence", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings. ", "recommended_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated recommended readings. ", "terms": {"2021-22 Term 1": {"--LEC (2803)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [3], "locations": ["Yasumoto Int'l Acad Park LT4"], "instructors": ["Professor WONG Patrick Chun Man"], "meetingDates": ["8/9", "15/9"]}}}, "assessments": {"Classwork": "10", "Examination": "38", "Homework or assignment": "20", "Project": "20", "Test or quiz": "12"}}, {"code": "5701", "title": "Linguistics Research", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MA Linguistics or MA Chi Linguis & Language Acq", "description": "The course aims to train students in conducting linguistic research. General research methodology will be introduced, with a focus on methods commonly used in linguistic research and analysis. Students may be required to take part in field trips and expeditions.", "outcome": "1. Students will have a clear understanding of the process and requirements of conducting research. 2. Students will be able to use electronic resources to facilitate their research.  3. Students will produce a research proposal on a topic of their choice.  4. Students will know how to assess research hypotheses and methods critically. 5. Students will understand the importance of statistics in data analysis; they will also have a basic idea of some common statistical tests. 6. Students will learn how to communicate their ideas formally in writing and in oral presentation.", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings. ", "recommended_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated recommended readings. ", "terms": {"2020-21 Term 1": {"--LEC (3000)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor MOK Pik Ki Peggy"], "meetingDates": ["10/9", "17/9", "24/9"]}}, "2021-22 Term 1": {"A-LEC (3050)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [1], "locations": ["Wu Ho Man Yuen Bldg 306"], "instructors": ["Professor LAI Yee King Regine"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}, "B-LEC (3088)": {"startTimes": ["13:30"], "endTimes": ["16:15"], "days": [3], "locations": ["Lai Chan Pui Ngong LT"], "instructors": ["Professor YOU Shuxiang"], "meetingDates": ["8/9", "15/9"]}}}, "assessments": {"Homework or assignment": "42", "Presentation": "15", "Project": "40", "Participation": "3"}}, {"code": "5702", "title": "Research Project", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "LectureProject", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MA Linguistics or MA Chi Linguis & Language Acq; Prerequisite: LING5701", "description": "This is an independent, individual investigation on a topic of linguistic interest guided by a supervisor, the findings of which must be presented in a standard report format. Consent of the teacher on the topic is required. Students who wish to take the course should obtain prior approval from the Graduate Division for their research proposals. Prerequisite: LING5701 Linguistics Research.", "outcome": "Students will be able to complete an independent, individual investigation on a topic of linguistic interest guided by a supervisor, which will be presented in a standard report format.", "syllabus": "The course syllabus may be suggested and approved by the individual faculty members who supervise the research projects", "required_readings": "The required readings may be suggested and approved by the individual faculty members who supervise the research projects", "recommended_readings": "The recommended readings may be suggested and approved by the individual faculty members who supervise the research projects", "terms": {"2020-21 Term 2": {"-J01-PRJ (3368)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LEI Ka Yan Margaret, \n\rProfessor CAI Zhenguang, \n\rProfessor CHEUNG Yam Leung, \n\rProfessor LAI Yee King Regine, \n\rProfessor MOK Pik Ki Peggy, \n\rProfessor PAN Haihua, \n\rProfessor PAN Victor Junnan, \n\rProfessor SZE Yim Binh, \n\rProfessor TANG Wai Lan Gladys, \n\rProfessor WONG Patrick Chun Man, \n\rProfessor YIP Choy Yin Virginia, \n\rProfessor YOU Shuxiang"], "meetingDates": ["11/01/2021 - 28/06/2021"]}}, "2021-22 Term 2": {"-J01-PRJ (2260)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LEI Ka Yan Margaret, \n\rProfessor CAI Zhenguang, \n\rProfessor CHEUNG Yam Leung, \n\rProfessor LAI Yee King Regine, \n\rProfessor MOK Pik Ki Peggy, \n\rProfessor PAN Haihua, \n\rProfessor PAN Victor Junnan, \n\rProfessor SZE Yim Binh, \n\rProfessor TANG Wai Lan Gladys, \n\rProfessor WONG Patrick Chun Man, \n\rProfessor YIP Choy Yin Virginia, \n\rProfessor YOU Shuxiang"], "meetingDates": ["10/01/2022 - 27/06/2022"]}}}}, {"code": "5802", "title": "Research Practicum", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MA in Linguistics, and MA in Chinese Linguistics and Language Acquisition", "description": "The course provides students with an experiential learning opportunity through participating in faculty’s research projects, as a way to prepare themselves for postgraduate study in Linguistics. Specific learning activities may include review of literature, preparation of experimental stimuli, data collection, data analysis and presentation of research findings.", "outcome": "At the end of the course, students will be able to 1. evaluate and discuss empirical studies in an area of Linguistics 2. design and execute research projects in Linguistics under the support of the instructor 3. analyze and interpret research data", "syllabus": "The course syllabus may be suggested and approved by the individual faculty members who offers the research practicum.", "required_readings": "The required readings may be suggested and approved by the individual faculty members who offers the research practicum.", "recommended_readings": "The recommended readings may be suggested and approved by the individual faculty members who offers the research practicum.", "terms": {"2020-21 Term 1": {"-P01-PRA (1807)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LEI Ka Yan Margaret, \n\rProfessor CAI Zhenguang, \n\rProfessor MOK Pik Ki Peggy, \n\rProfessor PAN Haihua, \n\rProfessor PAN Victor Junnan, \n\rProfessor YOU Shuxiang"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-P01-PRA (3539)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CAI Zhenguang, \n\rProfessor PAN Victor Junnan"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-P01-PRA (2825)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LEI Ka Yan Margaret, \n\rProfessor CAI Zhenguang, \n\rProfessor CHEUNG Yam Leung, \n\rProfessor LAI Yee King Regine, \n\rProfessor MOK Pik Ki Peggy, \n\rProfessor PAN Haihua, \n\rProfessor PAN Victor Junnan, \n\rProfessor SZE Yim Binh, \n\rProfessor TANG Wai Lan Gladys, \n\rProfessor WONG Patrick Chun Man, \n\rProfessor YIP Choy Yin Virginia, \n\rProfessor YOU Shuxiang"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-P01-PRA (2871)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. LEI Ka Yan Margaret, \n\rProfessor CAI Zhenguang, \n\rProfessor CHEUNG Yam Leung, \n\rProfessor LAI Yee King Regine, \n\rProfessor MOK Pik Ki Peggy, \n\rProfessor PAN Haihua, \n\rProfessor PAN Victor Junnan, \n\rProfessor SZE Yim Binh, \n\rProfessor TANG Wai Lan Gladys, \n\rProfessor WONG Patrick Chun Man, \n\rProfessor YIP Choy Yin Virginia, \n\rProfessor YOU Shuxiang"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}}, {"code": "6902", "title": "Phonological Theory", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MPhil-PhD Linguistics, MPhil Linguistics or PhD Linguistics", "description": "This course aims to introduce the development of phonological theory over the past half century and to provide a critical survey of the current issues in phonological research. Topics include segmental alternation, syllable structure, tone, stress, and prosodic effect in word formation. Students will gain a solid understanding of the characteristics of different phonological frameworks over the course of the development of phonological theory, and will learn how to analyze a variety of language data within different phonological frameworks.", "outcome": "This course allows students to attain a solid understanding of different phonological frameworks over the course of the development of phonological theory. Students will be familiar with the characteristics of different phonological frameworks, and be able to analyze a variety of language data using these frameworks.", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings. ", "recommended_readings": "Chomsky, Norm, and Morris Halle. 1968. The Sound Pattern of English. Cambridge: MIT Press. Goldsmith, John A. 1990. Autosegmental and Metrical Phonology. Blackwell. Goldsmith, John A. ed. 1995. The Handbook of Phonological Theory. Blackwell Publishers. Kager, Rene. 1999. Optimality Theory. Cambridge University Press Publishers. McCarthy, John J. 2002. A Thematic Guide to Optimality Theory. Cambridge University Press. Odden, David. 2005. Introducing Phonology. Cambridge University Press.", "terms": {"2020-21 Term 1": {"--LEC (1570)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor LAI Yee King Regine"], "meetingDates": ["11/9", "18/9", "25/9"]}}, "2021-22 Term 1": {"--LEC (2696)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Tsang Shiu Tim Bldg 105"], "instructors": ["Professor LAI Yee King Regine"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}}, "assessments": {"Essays": "30", "Essay test or exam": "40", "Presentation": "30"}}, {"code": "6903", "title": "Syntactic Theory", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MPhil-PhD Linguistics, MPhil Linguistics or PhD Linguistics", "description": "This course provides students with a concise and critical introduction to the central issues and perennial problems in syntactic theory, with special focus on the Government and Binding Theory and the Minimalist Program. Through exercises, class discussions, and presentations, students will gain a solid understanding of the concepts and principles which have been of central significance in the recent development of syntactic theory. Whenever relevant, data from Mandarin and other languages will be used to motivate and instantiate the analyses that pertain to the central issues in syntactic theory.", "outcome": "This course allows students to attain a good understanding of the key concepts and principles that are of central significance to the recent development in syntactic theory and enhances their sensitivity toward the central issues and problems that arise in the recent development. Students will be equipped with the analytical skills for analyzing data and tackling syntactic problems, and be trained to identify and articulate empirical and theoretical issues in the literature.", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings. ", "recommended_readings": "1. Baltin, Mark and Chris Collins. eds. 2001. The Handbook of Contemporary Syntactic Theory, Mass.: Blackwell.  2. Boeckx, Cedric. 2006. The Minimalist Core. Linguistic Minimalism: Origins, Concepts, Methods, and Aims, 61-109. Oxford: Oxford University Press.  3. Chomsky, Noam. 1981. Lectures on Government and Binding. Dordrecht: Foris. 4. Chomsky, Noam. 1986. Barriers. Cambridge, MA: MIT Press. 5. Chomsky, Noam. 1993. A minimalist program for linguistic theory. In Kenneth Hale and Samuel Keyser, eds., The View from Building 20, 1-52. Cambridge, MA: MIT Press.  6. Chomsky, Noam. 1995. The Minimalist Program. Cambridge, MA: The MIT Press. 7. Chomsky, Noam. 2000. Minimalist Inquiries: The Framework. In Robert Martin, David Michaels and Juan Uriagereka, eds., Step by Step: Essays in Minimalist Syntax in Honor of Howard Lasnik, ed. by, 89-155. Cambridge, MA: The MIT Press. 8. Chomsky, Noam. 2005. Three factors in language design. Linguistic Inquiry 36:1-22. 9. Haegeman, Liliane. 1994. Introduction to Government and Binding Theory. MA: Blackwell. 10. Hornstein, Norbert, Jairo Nunes, and Kleanthes K. Grohmann. 2005. Understanding Minimalism. Cambridge University Press.  11. Ouhalla, Jamal. 2001. Introducing Transformational Grammar: From Principles and Parameters to Minimalism. Beijing: Foreign Language Teaching and Research Press. 12. Željko, Bošković, and Howard Lasnik. eds. 2007. Minimalist Syntax: The Essential Readings. MA: Blackwell.", "terms": {"2020-21 Term 2": {"--LEC (1616)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Pending"], "instructors": ["Professor PAN Victor Junnan"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (2813)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Lee Shau Kee Building 301"], "instructors": ["Professor PAN Victor Junnan"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Essays": "60", "Others": "10", "Presentation": "30"}}, {"code": "6904", "title": "Topics in Phonetics", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MPhil-PhD Linguistics, MPhil Linguistics or PhD Linguistics", "description": "This course introduces major theories and research topics in phonetics. Issues in both speech production and perception will be introduced. Both segmental and suprasegmental aspects of speech sounds will be investigated. Emphasis will be placed on the acoustic nature of speech sounds. Phonetic interfaces with other sub-branches of linguistics will also be discussed. Students will gain a good understanding of the complex nature of speech communication.", "outcome": "Students will be familiar with the major issues and theories in both speech production and speech perception. They will be able to compare and evaluate different phonetic theories, and have a good understanding of the complex nature of speech communication. They can also integrate phonetic knowledge with other areas of linguistics, e.g. phonology and language acquisition.", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings. ", "recommended_readings": "Clark, J., Yallop, C. and Fletcher, J. (2007) An Introduction to Phonetics and Phonology (3rd edition). Oxford: Blackwell Publishers. Hardcastle, W.J., Laver, J. and Gibbon, F.E. (2010) The Handbook of Phonetic Sciences (2nd edition). Wiley-Blackwell. Hayward, K. (2000) Experimental Phonetics. London: Longman. Johnson, K. (2003) Acoustic and Auditory Phonetics (2nd edition). Oxford: Blackwell Publishers. Jones, M.J. and Knight, R. (2013) The Bloomsbury Companion to Phonetics. London: Bloomsbury Academic. Ladefoged, P. (1996) Elements of Acoustics Phonetics (2nd edition). Chicago: University of Chicago Press. Pickett J. (1999) The Acoustics of Speech Communication. London: Allyn and Bacon. Reetz, H. and Jongman, A. (2009) Phonetics: Transcription, Production, Acoustics and Perception. Wiley-Blackwell. Tatham, M. and Morton, K. (2006) Speech Production and Perception. Palgrave MacMillan. Thomas, E. (2011) Sociophonetics: An Introduction. Palgrave Macmillan.", "terms": {"2021-22 Term 2": {"--LEC (3232)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Wen Lan Tang LG204"], "instructors": ["Professor MOK Pik Ki Peggy"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Essays": "30", "Essay test or exam": "40", "Presentation": "30"}}, {"code": "6905", "title": "Topics in Semantics", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MPhil-PhD Linguistics, MPhil Linguistics or PhD Linguistics", "description": "This course aims at exploring various semantic phenomena and examining the relation between meaning and structure in human languages. Emphasis will be given to current topics that are central to research in semantics. The discussion will also help students appreciate the relation between semantics and other sub-fields such as pragmatics, syntax and philosophy of language. The study of the related literature will help student develop the ability to carry out semantic analysis.", "outcome": "Students will learn about the fundamental issues of important semantic topics and the different theoretical approaches to analyzing them. The course will help students appreciate the interface issues between semantics and other Linguistics sub-fields. Students will also become familiar with how semantic analysis is conducted.", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings. ", "recommended_readings": "1. Barwise, Jon and Robin Cooper. 1981. Generalized Quantifiers and natural language. Linguistics and Philosophy 4: 159–219. 2. Heim, Irene, and Angelika Kratzer. 1998. Semantics in generative grammar. Oxford: Blackwell. 3. Lappin, Shalom. 1997. The handbook of contemporary semantic theory. Blackwell. 4. Lyons, John. 1977. Semantics. Cambridge University Press.  5. Parsons, Terence. 1990. Events in the semantics of English. Cambridge, MA: The MIT Press. 6. Portner, Paul. 2009. Modality. Oxford University Press. 7. Portner, Paul H., and Barbara H. Partee, eds. 2008. Formal semantics: the essential readings. Wiley. 8. Potts, Christopher. 2005. The logic of conventional implicatures. Oxford: Oxford University Press. 9. Szabolcsi, Anna. 2010. Quantification. Research surveys in linguistics. Cambridge University Press.", "terms": {"2020-21 Term 2": {"--LEC (4584)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Mong Man Wai Bldg 707"], "instructors": ["Dr. WU Jiun-Shiung"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}}, "assessments": {"Essays": "40", "Essay test or exam": "30", "Presentation": "30"}}, {"code": "6920", "title": "Topics in Language Acquisition", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "LectureSeminar", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MPhil-PhD Linguistics, MPhil Linguistics or PhD Linguistics", "description": "This course focuses on current issues in language acquisition with a strong emphasis on the interface of theoretical analysis of linguistics phenomena and central research questions in studies of language acquisition. Selected topics from first language acquisition, bilingual acquisition, second language acquisition, and sign language acquisition will be covered. Data from different languages will be used for illustration. Empirical coverage that extends beyond one language is essential. Topics vary from year to year.", "outcome": "Students are expected to achieve the following through a close reading of some of the classic writings in language acquisition, lectures, in-class discussions, writing assignments and the term project:  --a basic understanding of the biological foundations of language, the situation of the language learner, and the relationship between the input to language acquisition and the ultimate linguistic knowledge attained;  --a critical understanding of the fundamental assumptions underlying the nativist and the usage-based approaches to language acquisition, and the logic of argumentation in support of these approaches;  --a basic knowledge of the modularity thesis on the architecture of mind, cognitive pre-requisites for the development of language, putative syntactic and semantic universals, and the ways in which language structure may facilitate the development of thought;  --a basic grasp of how longitudinal and cross-sectional acquisition data are used to address issues in linguistics and language acquisition, as well as an ability to analyze acquisition data (in English, Mandarin or Cantonese) for structural patterns.", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings. ", "recommended_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated recommended readings. ", "terms": {"2020-21 Term 1": {"-S01-SEM (1551)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor YIP Choy Yin Virginia"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2021-22 Term 1": {"-S01-SEM (3023)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Yasumoto Int'l Acad Park 409"], "instructors": ["Professor YIP Choy Yin Virginia"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Essays": "40", "Homework or assignment": "50", "Presentation": "10"}}, {"code": "6940", "title": "Linguistics Research Seminars", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MPhil-PhD Linguistics, MPhil Linguistics or PhD Linguistics", "description": "This course aims to engage students in the Department's Linguistics Research Seminars and in-house research activities. These activities will deepen students' knowledge of various fields of specialization, and help prepare them for their future academic and professional careers.", "outcome": "Students attending the linguistics research seminars are expected to gain knowledge of different lines of linguistic inquiry and be able to think critically of the argumentation involved in the analysis.", "syllabus": "Topics will be concerned with core issues of linguistic study.", "required_readings": "Readings subject to topics of discussion of the seminars.", "recommended_readings": "Readings subject to topics of discussion of the seminars.", "terms": {"2020-21 Term 1": {"-S01-SEM (3716)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor PAN Victor Junnan"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}}, "2020-21 Term 2": {"-S01-SEM (3981)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Pending"], "instructors": ["Professor CAI Zhenguang"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 1": {"-S01-SEM (3320)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Lee Shau Kee Building LT3"], "instructors": ["Professor YOU Shuxiang"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11"]}}, "2021-22 Term 2": {"-S01-SEM (3324)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Lee Shau Kee Building LT4"], "instructors": ["Professor CHEUNG Yam Leung"], "meetingDates": ["11/1", "18/1", "25/1"]}}}}, {"code": "6941", "title": "Proseminars in Linguistics I", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MPhil-PhD Linguistics, MPhil Linguistics or PhD Linguistics", "description": "This course aims to broaden students' horizon in linguistic research by bringing in focused, teacher-led discussions on selected contemporary linguistics issues. The topics of discussion vary from course to course each term/year, depending on student interest and availability of expertise.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6942", "title": "Proseminars in Linguistics II", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MPhil-PhD Linguistics, MPhil Linguistics or PhD Linguistics", "description": "This course aims to broaden students' horizon in linguistic research by bringing in focused, teacher-led discussions on selected contemporary linguistics issues. The topics of discussion vary from course to course each term/year, depending on student interest and availability of expertise.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6951", "title": "Topics in Bilingualism & Bilingual Acquisition", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MPhil-PhD Linguistics, MPhil Linguistics or PhD Linguistics", "description": "This course explores current topics in bilingualism and bilingual acquisition from both theoretical and methodological perspectives. Issues at the interface of bilingualism and language acquisition in bilingual and multilingual contexts will be addressed. The emphasis of the course will be on individual bilingualism: how do children acquire, process and represent two or more languages in early childhood? What is the relationship between language and cognitive development in bilingual children? Central questions in bilingual acquisition and methodological issues in investigating bilingual infants and children will be discussed. The development of bilingual and trilingual children in Hong Kong and overseas communities will be the focus of our discussion. Issues regarding how heritage speakers in North America and UK develop their heritage language and undergo language shift will also be discussed.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6952", "title": "Topics in Sign Linguistics", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MPhil-PhD Linguistics, MPhil Linguistics or PhD Linguistics", "description": "Linguistic inquiry into sign language structure reveals universal principles of linguistic organization shared by sign languages and spoken languages, in phonology, morphology, syntax, semantics and pragmatics. Additionally, similar processes of language acquisition are observed when children acquire sign language in monolingual and bilingual contexts. Yet, differences in modality of communication, auditory versus visual, pose challenges to researchers in their attempts to account for the role of space and gesture in the organization of sign language grammar and language acquisition. This introductory course aims to address these issues.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6953", "title": "Topics in Neurolinguistics & Psycholinguistics", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MPhil-PhD Linguistics, MPhil Linguistics or PhD Linguistics", "description": "This course introduces students to selected topics concerning neurobiology of language as well as language representation, processing and production. Major theoretical debates and contemporary issues that address different aspects of language will be discussed. The selected topics vary from term to term, but may include syntactic and phonological priming as evidence for language representation, computational modeling of language phenomena, neural correlates of first and second language acquisition, explanatory neurolinguistics, comparative studies of language processing, models of speech production, lexical tone processing, cross-modal studies of language processing, and the bilingual brain. ", "outcome": "(Vary from term to term, but may include the outcomes below) \r At the end of the course, students will be able to \r  Identify major structures in the brain, especially those that are relevant to language\r  Describe research methods used in psycholinguistics and neurolinguistics research\r  Discuss how language representation, processing, and production functions are enabled by the brain\r  Analyze research studies in psycholinguistics and neurolinguistics", "syllabus": "Content, highlighting fundamental concepts (vary from term to term; some examples are highlighted) \r  Topics may include: \r Neuroanatomy\r Psycholinguistics as an empirical science\r Research methods \r Language components in the brain\r Language acquisition and the brain\r Models of language processing\r Models of language production\r The bilingual brain\r Lexical tone processing\r  Contents/fundamental concepts may include: \r Major systems of the brain\r Aims of psycholinguistics; empirical research design, psychological methods, hypothesis testing\r Lesion and neuroimaging methods, word recognition experiments, structural priming, eye tracking\r Associations between brain systems and language structures \r Neural consequences of first and second language acquisition\r Computational models of language such as the TRACE model\r Theoretical models of speech production such as the DIVA model\r Code switching, cognitive control network in the brain\r Cortical and subcortical circuits subserving lexical tones", "required_readings": "Harley, T. A. (2013). The psychology of language: From data to theory. Psychology press.\r Embick, D, Poeppel, D. (2015). Towards a computational(ist) neurobiology of language: correlational, integrated and explanatory neurolinguistics. Language, Cognition and Neuroscience, 30, 357-366.\r Wixted, J. T., & Thompson-Schill, S. (Eds.). (2018). Stevens' Handbook of Experimental Psychology and Cognitive Neuroscience III: Language and Thought. John Wiley & Sons.", "recommended_readings": "Carroll, D.W. (2008) Psychology of Language (5th edition). Thomson Wadsworth.\r Traxler, M., & Gernsbacher, M. A. (Eds.). (2011). Handbook of psycholinguistics. Elsevier.\r Li, P., Tan, L. H., Bates, E., & Tzeng, O. J. (Eds.). (2006). The Handbook of East Asian Psycholinguistics:Volume 1, Chinese. Cambridge University Press.\r Fuller et al. (2012). Anatomy and Physiology of the Nervous System (Chapter 4). Applied Anatomy and Physiology for Speech-Language Pathology and Audiology.", "terms": {"2021-22 Term 1": {"--LEC (2923)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [5], "locations": ["Wu Ho Man Yuen Bldg 501"], "instructors": ["Professor FENG Gangyi"], "meetingDates": ["10/9", "17/9", "24/9"]}}}, "assessments": {"Essays": "25", "Essay test or exam": "25", "Homework or assignment": "10", "Report": "25", "Short answer test or exam": "15"}}, {"code": "6960", "title": "Independent Study", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MPhil-PhD Linguistics, MPhil Linguistics or PhD Linguistics", "description": "With permission of the instructor, a student may pursue an in-depth study of a topic related to his/her research in consultation with and under the supervision of the instructor. The topic and content of the course will be individually determined.", "outcome": "Students will gain knowledge in areas specific to the topic of study under the supervision of the instructor, in particular its theoretical orientation and methods of analysis. They will also be able to generate research questions based on their understanding of the literature involved.", "syllabus": "Please refer to the course outline distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "The required readings may be suggested and approved by the individual faculty members who supervise the research projects.", "recommended_readings": "The recommended readings may be suggested and approved by the individual faculty members who supervise the research projects.", "terms": {"2020-21 Term 2": {"--LEC (9192)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor MOK Pik Ki Peggy, \n\rProfessor PAN Haihua"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"--LEC (3024)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor PAN Victor Junnan"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}}}, {"code": "6970", "title": "Special Topics in Linguistics", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MPhil-PhD Linguistics, MPhil Linguistics or PhD Linguistics", "description": "From time to time, a course focusing on a specific area of linguistics or applied linguistic research that is not covered in the regular linguistic programme may be offered. Students are allowed to take this course more than once (but not within the same term), and gain the units each time they pass the course. However, students cannot take the same topic twice.", "outcome": "Students taking special topics in linguistics will benefit from training that is not covered in the regular linguistic programme. They should demonstrate a much broadened knowledge base about linguistic analysis, and be able to come up with research questions that may go beyond their area of specialization.", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme. ", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings. ", "recommended_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated recommended readings. ", "terms": {"2020-21 Term 1": {"--LEC (4369)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. YANG Chin Lung"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}}, "2021-22 Term 1": {"--LEC (1680)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Mong Man Wai Bldg 706"], "instructors": ["Professor CAI Zhenguang"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}, "2021-22 Term 2": {"--LEC (3350)": {"startTimes": ["12:30"], "endTimes": ["15:15"], "days": [2], "locations": ["Yasumoto Int'l Acad Park 402"], "instructors": ["Dr. YANG Chin Lung"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Discussion": "10", "Homework or assignment": "20", "Presentation": "30", "Project": "40"}}, {"code": "6971", "title": "Special Topics in Experimental Methods", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MPhil-PhD Linguistics, MPhil Linguistics or PhD Linguistics", "description": "This course is a continuation of LING 6980 (Research Methodology). Selected experimental methods will be discussed in depth. Students will learn about the mechanics of the methods as well as how they can be used to address theoretical issues in linguistics. Topics may include EEG, fMRI, eye-tracking, advanced behavioral methods and data analytics and computational mathematics. Students will learn hands-on techniques and will complete a research project using the methods introduced.", "outcome": "At the end of the course, students will be able to \r  Describe the research methods introduced\r  Explain why a particular method is needed to address a research problem in linguistics\r  Collect and analyze data using such a method", "syllabus": "Selected Research Methods \r Mechanics of the methods\r  Methods in drafting research proposal\r How to motivate the use of the selected methods to address a specific theoretical issue in linguistics\r  Data analysis\r How to use the collected data to draw conclusions", "required_readings": "Penke, M., & Rosenbach, A. (2007). What counts as evidence in linguistics? An introduction. In M. Penke & A. Rosenbach (eds). What Counts as Evidence in Linguistics. John Benjamins Publishing Group: Amsterdam.\r  Drost, E. A. (2011). Validity and reliability in social science research. Education Research and Perspective, 38, 105–123.\r  Goodwin, C.J. (2010). Research in Psychology: Methods and Designs. Wiley: NJ. \r  Abbuhl, R., Gass, S., & Mackey, A. (2013). Experimental research design. In R. J. Podesva & D. Sharma (eds). Research Methods in Linguistics. Cambridge University Press: NY.\r  Kaiser, E. (2013). Experimental paradigms in psycholinguistics. In R. J. Podesva & D. Sharma (eds). Research Methods in Linguistics. Cambridge University Press: NY.", "recommended_readings": "Baker, P. (2010). Corpus methods in linguistics. In L. Litosseliti (ed). Research Methods in Linguistics. Continuum International Publishing Group: NY.\r  Schuetze, C. (1996). The Empirical Base of Linguistics: Grammaticality Judgments and Linguistic Methodology. University of Chicago Press: Chicago\r Gibson & Fedorenko (2013). The need for quantitative methods in syntax and semantics research. Language & Cognitive Processes.\r Gazzaniga, M.S., Ivry, R.B., Mangun, G.R. (2002). Cognitive Neuroscience: The Biology of the Mind.", "terms": {"2020-21 Term 2": {"--LEC (4548)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Esther Lee Bldg 205"], "instructors": ["Professor David Philip THIERFELDER"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}}}, "assessments": {"Essay test or exam": "25", "Homework or assignment": "10", "Lab reports": "25", "Report": "25", "Selected response test or exam": "15"}}, {"code": "6980", "title": "Research Methodology", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "LectureSeminar", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MPhil-PhD Linguistics, MPhil Linguistics or PhD Linguistics", "description": "The course adopts an interactive, problem-based approach, with an aim to training students in conducting linguistics research on a topic of their interest. Focus will be on linguistic analysis and empirical methods in language research. Students may be required to conduct linguistic research through field trips.", "outcome": "Upon successfully completing the subject, students should be able to: - Have a clear understanding of conducting research - Use relevant resources/databases to look up information and references - Write a research proposal on a topic of their choice - Assess research hypotheses and methods in different sub-fields of linguistics - Understand the basic concept of common statistical tests. - Learn how to communicate their ideas and findings in writing and in oral presentation.", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated required readings. ", "recommended_readings": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated recommended readings.", "terms": {"2020-21 Term 2": {"-S01-SEM (2975)": {"startTimes": ["11:30"], "endTimes": ["14:15"], "days": [5], "locations": ["Lee Shau Kee Building 212"], "instructors": ["Dr. YANG Chin Lung, \n\rProfessor CHEUNG Yam Leung"], "meetingDates": ["15/1", "22/1", "29/1", "5/2"]}}, "2021-22 Term 2": {"-S01-SEM (3325)": {"startTimes": ["11:30"], "endTimes": ["14:15"], "days": [5], "locations": ["Lee Shau Kee Building 204"], "instructors": ["Professor CHEUNG Yam Leung"], "meetingDates": ["14/1", "21/1", "28/1"]}}}, "assessments": {"Homework or assignment": "80", "Presentation": "20"}}, {"code": "6981", "title": "Technologies in Linguistic Research I", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "Pre-requisite: LING6980;For students in MPhil-PhD Linguistics, MPhil Linguistics or PhD Linguistics", "description": "This course is a continuation of LING 6980 (Research Methodology). Students will learn selected techonologies in contemporary linguistic research. Topics may include EEG, fMRI, eye-tracking, advanced behavioral methods and data analytics and computational mathematics. Students will learn hands-on techniques and will complete a research project using the methods introduced.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6982", "title": "Topics in Statistics", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "Pre-requisite: LING6980;For students in MPhil-PhD Linguistics, MPhil Linguistics or PhD Linguistics", "description": "Students will learn selected statistical techniques in contemporary research in linguistics. Topics may include multiple regression, discriminant analysis, and linear mixed-effects model.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6983", "title": "Technologies in Linguistic Research II", "career": "Postgraduate - Research", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "Pre-requisite = LING6980;For students in MPhil-PhD Linguistics, MPhil Linguistics or PhD Linguistics", "description": "This course is a continuation of LING 6980 (Research Methodology). Students will learn selected techonologies in contemporary linguistic research. Topics may include EEG, fMRI, eye-tracking, advanced behavioral methods and data analytics and computational mathematics. Students will learn hands-on techniques and will complete a research project using the methods introduced.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "8003", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MPhil-PhD Linguistics", "description": "Supervisors will meet with students on a regular basis to give advice on all matters related to the preparation of thesis proposals, the conducting of the research, and the writing of the thesis. Students will work toward a set of research targets upon consultation with their supervisors.", "outcome": "Students will achieve the research targets worked out under the supervision of their supervisors.", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "The required readings may be suggested and approved by the individual faculty members who supervise the research projects. ", "recommended_readings": "The recommended readings may be suggested and approved by the individual faculty members who supervise the research projects.", "terms": {"2020-21 Term 1": {"-M01-TMC (3189)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CAI Zhenguang, \n\rProfessor MOK Pik Ki Peggy, \n\rProfessor PAN Haihua, \n\rProfessor TANG Wai Lan Gladys, \n\rProfessor WONG Patrick Chun Man"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-M01-TMC (3500)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CAI Zhenguang, \n\rProfessor MOK Pik Ki Peggy, \n\rProfessor PAN Haihua, \n\rProfessor PAN Victor Junnan, \n\rProfessor TANG Wai Lan Gladys, \n\rProfessor WONG Patrick Chun Man, \n\rProfessor YIP Choy Yin Virginia"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-M01-TMC (1392)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CAI Zhenguang, \n\rProfessor CHEUNG Yam Leung, \n\rProfessor LAI Yee King Regine, \n\rProfessor MOK Pik Ki Peggy, \n\rProfessor PAN Haihua, \n\rProfessor PAN Victor Junnan, \n\rProfessor SZE Yim Binh, \n\rProfessor TANG Wai Lan Gladys, \n\rProfessor WONG Patrick Chun Man, \n\rProfessor YIP Choy Yin Virginia"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-M01-TMC (2362)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CAI Zhenguang, \n\rProfessor CHEUNG Yam Leung, \n\rProfessor LAI Yee King Regine, \n\rProfessor MOK Pik Ki Peggy, \n\rProfessor PAN Haihua, \n\rProfessor PAN Victor Junnan, \n\rProfessor SZE Yim Binh, \n\rProfessor TANG Wai Lan Gladys, \n\rProfessor WONG Patrick Chun Man, \n\rProfessor YIP Choy Yin Virginia"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}}, {"code": "8006", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "6.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MPhil-PhD Linguistics", "description": "Supervisors will meet with students on a regular basis to give advice on all matters related to the preparation of thesis proposals, the conducting of the research, and the writing of the thesis. Students will work toward a set of research targets upon consultation with their supervisors.", "outcome": "Students will achieve the research targets worked out under the supervision of their supervisors.", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "The required readings may be suggested and approved by the individual faculty members who supervise the research projects.", "recommended_readings": "The recommended readings may be suggested and approved by the individual faculty members who supervise the research projects.", "terms": {"2020-21 Term 1": {"-M01-TMC (3390)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CAI Zhenguang, \n\rProfessor CHEUNG Yam Leung, \n\rProfessor LAI Yee King Regine, \n\rProfessor MOK Pik Ki Peggy, \n\rProfessor PAN Haihua, \n\rProfessor PAN Victor Junnan, \n\rProfessor SZE Yim Binh, \n\rProfessor TANG Wai Lan Gladys, \n\rProfessor WONG Patrick Chun Man, \n\rProfessor YIP Choy Yin Virginia"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-M01-TMC (3501)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CAI Zhenguang, \n\rProfessor CHEUNG Yam Leung, \n\rProfessor LAI Yee King Regine, \n\rProfessor MOK Pik Ki Peggy, \n\rProfessor PAN Haihua, \n\rProfessor PAN Victor Junnan, \n\rProfessor SZE Yim Binh, \n\rProfessor TANG Wai Lan Gladys, \n\rProfessor WONG Patrick Chun Man, \n\rProfessor YIP Choy Yin Virginia"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-M01-TMC (2026)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CAI Zhenguang, \n\rProfessor CHEUNG Yam Leung, \n\rProfessor LAI Yee King Regine, \n\rProfessor MOK Pik Ki Peggy, \n\rProfessor PAN Haihua, \n\rProfessor PAN Victor Junnan, \n\rProfessor SZE Yim Binh, \n\rProfessor TANG Wai Lan Gladys, \n\rProfessor WONG Patrick Chun Man, \n\rProfessor YIP Choy Yin Virginia"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-M01-TMC (2103)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CAI Zhenguang, \n\rProfessor CHEUNG Yam Leung, \n\rProfessor LAI Yee King Regine, \n\rProfessor MOK Pik Ki Peggy, \n\rProfessor PAN Haihua, \n\rProfessor PAN Victor Junnan, \n\rProfessor SZE Yim Binh, \n\rProfessor TANG Wai Lan Gladys, \n\rProfessor WONG Patrick Chun Man, \n\rProfessor YIP Choy Yin Virginia"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}}, {"code": "8012", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "12.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Linguistics", "requirements": "For students in MPhil-PhD Linguistics", "description": "Supervisors will meet with students on a regular basis to give advice on all matters related to the preparation of thesis proposals, the conducting of the research, and the writing of the thesis. Students will work toward a set of research targets upon consultation with their supervisors.", "outcome": "Students will achieve the research targets worked out under the supervision of their supervisors.", "syllabus": "Please refer to the course outline uploaded on the Department's website or distributed by the course teacher for the detailed and updated course syllabus and assessment scheme.", "required_readings": "The required readings may be suggested and approved by the individual faculty members who supervise the research projects.", "recommended_readings": "The recommended readings may be suggested and approved by the individual faculty members who supervise the research projects.", "terms": {"2020-21 Term 1": {"-M01-TMC (3391)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor MOK Pik Ki Peggy, \n\rProfessor PAN Haihua, \n\rProfessor TANG Wai Lan Gladys, \n\rProfessor WONG Patrick Chun Man, \n\rProfessor YIP Choy Yin Virginia"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-M01-TMC (3502)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor MOK Pik Ki Peggy, \n\rProfessor PAN Haihua, \n\rProfessor PAN Victor Junnan, \n\rProfessor TANG Wai Lan Gladys, \n\rProfessor WONG Patrick Chun Man, \n\rProfessor YIP Choy Yin Virginia"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-M01-TMC (2752)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CAI Zhenguang, \n\rProfessor CHEUNG Yam Leung, \n\rProfessor LAI Yee King Regine, \n\rProfessor MOK Pik Ki Peggy, \n\rProfessor PAN Haihua, \n\rProfessor PAN Victor Junnan, \n\rProfessor SZE Yim Binh, \n\rProfessor TANG Wai Lan Gladys, \n\rProfessor WONG Patrick Chun Man, \n\rProfessor YIP Choy Yin Virginia"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-M01-TMC (2104)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CAI Zhenguang, \n\rProfessor CHEUNG Yam Leung, \n\rProfessor LAI Yee King Regine, \n\rProfessor MOK Pik Ki Peggy, \n\rProfessor PAN Haihua, \n\rProfessor PAN Victor Junnan, \n\rProfessor SZE Yim Binh, \n\rProfessor TANG Wai Lan Gladys, \n\rProfessor WONG Patrick Chun Man, \n\rProfessor YIP Choy Yin Virginia"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}}]