[{"code": "6161", "title": "Teaching and Learning Mathematics in the Changing Curriculum", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MSc Mathematics Education", "description": "This course offers an introduction to the theoretical aspects of mathematics teaching and learning in face of the challenge from the ever-changing mathematics curriculum. It will provide an overview of both cognitive and socio-psychological issues involved in both the teaching and the learning of mathematics. Topics include the psychological models or theories in the teaching and learning of mathematics; research on the teaching and learning of number, algebra, geometry, and calculus; developmental, sociocultural, semiotic, and approaches to the study of concepts and conceptual development; digital technology in mathematics teaching and learning; discourse and the situated nature of cognition; mathematical problem solving and problem posing; research on mathematics-related affect.", "outcome": "1. Develop an understanding of the theoretical aspects of mathematics teaching and learning in face of the challenge from the ever-changing mathematics curriculum.\r 2. Demonstrate knowledge of an overview of the central issues related to the nature of teaching and learning from historical and cultural perspectives in relation to the ever-changing curriculum.\r 3. Critically examine issues related to the changing mathematics curriculum with reference to latest trends in technological innovations and theoretical research development in mathematics education.\r 4. Become familiar with significant theoretical constructs and empirical findings with reference to the psychology of mathematical problem-solving and the nature of learning mathematics in the classroom.\r 5. Become familiar with current issues in attitude and belief in mathematics learning, intelligence and disability, learning styles, and affect.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "1. Historical and contemporary perspectives on knowledge, teaching, and learning \r 2. Contemporary theories in mathematics education \r 3. Selected theoretical constructs about teaching and learning mathematics\r  (For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "(Required readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "recommended_readings": "(See also Weekly Reading List) \r  Arnon I, Cottrill J, Dubinsky E, Oktaç A, Fuentes SR, Trigueros M, Weller K. (2014). APOS theory: A framework for research and curriculum development in mathematics education. London: Springer.\r Artigue, M. (2002). Learning mathematics in a CAS environment: The genesis of a reflection about instrumentation and the dialectics between technical and conceptual work. International Journal of Computers for Mathematical Learning, 7(3), 245–274.\r Arzarello, F. (2006). Semiosis as a multimodal process. Revista Latinoamericana de Investigación en Matemática Educativa, 9, 267–299 \r Bartolini Bussi, M. G., & Mariotti, M. A. (2008), Semiotic mediation in the mathematics classroom: artifacts and signs after a Vygotskian perspective. In L. English, M. Bartolini Bussi, G. Jones, R. Lesh, and D. Tirosh, (Eds.) Handbook of International Research in Mathematics Education, second revised edition (pp. 746-805). Lawrence Erlbaum, Mahwah, NJ. \r Boaler, J. (2002). Experiencing school mathematics: Traditional and reform approaches to teaching and their impact on student learning. Mahwah, New Jersey, U.S.A.: Lawrence Erlbaum Associates\r Bruner, J. (1966). Toward a theory of instruction. Cambridge, MA: Harvard University Press.\r Clark-Wilson, A., & Noss, R. (2015). Hiccups within technology mediated lessons: A catalyst for mathematics teachers’ epistemological development. Research in Mathematics Education, 17(2), 92–109. \r Davis, B., Sumara, D., Luce-Kaper, R. (2015). Engaging Minds: Cultures of Education and Practice of Teaching. New York: Routledge.\r Davis, B., Sumara, D., Luce-Kaper, R. (2008). Engaging Minds: Changing Teaching in Complex Times. New York: Routledge.\r Drijvers, P., Doorman, M., Boon, P., Reed, H., & Gravemeijer, K. (2010). The teacher and the tool: Instrumental orchestrations in the technology-rich mathematics classroom. Educational Studies in Mathematics, 75(2), 213–234.\r English, L. (2016). STEM education K-12: Perspectives on integration. International Journal of STEM Education, 3, 3. https://doi.org/10.1186/s40594-016-0036-1 \r Fitzallen, N. (2015). STEM education: What does mathematics have to offer? In M. Marshman (Ed.), Mathematics education in the margins. Proceedings of the 38th annual conference of the Mathematics Education Research Group of Australasia (pp. 237–244). Sydney, NSW: MERGA. Franz, G. & Papert, S. (1988). Computer as material: messing about with time. Teachers College Record, 89, 408–417.\r Gutiérrez, A., Leder, G.C., & Boero, P. (Eds.) (2016). The Second Handbook of Research on the Psychology of Mathematics Education. Rotterdam: Sense Publishers.\r Hegedus, S., & Moreno-Armella, L. (2014). Information and Communication Technology (ICT) Affordances in Mathematics Education. In S. Lerman (Ed.), Encyclopedia of Mathematics Education SE - 78 (pp. 295–299). Springer Netherlands. \r Hollebrands, K. (2003). High school students’ understandings of geometric transformations in the context of a technological environment. Journal of Mathematics Behavior, 22, 55-72. \r Hong Kong Curriculum Development Council (HKCDC). (2015). Ongoing renewal of the school curriculum – Focusing, deepening and sustaining updating the mathematics education key learning area curriculum (primary 1 to secondary 6). Hong Kong: The Printing Department.\r Hoyles, C., & Healy, L. (1997). Unfolding meanings for reflective symmetry. International journal of computers in mathematical learning, Technology, Knowledge and Learning, 2(1). 27-59. \r Hoyles, C., Noss, R., Vahey, P., & Roschelle, J. (2013). Cornerstone Mathematics: designing digital technology for teacher adaptation and scaling. ZDM, 45(7), 1057–1070. \r Kelley, T & Knowles G. (2016). A conceptual framework for integrated STEM education, International Journal of STEM Education, 3(11), 1-11. \r Lakoff, G., & Núñez, R. (2000). Where mathematics comes from: How the embodied mind brings mathematics into being. New York: Basic Books. \r Lave, J., & Wenger, E. (1991). Situated Learning: Legitimate Peripheral Participation. Cambridge, England: Cambridge University Press.\r Leung, A. (2008). Dragging in a dynamic geometry environment through the lens of variation. International Journal of Computers for Mathematical Learning, 13, 135–157.\r Lerman, S. (2014). Encyclopedia of Mathematics Education. London, UK: Springer.\r Ng, O. (2016). Comparing calculus communication across static and dynamic environments using a multimodal approach. Digital Experiences in Mathematics Education, 2(2), 115-141. doi: 10.1007/s40751-016-0014-8.\r Ng, O., & Sinclair, N. (2015). Young children reasoning about symmetry in a dynamic geometry environment. ZDM: The International Journal of Mathematics Education, 47(3), 421-434. doi: 10.1007/s11858-014-0660-5. \r Ng, O., & Sinclair, N. (2015). 'Area without numbers': Using touchscreen dynamic geometry to reason about shape. The Canadian Journal of Science, Mathematics, and Technology Education, 15(1), 84-101. doi: 10.1080/14926156.2014.993048.\r Piaget, J. (1977). The role of action in the development of thinking. In W. Overton, & J. Gallagher (Eds.), Knowledge and development (pp. 17-42). Springer US. \r Papert, S. (1980). Mindstorms: children, computers, and powerful ideas. New York: Basic Books. \r Papert, S., & Harel, I. (1991). Situating constructionism. In I. Harel & S. Papert (Eds.), Constructionism (pp.1-11). New York: Ablex Publishing.\r Pickering, A. (1995). The mangle of practice: Time, agency and science. Chicago: University of Chicago Press. \r Radford, L. (2009). Why do gestures matter? Sensuous cognition and the palpability of mathematical meanings. Educational Studies in Mathematics, 70, 111-126. Pólya, G. (1945). How to solve it. Princeton, U.S.A.: Princeton University Press. \r Roschelle, J. (2006, August). Effective integration of dynamic representations and collaboration to enhance mathematics and science learning. Keynote address at Curriculum Corporation 13th National Conference. Adelaide, Australia.\r Rotman, B. (2000). Mathematics as sign: Writing, imagining, counting... Stanford, California, U.S.A.: Standford University Press. \r Ruthven, K. (2009). Towards a naturalistic conceptualisation of technology integration in classroom practice: The example of school mathematics. Éducation et didactique, 3(1), 131–159. \r Sfard, A. (2008). Thinking as communicating: Human development, the growth of discourses, and mathematizing. Cambridge, England: Cambridge University Press.\r Sfard, A. (2009). What’s all the fuss about gestures? A commentary. Educational Studies in Mathematics, 70, 191–200. \r Sinclair, N., & Robutti, O. (2014). Teaching Practices in Digital Environments. In S. Lerman (Ed.), Encyclopedia of Mathematics Education SE - 153 (pp. 598–601). Springer Netherlands. \r Steffe, L.P., Nesher, P., Cobb, P., Sriraman, B., Goldin, B., & Greer, B. (1996). Theories of Mathematical Learning. Mahwah, NJ: Erlbaum.\r Stylianides, A.J., & Stylianides, G.J. (2013). Seeking research-grounded solutions to problems of practice: Classroom-based interventions in mathematics education. ZDM–The International Journal on Mathematics Education, 45(3), 333-342. \r Skemp, R.R. (1987). The psychology of mathematics learning. Hillsdale, New Jersey, U.S.A.: Lawrence Erlbaum Associates. \r Van Hiele, P. M. (1986). Structure and insight: A theory of mathematics education. Orlando, Florida, U.S.A.: Academic Press.\r Vygotsky, L. (1986). Thought and Language. Cambridge, MA: MIT Press.\r Watson, A., & Mason, J. (2005). Mathematics as a constructive activity: Learners generating examples. Mahwah, NJ: Lawrence Erlbaum Associates, Inc.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 1": {"--LEC (1130)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor CHIU Kin Fung"]}}}, "assessments": {"Essay test or exam": "60", "Presentation": "40"}}, {"code": "6162", "title": "Mathematics Curriculum and Assessment Under Educational Reform", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MSc Mathematics Education", "description": "This course aims at helping students develop an understanding of the impact of educational reform on mathematics education by an in-depth analysis of current issues pertaining to the mathematics curriculum and assessment. From the perspective of curriculum design, the local curricula in both primary and secondary schools are delineated. The changing goals of mathematics education are addressed with reference to the historical development. Worldwide trends in mathematics curriculum development are also reviewed. Mathematics achievement and the ever-changing development in the assessment of mathematics learning are discussed. Other relevant current issues in curriculum development and teacher professionalism may also be explored.", "outcome": "1. develop an understanding of the impact of educational reform on mathematics education, by an in-depth analysis of current curriculum issues\r 2. develop an understanding of the general principles of curriculum design of the current Hong Kong primary and secondary curriculum\r 3. advance their awareness and understanding of the key external and internal forces shaping the historical development and the changing goals of mathematics education,\r 4. enhance their abilities to analyze, evaluate, and reflect on the worldwide trends in mathematics curriculum development,\r 5. increase their awareness of the ever-changing development in the assessment issues, both at local and global levels, and \r 6. strengthen their abilities to analyze, evaluate, and reflect on other current curriculum development issues. \r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "1. The goals of mathematics education \r 2. The evolution of the Hong Kong mathematics curricula\r 3. Mathematics curriculum development\r 4. Mathematics curriculum evaluation\r 5. Analysis of the current Hong Kong mathematics curriculum\r 6. Designing mathematics curricula for specific target groups\r 7. Focal points of the Hong Kong mathematics curriculum\r 8. Assessment issues in focus\r 9. Emergent issues in mathematics curriculum\r 10. Trends of the mathematics curricula worldwide\r  (For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "1. Bybee, R. W. (2013). The case for STEM education: Challenges and opportunities. Arlington, VA: NSTA Press Book.\r 2. Ernest, P. (1991). The philosophy of mathematics education. New York: Falmer Press.\r 3. Li, Y., & Lappan, G. (Eds.). (2014). Mathematics curriculum in school education. Dordrecht, Netherlands: Springer.\r 4. Niess, M. L., Ronau, R. N., Shafer, K. G., Driskell, S. O., Harper S. R., Johnston, C., Browning, C., Özgün-Koca, S. A., & Kersaint, G. (2009). Mathematics teacher TPACK standards and development model. Contemporary Issues in Technology and Teacher Education, 9(1), 4-24.\r 5. Remillard, J.T. & Heck, D.J. (2014). Conceptualizing the curriculum enactment process in mathematics education. ZDM Mathematics Education, 46(5), 705-718.\r 6. Small, M. (2017). Good questions: Great ways to differentiate mathematics instruction in the standards-based classroom. New York: Teachers College Press.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "1. AAMT. (Australian Association of Mathematics Teachers). (2017). The practice of assessing mathematics learning. Retrieved from http://www.aamt.edu.au/content/download/9895/126744/file/Assessment_position_paper_2017.pdf. \r 2. Akker, J. van den (2003). Curriculum perspectives: An introduction. In J. van den Akker, W. Kuiper & U. Hameyer (Eds.), Curriculum landscapes and trends (pp. 1-10). Dordrecht: Springer.\r 3. Anderson, L. W. (2002). Curricular alignment: A re-examination. Theory into Practice, 41(4), 255-260.\r 4. Andrews, P. (2007). Negotiating meaning in cross-national studies of mathematics teaching: Kissing frogs to find princes. Comparative Education, 43(4), 489-509.\r 5. Bishop, A. J. (1999). Mathematics teaching and values education – An intersection in need of research. ZDM, 31(1), 1-4.\r 6. Burke, D. (n.d.). Audit of mathematics curriculum policy across 12 jurisdictions: Commissioned report. Retrieved from https://www.ncca.ie/media/2031/audit-mathematics-curriculum-policy.pdf.\r 7. Cai, J. (2010). Evaluation of mathematics education programs. In E. Baker, B. McGraw, & P. Peterson (Eds.), International encyclopedia of education (Vol. 2, pp. 653-659). Oxford: Elsevier.\r 8. Cai, J., & Howson, G. (2013). Toward an international mathematics curriculum. In M. A. Clements, A. J. Bishop, C. Keitel, J. Kilpatrick & F. K. S. Leung (Eds.), Third international handbook of mathematics education (pp. 949–974). Springer.\r 9. Cambridge ESOL. (English for Speakers of Other Languages). (2010). Teaching Maths through English – a CLIL approach. Retrieved from https://www.unifg.it/sites/default/files/allegatiparagrafo/21-01-2014/teaching_maths_through_clil.pdf. \r 10. Carless, D. R. (1997). Managing systemic curriculum change: A critical analysis of Hong Kong’s Target-Oriented Curriculum initiative. International Review of Education, 43(4), 349–366.\r 11. Case, B., & Zucker, S. (2005). Horizontal and vertical alignment. San Antonio, TX: Pearson Education.\r 12. CCSSI. (Common Core State Standards Initiative). (2010). Common core state standards for mathematics. Retrieved from http://www.corestandards.org/wp-content/uploads/Math_Standards1.pdf.\r 13. CDC. (Curriculum Development Council). (1999). Syllabuses for secondary schools mathematics Secondary 1 – 5. Retrieved from http://www.edb.gov.hk/en/curriculum-development/kla/ma/curr/sec-math-1999.html.\r 14. CDC. (Curriculum Development Council). (2000). Report on holistic review of the mathematics curriculum. Retrieved from http://cd1.edb.hkedcity.net/cd/maths/en/ref_res/document/AdHoc.htm.\r 15. CDC. (Curriculum Development Council). (2001). Learning to learn – The way forward in curriculum. Retrieved from http://www.edb.gov.hk/en/curriculum-development/cs-curriculum-doc-report/wf-in-cur/index.html.\r 16. CDC. (Curriculum Development Council). (2002). Mathematics education key learning area curriculum guide (Primary 1 - Secondary 3). Retrieved from http://www.edb.gov.hk/en/curriculum-development/kla/ma/curr/basic-education-2002.html.\r 17. CDC. (Curriculum Development Council). (2014). Basic education curriculum guide – To sustain, deepen and focus on learning to learn (Primary 1 – 6). Retrieved from http://www.edb.gov.hk/attachment/en/curriculum-development/doc-reports/guide-basic-edu-curriculum/BECG_2014_en.pdf.\r 18. CDC. (Curriculum Development Council). (2017a). Mathematics education key learning area curriculum guide (Primary 1 – Secondary 6). Retrieved from http://www.edb.gov.hk/attachment/en/curriculum-development/kla/ma/curr/ME_KLACG_eng_2017_12_08.pdf.\r 19. CDC. (Curriculum Development Council). (2017b). Secondary education curriculum guide. Retrieved from http://www.edb.gov.hk/attachment/en/curriculum-development/renewal/Guides/SECG%20Introduction_20170531.pdf.\r 20. Chan, K. M. (2013). Peer assessment in mathematics lessons: An action research in an eighth grade class in Macau. (Master of Education Dissertation), University of Hong Kong, Hong Kong. Retrieved from http://hdl.handle.net/10722/198870.\r 21. DfE. (Department for Education, UK). (2014). The national curriculum in England: Framework document. Retrieved from https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/381344/Master_final_national_curriculum_28_Nov.pdf.\r 22. EC. (Education Commission). (2000). Reform proposals for the education system in Hong Kong. Retrieved from http://www.e-c.edu.hk/doc/en/publications_and_related_documents/education_reform/Edu-reform-eng.pdf.\r 23. ED. (Education Department). (1994). General introduction to Target Oriented Curriculum. Hong Kong: Government Printer.\r 24. EMB. (Education Bureau). (2007). Mathematics curriculum and assessment guide (Secondary 4 - 6). Retrieved from http://www.edb.gov.hk/en/curriculum-development/kla/ma/curr/ss-math-2007.html.\r 25. EDB. (Education Bureau). (2018). Assessment for learning. Retrieved from http://www.edb.gov.hk/en/curriculum-development/assessment/about-assessment/assessment-for-learning.html.\r 26. English, L. (2016). STEM education K–12: Perspectives on integration. International Journal of STEM Education, 3(3), 1-8.\r 27. Freudenthal, H. (1973). Mathematics as an educational task. Dordrecht, The Netherlands: Reidel Publishing Company.\r 28. Hammonds, B. (2013). The effects of peer and self-assessment in a middle school mathematics classroom. (Master of Education Thesis), Ohio University, USA. Retrieved from https://www.ohio.edu/education/academic-programs/upload/Hammonds_Brittany_MRP_FINAL.pdf.\r 29. Huckstep, P. (2000). The utility of mathematics education: Some responses to skepticism. For the Learning of Mathematics, 20(2), 8–13.\r 30. Kelley, T. R. & Knowles, J. G. (2016). A conceptual framework for integrated STEM education. International Journal of STEM Education, 3(11), 1-11.\r 31. Kirkup, C., Jones, E., Everett, H., Stacey, O., & Pope, E. (2014). Developing national curriculum-based learning progressions: Mathematics. Slough: NFER.\r 32. Liu, P.-H. (2003). Do teachers need to incorporate the history of mathematics in their teaching? The Mathematics Teacher, 96(6), 416-421.\r 33. Maker, C. J. (1982). Teaching models in the education of the gifted. Rockville, MD: Aspen system corp.\r 34. Marishane, M. A., Marishane, R. N., & Mahlo, F. D. (2015). Teacher capacity for curriculum differentiation in teaching foundation phase mathematics. International Journal of Educational Sciences, 11(3), 253-262.\r 35. McKernan, J. (2007). Curriculum and imagination: Process, theory, pedagogy and action research. London: Routledge.\r 36. MOE. (Ministry of Education, People’s Republic of China). (2001). Mathematics curriculum standards for full-time compulsory education (trial version) [in Chinese]. Beijing: Beijing Normal University Press. Retrieved from http://www.dhssxx.com/keyan/UploadFiles_8011/201010/2010102223485323.doc.\r 37. MOE. (Ministry of Education, People’s Republic of China). (2011). Mathematics curriculum standards for compulsory education (2011 version) [in Chinese]. Beijing: Beijing Normal University Press. Retrieved from https://www.naer.edu.tw/ezfiles/0/1000/attach/51/pta_1725_3361727_08552.pdf.\r 38. MoE. (Ministry of Education, Singapore). (2012a). Mathematics syllabus Secondary One to Four Express Course Normal (Academic) Course. Retrieved from https://www.moe.gov.sg/docs/default-source/document/education/syllabuses/sciences/files/mathematics-syllabus-sec-1-to-4-express-n(a)-course.pdf.\r 39. MoE. (Ministry of Education, Singapore). (2012b). Primary mathematics teaching and learning syllabus. Retrieved from http://www.mgs.moe.edu.sg/qql/slot/u500/Primary/MG%20Curriculum/Academic/Mathematics/maths-primary-2013.pdf.\r 40. Morrison-Love, D. (2011). Establishing a community of learners with secondary school pupils. Retrieved from http://www.dmorrisonlove.net/uploads/7/6/8/2/7682775/a_community_of_learners_with_secondary_school_pupils.pdf.\r 41. NCTM. (National Council of Teachers of Mathematics). (2000). Principles and standards for school mathematics. Reston, VA: NCTM.\r 42. NCTM. (National Council of Teachers of Mathematics). (2006). Curriculum focal points for Prekindergarten through Grade 8 mathematics. Reston, VA: NCTM.\r 43. NCTM. (National Council of Teachers of Mathematics). (2014). Principles to actions: Ensuring mathematical success for all. Reston, VA: NCTM.\r 44. NRC. (National Research Council). (2001). Adding it up: Helping children learn mathematics. Washington, DC: National Academies Press. \r 45. OKeeffe, L. (2013). A framework for textbook analysis. International Review of Contemporary Learning Research, 2(1), 1–13.\r 46. Osta, I. (2014). Mathematics curriculum evaluation. In S. Lerman (ed.), International Encyclopedia of Mathematics Education (pp. 417-423). Springer, Netherlands.\r 47. Pepin, B., & Gueudet, G. (2014). Curriculum resources and textbooks in mathematics education. In S. Lerman (ed.), International Encyclopedia of Mathematics Education (pp. 132-135). Springer, Netherlands.\r 48. Ruddock, G., & Sainsbury, M. (2008). Comparison of the core primary curriculum in England to those of other high performing countries. (Research report no. DCSF-RW048). London: National Foundation for Educational Research & Department for Children, Schools and Families.\r 49. Schmidt, W. H., McKnight, C. C., Valverde, G. A., Houang, R. T., & Wiley, D. E. (1997). Many visions, many aims: A cross-national investigation of curricular intentions in school mathematics (Vol. 1). Dordrecht, The Netherlands: Kluwer.\r 50. Schoenfeld, A. H. (2014). Reflections on curricular change. In L. Yeping & G. Lappan (Eds.), Mathematics Curriculum in School Education (pp. 49-72). Netherlands: Springer.\r 51. Sfard, A., & Cobb, P. (2014). Research in mathematics education: What can it teach us about human learning? In R. K. Sawyer (Ed.), The Cambridge handbook of the learning sciences: Second edition (pp. 545-563). Cambridge, England: Cambridge University Press.\r 52. Sriraman, B., & English, L. (2010). Surveying theories and philosophies of mathematics education. In B. Sriraman & L. English (Eds.), Theories of mathematics education: Seeking new frontiers (pp. 7-32). Heidelberg, DL: Springer.\r 53. Stein, M., Kinder, D., & Milchick, S. (2004). Mathematics curriculum evaluation framework. Journal of Direct Instruction, 4(1), 41-52.\r 54. STEM Task Force Report. (2014). Innovate: A blueprint for science, technology, engineering, and mathematics in California public education. Dublin, California: Californians Dedicated to Education Foundation.\r 55. Strijbos, J.- W., & Sluijsmans, D. (2010). Unravelling peer assessment: Methodological, functional and conceptual developments. Learning and Instruction, 20(4), 265-269.\r 56. Tam, H. P., Wong, N.-Y., Lam, C.-C., Ma, Y., Lu, L., & Lu, Y.-J. (2014). Decision making in the mathematics curricula among the Chinese Mainland, Hong Kong, and Taiwan. In Y. Li & G. Lappan (Eds.), Mathematics curriculum in school education, Advances in mathematics education (pp. 93–117). Dordrecht: Springer.\r 57. Tang, K. C., Wong, N. Y., Fok, P. K., Ngan, M. Y., & Wong, K. L. (2007). Hong Kong primary mathematics curriculum development in the past five decades and its implications for future mathematics curriculum development [in Chinese]. Journal of Basic Education, 16(1), 115–131.\r 58. Thijs, A., & Akker, J. van den (Eds.). (2009). Curriculum in development. Enschede, Netherlands: SLO–Netherlands Institute for Curriculum Development. Retrieved from http://www.slo.nl/downloads/2009/curriculum-in-development.pdf/.\r 59. Tomlinson, C. (1999). The differentiated classroom: Responding to the needs of all learners. Alexandria, VA: Association for Supervision and Curriculum Development.\r 60. Tomlinson, C. A., & Eidson, C. C. (2003). Differentiation in practice: A resource guide for differentiating curriculum. Grades 5-9. Alexandria, VA: Association for Supervision and Curriculum Development.\r 61. Tsang, K. W. F. (2012). A comparison of the secondary school mathematics curriculum reform in Hong Kong and the United Kingdom during the new mathematics or modern mathematics era (Part 2). Retrieved from http://www.mers.hk/resource/bulletin/content/archieve/index.php?version=99&url=/99bulletin13.htm.\r 62. UNESCO. (United Nations Educational, Scientific, and Cultural Organization). (2004). Changing teaching practices : Using curriculum differentiation to respond to students’ diversity. Retrieved from http://unesdoc.unesco.org/images/0013/001365/136583e.pdf.\r 63. Van den Heuvel-Panhuizen, M., & Becker, J. (2003). Towards a didactic model for assessment design in mathematics education. In A. J. Bishop, M. A. Clements, C. Keitel, J. Kilpatrick, & F. K. S. Leung (Eds.), Second international handbook of mathematics education (pp. 686–716). Dordrecht, The Netherlands: Kluwer Academic Publishers.\r 64. Van den Heuvel-Panhuizen, M., & Drijvers, P. (2014). Realistic mathematics education. In S. Lerman (Ed.), Encyclopedia of mathematics education (pp. 521–525). Heidelberg/New York/London: Springer.\r 65. Vygotsky, L. S. (1978). Mind in society: The development of higher psychological processes. Cambridge, MA: Harvard University Press.\r 66. Walter, C., & Briggs, J. (2012). What professional development makes the most differences to teachers. Retrieved from http://www.education.ox.ac.uk/wordpress/wp-content/uploads/2010/07/WalterBriggs_2012_TeacherDevelopment_public_v2.pdf.\r 67. White-Fredette, K. (2009). Why not philosophy? Problematizing the philosophy of mathematics in a time of curriculum reform. The Mathematics Educator, 19(2), 21-31.\r 68. Wolf, P., Hill, A., & Evers, F. (2006). A handbook for curriculum assessment. Retrieved from https://ctlt.ubc.ca/files/2010/08/HbonCurriculumAssmt.pdf.\r 69. Wong, K. Y., Zhao, D., Cheng, W. K., Teo, K. M., Lee, P. Y., Yen, Y. P.,…So, H. J. (2012). Real life mathematics tasks: A Singapore experience. Retrieved from https://repository.nie.edu.sg/bitstream/10497/11492/1/NIE-SMAPP%20eBook%20-%20Real%20Life%20Mathematics%20Tasks%202012%20RESTRICTED.pdf.\r  Periodicals\r  Educational Studies in Mathematics\r For the Learning of Mathematics\r International Journal of Science and Mathematics Education \r Journal of Mathematical Behavior\r Journal for Research in Mathematics Education\r Mathematical Thinking and Learning\r ZDM—The International Journal on Mathematics Education \r 《數學教育學報》 《台灣數學教育期刊》  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 2": {"--LEC (4146)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [3], "locations": ["Esther Lee Bldg LT4"], "instructors": ["Professor LAU Wing Fat"]}}}, "assessments": {"Essays": "80", "Presentation": "20"}}, {"code": "6163", "title": "Researching Action in Mathematics Teaching", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MSc Mathematics Education", "description": "This course is designed to raise the awareness of participants who wish to improve their teaching in mathematics lessons through recurrent hermeneutic cycles of researching process. Mathematics education research is to be explored with the focus being drawn on the discussion of teacher-as-researcher movement. Through critical reflection, the participants are to explore the sense-making process of mathematics learning via researching action in mathematics lessons.", "outcome": "Upon completion of this class, the learner will be able to: \r 1. Define the characteristics of action research and professional noticing. \r 2. Compare and contrast action research with other types of research. \r 3. Relate action research to current teaching practices.\r 4. Understand different types of data collection and analysis in a classroom setting. \r 5. Analyze different types of data collected during an action research project.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "1. What is action research?\r 2. Action research designs and common mathematics education research methodologies\r 3. Preparing and critiquing action research\r 4. The discipline of noticing\r  (For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "(Required readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "recommended_readings": "Ainley, J. (1999). Who are you today? Complementary and conflicting roles in school-based research. For the Learning of Mathematics, 19(1) 39-47 \r Anderson, T. & Shattuck, J. (2012). Design-based research: A decade of progress in education research? Educational Researcher, 41, 16–25. \r Bencze, L., Hewitt, J., & Pedretti, E. (2009). Personalizing and contextualizing multimedia case methods in university-based teacher education: An important modification for promoting technological design in school science. Research in Science Education, 39(1), 93–109.\r Borko H., Jacobs J., Seago N., Mangram C. (in press). Facilitating video-based professional development: Planning and orchestrating productive discussions. In Li Y., Silver E. A., Li S. (Eds.), Transforming mathematics instruction: Multiple approaches and practices. Berlin, Germany: Springer.\r Bourner, T (2003). Assessing Reflective Learning. Education & Training, 45(5), 267-272.\r Brennan, B., Cook, J., & Pachler, N. (2016). Reconceptualizing design research in the age of mobile learning, Interactive Learning Environments, 24(5), 938-953, doi: 10.1080/10494820.2015.1018911\r Cai, J., Morris, A., Hohensee, C., Hwang, S. (2018). Building and Structuring Knowledge That Could Actually Improve Instructional Practice. Journal for Research in Mathematics Education, 49(3), 238–246.\r Carson, T. R., & Sumara, D. J. (Eds.). (1997). Action research as a living practice. New York: Peter Lang. Bruner, J. (1966). Toward a theory of instruction. Cambridge, MA: Harvard University Press.\r Choy, B.H. (2016). Snapshots of mathematics teacher noticing during task design. Mathematics education research journal, 28, 421-440.\r Clark-Wilson, A., & Noss, R. (2015). Hiccups within technology mediated lessons: A catalyst for mathematics teachers' epistemological development. Research in Mathematics Education, 17(2). doi: 10.1080/14794802.2015.1046476\r Creswell, J.W. (2005). Educational research. Upper Saddle River, New Jersey: Pearson.\r Elliott, J. (2015). Educational action research as the quest for virtue in teaching. Educational Action Research, 23(1), 4-21, DOI: 10.1080/09650792.2014.994017 \r Elliott, J. (2007). Assessing the quality of action research. Research Papers in Education, 22(2), 229-246, DOI: 10.1080/02671520701296205. \r Feldman, A. (2007). Teachers, responsibility and action research. Educational Action Research, 15(2), 239-252, DOI: 10.1080/09650790701314809\r Frey, B. (2016). There’s a stat for that! Thousand Oaks: Sage.\r Floro, B., & Bostic, J. (2017). A Case Study of Middle School Teachers’ Noticing During Modeling with Mathematics Tasks. In E.O. Schack, M.H. Fisher, & J.A. Wilhelm (Eds.). Teacher Noticing: Bridging and Broadening Perspectives, Contexts, and Frameworks (pp 73-89). Cham, Switzerland: Springer.\r Gee, J.P. (2014). An introduction to discourse analysis: Theory and method. New York: Routledge.\r Gee, J.P. (2008). A Sociocultural Perspective on Opportunity to Learn. In Assessment, Equity, and Opportunity to Learn (pp. 76-108). Cambridge, UK: Cambridge University Press \r Gee, J. (2004) Language in the science classroom: academic social languages as the heart of school-based literacy. In E. W. Saul (Ed.) Crossing borders in literacy and science instruction (pp. 13–32) Newark, DE: International Reading Association. \r Gee, J.P. (2002). Learning in semiotic domains: A social and situated account. In D. Schalert, C. Fairbanks, J. Worthy, B. Maloch, & J. Hoffman, Eds., The 51st yearbook of the National Reading Conference (pp. 23-32). Oak Creek, WI: NRC\r Gibson, W. J., & Brown, A. (2009). Working with qualitative data. London: Sage.\r Ginsburg, H.P. (1997). Entering the child’s mind: the clinical interview in psychological research and practice. Cambridge University Press, New York. \r Grundy, S. (1994). Action research at the school level: possibilities and problems. Educational Action Research, 2(1), 23-37. \r Hatch, J. A. (2002). Doing qualitative research in education settings. Albany, NY: State University of New York Press.\r Herbel-Eisenmann, B. & Pimm, D. The one and the many: transcripts and the art of interpretation. For the learning of mathematics, 34(2), 38-40.\r Hong Kong Curriculum Development Council. (2015). Ongoing Renewal of the school curriculum – Focusing, deepening and sustaining: Updating the mathematics education key learning area curriculum (primary 1 to secondary 6). Hong Kong: The Printing Department.\r Huillet, D. (2014). Teacher as Researcher in Mathematics Education. In S. Lerman (ed.), Encyclopedia of Mathematics Education, pp.582-583. Dordrecht: Springer.\r Huillet, D., Adler, J., & Berger, M. (2011). Teachers as researchers: Placing mathematics at the core. Education as Change, 15(1), 17-32.\r Jacobs, V. R., Lamb, L. L. C., & Philipp, R. A. (2010). Professional noticing of children’s mathematical thinking. Journal for Research in Mathematics Education, 41(2), 169–202.\r Kieran, C., Krainer, K., & Shaughnessy, J. M. (2013). Linking research to practice: Teachers key stakeholders in mathematics education research. In K. Clements, A. Bishop, C. Keitel, J. Kilpatrick, & F. Leung, (Eds.), Third international handbook of research in mathematics education (pp. 361–392). New York, NY: Springer.\r Koehler, M., & Mishra, P. (2009). What is technological pedagogical content knowledge (TPACK)? Contemporary Issues in Technology and Teacher Education, 9(1), 60–70.\r Lave, J., & Wenger, E. (1999). Situated learning: Legitimate peripheral participation. Cambridge: Cambridge University Press.\r Mason, J. (2002). Researching your own practice: The discipline of noticing. NY: Routledge.\r Mason, J. (2008). Being mathematical with and in front of learners: attention, awareness and attitude as sources of differences between teacher educators, teachers and learners. International handbook of mathematics teacher education: pp.31-56.\r Mason, J. (2016). Rising above a cause-and-effect stance in mathematics education research, Journal of Mathematics Teacher Education, 19(4), 297–300\r Mason, J. (2017). Probing Beneath the Surface of Experience. In E.O. Schack, M.H. Fisher, & J.A. Wilhelm (Eds.). Teacher Noticing: Bridging and Broadening Perspectives, Contexts, and Frameworks (pp 1-17). New York: Springer.\r Maher, S.A., & Sigley, R. (2014). Task-Based Interviews in Mathematics Education. In S. Lerman (ed.), Encyclopedia of Mathematics Education, pp.579-582. Dordrecht: Springer.\r McNiff, J. (1991). Action research: Principles and practice. London: Routledge.\r McNiff, J., & Whitehead, J. (1996). You and your action research project. London: Routledge.\r Nyanjom, J. (2017). Cycles within cycles: instilling structure into a mentoring self-study action research project, Educational Action Research, DOI: 10.1080/09650792.2017.1386116. \r Rich, P., & Hannafin, M. J. (2008). Capturing and assessing evidence of student teacher inquiry: A case study. Teaching and Teacher Education, 24(6), 1426–1440.\r Roche, M. (2011). Creating a dialogical and critical classroom: reflection and action to improve practice. Educational Action Research, 19(3), 327-343, DOI: 10.1080/09650792.2011.600607 \r Roschelle, J. (2006, August). Effective integration of dynamic representations and collaboration to enhance mathematics and science learning. Keynote address at Curriculum Corporation 13th National Conference. Adelaide, Australia.\r Schack, E.O., Fisher, M.H., & Wilhelm, J.A. Teacher Noticing: Bridging and Broadening Perspectives, Contexts, and Frameworks. New York: Springer.\r Sherin, M. G., Jacobs, V. R., Philipp, R. A., & Sherin, M. G. (Ed.) (2011). Mathematics teacher noticing: Seeing through teachers' eyes. New York: Taylor and Francies.\r Star, J. R., & Strickland, S. K. (2008). Learning to observe: using video to improve preservice mathematics teachers’ ability to notice. Journal of Mathematics Teacher Education, 11(2), 107–125. doi:10.1007/s10857-007-9063-7\r Star, J. R., Lynch, K., & Perova, N. (2011). Using video to improve preservice mathematics teachers’ abilities to attend to classroom features. In M. G. Sherin, V. R. Jacobs, & R. A. Philipp (Eds.), Mathematics teacher noticing: Seeing through teachers’ eyes (pp. 117–133). New York: Routledge.\r Strauss, A., & Corbin, J. (1990). Basics of qualitative research: Grounded theory procedures and techniques. Thousand Oaks, CA: Sage. \r Stenhouse, L. (1981). What Counts as Research? British Journal of Educational Studies, 29, 103-114. \r Tracy, S. (2010). Qualitative Quality: Eight “Big-Tent” Criteria for Excellent Qualitative Research. Qualitative Inquiry, 16(10), 837–851.\r Tripp, T., & Rich, P. (2012). Using video to analyze Stringer, E.T. (2014). Action Research. Thousand Oaks: Sage.\r Wilkinson, S., & Kitzinger, C. (2011), ‘Conversation analysis’, in K. Hyland and B. Paltridge (Eds), Continuum Companion to Discourse Analysis (pp. 22–37.). London: Continuum.\r Zeni, J. (1988). A guide to ethical issues and action research. Educational Action Research, 6(1), 9-19. \r van Es, E.A., Tunney, J., Goldsmith, L.T., Seago, N. (2014). A Framework for the Facilitation of Teachers’ Analysis of Video. Journal of Teacher Education, 65(4), 340-356.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 1": {"--LEC (1977)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor NG Oi Lam"]}}}, "assessments": {"Essay test or exam": "50", "Homework or assignment": "25", "Presentation": "25"}}, {"code": "6164", "title": "Project and Research Report: Mathematics Education", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "LectureProject", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MSc Mathematics Education", "description": "The participants are expected to conduct guided independent studies, and on completion, to submit a research report within the area of mathematics education. The exact titles of the projects of investigation and the supervision schedules are to be negotiated between supervisors and participant.", "outcome": "After taking this course, students will be able to:1. Demonstrate the application of knowledge and method to the investigation of a specific area within the field of Mathematics Education.2. Identify an issue to which solutions and/or recommendations can be addressed; and produce a written report which sets out clearly the aims, context, content and outcome.3. Integrate the skills and knowledge which have been taught in the degree programme with specific application to a topic to produce a well-argued report.(Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "(Required readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "recommended_readings": "(Recommended readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 1": {"AJ01-PRJ (2189)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}, "2020-21 Term 2": {"BJ01-PRJ (2199)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}}}, {"code": "6165", "title": "Independent Study in Mathematics Education", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureProject", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MSc Mathematics Education", "description": "Students will pursue independent study in selected topics and areas of mathematics education under the supervision of teachers as appointed by the board of the Faculty of Education. A student should only elect this course to fulfi ll the programme requirements if a required course is not offered within the normative study period of the student, and no other substitute can be found.", "outcome": "After taking this course, students will be able to:\r 1. Demonstrate the application of knowledge and method to the investigation of a specific area within the field of Mathematics Education.\r 2. Identify an issue to which solutions and/or recommendations can be addressed; and produce a written report which sets out clearly the aims, context, content and outcome.\r 3. Integrate the skills and knowledge which have been taught in the degree programme with specific application to a topic to produce a well-argued report.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "(Required readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "recommended_readings": "(Recommended readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 1": {"AJ01-PRJ (2190)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}, "2020-21 Term 2": {"BJ01-PRJ (2200)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}}}]