[{"code": "6101", "title": "Curriculum Development and Assessment in Early Childhood Education", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Early Childhood Education", "description": "This course focuses on current issues in curriculum development and assessment in early childhood education (ECE). Technical, deliberative/ practical and critical approaches to curriculum development in ECE will be explored. Participants will be encouraged to reflect on their own practices and examine issues which are likely to be covered: curriculum continuity between kindergarten and primary school; values education in the early childhood curriculum; multiple intelligences and their application in curriculum development and assessment; whole language approach; information technology in education; portfolio assessment; and sociocultural theories for early childhood curriculum.", "outcome": "At the end of this course, students are expected to: \r 1. Grasp the distinctive features of different curriculum development models; 2. Understand the principles that underpin the ECE curriculum and assessment designs; 3. Offer analysis and personal opinions on selected curriculum issues in ECE; and\r 4. Reflect on their own practices related to curriculum development in ECE.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "1. Trends and issues in of ECE curriculum development and assessment\r 2. Approaches to curriculum development and assessment\r 3. Developmentally appropriate practice and authentic assessment\r 4. Project approach and portfolio assessment\r 5. Play and early childhood education curriculum\r 6. Inclusive education in kindergartens\r 7. Catering learner diversities\r 8. Whole language approach and assessment\r 9. Integrated curriculum and assessment\r 10. Pedagogical decision making and constructivist instruction in ECE\r 11. Sociocultural theories and hidden curriculum in ECE\r  (For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "1. Li, H., Rao, N., & Tse, S. K. (2012). Adapting Western pedagogies for Chinese literacy instruction: Case studies of Hong Kong, Shenzhen, and Singapore preschools. Early Education and Development, 23(4), 603-621.\r 2. Li, H., & Fong, R. W. (2014). Implementing 15-year free education in Hong Kong: Dilemmas and practical solutions. Hong Kong Teachers’ Centre Journal, 13, 1–14.\r 3. Rao, N., & Li, H. (2009). Quality Matters: Early Childhood Education Policy in Hong Kong. Early Child Development and Care, 179(3), 233–245.\r 4. Rao, N., Ng, S. S. N., & Pearson, E. (2009). Preschool pedagogy: A fusion of traditional Chinese beliefs and contemporary notions of appropriate practice. In C. K. K. Chan & N. Rao (Eds.), Revisiting the Chinese learner: Changing contexts, changing education (pp. 255-279). Hong Kong: Springer, CERC.\r 5. Rao, N., Zhou, J., & Sun, J. (Eds.) (2017). Early childhood education in Chinese societies. Dordrecht, Netherlands: Springer.\r 6. 林志德、歐凱鑫（2006）。反思幼稚園的全語文學習。香港教師中心學報, 5, 1-8。\r 7. 林智中、張爽（2004）。課程統整效能的研究：批判性的文獻回顧。香港：香港中文大學教育學院：香港中文大學香港教育硏究所。(LB2806.15 .Z55 2004) (reserved)\r 8. 馮施鈺珩（2015）。幼兒課程學：理論與實踐。香港公開大學出版社。\r 9. 許麗平、楊少詩（2007）。融合教育：障礙與時機。香港幼兒學報，6（1），頁49-53。\r 10. 馮潔皓（2014）。二十一世紀的香港幼兒教育課程改革：回顧與前瞻。教育學報，42（2），頁95-112。\r 11. 課程發展議會（2017）。《幼稚園教育課程指引》。取自： https://www.edb.gov.hk/attachment/tc/curriculum-development/major-level-of-edu/preprimary/TC_KGECG_2017.pdf\r  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "L1. Overview\r 1. McCutcheon, G. (1997). Curriculum and the work of teachers. In D. J. Flinders & S. J. Thornton (Eds.), The curriculum studies reader (pp.188-197). New York: Routledge.\r 2. National Association for the Education of Young Children and National Association of Early Childhood Specialists in State Departments of Education (2003). Early childhood curriculum, assessment, and program evaluation: Building an effective, accountable system in programs for children birth through age 8. Retrieved from https://www.naeyc.org/files/naeyc/file/positions/CAPEexpand.pdf\r 3. Schweinhart, L. J., & Weikart, D. P. (1998). Why curriculum matters in early childhood education. Educational Leadership, 55(6), 57-60.\r 4. Spodek, B., & Saracho, O.N. (2003). “On the shoulders of giants”: Exploring the traditions of early childhood education. Early Childhood Education Journal, 31(1), 3-10.\r 5. Walsh, D. J. (2005). Developmental theory and early childhood education: Necessary but not sufficient. In N. Yelland (Ed.), Critical issues in early childhood education (pp. 40-48). NY: Open University Press.\r  L2. Trends and issues of ECE curriculum development & assessment\r 1. Saracho, O., & Spodek, B. (2003). Recent trends and innovations in the ECE curriculum. Early Child Development and Care, 173(2–3), 175–183.\r 2. Yelland, N., & Kilderry, A. (2005). Against the tide: New ways in ECE. In N. Yelland (Ed), Critical issues in early ECE (pp. 1-13). NY: Open University Press.\r 3. Zhu, J. (2009). Early childhood education and relative policies in China. International Journal of Child Care and Education Policy, 3(1), 51-60.\r 4. 黎鳳霞（2010）。香港學前教育課程探討1996-2006。載李南玉編，開來繼往，教學相長—香港浸會大學持續教育學院三十五周年紀念論文集（頁276-298）。香港：香港浸會大學持續教育學院幼兒及基礎教育部。\r  L3. Approaches to curriculum development & assessment in ECE\r 1. Appl, D. J. (2000). Clarifying the preschool assessment process: Traditional practices and alternative approaches. Early Childhood Education Journal, 27(4), 219-225. \r 2. Copple, C. (2003). Fostering young children’s representation, planning, and reflection: A focus in three current early childhood models. Applied Developmental Psychology, 24(6), 763-771.\r 3. Kessels, J., & Plomp, T. (1996). Course design. In T. Plomp & D. Ely (Eds.), The international encyclopedia of educational technology (2nd ed.) (pp. 143-148). NY: Pergamon. \r 4. Lim, B. Y. (2004). The magic of the brush and the power of color: Integrating theory into practice of painting in early childhood settings. Early Childhood Education Journal, 32(2), 113-119.\r 5. Schwab, J. J. (1969). The practical: A language for curriculum. School Review, 78(1), 1-23.\r 6. Tyler, R. W. (1949). Basic principles of curriculum and instruction. Chicago: University of Chicago Press. (reserved)\r 7. Walker, D. F. (1971). A naturalistic model for curriculum development. School Review, 80(1), 51-65.\r 8. 簡楚瑛（2005）。幼兒教育課程模式（第三版）。台北：心理。(LB 1140.4 .J35 2005)\r  L4. Developmentally appropriate practice and authentic assessment \r 1. Copple, C., & Bredekemp, S. (2009). Developmentally appropriate practice in early childhood programs serving children from birth through age 8. Washington, DC: NAEYC.\r 2. Hirsh, R.A. (2004). Early childhood curriculum: Incorporating multiple intelligences, developmentally appropriate practice, and play. Boston: Pearson. (LB 1139.4 .H57 2004)\r 3. Kim, H. K. (2011). Developmentally appropriate practice (DAP) as defined and interpreted by early childhood preservice teachers: Beliefs about DAP and influences of teacher education and field experiences. SRATE Journal, 20(2), 12-22.\r 4. Kostelnik, M. J., Soderman, A. K., & Whiren, A. P. (2011). Developmentally appropriate curriculum: Best practices in early childhood education (5th ed.). Boston: Pearson. (LB1139.25 .K67 2011) (Noted: 2007 the 4th edition has been reserved)\r 5. Parker, A., & Neuharth-Pritchett, S. (2006). Developmentally appropriate practice in kindergarten: factors shaping teacher beliefs and practice. Journal of Research in Childhood Education, 21(1), 65-78.\r 6. Shiakou, M & Belsky, J. (2009). Exploring effects of developmentally appropriate practices in Cyprus. Early Education and Development, 20(4), 565–583.\r  L5. Project approach and portfolio assessment \r 1. Buldu, M. (2010). Making learning visible in kindergarten classrooms: Pedagogical documentation as a formative assessment technique. Teaching and Teacher Education, 26, 1439-1449.\r 2. Catapano, S. (2005). Teacher professional development through children’s project work. Early Childhood Education Journal, 32(4), 261-267.\r 3. Clark, A. (2006). Changing classroom practice to include the project approach. Early Childhood Research & Practice, 8(2). \r 4. Helm, J. H., & Katz, L. (2011). Young investigators: The project approach in the early years (2nd ed., Ch. 1). New York: Teachers College Press. (LB1139.35.P8 H46 2011)\r 5. Hewett, V. M. (2001). Examining the Reggio Emilia approach to early childhood education. Early Childhood Education Journal, 29(2), 95-100.\r 6. Katz, L., & Chard, C. (2013). The project approach: An overview. In J. Roopnarine & J. Johnson (Eds.), Approaches to early childhood education (pp. 279-298). Columbus, OH: Merrill. \r 7. Pecore, J. L. (2015). From Kilpartick’s project method to project-based learning. In M. Y. Eryaman & B. C. Bruce (Eds.), International Handbook of Progressive Education (pp. 155-171). New York: Peter Lang.\r 8. Mitchell, S., Foulger, T. S., Wetzel, K., & Rathkey, C. (2009). The negotiated project approach: Project-based learning without leaving the standards behind. Early Childhood Education Journal, 36, 339-346.\r 9. Notari-Syverson, A., & Losardo, A. (2004). What assessment means to early childhood educators? Exchange: The Early Childhood Leaders’ Magazine, 159, 72-75.\r 10. Trepanier-Street, M. (1993). What’s so new about the project approach? Childhood Education, 70(1), 25-28.\r  L6. Play and early childhood education curriculum\r 1. Ashiabi, G. S. (2007). Play in the preschool classroom: Its socioemotional significance and the teacher’s role in play. Early Childhood Education Journal, 35(2), 199-207.\r 2. Coolahan, K., Fantuzzo, J., Mendez, J., & McDermott, P. (2000). Preschool peer interactions and readiness to learn: Relationships between classroom peer play and learning behaviors and conduct. Journal of Educational Psychology, 92(3), 458-465.\r 3. Diamond, A., Barnett, W. S., Thomas, J., & Munro, S. (2007). Preschool program improves cognitive control. Science, 319(5855), 1387-1388.\r 4. Edwards, S., & Cutter-Mackenzie, A. (2011). Environmentalising early childhood education curriculum through pedagogies of play. Australian Journal of Early Childhood, 36(1), 51-59.\r 5. Hanline, M. F. (1999). Developing a preschool play-based curriculum. International Journal of Disability, Development and Education, 46(3), 289-305.\r 6. Lillard, A. S., Lerner, M. D., Hopkins, E. J., Dore, R. A., Smith, E. D., & Palmquist, C. M. (2013). The impact of pretend play on children’s development: A review of the evidence. Psychological Bulletin, 139(1), 1-34.\r 7. Ridgway, A., & Quinones, G. (2012). How do early childhood students conceptualise play-based curriculum? Australian Journal of Teacher Education, 37(1), 46-56.\r 8. Samuelsson, I. P., & Johansson, E. (2006). Play and learning – inseparable dimensions in preschool practice. Early Childhood Development and Care, 176(1), 47-65.\r 9. 黃瑞琴(2009) 。當遊戲遇見幼兒課程。教育研究與發展期刊, 5(2), 27-54。\r  L7 & L8. Inclusive education in kindergartens & Catering for learner diversities\r 1. 教育局與社會福利署編訂的《學前機構辦學手冊》（第七章課程與活動）（2015年1月修訂）取自：http://www.edb.gov.hk/attachment/tc/edu-system/preprimary-kindergarten/overview/Operation_Manual_chi.pdf\r 2. 《學前教育課程指引》 （2006）取自：http://www.edb.gov.hk/attachment/tc/curriculum-development/major-level-of-edu/preprimary/pre-primaryguide-net_tc.pdf\r 3. 《適用書目表:幼稚園學習資料》取自：https://cd.edb.gov.hk/rtl/search.asp\r 4. 《學前兒童發展及行為處理 ── 幼師參考資料套》取自：http://www.edb.gov.hk/tc/edu-system/preprimary-kindergarten/comprehensive-child-development-service/#Reference\r 5. 幼稚園行政手冊（2017/2018）取自：http://www.edb.gov.hk/attachment/en/edu-system/preprimary-kindergarten/free-quality-kg-edu/Admin%20Guide%20Chi%201718%201.0.pdf\r 6. 學前機構 自我評估手冊（2012）取自：http://www.edb.gov.hk/attachment/tc/edu-system/preprimary-kindergarten/quality-assurance-framework/sse/SSE_Manual_Chi.pdf\r 7. 表現指標（學前機構）取自：http://www.edb.gov.hk/tc/edu-system/preprimary-kindergarten/quality-assurance-framework/performance-indicators-pre-primary-institutions/index.html\r  L9. Whole language approach and assessment\r 1. Bergeron, B. S. (1990). What does the term whole language mean? Constructing a definition from the literature. Journal of Reading Behavior, 22(4), 301-329.\r 2. Goodman, K. S. (1992). Why whole language is today’s agenda in education. Language Arts, 69(5), 354-363.\r 3. Krashen, S. (2002). Defending whole language: The limits of phonics instruction and the efficacy of whole language instruction. Reading Improvement, 39(1), 32-42.\r 4. Stockard, J., & Engelmann, K. (2010). The development of early academic success: The impact of direct instruction’s “reading mastery”. Journal of Behavior Assessment and Intervention in Children, 1(1), 2-24.\r 5. Shelley, A. C. (1995). Whole language teaching and learning: Is it for everyone? Reading Horizons, 36(2), 116-125.\r 6. Wheeler, G. (1995). Making fundamental changes in education: Is “whole language” feasible? TESL Canada Journal, 13(1), 87-94. \r 7. 袁愛玲(2001)。學前全語言創造敎育活動設計。北京: 敎育科學出版社。\r 8. 施淑娟、曹湘玲(2013) 。全語文概念融入蒙特梭利教學之初探。臺北市立大學學報, 44(2), 57-84。\r 9. 廖佩莉 (2013) 。香港幼稚園實施「全語文」的現況：從教師的角度出發。論文發表於「香港亞洲研究學會第第八屆研討會」，香港教育學院，香港。\r  L10. Integrated curriculum and assessment\r 1. Beane, J. A. (1995) Curriculum integration and the disciplines of knowledge. Phi Delta Kappan, 76(8), 616-622.\r 2. Biddle, M. (2007). When opportunity knocks: Integrating language arts and the daily calendar. Reading Teacher, 60(5), 488-491.\r 3. Colley, S. (2005). Towards the seamless day: Integrating early childhood programs. Education Canada, 45(2), 32-35.\r 4. Cukierkorn, J. R., Karnes, F. A., & Manning, S. J. (2007). Serving the preschool gifted child: “Programming and resources.” Roeper Review, 29(4), 271-276.\r 5. Fraser, D. (2013). Curriculum integration. In D. Fraser, V. Aitken & B. Whyte (Eds.), Connecting curriculum, linking learning (pp. 18-33). Wellington: NZCER press.\r 6. Huerta, M., & Jackson, J. (2010). Connecting literacy and science to increase achievement for English language learners. Early Childhood Education Journal, 38(3), 205-211.\r 7. Loughran, S. (2005). Thematic teaching in action. Kappa Delta Pi Record, 41(3), 112-117.\r 8. McGarry, T. P. (1986). Integrated learning for young children. Educational Leadership, 44(3), 64-66.\r 9. New, R. S. (1999). An integrated early childhood curriculum: Moving from the what and the how to the why. In C. Seefeldt (Ed.), The early childhood curriculum: Current findings in theory and practices (pp. 265-288). New York: Teachers College Press. (LB1139.4.E17 1999) \r 10. Niland, A. (2007). Musical stories: Strategies for integrating literature and music for young children. Australian Journal of Early Childhood, 32(4), 7-11.\r 11. Toren, Z., Maiselman, D., & Inbar, S. (2008). Curriculum integration: Art, literature and technology in pre-service kindergarten teacher training. Early Childhood Education Journal, 35(4), 327-333.\r 12. Zhbanova, K. S., Rule, A. C., & Montgomery, S. E. (2010). Defining the difference: Comparing integrated and traditional single-subject lessons. Early Childhood Education Journal, 38(4), 251-258.\r  L11. Pedagogical decision making and constructivist instruction in ECE\r 1. Fung, C. K. H. (2015). “Active child” and “active teacher”: Complementary roles in sustaining child-centered curriculum. Childhood Education, 91(6), 420-431.\r 2. Heron, A. H. (2003). A study of agency: Multiple constructions of choice and decision making in an inquiry-based summer school program for struggling readers. Journal of Adolescent and Adult Literacy, 46(7), 568-579.\r 3. Malone, D., & Denno, D. (2003). Decision making in early childhood intervention. Early Childhood Education Journal, 30(4), 265-273.\r 4. Starko, A. J., Sparks-Langer, G. M., Pasch, M., Frankes, L., Gardner, T. G., & Moody, C. D. (1995). Teaching as decision making: Successful practices for the elementary teacher (2nd ed). Upper Saddle River, NJ: Merrill. (Chapter 1: Teaching as decision making)\r 5. Stoffels, N. T. (2005). “'Sir, on what page is the answer?”: Exploring teacher decision-making during complex curriculum change, with specific reference to the use of learner support material. International Journal of Educational Development, 25(5), 531-546.\r  L12. Sociocultural theories and hidden curriculum in ECE\r 1. Aina, O. E., & Cameron, P. A. (2011). Why does gender matter? Counteracting stereotypes with young children. Dimensions of Early Childhood, 39(3), 11-20.\r 2. Baker, E. R., Tisak, M. S., & Tisak, J. (2016). What can boys and girls do? Preschoolers’ perspectives regarding gender roles across domains of behavior. Social Psychology of Education, 19(1), 23-39.\r 3. Chen, E. S. L., & Rao, N. (2011). Gender socialization in Chinese kindergartens: Teachers’ contributions. Sex Roles, 64(1-2), 103-116.\r 4. Edwards, S. (2003). New directions: Charting the paths for the role of sociocultural theory in early childhood education and curriculum. Contemporary Issues in Early Childhood, 4(3), 251-266.\r 5. Jingbo, L., & Elicker, J. (2005). Teacher-child interaction in Chinese kindergartens: An observational analysis. International Journal of Early Years Education, 13(2), 129-143.\r 6. Rietveld, C. (2010). Early childhood inclusion: The hidden curriculum of peer relationships. New Zealand Journal of Educational Studies, 45(1), 17-32.\r 7. Smith, A. B. (1996). The early childhood curriculum from a sociocultural perspective. Early Childhood Development and Care, 115(1), 51-64. \r 8. Wren, D. (1999). School culture: Exploring the hidden curriculum. Adolescence, 34, 593-596.\r 9. Zorec, M. B., & Dosler, A. J. (2016). Rethinking the hidden curriculum: Daily routine in Slovene preschools. European Early Childhood Education Research Journal, 24(1), 103-114.\r 10. 張盈堃(2012) 。幼稚園性別導向的課程。性別平等教育季刊, 57, 27-30。\r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 1": {"--LEC (3538)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor LEUNG Kit Ying Suzannie"]}}}, "assessments": {"Essays": "50", "Presentation": "20", "Report": "30"}}, {"code": "6201", "title": "Educational Leadership and Management in Early Childhood Education", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Early Childhood Education", "description": "This course focuses on two important aspects in early childhood education: educational leadership and management. It is to emphasize that leadership and management are of paramount importance to the success of any organization, including ECE institutions. It is leadership and management that make organizations efficient and effective. This course blends the theoretical concepts of leadership and management with practice, enabling the participants to refine and improve their practice. By the end of the course, students will be familiar with a number of theories and perspectives of leadership and management; be able to critically analyze different perspectives and theories; have developed a position on what they believe ‘good’ leadership and management entailed in Hong Kong schools in general, and more specifically within their workplace context; and be able to discuss the various educational leadership and management issues in Hong Kong schools and their relationship with educational reform.", "outcome": "• Appreciate the complexity of real life in school; • Develop an integrative perspective about organizational life in school; • Become an independent and critical thinker; • Employ organizational theory as a lens to interpret everyday organizational life; • Apply theories to improve organizational practice; • Explore management practices across cultural boundaries; • Understand the new roles emerging in organizations as a result of innovations in technology.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "1. Foundations of management and leadership theories\r 2. Structural perspective\r 3. Political perspective\r 4. Human resource perspective\r 5. Cultural perspective\r 6. Integration\r  (For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "(Required readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "recommended_readings": "(Recommended readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 2": {"--LEC (2033)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [1], "locations": ["Yasumoto Int'l Acad Park 201"], "instructors": ["Professor CHEUNG Man Biu"]}}}, "assessments": {"Essays": "50", "Project": "50"}}, {"code": "6202", "title": "Comparative Education and Current Issues in Early Childhood Education", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Early Childhood Education", "description": "This course focuses on the current issues from a comparative perspective. It aims to expound the divergent and convergent trends among educational policies, educational practices and issues related to early childhood education. The following issues are likely to be examined: educational governance and finance; home-preschool collaboration; early childhood education and care policy; early childhood school-based curriculum reform; preschool special education, preschool improvement and new trends in early childhood educational research. Through a comparison of the rationales, initiatives in early childhood education in different societies, participants will be able to examine the local development of early childhood education in a wider context.", "outcome": "Upon completion of this course, students are expected:\r 1. to have a basic understanding of general perspectives on education; 2. to be able to reflect on the meaning and significance of the key issues in early childhood education; 3. to relate their own experience to the concepts and theories learnt in the course.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "(Required readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "recommended_readings": "(Recommended readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 1": {"--LEC (2293)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Dr. KOO Wai Sze"]}}}, "assessments": {"Essay test or exam": "0", "Homework or assignment": "0", "Presentation": "0"}}, {"code": "6301", "title": "Early Childhood Development from Birth to Eight Years of Age", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Early Childhood Education", "description": "Studies of early childhood from birth to eighth year of age will be introduced in this course which includes the characteristic periods of infants, toddlers, preschool and kindergarten kids, and children of early primary grades. The course is to develop students’ insights into early childhood’s physical, motor, intellectual, emotional, social, and aesthetic growth. Major developmental theories/perspectives will be discussed, analyzed, and compared. The key issues that will be highlighted are concerned with developmental and learning mechanisms, domain-general and domain-specific development, and nature-nurture relationship. Reflecting upon relevant social policy and educational initiatives. The challenges will be analyzed of translating observations and theories of child development into child care and education practices at home and at school.", "outcome": "A. Compare and contrast the perspectives of major developmental theories which influence early childhood education.\r B. Demonstrate knowledge of developmental capabilities and tasks at each stage of early childhood development.\r C. Practice methodological approaches including observations, interviews, and developmental assessments to understand children’s behaviors.\r D. Demonstrate the ability to summarize and to analyze collected information on young children’s development in theoretical contexts.\r E. Apply developmental theories and research results in practical situations when planning for instruction, or developing facilitative interactions with children.\r F. Appreciate developmental differences in individual children and understand how they influence classroom practice.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "The introduction of what, why, and how of the study of early childhood development\r Physical growth and brain development\r Cognitive development\r Social and emotional development\r  (For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "Berk, L. E. (2013). Child Development (9th ed.). Upper Saddle River, NJ: Pearson Education Inc.\r (The above book has Chinese translated version.)\r  Wittmer, D., Peterson, S. H., & Puckett, M. B. (2013). The young child: Development from prebirth through age eight (6th ed.) Upper Saddle River, NJ: Pearson Education Inc.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Atherton, F., & Nutbrown, C. (2013). Understanding schemas and young children: From birth to three. Thousand Oaks, CA: SAGE Publications Ltd.\r Beaty, J. J. (2014). Observing development of the young child (8th ed.). UpperSaddle River, NJ: Pearson Education, Inc.\r Billman, J. (2003). Observation and participation in early childhood settings: A practicum guide. Boston, MA: Allyn and Bacon. \r Bjorklund, D. F., & Causey, K. B. (2018). Children’s thinking: Cognitive development and individual differences (6th ed.). Thousand Oaks, CA: SAGE Publications, Inc.\r Brock, A., Dodds, S., Jarvis, P., & Olusoga, Y. (2009). Perspectives on play: Learning for life. Essex, England: Pearson Education Limited.\r Bruce, T., Louis, S., & McCall, G. (2015). Observing young children. Thousand Oaks, CA: Sage Publications Ltd.\r Conkbayir, M., & Pascal, C. (2014). Early childhood theories and contemporary issues: An introduction. London, UK: Bloomsbury Publishing Plc.\r Empson, J. M. (2015). Atypical child development in context (2nd ed.). London, England: Palgrave.\r Engel, S. L. (2005). Real kids: Creating meaning in everyday life. Cambridge, MA: Harvard University Press.\r Fleer, M. (2010). Early learning and development: Cultural-historical concepts in play. New York, NY: Cambridge University Press.\r Gentner, D., & Goldin-Meadow, S. (2003). Language in mind: Advances in the study of language and thought. Cambridge, MA: The MIT Press.\r Griffin, J. A., McCardle, P., & Freund, L. S. (Eds.) (2016). Executive function in preschool-age children: Integrating measurement, neurodevelopment, and translational research. Washington, DC: American Psychological Association.\r Grimmer, T. (2017). Observing and developing schematic behavior in young children: A professional’s guide for supporting children’s learning, play and development. Philadephia, PA: Jessica Kingsley Publishers.\r Hayes, N., O’Toole, L., & Halpenny, M. (2017). Introducing Bronfenbrenner: A guide for practioners and students in early years education. New York, NY: Routledge.\r McAfee, O., Leong, D. J., & Bodrova, E. (2016). Assessing and guiding young children’s development and learning (6th ed.). Upper Saddle River, NJ: Pearson education Inc.\r McCartney, K., & Philips, D. (2006). Blackwell handbook of early childhood development. Oxford, UK: Blackwell Publishing.\r McDevitt, T. M., & Ormrod, J. E. (2013). Child Development and Education (5th ed.). Upper Saddle River, NJ: Pearson.\r Mindes, G., & Jung, L. A. (2015). Assessing young children (5th ed.). Upper Saddle River, NJ: Pearson Education, Inc.\r Nelsen, J., Erwin, C., & Duffy, R. (2015). Positive discipline: The first three years (3rd ed.) New York, Harmony Books.\r Opper, S. (1996). Hong Kong’s young children: Their early development and learning. Hong Kong: Hong Kong University Press.\r Petty, K. (2010). Developmental milestones of young children. St. Paul, MN: Redleaf Press.\r Puckett, M.B., & Black, J. K. (2007). Understanding preschooler development. Upper Saddle River, NJ: Pearson education Inc.\r Reed, M., & Walker, R. (Eds.) (2015). A critical companion to early childhood. Thousand Oaks, CA: Sage Publications Ltd.\r Riddall-Leech, S. (2008). How to observe children. UK: Heinemann.\r WiIlats, J. (2005). Making sense of children’s drawings. Malwah, NJ: Lawrence Erlbaum.\r Yeager, M., & Yeager, D. (2013). Executive function and child development. New York, NY: Norton & company Inc.\r   方富熹、方格 (編著) (2005) 。幼兒認知發展與教育。北京：北京師範大學出版社。\r 黃志成，王淑芬，陳玉玟 (2008) 。幼兒發展。台北縣沉杭鄉：揚智文化事業股份有限公司。\r 錡寶香 (2009) 。兒童語言與溝通發展。心理出版社。\r 郭靜晃 (2013). 兒童發展與輔導。新北市：揚智文化\r 吳幸玲 (2003) 。兒童遊戲與發展。台北市：揚智文化事業股份有限公司。\r 謝錫金(2006) 。香港幼兒口語發展。香港大學出版社。\r 王堅紅 (2005) 。學前兒童發展與教育科學研究方法。北京：人民教育出版社。\r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 1": {"--LEC (3431)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. YAU Jenny Yuk Ping"]}}}, "assessments": {"Homework or assignment": "0", "Others": "0", "Project": "0"}}, {"code": "6302", "title": "Signs, Activities and the Development of Mind in Early Childhood", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Early Childhood Education", "description": "The role of sign mediation is regarded as essential in the development of higher psychological processes. In this course, you are invited to explore the rich varieties of signs and their role in the development of mind in early childhood. There are two key concerns in the course: (1) In what ways are meaning making and the development of mind related to children's experience with signs such as languages, mathematics, and visual and expressive arts? (2) How could learning activities be designed to facilitate the understanding, appropriation, and creation of signs? To deepen our understanding of the complexity involved, perspectives from semiotics and the cultural-historical activity theory would be introduced. Insights from research works on the relation between signs and thought, as well as the interaction between sign mediation and human mediation, the creation of the zone of proximal development, and the integration of signs in children's activities, would be drawn to inform the educational practice and the actual design of learning activities. Drawing from different sources of stimulations, we aim to arrive at rich possibilities of designing meaningful activities for facilitating the early development of human mind.", "outcome": "Upon completion of this course, students are expected to be able to: 1) identify different forms of signs and their richness; 2) recognize multi-modal meaning making in children's experience with signs and the role of the signs mediation in the development of children's higher psychological processes; 3) design and/or evaluate the effectiveness of early childhood educational activities applying the rationales behind the perspectives of semiotics and cognitive theories.  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "Narey, M. (2009). Making meaning: Constructing multimodal perspectives of language, literacy, and learning through arts-based early childhood education. Pittsburgh, PA: Springer.  Wright, S. (2003). The arts, young children, and learning. Boston, MA: Pearson.  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Deans, J., & Wright, S. (2018). Dance-play and drawing-telling as semiotic tools for young children's learning. London, UK: Taylor & Francis. Gadsden, V. L. (2008). The arts and education: Knowledge generation, pedagogy, and the discourse of learning. Review of Research in Education, 32, 29-61. Kress, G. (1997). Before writing: Rethinking the paths to literacy. London, UK: Routledge. Lim, B. (2004). Aesthetic discourses in early childhood settings: Dewey, Steiner, and Vygotsky. Early Child Development and Care, 174, 473-486.  Lysaker, J. (2006).Young children’s reading of wordless picture books. What’s self got to do with it? Journal of Early Childhood Literacy, 6, 33-55. Malchiodi, C. A. (1998). Understanding children’s drawings. New York, NY: Guilford. Mayesky, M. (2011). Creative activities and curriculum for young children (11th ed.). Stamford, CT: Cengage. Piaget, J. (1923/1959). The language and thought of the child. London,UK: Routledge & Kegan Paul. Piaget, J. (1977). The origin of intelligence in the child. London, UK: Penguin. Piaget, J. (1981/1987). Possibility and necessity: Vol.1. The role of possibility in cognitive development. (H. Felder, Trans.) Minneapolis, MN: University of Minnesota Press. Sendak, M. (1963/1984). Where the wild things are. New York, NY: Harper Collins. Sendak, M. (1987). 野獸國（漢聲雜誌譯）。台北：英文漢聲。 Soundy, C.S., Guha, S., & Qiu, Y. (2007). Picture power: Placing artistry and literacy on the same page. Young Children, 62 (3), 82-88.  Soundy, C.s., Drucker, M.F. (2009). Drawing opens pathways to problem solving for young children. Childhood Education, 86(1), 7-13. 徐德成 (2001) 。《玩泥巴的小手：漫遊幼兒黏土創作世界》。台 北：四季文化。 Vagovic, J.C. (2008). Transformers: Movement experiences for early childhood classrooms. Young Children, 63 (3), 26-  Vygotsky, L. S. (1930/1999). Tool and sign in the development of the child. In R. W. Rieber (Ed.), The collected works of L. S. Vygotsky: Vol. 6. Scientific legacy (pp.3-68). New York, NY: Kluwer Academic. Vygotsky, L. S. (1930-1931/1998). Pedology of the adolescent. In R. W. Rieber (Ed.), The collected works of L. S. Vygotsky: Vol. 5. Child psychology (pp.3-184). New York, NY: Plenum Press. Vygotsky, L. S. (1934/1987). Thinking and speech. In R. W. Rieber, & A. S. Carton (Eds.), The collected works of L. S. Vygotsky: Vol. 1. Problems of general psychology (pp.39-285). New York, NY: Plenum Press. Vygotsky, L. S. (1935/1994). The problem of the environment. In R. v. d. Veer, & J. Valsiner (Eds.), The Vygotsky reader (pp.338-354). Oxford, UK: Basil Blackwell. Vygotsky, L. S. (1967). Play and its role in the mental development of the child. Soviet Psychology, 5, 6-18. 黄麗卿 (2008) 。《舞動、敲擊、嬉遊記：幼教藝術課程探究之足跡》。台北：心理出版社。 Wright, S. (2010). Understanding creativity in early childhood. London, UK, Sage.  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 2": {"--LEC (1952)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [3], "locations": ["Chen Kou Bun Bldg LT3"], "instructors": ["Dr. LAU Elaine"]}}}, "assessments": {"Discussion": "0", "Essays": "0", "Homework or assignment": "0", "Others": "0", "Presentation": "0", "Participation": "0"}}, {"code": "6401", "title": "Guided Project", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "LectureProject", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Early Childhood Education", "description": "Participants will participate in a small project under the guidance and support of practicum supervisors. They may either undertake the project individually or in pairs if the topic and context allows. The focus of study may be related to organizational, curriculum, teaching and learning aspects in pre-schools or other early childhood educational organizations or other themes with permission of supervisor. Participants will be placed in small support groups who are expected to share experiences and exchange ideas gained from the project.", "outcome": "After taking this course, students will be able to:\r 1. Demonstrate the application of knowledge and method to the investigation of a specific area within the field of Early Childhood Education.\r 2. Identify an issue to which solutions and/ or recommendations can be addressed; and produce a written report which sets out clearly the aims, context, content and outcome.\r 3. Integrate the skills and knowledge which have been taught in the degree programme with specific application to a topic to produce a well-argued report.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "(Required readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "recommended_readings": "(Recommended readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 1": {"AJ01-PRJ (2196)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}, "2020-21 Term 2": {"BJ01-PRJ (2207)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}}}, {"code": "6901", "title": "Study Tour and Report", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Early Childhood Education", "description": "This course aims to provide opportunity for participants to gain actual experience of early childhood education in or outside of Hong Kong, leading to a reflection on the existing practice in early childhood settings by making connections between research and practice. During the tour, participants will visit local or overseas institutions specializing in early childhood education, nurseries, kindergartens, and exchange on children development and curriculum implementation, as well as collect relevant data on early childhood education setting. Students are required to submit a study report after the visits.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]