[{"code": "1010", "title": "Foundation Course for Health Sciences I (for MBChB only)", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ExerciseIndependent StudyLectureOthersInteractive Tutorial", "campus": "Main Campus", "academic_group": "Faculty Office of Medicine", "requirements": "FO - MBChB Major", "description": "This course introduces students to the foundation knowledge of biochemistry and molecular biology, including cellular processes and molecular aspects of cells and tissues in the human body, before they embark on the journey of Health Sciences II to get an overview of the human physiological functions. Topics in this course range from introducing the ingredients of life and biomolecules, mechanisms of membrane transport and cellular transport, cellular events leading to energy production, cell cycle and its regulation, overview of cell signalling and its relationship with neurotransmission and drug responses, to basic blood components and the biology of blood cells. Selected topics would be supplemented by case studies to review the relevance of these concepts to medical conditions or their applications.", "outcome": "By the end of the course, students should be able to:\r 1. describe the roles of biomolecules in cellular processes and how they help to maintain the normal functions of a cell; and\r 2. recognize the importance of membrane transport, cellular transport and cell signalling to aid in different cellular functions, which serve the functional basis of tissues, organs, and body systems.", "syllabus": "Lecture Topics\r • The ingredients of life\r • Biological thermodynamics \r • Amino acids and proteins: multi-functional biomolecules \r • Biocatalyst \r • Carbohydrate and carbohydrate-containing biomolecules \r • Bioenergetics and principles of metabolism \r • Cell organelles and membrane transport\r • Cellular transport and cytoskeleton\r • DNA replication, cell cycle and programmed cell death \r • Cell signaling and cellular response \r • The biology of blood cells\r  Tutorials\r • Structure-function relationship of proteins \r • Enzymes \r • Cell cycle, apoptosis and cancer", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Term 1": {"--LEC (8739)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. YEUNG Hang Mee"]}, "-T01-TUT (8738)": {"startTimes": ["8:30"], "endTimes": ["10:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Dr. YEUNG Hang Mee"]}}}, "assessments": {"Others": "20", "Short answer test or exam": "80"}}, {"code": "1011", "title": "Foundation Course for Health Sciences I", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "LectureOthersInteractive Tutorial", "campus": "Main Campus", "academic_group": "Faculty Office of Medicine", "requirements": "", "description": "The human body can be studied through its levels of organization, with each level representing different features of life. In particular, the cellular and molecular levels enable us to appreciate how excitable cells such as neurons communicate within the human body by utilizing electrical voltages created by the movement of electrolytes across cell membranes. The generation of these micro- voltages is an important functional basis of various organ systems, such as the nervous system and the cardiovascular system. In physiology, one of the primary ions of electrolytes is the sodium ion, which plays essential roles in determining plasma osmolarity, water balance and even blood pressure. The human body also has an amazing ability to interpret and process both light and sound waves so we can see and hear. In this foundation course, medical students are introduced to various aspects of basic science and organ-specific human physiology essential for an understanding of how the human body functions. They are exposed to important concepts from both the chemical and physical sciences, which they then relate to human cell and organ functions. Selected case studies are also used to aid students in understanding the medical relevance of these concepts.\r", "outcome": "By the end of the course, students should be able to: 1. Describe general functions of plasma membrane and different cell organelles. 2. Describe four physical processes of heat transfer, and relate them to the body and the mechanism of body temperature control. 3.Recognize the bioelectrical properties of a neuron and describe different types of ion channels involved in neural conduction. 4.Review the general organization of the nervous system and appreciate the importance of homeostatic control system. 5. Distinguish electrolytes and non-electrolytes in body fluid and describe briefly how osmolality and selective permeability of cell membrane are important in determining water balance. 6. Review the general physiology of cardiovascular system in the control of blood pressure. 7.Identify major chemical and physiological buffering systems in the human body. 8.Describe characteristics of sound waves and clinical uses of ultrasound.", "syllabus": "Lecture Topics: •Mastery lecture (Importance of Health Sciences for students of the Faculty of Medicine) •The ingredients of life •Cell organelles and membrane transport •The electrochemical signals of excitable cells •Integration of signals and body control: Nervous system] •Heat, energy and body temperature •Flow, pressure and elasticity •Body circulation: Cardio-vascular system    •Water, electrolytes and body fluid compartments •Acids and bases •Homeostatic regulation of electrolytes and non-electrolytes •Light and vision •Sound and hearing Tutorials •Membrane excitability •Electrolyte and osmolarity Interactive online activity •Auto-marking exercises or quizzes (topic-specific)", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (8722)": {"startTimes": ["11:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Dr. HWANG Shui Shan Isabel"]}, "-O01-OTH (8890)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Dr. HWANG Shui Shan Isabel"]}, "-T01-TUT (8889)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Dr. HWANG Shui Shan Isabel"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "80"}}, {"code": "1012", "title": "Foundation Course for Health Sciences II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ExerciseIndependent StudyLectureOthersInteractive Tutorial", "campus": "Main Campus", "academic_group": "Faculty Office of Medicine", "requirements": "", "description": "This is an integrated course covering the structural, physiological and molecular aspects of cells and tissues in the human body. It provides a solid foundation upon which students can embark onto the full-fledged Medical, Nursing, Pharmacy, and Chinese Medicine curricula.\r", "outcome": "By the end of this course, students should be able to: 1. know basic biochemistry, molecular biology, and physiology; 2. recognize the structures of the human body and recall their general functions; 3. appreciate the sophisticated structure-function relationship of the human body and the integrated functions of different body parts; and 4. understand the basics of homeostatic control mechanisms that maintain normal body functions and give rise to disease states under derangement.", "syllabus": "Lecture Topics • Biological thermodynamics • Protein • Biocatalyst • Carbohydrates and carbohydrate-containing biomolecules • Bioenergetics and principles of metabolism • Cellular transport and cytoskeleton • DNA replication, cell cycle and programmed cell death • Cell signaling and cellular response • The biology of blood cells • Urinary system • Digestive system • Respiratory system • Endocrine and reproductive systems  (Heavier emphasis on physiological functions will apply to MEDF1012B)  Tutorials (For MEDF1012A) • Structure-function relationship of proteins • Enzymes • Cell cycle, apoptosis and cancer • Renal Physiology  (For MEDF1012B) • Membrane excitability • Fluid compartments and Solute Balance • Renal Physiology", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Term 2": {"A-LEC (6509)": {"startTimes": ["8:30"], "endTimes": ["10:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Dr. YEUNG Hang Mee"]}, "AT01-TUT (5565)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Sir Run Run Shaw Hall"], "instructors": ["Dr. YEUNG Hang Mee"]}, "B-LEC (6510)": {"startTimes": ["11:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Sir Run Run Shaw Hall"], "instructors": ["Dr. HWANG Shui Shan Isabel"]}, "BT01-TUT (5452)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Yasumoto Int'l Acad Park LT1"], "instructors": ["Dr. HWANG Shui Shan Isabel"]}}}, "assessments": {"Others": "20", "Short answer test or exam": "80"}}, {"code": "1021", "title": "Public Health and Healthcare Ethics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureProjectInteractive TutorialVisit", "campus": "Main Campus", "academic_group": "Faculty Office of Medicine", "requirements": "", "description": "This course will introduce undergraduate students to healthcare issues and challenges facing our society in the 21st century. The study of public health and healthcare ethics related themes will include history of modern medicine and public health, current global health issues, professionalism and various approaches to ethical reasoning that enable students to address the moral concerns related to public health and healthcare challenges. The various academic disciplines within the domains of public health will be introduced through case presentations of various global public health issues including SARS, air pollution, healthcare safety, obesity and non-communicable diseases followed by experience sharing by eminent health professionals. Experiential Learning: Students will also have a chance to spend time with patients from The Alliance of Patients’ Mutual Help Organizations (APMHO) and will conduct interviews with patients with chronic health problems (all discipline).", "outcome": "By the end of this course, student should be able to: examine the key domains of public health describe and articulate current global public health problems and their determinants appreciate the complexities of issues encountered in healthcare settings and the importance of professionalism   use critical and analytical thinking in analyzing public health problems apply bioethical principles and theories in analyzing contemporary public health problems demonstrate ethical argumentation in a logical and coherent manner", "syllabus": "- Overview, Foundation Concepts and History of Public Health - The Origins and Achievements of Public Health- Public Health Ethics, Justice and Inequality- Social Determinants of Health - Lifestyle Determinants of Health - Chronic and Non-communicable Diseases - Infectious Diseases- Population Health & International Health - Health Services: Understanding the Hong Kong Health System- Current Challenges & Global Health", "required_readings": "1. Griffiths SM, Tang JL, Yeoh EK (eds). Routledge Handbook of Global Public Health in Asia. London, UK: Routledge; 20142. Schneider M-J. Introduction to Public Health (5th edition) 2016. Jones and Bartlett Publishers; Massachusetts.", "recommended_readings": "1. Marmot M, Wilkinson RG. Social Determinants of Health (2nd edition). UK: Oxford University Press; 2011.  2. Rose GA. Rose’s Strategy of Preventive Medicine: The Complete Original Text. Oxford University Press; 2008.3. Campbell AV. Bioethics the Basics. London & New York: Routledge; 2017.4. Bayer E, Gostin LO, Jennings B, Steinbok B. Public Health Ethics: Theory, Policy and Practice. New York, US: Oxford University Press; 2007.5. Beauchamp, T. L., & Childress, J. F. Principles of biomedical ethics (6th ed.). New York: Oxford University Press, 2009.6. Griffiths S, Hill A, Gillian S.  Public Health and Primary Care, New York, USA: Oxford University Press; 20077. Sandars J, Murray C. Digital storytelling for reflection in undergraduate medical education: a pilot study. Education for Primary Care 2009; 20: 441-44.8. Sandars J, Murray C, Pellow A. Twelve tips for using digital storytelling to promote reflective learning by medical students. Medical Teacher 2008; 30: 774-777.9. The Patient Voices programme. (2013). Retrieved from http://www.patientvoices.org.uk/", "terms": {"2020-21 Term 1": {"--LEC (5992)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor CHUNG Roger Yat Nork"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "50", "Others": "30"}}, {"code": "1031", "title": "Communication Skills", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "LectureProjectInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Faculty Office of Medicine", "requirements": "", "description": "Course overview:To understand the basic theories of communication and appreciate the importance of effective communication.", "outcome": "Upon completion of the course, students will be able to:1) describe the basic theories of communication.2) apply knowledge of communication for professional development.3) introduce effective interpersonal communication skills for health professionals and the general public.4) examine and utilize appropriate means of media for effective communication.5) analyze and give constructive feedback to peers’ presentation.", "syllabus": "Lectures (12 hours):Topic Contents/ fundamental concepts Introduction to communication  Importance of communication skills         Communication breakdown         Basic communication theories         Factors influencing interpersonal communication Effective Presentation Skills  Elements of a presentation         Guidelines to effective individual and group presentations         Communication to public and media Communicating with patients/ clients  Communicating with patients/clients across the lifespan         Basic and therapeutic communication skills         Phases of therapeutic health care personnel-client relationship         Communication with special population (e.g. elderly, children) Communicating with health professionals         Effective communication and interpersonal relationship         Effective interaction with the public and media", "required_readings": "NIL", "recommended_readings": "1. Corless IB, Michel TH, Nicholas M, et al. (2009). Educating health professions students about the issues involved in communication effectively: A novel approach. Journal of Nursing Education, 48(7), 367-373.2. Capehart, K. D. (2017). Patient communication: getting the most out of that one-on-one time. In T. L. Schwinghammer, J. M. Koehler, J. S. Borchert, D. Slain & S. K. Park (Eds.). (10th ed.). Pharmacotherapy casebook 〔electronic resource〕: a patient-focused approach (ch. 3). New York: McGraw-Hill Education.3. Dainton, M., & Zelley, E. D. (2019). Applying communication theory for professional life: A practical introduction (4th ed.). London: Sage Publications.4. DeVito, J. A. (2013). Essentials of Human Communication (8th ed.). New York: Pearson.5. Griffin, C. L. & Bone, J. E. (2017). Invitation to human communication (2nd ed.). United States: Cengage Learning.Williams AM, & Irurita V. (2004). Therapeutic and Non-therapeutic Interpersonal Interactions: The patient’s Perspectives. Journal of Clinical Nursing, 13, 806 -815.", "terms": {"2020-21 Term 2": {"--LEC (5864)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [3], "locations": ["Sir Run Run Shaw Hall"], "instructors": ["Ms. KWAN Siu Kuen"]}}}, "assessments": {"Essays": "15", "Micro-teaching": "10", "Others": "10", "Presentation": "45", "Participation": "20"}}, {"code": "1120", "title": "Public Health", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureProjectInteractive TutorialVisit", "campus": "Main Campus", "academic_group": "Faculty Office of Medicine", "requirements": "FO - MBChB Major", "description": "This course will introduce undergraduate students to the discipline of public health and life course approach to health as well as research methods. This course has three parts:Part 1 Introduction to Public Health: health indicators, life course approach to health and determinants, social and behavioural health, health promotion, health system and challenges. Part 2 Evidence based approaches to Public Health: hypothesis testing, study design, survey design and data analysis.Part 3 Interview skillsStudents will be able to apply their knowledge and have hands on experience of interview skills with research participants and patients.", "outcome": "By the end of this course, students should be able to:1. describe public health domains;2. describe life-course approach to health and social determinants; 3. understand research approaches to public health and how to present results; and4. demonstrate interview skills using a survey and semi structured questionnaire.", "syllabus": "- Overview and Foundation Concepts and History of Public Health- Tutorial 1: Introduction to patients interview and poster presentation - Public (Global) Health Problem I: Public health and medical humanitarian response in crisis, Part 1 Introduction to Public Health:- Week 1: Overview and foundation concepts and introduction to public health- Week 2: Health service system challenges, current health system in HK, health care financing - Week 3: Social determinants of health, health inequalities, and life course approach to health- Week 4: Health promotion and prevention, non-communicable diseases- Week 5: Global HealthPart 2 Research approaches to Public Health:- Week 6: Epidemiological study designs  - Week 7: Introduction to biostatistics- Week 8: How to present quantitative results- Week 9 : Introduction to qualitative research Part 3 Essential interview skills:- Week 10: Interview skills: Research questionnaire- Week 11: Interview skills: In depth interview- Week 12: Participant interview (pairs): microbiome research- Week 13: Patient interview (group): Patient groups/ rare diseases", "required_readings": "NIL", "recommended_readings": "ReferenceBeaglehole R, Bonita R. Public health at the crossroads: which way forward?  Lancet 1998;351:590-592.Beaglehole R, et al. Public health in the new era: improving health through collective action. Lancet 2004;363:2084-286.Pencheon D, Guest C, Melzer D, Muir Gray JA (Eds). Oxford handbook of public health practice (2nd ed). 2006. Oxford University Press, USA. Part 1: Public health assessment.North NH, Perkins R. Chapter 18: Using research and evaluation in managing health services. In: Harris MG et al. Managing health services: concepts and practice (2nd edition). Elsevier Australia; 2006. Suggested books on hold in library:Schneider M-J. Introduction to Public Health (3rd edition) 2010. Jones and Bartlett Publishers; Massachusetts.", "terms": {"2020-21 Term 1": {"--LEC (8766)": {"startTimes": ["12:30"], "endTimes": ["15:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor WONG Yeung Shan Samuel"]}}}, "assessments": {"Essays": "30", "Fieldwork or field study": "20", "Participation": "20", "Selected response test or exam": "30"}}]