[{"code": "5001", "title": "Scientific Skills, Laboratory Safety and Management", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Anatomical & Cell Patho", "requirements": "For students in MSc Medical Laboratory Science", "description": "This course will cover:- Bioethics: It is designed to familiarize the student with current thinking on ethical issues in the medical laboratory profession. Emphasis is on how problems are identified and defined, and the methods employed to resolve them. This course examines basic principles that govern the responsible conduct of medical laboratory research. It explores topics related to scientific integrity, collegiality, research subjects, institutional integrity and social responsibility. Students participate actively in the course through written critiques and analyses of assigned readings, in-class presentations, and group discussions.Bioinformatics: It focuses on the basic use of computers in health sciences, information searches and retrieval, and thorough library search of scholarly reports on advanced topics in medical laboratory sciences.Presentation and communication skills: This module will cover generation, transmission, or reception of messages to oneself or another; defining objectives and main points; modes of presentation and communication; guides of writing prompts, ideas, memos, letters, resumes, proposals, tenders, conflict resolution, negotiation, posters, theses, research papers and grant applications; critical analysis, argument and opinion; plagiarism and citation; presenting skills in poster/oral presentations, public speaking, interviewing and phoning; use of audio-visual aids.Laboratory safety: It covers biosafety levels; laboratory containment, design and facilities; laboratory equipment; fire and electrical safety; guidelines and code of practice; safety organization and surveillance; safety checklist, training programme and rules for supportive staff; disinfection, decontamination and disposal of bio-hazardous, chemical and radioactive waste.Laboratory management: It deals with the organization of core laboratory and reference laboratory, good laboratory practice regulations, implementation and monitoring laboratory safety, equipment evaluation, financial budgeting and controlling, tendering, stock taking, auditing, decision making, formulation of laboratory policies and standard operating procedure, laboratory accreditation, personnel management, handling conflicts in work environment.", "outcome": "Upon completion of the study, students should be able to perceive the essences of bioethics, local code, standards of practice and conduct in practicing medical technology in Hong Kong and properly handle issues related to and at time of practicing medical laboratory sciences especially in identifying and resolving any conflict which might arise. They should be capable to conduct effective communication at work in writing memos, emails, letters, proposals, tenders, appraisals, complaints, reports, guidelines, requirements, standards, local rules, grant applications, scientific paper and research theses in appropriate formats and giving presentations, interviewing and phoning to convey ideas, arguments, negotiations, resolutions, critical analysis, etc., in a precise and clear manner. Besides, they should also know how to store, retrieve, extract, organize and analyze biological data via internet access and library search of repositories and reports taking into account the intellectual rights and proper acknowledgments, recognitions, credits and consents of reproduction of other’s works without any violation of copyrights and plagiarism.  Students should be able to realize the potential hazards and implement necessary precautions in medical laboratories by understanding safety levels; laboratory containment and design, maintenance of facilities, equipment, fire, chemical, radiation and microbiologic safety and implementing guidelines, regulations and code of practice, safety organization, measures, surveillance and training programme for disinfection, de-contamination and disposal of laboratory bio-hazardous, chemical and radioactive wastes, respectively. Besides, students should have the knowledge of managing medical laboratories especially in running core laboratory and reference laboratory, monitoring laboratory safety, evaluating equipment, controlling financial budgets, tendering, stock taking, auditing, formulating laboratory policies and procedures, maintaining laboratory accreditation, managing personnel and handling conflicts at work.", "syllabus": " Bioethics Presentation and communication skills Bioinformatics Laboratory safety Laboratory management", "required_readings": "N/A", "recommended_readings": " Amarakone K, Panesar SS. Ethics and human sciences. Elsevier Mosby, 2006. Bobin A. Ethics: an overview.  Continuum, 2012. Hong Kong Medical Technologists Board. Code of practice of the medical laboratory technologists board of Hong Kong: for the guidance of registered medical laboratory technologists. http://www.smp-council.org.hk/mlt/file/pdf/Code%20of%20Practice%20(Apr%202012).pdf van Emden J. Effective communication for science and technology. Palgrave, 2001. Seely J. The Oxford guide to effective writing and speaking. Oxford University Press, 2005. Andy Hewitt A. Construction claims & responses: effective writing & presentation. John Wiley, 2011. The Chinese University of Hong Kong. Information literacy tutorial. https://portal.cuhk.edu.hk/psp/epprd/CUHK/ENTP/s/WEBLIB_CU_GRP10.ISCRIPT1.FieldFormula.IScript_CU_SSO?sso=CU_LIBRARY_HOME&type=staff&FolderPath=PORTAL_ROOT_OBJECT.CU_PORTAL_ROOT.CU_LIBRARY_STAFF.CU_LIBRARY_HOME_STAFF&IsFolder=false&IgnoreParamTempl=FolderPath%2cIsFolder The Chinese University of Hong Kong. Copyright and intellectual property rights. http://www.cuhk.edu.hk/policy/copyright/en/. The Chinese University of Hong Kong. Honesty in academic work: a guide for students and teachers. http://www.cuhk.edu.hk/policy/academichonesty/. University Safety Office, The Chinese University of Hong Kong.Safety Manual and Guidelines. http://www.cuhk.edu.hk/useo/safety/ko_labsafety/_labsafety.html. National Pathology Accreditation Advisory Council, Australia. Requirements for quality management in medical laboratories. Second edition, 2007. http://www.health.gov.au/internet/main/publishing.nsf/Content/6282D1966161A977CA25728B000FAB1B/$File/dhaquality.pdf", "terms": {"2021-22 Term 1": {"--LEC (1864)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor NG Ho Keung"], "meetingDates": ["06/09/2021 - 20/12/2021"]}}}, "assessments": {"Attendance": "10", "Examination": "75", "Homework or assignment": "15"}}, {"code": "5002", "title": "Biostatistics, Measurement Uncertainty, Quality Assurance and Laboratory Accreditation", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Anatomical & Cell Patho", "requirements": "For students in MSc Medical Laboratory Science", "description": "This course will cover:- Biostatistics: It introduces descriptive statistics, normal distribution, significance tests, confidence intervals and point estimation, chi-square analysis, regression and correlation methods, analysis of variance, multiple comparison procedures and non-parametric methods. Basic methods of statistical analysis are emphasized including t-tests, ANOVA, etc.Measurement of uncertainty: It covers the international comparisons of measurement standards; classification of components of uncertainty, evaluating and expressing the uncertainty of National Institute of Standards and Technology (NIST) measurement results, combining standard uncertainty of a measurement result, expanded uncertainty and reporting, impact on laboratory accreditation.Quality assurance: It highlights the importance of inter-laboratory comparisons of accuracy and reliability of medical testing, initiatives and impact of proficiency testing on medical laboratory; proficiency testing programmes and providers; standards and choice.Laboratory accreditation: It focuses on the International Organization for Standards (ISO), International Laboratory Accreditation Cooperation (ILAC), Asia Pacific Laboratory Accreditation Cooperation (APLAC) and Hong Kong Laboratory Accreditation Scheme (HOKLAS); ISO 15189:2012 standard for quality and competence to medical laboratories; regulations of good manufacturing practice (GMP) and good laboratory practice (GLP); technical criteria and guidelines for quality system.", "outcome": "Upon completion of the course, students should comprehend the fundamental statistical notions, appropriate methods, effect size and uses of commonly available statistical softwares to analyze data and test significance in medical laboratory: the level of measurement, descriptive statistics, normal distribution, confidence intervals, predictive value, likelihood ratios, hypothesis testing by appropriately using statistical methods of Student's t-test, Chi-square test, ANOVA, Pearson's correlation and Regression, Mann Whitney U test, Spearman's rank correlation, receiver operating characteristic curve, Bland and Altman plot, cluster analysis and linear discriminant analysis. They should also recognize the accuracy and precision of data derived from analyzing clinical samples, basic concepts, impacts and reports on measurement uncertainty in medical laboratories, and be able to identity and classify components of measurement uncertainty, evaluate, express and record combined measurement uncertainty.  Students should perceive the importance of a proactive quality system aiming at error prevention and quality improvement in medical laboratories by implementing pre-analytical and analytical measures and procedures, comparing with standards, monitoring of laboratory processes and technical competency of personnel, and feedbacks to ensure the competency of medical laboratories in delivering timely, accurate and reliable results. They should be able to understand the international organization for standardization for medical laboratory accreditation, ISO 15189 requirements for quality and competency in managing medical laboratories; regulations, guidelines and technical criteria for facilities of good manufacturing practice and good laboratory practice.", "syllabus": " Biostatistics Measurement of uncertainty Quality assurance Laboratory accreditation", "required_readings": "N/A", "recommended_readings": " Matthew DE, Farewell VT. Using and understanding medical statistics. Second edition, Karger 1988. Machin D, Campbell MJ, Walters SJ.Medical statistics: a textbook for the health sciences. Fourth edition, Wiley 2007. Bell S. A Beginner’s Guide to Uncertainty of Measurement Issue 2. 2001. 2001. https://www.dit.ie/media/physics/documents/GPG11.pdf National Institute of Standards and Technology (NIST).The NIST reference on constants, units and uncertainty.http://physics.nist.gov/cuu/Uncertainty/ European Federation of National Associations of Measurement, Testing and Analytical Laboratories. Guide to the Evaluation of Measurement Uncertainty for Quantitative Test Results.2006. http://www.eurolab.org/documents/1-2006.pdf International Laboratory Accreditation Cooperation. ISO 15189 medical laboratory accreditation. https://ilac.org/?ddownload=120819 American Association for Laboratory Accreditation. General requirements: accreditation of ISO 15189 medical testing laboratories. https://portal.a2la.org/requirements/15189_R901.pdf", "terms": {"2021-22 Term 1": {"--LEC (4223)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor NG Ho Keung"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}}, "assessments": {"Attendance": "10", "Examination": "60", "Homework or assignment": "30"}}, {"code": "5003", "title": "Immunology", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Anatomical & Cell Patho", "requirements": "For students in MSc Medical Laboratory Science", "description": "This course will cover immunogenicity and immunogenetics; human major histocompatibility complex and antigen receptors; cellular immune responses of macrophages, dendritic cells and B lymphocytes, T lymphocytes, antigen presentation cells and natural killer cells; complement system; secretary immune system; immune mechanisms in tissue damage; autoimmunity; clinical transplantation; infection-, tumour- and reproductive immunology; hypersensitivity, immunosuppression and anti- inflammatory drugs; immunization; immunotherapy; laboratory diagnostics and detection.", "outcome": "* The student should be able to enhance and update his knowledge and expertise of medical laboratory professionals to cope with the ever-changing service demands; * The student should be able to improve his skills on critical analysis, problem solving and innovative thinking, in addition to the integration of theory and application of diagnostic laboratory techniques; * The student should be equipped with the necessary research skill and deliver evidence-based medical laboratory services; * The student should have the skills and knowledge for a good career in medical laboratory science.", "syllabus": " General Immunology I General Immunology II Allergy and Laboratory Diagnosis Immunological Diseases – An Introductory Clinical Perspective Infection and Immunity, Immunodeficiency Clinical Transplantation, Tumor Immunology; Immunoprophylaxis and Immunotherapy  Laboratory Techniques in Clinical Immunology", "required_readings": "N/A", "recommended_readings": "Stuart Ralston Ian Penman Mark Strachan Richard Hobson. Davidson's Principles and Practice of Medicine. 23rd Edition, Elsevier, 2018.", "terms": {"2021-22 Term 1": {"--LEC (1865)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor NG Ho Keung"], "meetingDates": ["06/09/2021 - 20/12/2021"]}}}, "assessments": {"Attendance": "10", "Examination": "90"}}, {"code": "5004", "title": "Frontiers in Medical Laboratory Sciences and Laboratory Technology", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Anatomical & Cell Patho", "requirements": "For students in MSc Medical Laboratory Science", "description": "Frontiers in medical laboratory sciences: It is designed to train students in keeping abreast of recent advances in proteinomics, immunotherapy, genetic engineering, stem cell technology, bio-micro-electro-mechanical systems and nanotechnology Current research in these areas will be discussed. Laboratory technology: It focuses on the principle and applications with specific highlights of the accuracy, precision and limitation of the latest advanced medical laboratory technologies. The current usages in clinical applications and research will be discussed.", "outcome": "In the course, the students are expected to acquire essential and fundamental knowledge about the cutting-edge biomedical researches related to modern medicine and laboratory technology. They are also expected to recognize the limitations of conventional diagnostic and prognostic tests and appreciate the newly developing strategies to overcome these limitations. Through keeping abreast of recent scientific developments and apprehending their logical and creative thoughts, the students could be able to develop their own critical and scientific thinking and creativities. In addition, they could be able to identify and organize critical and relevant information from the fragmented and overwhelming information pool in the fast-pacing biomedical researches. Eventually, they are equipped to participate and contribute in the fields of biomedical research and/or clinical applications of these technologies.", "syllabus": "Frontiers in medical laboratory sciences: It is designed to train students in keeping abreast of recent advances in proteinomics, immunotherapy, genetic engineering, stem cell technology, bio-micro-electro-mechanical systems and nanotechnology. Current research in these areas will be discussed.   Laboratory technology: It focuses on the principle and applications with specific highlights of the accuracy, precision and limitation of the latest advanced medical laboratory technologies. The current usages in clinical applications and research will be discussed.   ", "required_readings": "N/A", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (1173)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor NG Ho Keung"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}}, "assessments": {"Attendance": "10", "Examination": "70", "Homework or assignment": "20"}}, {"code": "5005", "title": "Genetics, Gene Expression and Regulation", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Anatomical & Cell Patho", "requirements": "For students in MSc Medical Laboratory Science", "description": "This course will cover:- Genetics: It encompasses the structure and function of genes and chromosomes; autosomal dominant and recessive inheritance; sex-linked mitochondrial inheritance; genetics of development, metabolic disorder and cancer; genetic screening, diagnosis, counselling and therapy; recent advances in cytogenetic and molecular genetic detection methods of fluorescent in situ hybridization (FISH), multi-colour FISH, high-resolution multi-colour banding (MCB), spectral karyotyping (SKY), reverse transcriptase-polymerase chain reaction (RT-PCR), gene mapping and cloning. Gene expression and regulation: It deals with the transcription machinery of transcription factors, core promoter elements, co-factors and chromatin; histone acetyltransferase and histone deacetylase complex; transcriptional activators and repressors; chromatin remodelling and X-inactivation; DNA methylation and gene silencing; comparative genomics of tissue specific gene expression; cell death and transcription; pre-mRNA splicing; biogenesis and function of siRNA, miRNA and piRNA; gene therapy; laboratory diagnostics and detection.", "outcome": "1. To acquire a modern knowledge of genes and functions  2. To familiarize with modern genetic and molecular techniques as applied to medical laboratory sciences.", "syllabus": "Genetics: It encompasses the structure and function of genes and chromosomes; autosomal dominant and recessive inheritance; sex-linked mitochondrial inheritance; genetics of development, metabolic disorder and cancer; genetic screening, diagnosis, counselling and therapy; recent advances in cytogenetic and molecular genetic detection methods of fluorescent in situ hybridization (FISH), multi-colour FISH, high-resolution multi-colour banding (MCB), spectral karyotyping (SKY), reverse transcriptase-polymerase chain reaction (RT-PCR), gene mapping and cloning.Gene expression and regulation: It deals with the transcription machinery of transcription factors, core promoter elements, co-factors and chromatin; histone acetyltransferase and histone deacetylase complex; transcriptional activators and repressors; chromatin remodelling and X-inactivation; DNA methylation and gene silencing; comparative genomics of tissue specific gene expression; cell death and transcription; pre-mRNA splicing; biogenesis and function of siRNA, miRNA and piRNA; gene therapy; laboratory diagnostics and detection.", "required_readings": "N/A", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (1174)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor NG Ho Keung"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}}, "assessments": {"Attendance": "10", "Examination": "90"}}, {"code": "5010", "title": "Anatomical Pathology I", "career": "Postgraduate - Taught", "units": "4.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Anatomical & Cell Patho", "requirements": "For students in MSc Medical Laboratory Science", "description": "This course will cover: - Cell injury and cell death; inflammation- Principles of neoplasia and pathology of tumour- Molecular pathology- Surgical cut ups; design of histology benches; automation in histology- Immunohistochemistry; new diagnostic antibodies - Special stains in modern histology- Microscopy- Gynecologic and non-gynecologic cytopathology- Mortuary management- Quality assurance in histology", "outcome": "1. To be familiar with the general and specialized techniques utilized in diagnostic histopathology laboratories  2. To be familiar with the general techniques utilized in diagnostic cytology laboratories", "syllabus": " Cell injury and cell death; inflammation Principles of neoplasia and pathology of tumour Molecular pathology Surgical cut ups; design of histology benches; automation in histology Immunohistochemistry; new diagnostic antibodies  Special stains in modern histology Gynecologic and non-gynecologic cytopathology Mortuary management Quality assurance in histology ", "required_readings": "N/A", "recommended_readings": "V Kumar. Robbins and Cotran's Pathologic Basis of Diseases.   Eighth edition", "terms": {"2021-22 Term 2": {"--LEC (4233)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor NG Ho Keung"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Attendance": "10", "Examination": "90"}}, {"code": "5011", "title": "Anatomical Pathology II", "career": "Postgraduate - Taught", "units": "4.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Anatomical & Cell Patho", "requirements": "For students in MSc Medical Laboratory Science", "description": "This course will cover: - Administrative aspects of anatomical pathology- Autopsy pathology- Pathology of various organs and systems- Endocrine pathology; gynaecologic pathology- Managements of fluids, fine needle aspiration cytology", "outcome": "1. To be familiar with the general and specialized techniques utilized in diagnostic histopathology laboratories  2. To be familiar with the general techniques utilized in diagnostic cytology laboratories", "syllabus": " Cell injury and cell death; inflammation Principles of neoplasia and pathology of tumour Molecular pathology; pathology of various organs and systems Endocrine pathology; gynaecologic pathology Managements of fluids, fine needle aspiration cytology", "required_readings": "N/A", "recommended_readings": "V Kumar. Robbins and Cotran's Pathologic Basis of Diseases.   Eighth edition", "terms": {"2020-21 Term 2": {"--LEC (1185)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor NG Ho Keung"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}}, "assessments": {"Attendance": "10", "Examination": "90"}}, {"code": "5012", "title": "Clinical Chemistry I", "career": "Postgraduate - Taught", "units": "4.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Anatomical & Cell Patho", "requirements": "For students in MSc Medical Laboratory Science", "description": "This course will cover:- Laboratory principles and instrumentation- Disorders of water, electrolytes, and acid-base homeostasis- Disorders of the renal system- Disorders of the endocrine system- Disorders of the cardiovascular system", "outcome": "Students are ensured to understand the interface between basic science and clinical medicine. The course aims to give an in-depth knowledge of the nature of analytic principles, instrumentation, homeostasis, aetiology, pathogenesis, genetic controls, clinicopathological features and principles of treatment of disorders of the renal, endocrine and cardiovascular systems. Other major objectives are to enlighten medical laboratory professionals with competency in generation, transmission, and reception of messages; defining objectives and main points; critical analysis, argument and opinion via oral presentation and written report.", "syllabus": " Laboratory principles, instrumentation and applications in spectrophotometry, fluorometry, turbidimetry, nephelometry, atomic absorption, chromatography, mass spectrometry, electrophoresis, electrochemistry, immunoassay, point-of care testing and molecular diagnostics technology Water, electrolytes and acid-base balance, structure and functions of the kidney Fluid and electrolyte homeostasis and disturbances, kidney diseases and its complications Analytical aspects and biomarkers of renal function Renal stones and renal replacement therapy General endocrinology, principles, disorders of calcium metabolism Thyroid gland, adrenal gland Disorders of glucose metabolism Sex hormone and growth Structure and function of the cardiovascular system heart failure Atherosclerosis and cardiovascular diseases Analytical aspects of markers of cardiovascular diseases  Hypertension, biochemistry of lipids and dyslipidemia Analytical aspects of triglyceride and cholesterol Inherited metabolic disorders causing cardiovascular diseases", "required_readings": "N/A", "recommended_readings": " Nader Rifai. Tietz Textbook of Clinical Chemistry and Molecular Diagnostics, 6th edition. USA: Elsevier Saunders 2017. Marshall W, Lapsley M, Day A. Clinical Chemistry, 8th edition. USA: Mosby 2016. Kaplan LA, Pesce AJ. Clinical Chemistry: Theory, Analysis, Correlation, 5th edition. USA: Mosby 2010.", "terms": {"2021-22 Term 2": {"--LEC (4234)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor NG Ho Keung"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Attendance": "10", "Examination": "75", "Presentation": "15"}}, {"code": "5013", "title": "Clinical Chemistry II", "career": "Postgraduate - Taught", "units": "4.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Anatomical & Cell Patho", "requirements": "For students in MSc Medical Laboratory Science", "description": "This course will cover:- Disorders of the gastrointestinal system- Disorders of the neuromuscular system- Haematological biochemistry and nutritional status- Clinical Biochemistry of pregnancy and childhood- Toxicology, pharmacology and pharmacogenetics", "outcome": "Students are ensured to understand the interface between basic science and clinical medicine. The course aims to give an in-depth knowledge of the homeostasis, aetiology, pathogenesis, genetic controls, clinico-pathological features of disorders of the renal, endocrine and cardiovascular systems, and principles of analytic techniques and laboratory instrumentation.", "syllabus": " Disorders of the gastrointestinal system Disorders of the neuromuscular system Haematological biochemistry and nutritional status Clinical biochemistry of pregnancy and childhood Toxicology, pharmacology and pharmacogenetics", "required_readings": "N/A", "recommended_readings": " Marshall W, Bangert SK. Clinical Chemistry, 6th edition. USA: Mosby 2008. Kaplan LA, Pesce AJ. Clinical Chemistry: Theory, Analysis, Correlation, 3rd edition. USA: Mosby 1997. Williams D, Marks V. Scientific Foundations of Biochemistry in Clinical Practice, 2nd edition. UK: Butterworth-Heinemann 1998. Edwards CRW, Bouchier IAD. Davidson's Principles and Practice of Medicine, 17th edition. UK: WB Saunders 1996.", "terms": {"2020-21 Term 2": {"--LEC (1196)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor NG Ho Keung"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}}, "assessments": {"Attendance": "10", "Examination": "90"}}, {"code": "5014", "title": "Haematology and Transfusion Science I", "career": "Postgraduate - Taught", "units": "4.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Anatomical & Cell Patho", "requirements": "For students in MSc Medical Laboratory Science", "description": "This course will cover:- Haematopoiesis- Medical genetics of haematologic diseases/disorders- White cells in health and diseases; laboratory diagnostics and detection- Therapy for haemic diseases/disorders", "outcome": "Students are ensured to understand the interface between basic science and clinical medicine of normal and abnormal haematopoiesis and leukaemogenesis. The course aims to give an in-depth knowledge of the nature of haemic malignancies including the aetiology, pathogenesis, genetic controls, clinicopathological features and principles of treatment of haemic malignancies. Other major objectives are to enlighten medical laboratory professionals with technical competency in blood cell morphology, cytogenetics and molecular genetics in disease phenotypes.", "syllabus": " in health and disease Characterization of haematopoietic stem cells Flow cytometry and immunophenotyping Cytogenetics and molecular genetics of haematologic diseases Investigation of myelodysplastic / myeloproliferative neoplasms, lymphoproliferative neoplasms, leukaemias and lymphomas Therapy for acute leukaemias, chronic leukaemias, myelodysplastic / myeloproliferative neoplasms and lymphoproliferative neoplasms Haematopoietic stem cell technology and transplantation", "required_readings": "N/A", "recommended_readings": " Kondo M (Ed.) Hematopoietic Stem Cell Biology. First Edition, Humana Press 2010. Shaffer LG, Slovak ML, Campbell LJ. An International System for Human Cytogenetic Nomenclature. Karger 2009. Nguyen D, Diamond LW, Braylan RC. Flow cytometry in haematopathology: a visual approach to data analysis and interpretation.New Jersey, NY: Humana Press 2003. Swerdlow, S.H., Campo, E., Harris, N.L., Jaffe, E.S., Pileri, S.A., Stein, H., Thiele, J., Vardiman, J.W.WHO classification of tumours of haematopoietic and lymphoid tissues. Fourth Edition, Lyon, IARC Press 2008. Adverse effects of immune-checkpoint inhibitors:management and surveillance;Nature Reviews Clinical Oncology volume 16, pages563–580 (2019) A Review of Efficacy and Safety of Checkpoint Inhibitor for the Treatment of Acute Myeloid Leukemia:Front. Pharmacol., 06 June 2019 | https://doi.org/10.3389/fphar.2019.00609", "terms": {"2021-22 Term 2": {"--LEC (4235)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor NG Ho Keung"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Attendance": "10", "Examination": "65", "Presentation": "25"}}, {"code": "5015", "title": "Haematology and Transfusion Science II", "career": "Postgraduate - Taught", "units": "4.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Anatomical & Cell Patho", "requirements": "For students in MSc Medical Laboratory Science", "description": "This course will cover:- Platelet disorders and coagulopathy- Red cell disorders; pathophysiology, investigation and treatment- Immunohaematology and transfusion science- Immunogenetics; HLA system and typing; bone marrow registry and donor/graft selection", "outcome": "Students are ensured to understand the interface between basic science and clinical medicine. The course aims to give an in-depth knowledge of the homeostasis, aetiology, pathogenesis, genetic controls, clinico-pathological features of coagulopathy, platelet disorders, red cell disorders, transfusion science, immunogenetics, and principles of analytic techniques and laboratory investigations.", "syllabus": " Platelet disorders and coagulopathy Red cell disorders: pathophysiology, investigation and treatment Immunohaematology and Transfusion science Immunogenetics: Genetic recombination in the early stages of immunoglobulin and T cell receptors, HLA system and typing; bone marrow registry and donor/graft selection", "required_readings": "N/A", "recommended_readings": " Michelson AD (Ed.). Platelets. Second Edition. Academic Press, 2006. Action QA (Ed.).Blood Coagulation Factors: Advances in Research and Application: 2011 Edition. Scholarly Editions, 2012. Hoffbrand AV, Pettit JE, Moss PA. Essential Haematology. Sixth Edition, Blackwell Science 2011. Bain BJ, Bates I, Laffan MA, Lewis SM. Dacie and Lewis Practical Haematology. 11th Edition, Elsevier, 2011.Thalassaemia International Federation. Guidelines for the Clinical Management of Thalassaemia. Second Edition, 2008. Eleftheriou A. Compliance to iron chelation therapy with desferrioxamine. Thalassaemia International Federation, 2000. Roback JD (Ed.). AABB Technical Manual. 17th Edition, American Association of Blood Banks 2011. Appelbaum FR, Forman SJ, Negrin RS, Blume KG (Ed.). Thomas’ hematopoietic cell transplantation. Fourth Edition, Wiley-Blackwell, 2009.", "terms": {"2020-21 Term 2": {"--LEC (1197)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor NG Ho Keung"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}}, "assessments": {"Attendance": "10", "Examination": "90"}}, {"code": "5016", "title": "Medical Microbiology I", "career": "Postgraduate - Taught", "units": "4.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Anatomical & Cell Patho", "requirements": "For students in MSc Medical Laboratory Science", "description": "This course will cover:- Structure, classification, metabolism, genetics of normal flora and pathogens- Pathogenesis, epidemiology, principle of diagnosis- Application of molecular techniques in microbiology- Antibiotics and mechanism of bacterial resistance", "outcome": "1. To learn microbiologic investigations of a broad range of infectious diseases  2. To appreciate new technologies in the laboratory diagnoses of infectious diseases", "syllabus": " Structure, classification, metabolism, genetics of normal flora and pathogens Pathogenesis, epidemiology, principle of diagnosis Application of molecular techniques in microbiology Antibiotics and mechanism of bacterial resistance", "required_readings": "N/A", "recommended_readings": "", "terms": {"2021-22 Term 2": {"--LEC (4236)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor NG Ho Keung"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Attendance": "10", "Examination": "75", "Presentation": "15"}}, {"code": "5017", "title": "Medical Microbiology II", "career": "Postgraduate - Taught", "units": "4.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Anatomical & Cell Patho", "requirements": "For students in MSc Medical Laboratory Science", "description": "This course will cover:- Mycology- Parasitology- Role of microbiology laboratory and infection control- Infections in immunocompromised patients, laboratory investigations Zoonoses and bioterrorism- Vaccines for the prevention of human infectious diseases", "outcome": "*To have detailed knowledge of the laboratory investigations of fungal and parasitic diseases *To familiarize with laboratory investigations regarding immunocompromised patients", "syllabus": " Mycology Parasitology Vaccines for the prevention of human infectious diseases Role of microbiology laboratory and infection control Infections in immunocompromised patients, laboratory investigations Zoonoses and bioterrorism", "required_readings": "N/A", "recommended_readings": "N/A", "terms": {"2020-21 Term 2": {"--LEC (1184)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor NG Ho Keung"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}}, "assessments": {"Attendance": "10", "Examination": "70", "Presentation": "20"}}, {"code": "5018", "title": "Research Project", "career": "Postgraduate - Taught", "units": "8.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Anatomical & Cell Patho", "requirements": "For students in MSc Medical Laboratory Science", "description": "Research Project is one of the major components of the study programme on the Master of Science in Medical Laboratory Sciences (MSc in MLS). Students are required to conduct a research project on MLS under supervision of project supervisors and complete an individual dissertation of not less than 8,000 words in partial fulfillment of the requirements for the degree of MSc in MLS.", "outcome": "The project allows the student to undertake an important piece of research activities in a topic related to the selective course of the study programme of Master of Science in Medical Laboratory Sciences in a constrained period of time. It is the key element of the programme intended to extend student’s knowledge and understanding of one particular discipline in a more in-depth level, which may not be possible by undertaking taught post-graduate courses. Besides, it provides the opportunity for the student to specialise in a particular area of study in line with the student’s career interests and aspirations. Student is expected to satisfactorily complete a basic research training and undertake a substantial piece of independent work, which is a more advanced and intensive study than a first degree, in not less than 12 months, and present a satisfactory thesis.  Upon completion of the research project, student will be able to display and demonstrate the following abilities and expertise: • asking critical questions; • effectively reviewing literature for likely answers to the queries; • putting up hypotheses; • designing vigorous testings of the conjectures;  • being competent to investigate the specific subjects; • being able to focus on unique issues; • undertaking independent research; • effectively working with research collaborators and colleagues; • complying to medical ethics and the importance of good research practice; • meticulously analysing and evaluating research data; • presenting information both orally and in written form to a professional standard.", "syllabus": " A minimum of 40 – 50 hours of bench work.However, experimental hurdles are not easily solved and hardly predictable, a longer time might be required in many situations. An equivalent amount of time for literature search and review. Frequent communication, interaction, discussion and consultation with the project supervisor in a timely manner. Timely submission of the progress report. Oral presentation of experimental findings to and answering questions from the audience. An equivalent amount of time for writing up a dissertation of not less than 8,000 words.", "required_readings": "N/A", "recommended_readings": "", "terms": {"2020-21 Term 2": {"-J01-PRJ (1201)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor NG Ho Keung"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}}, "assessments": {"Presentation": "30", "Project": "20", "Report": "50"}}]