[{"code": "5111", "title": "Public Policy Process", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "Through equipping students with knowledge of major concepts, models and theories of public policymaking process, this course aims to enhance the ability of students to understand and analyze public policy problems. The course consists of the following key components: foundation of public policymaking process and policy environment, competing models of policy-making, major policymaking actors and institutions, critical factors and stakeholders in major stages of policymaking. Case studies and real-world examples are used to illustrate how the theories are put into practice.", "outcome": "1) Equip students of public policy and administration with substantive knowledge on public policy concepts, models and processes;2) Train students in the skill of public policy analysis through the use of specific techniques and case studies;3) Raise students’ awareness of the challenges and opportunities they may face in their future decision-making careers.", "syllabus": "This course discusses how public policy-makers go about defining problems, assembling evidence, constructing alternatives, selecting criteria, projecting outcomes, confronting trade-offs and, finally, making public policy decisions. The course specifically reflects on global economic, social, environmental, technological and legal factors affecting public policy process and decisions. Each of these contextual factors is dealt with theoretically, using internationally recognized public policy texts and, practically, through climate change-related case studies as follows:1) Economic factors and the deployment of the Green Climate Fund (GCF);2) Social factors and climate justice;3) Environmental factors and climate resilience to flooding in coastal cities;4) Technological factors and the uptake of renewable energy;5) Legal factors and the implementation of the Paris Agreement & its Rulebook.", "required_readings": "1) Xun, W.; M. Ramesh, M. Howlett and S. Fritzen (2018). The Public Policy Primer: Managing the Policy Process. Rutledge Textbooks in Policy Studies.2) Howlett, M. and M. Ramesh (1995). Studying Public Policy: Policy Cycles and Policy Subsystems. Oxfor University Press.3) Birkland, T. (2010- 4th ed). An Introduction to the Policy Process: Theory, Concepts and Models of Public Policy Making. NY, London: Routledge.4) Bardach, E. (2009 – 3rd ed.). A practical Guide for Policy Analysis: The Eightfold Path to more Effective Problem Solving. Washington DC, CQ Press.5) John, P. (2012 – 2nd ed.). Analysing Public Policy. Oxon, Routledge Textbooks in Policy Studies.6) Yin, R. (2009 – 4th ed.). Case Study Research: Design & Method. Thousand Oaks, SAGE.", "recommended_readings": "Additional readings will be given by the instructor.", "terms": {"2020-21 Term 1": {"--LEC (1819)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [1], "locations": ["Esther Lee Bldg LT4"], "instructors": ["Professor Maria Del Mar FRANCESCH HUIDOBRO"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}, "2021-22 Term 1": {"--LEC (2928)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [1], "locations": ["Esther Lee Bldg LT4"], "instructors": ["Professor Maria Del Mar FRANCESCH HUIDOBRO"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11", "6/12"]}}}, "assessments": {"Essays": "70", "Essay test or exam": "30"}}, {"code": "5121", "title": "Values and Ethics in Public Policy", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "This course aims to study the relationship between public polices and the values and ethics underlying them. It is the basic contention of this course that the making of public policies cannot be made divorced from moral and political values. These values provide justification for the legitimacy of policies. The course is divided into two parts. The first part introduces some major political theories and theoretical frameworks for students to understand the meaning and importance of values in different moral outlook. Values discussed cover rights and obligation, justice and fair procedure, freedom and democracy, community and citizenship, and the proper relation between personal and social responsibility. The second part focuses on case studies.", "outcome": "By the end of this course, students will be able to:1. Understand how different moral issues arise in the making of public policy.2. Develop moral framework to analyze and evaluate social policies and public affairs.3. Understand fundamental concepts and values in moral and political philosophy.4. Think critically and philosophically in the debates of public policies.5. Apply moral concepts to analyze public policies.", "syllabus": "It is the basic contention of this course that the making of public policies cannot be divorced from moral and political values. These values provide justification for the legitimacy of policies. The course is divided into two parts: The first part introduces major political theories and theoretical frameworks for students to understand the meaning and importance of values from different moral perspectives. Values discussed cover rights and obligations, justice and fair procedures, freedom and democracy, community and citizenship, and the proper relation between personal and social responsibilities. The second part focuses on case studies.Course Content1. Normative perspective on public policies2. Theoretical framework: utilitarianism, liberalism, and perfectionism3. Political theories: universal, comparative, and distributive justice4. Values and types of different political and governmental systems5. Values and public sector reforms6. Values and ethics for public organizations7. Values and ethics for public policy markers8. Values and ethics in public policy making9. Framework and principles for moral evaluation of public policies10. Ethics and code of conducts for professional practices11. Public leadership ethics", "required_readings": "(*Highly recommended readings)*Kraatz, Matthew, Flores, R., Chandler, D., (2020), “The Value of Values for Institutional Analysis”, in Academy of Management Annals, Vol. 14, No. 2, 474-512. https://doi.org/10.5465/annals.2018.0074.*Stewart, Jenny, (2019), Public Policy Values, Springer.*Welch, Don, (2014), A Guide to Ethics and Public Policy, Routledge.*Lynch, Thomas D., Lynch, C.E., (2019), Ethics and Professionalism in the Public Service, Melvin & Leigh.*Wolff, Jonathan, (2019), Ethics and Public Policy: A Philosophical Inquiry, 2nd ed., Routledge.*Strunk, White, Angell (2014), The Elements of Style, 4th ed. Pearson.Dobel, J. Patrick, (2019), Public Leadership Ethics: A Management Approach, Routledge.Shafer-Landau, Russ, (2017), The Fundamentals of Ethics, Oxford University Press.Yung, Betty, Yu, Kam Por (Eds.) (2016), Ethical Dilemmas in Public Policy: The Dynamics of Social Values in the East-West Context of Hong Kong, Springer.Searing, Elizabeth A.M., Searing, Donald R. (Eds.) (2016), Practicing Professional Ethics in Economics and Public Policy, Springer.Winston, Kenneth, (2015), Ethics in Public Life-Good Practitioners in a Rising Asia, Springer.LaFollette, H., (ed.) (1997), Ethics in Practice: An Anthology, Blackwell.LaFollette, H., (ed.) (2003), The Oxford Handbook of Practical Ethics, Oxford UP.Frey, R.G. & Wellman, C.H. (ed.) (2003), A Companion to Applied Ethics, Blackwell.Cohen, A.I. & Wellman, C.H. (ed.) (2005), Contemporary Debates in Applied Ethics, Blackwell.Smits, Katherine, (2009), Applying Political Theory: Issues and Debates, Macmillan.Singer, Peer, (ed.) (1986), Applied Ethics, Oxford University Press.Scott, Ian (2010), The Public Sector in Hong Kong. HKU Press.Lam, Wai-man; Percy Lui; Wilson Wong (eds) (2012), Contemporary Hong Kong Government and Politics, HKU Press.Gittings, Danny (2016), Introduction to the Hong Kong Basic Law, HKU Press.Lee, E.; Chan, E. et al., (2013), Public Policymaking in Hong Kong, Routledge.Bardach, Eugene (2009), A Practical Guide for Policy Analysis, CQ Press, Washington, DC.Lovina, Ash (2013), Guide to AP United States Government & Politics, Worldwide Scholar, Hong Kong.Fong, Peter. (2019), “Editorial”, Public Administration & Policy, Vol. 22 No. 2. Pp.87-92. Fong, Peter, (ed.) (2020), Public Administration & Policy, Vol. 23 No. 1.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (3219)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [5], "locations": ["Esther Lee Bldg LT3"], "instructors": ["Dr. FONG Kwok Wing Peter"], "meetingDates": ["11/9", "18/9", "25/9"]}}, "2021-22 Term 1": {"--LEC (2373)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [5], "locations": ["Esther Lee Bldg LT3"], "instructors": ["Dr. FONG Kwok Wing Peter"], "meetingDates": ["10/9", "17/9", "24/9"]}}}, "assessments": {"Attendance": "10", "Essays": "50", "Presentation": "15", "Test or quiz": "25"}}, {"code": "5132", "title": "Public Policy Research", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "This course focuses on the application of methodological and statistical techniques in conducting policy research, with the objective of sensitizing students to adopt an evidence-based approach to assess public policies and social programs. Course contents include basic concepts in research designs, data collection techniques and statistical analyses. Discussions include both the qualitative and quantitative approaches to evaluate effectiveness, efficiency, and public accountability that define good public policies and social programs. Special attentions are given to the influences of the political environment and the competing interests among stakeholders in the research process. Real-world examples are used to illustrate practical skills in policy research.", "outcome": "(1) To understand the basic concepts of policy research;(2) To comprehend social, political, economic and organizational factors which influence the research process;(3) To acquire experiences in collecting and analyzing qualitative and quantitative information;(4) To develop a research proposal on an actual policy issue;(5) To relate research outcomes as inputs to policy formulation and implementation.", "syllabus": "The whole course consists of three parts. The first part introduces the basic elements: research question, theory, research design, and conceptualization. The second part discusses some qualitative methods, including case study, interviews, and content analysis. The final part focuses on quantitative methods: descriptive and inferential analysis, and survey research. For the quantitative part, Microsoft Excel will be used to conduct statistical analysis. The teacher will demonstrate the analysis steps in class where necessary. Students are expected to learn the basic skills of statistical analysis. This course also highlights the application and implication of methodological and statistical techniques in policy research. Therefore, real-life examples of public policies are discussed in class in order to advance students’ understanding and foster their policy analysis capacity.", "required_readings": "Babbie, E. R. (2013). The practice of social research. 13th edition (Student Edition).  Nelson EducationBerman, E., & Wang, X. (2011). Essential statistics for public managers and policy analysts. Los Angeles: CQ Press.Quirk T.J. (2012). Excel 2010 for Social Science Statistics: A Guide to Solving Practical Problems (e-book). Springer. Rubin HJ. & Rubin IS. (1995). Qualitative Interviewing: The Art of Hearing Data. Sage Publications.Saldaña, J. (2015). The coding manual for qualitative researchers. Sage Publications.Yin, R. K. (2009). Case study research: Design and methods. Sage Publications.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (3507)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [5], "locations": ["Lee Shau Kee Building LT3"], "instructors": ["Dr. YANG Litianqing"], "meetingDates": ["15/1", "22/1", "29/1", "5/2"]}}, "2021-22 Term 2": {"--LEC (1648)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [5], "locations": ["Chen Kou Bun Bldg 109"], "instructors": ["Dr. James Floyd DOWNES"], "meetingDates": ["14/1", "21/1", "28/1"]}}}, "assessments": {"Attendance": "15", "Presentation": "35", "Report": "50"}}, {"code": "5142", "title": "Economic Analysis of Public Policy", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "The course objective is to provide students with useful economic tools to perform a benefit-cost analysis of public policy. It covers economic theories that help understanding how individuals, firms and government interact with one another. Relevant applications of economic theory to public policy in housing, health, labor, transportation, welfare, and environment are examined.", "outcome": "Students who have taken this course will  1) be able to apply economic tools for analyzing public policy, and  2) have a better understanding of the economic and financial context of public policy making", "syllabus": "Lectures will be given on topics including Economics and Economists, Prices, Competition, Market Failure, Firm, Competition Policies, Money, Trade, Nationalization VS Privatization, Rent-seeking, Competition among Governments, Top-down VS Bottom-up and Discretion VS Rules.", "required_readings": "Readings will be given by the instructor based on the topics covered.", "recommended_readings": "Readings will be given by the instructor based on the topics covered", "terms": {"2020-21 Term 2": {"--LEC (1018)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [4], "locations": ["Yasumoto Int'l Acad Park LT8"], "instructors": ["Professor NG Ka Ho"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 2": {"--LEC (2426)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [4], "locations": ["Yasumoto Int'l Acad Park LT8"], "instructors": ["Professor NG Ka Ho"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Discussion": "20", "Essay test or exam": "20", "Homework or assignment": "30", "Report": "30"}}, {"code": "5301", "title": "Globalization, Social Problem and Policy", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "This course examines how policies of national government are shaped by the super-state institutions, such as the WTO, IMF and the World Bank, and how these relate to the current social problems in the World Cities, such as poverty, income disparity, marginalization of labour, etc. It will also explore the limits and possibilities of social policies of the national governments in alleviating such social problems.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5311", "title": "Public Organization Management", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "Through discussing key questions in public organization theory and public management, the course examines how different aspects of public organizations, including their structure, environment and culture, can have an enormous impact on different stages of policymaking and policy outcomes. Emphasis of the course is on the understanding of the general theoretical frameworks of the field and the ability to apply them to the context of real-world problems and issues. Examples and cases from Hong Kong, China and major Asian and western countries are used for linking up the theory and practice.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5321", "title": "NGOs & Government", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "This course examines the political, social and economic importance of NGOs in view of the theoretical discussions derived from a variety of empirical research in the Western countries and the practical experiences faced by NGOs in Hong Kong. The juxtaposition of theory and practice constitutes the major theme of the course. A number of NGOs are to be studied, ranging from interest groups, community groups, social movement organisations, to social service organisations and international NGOs. Emphasis is placed on the manners in which these organisations interact with government, political parties and other social groups in the local and international contexts.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5331", "title": "Government and the Economy", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "The course identifies and analyzes the objectives and policies developed and pursued by the Government in managing the economy and how these policies are implemented to achieve the objectives. It will explore the Government's assumptions and approach to the economy and economic development, as well as monetary, fiscal, industrial, trade and investment policies. The Hong Kong Government serves as the primary case example, particularly the Financial Secretary's office, the HK Monetary Authority and Bureaus of Commerce and Economic Development and Financial Services and the Treasury.", "outcome": "1. To develop concrete, practical knowledge and skills in economic policy analayis, development and application.  2. To provide guidance in devising and implementing policies that contribute to sustainable eocnomic growth and beneficial", "syllabus": "This course will identify and examine goals and policies developed and pursued by governments in managing the economy; how these policies are implemented to try to achieve these objectives; what tools are available and used by policymakers; various constraints affecting economic policy and policymaking; and the impact of policies on how we live and work.  It will explore Governments’ assumptions and approach to the economy and economic development, as well as monetary, fiscal, industrial, trade and investment policies. The Hong Kong and other Asian governments will serve as case examples of the development and implementation of policies and practices.", "required_readings": " Richard H.K. Vietor, How Countries Compete: Strategy, Structure, and Government in the Global Economy. Boston: Harvard Business School Press, 2007. Jan-Erik Lane and Svante Ersson, Government and the Economy: A Global Perspective. London and New York: Continuum, 2002. Robert Wade, Governing the Market: Economic Theory and the Role of Government in East Asia Industrialization. Princeton, NJ: Princeton University Press, 1992, 2003. Richard Lehne, Government and Business. Washington, DC: CQ Press, 2006. Rudiger Dombusch, ed., Policymaking in the Open Economy. The World Bank, 1993.", "recommended_readings": " Richard H.K. Vietor, How Countries Compete: Strategy, Structure, and Government in the Global Economy. Boston: Harvard Business School Press, 2007. Jan-Erik Lane and Svante Ersson, Government and the Economy: A Global Perspective. London and New York: Continuum, 2002. Robert Wade, Governing the Market: Economic Theory and the Role of Government in East Asia Industrialization. Princeton, NJ: Princeton University Press, 1992, 2003. Richard Lehne, Government and Business. Washington, DC: CQ Press, 2006. Rudiger Dombusch, ed., Policymaking in the Open Economy. The World Bank, 1993.", "terms": {"2020-21 Term 2": {"--LEC (4301)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [1], "locations": ["Wu Ho Man Yuen Bldg 505"], "instructors": ["Professor Mark Charles MICHELSON"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}}, "2021-22 Term 2": {"--LEC (3459)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [1], "locations": ["Wu Ho Man Yuen Bldg 505"], "instructors": ["Professor Mark Charles MICHELSON"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Essay test or exam": "20", "Presentation": "35", "Participation": "15", "Report": "30"}}, {"code": "5351", "title": "Public Policy and Governance", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy.", "description": "This course analyses the relationship between public policy and governance in a rapidly changing world. It gives a general picture of contextual challenges confronting contemporary governments in forming and implementing public policies and discusses the ways in which governments have attempted to cope with these contextual changes and challenges, and how governance theories in public administration and more broadly political science have been developed to study the evolving modes of policy-making since the early 1990s.", "outcome": "1) To demonstrate an awareness of the fact that the environment in which governments make policies and organise the society has substantially changed; 2) To understand the changing mechanisms for governing in the recent decade and the impacts they bring about;  3) To reflect on both local and international cases and consider how they can contribute to a better understanding of public policy and administration in Hong Kong; and\r 4) To identity governing problems in the world and how the shared experience can help combat common governing problems faced by different governments.", "syllabus": "Please refer to course outline to be distributed in the first class.", "required_readings": "Please refer to course outline to be distributed in the first class.", "recommended_readings": "Please refer to course outline to be distributed in the first class.", "terms": {"2020-21 Term 1": {"--LEC (2844)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [2], "locations": ["No Room Required"], "instructors": ["Dr CHOU Kwok Ping"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12", "8/12"]}}, "2021-22 Term 1": {"--LEC (1229)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [2], "locations": ["Esther Lee Bldg 308"], "instructors": ["Staff"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11", "7/12"]}}}}, {"code": "5402", "title": "Comparative Public Policy", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "The course objective is to explain policy outcomes of different political units, whether they are national or sub-national governments. The course also discusses some fundamental issues concerning the approach, scope and methods of doing comparative public policy. The course is divided into two parts. First, some foundational concepts, conceptual definitions and the underpinnings of doing comparative public policy will be given. Second, cases in major policy areas including Hong Kong, China and major countries in regions around the world will be examined by applying the concepts and theoretical frameworks introduced.", "outcome": " Understanding more about the conceptual and theoretical dimensions of comparative public policy. Becoming more open-minded and tolerant to different policies with various outcomes and they are different from the local contexts. Ability to integrate empirical findings with theoretical guidance. Working with student-fellows to have team spirit and group efforts. Presentation skills in the class and communication techniques are used. Coordination efforts between student-fellows to present findings and analyse data. Locate the policy debate within the Asian context, guided by a larger theoretical approach. Ability to think critically. Explore policy alternatives to the existing and pressing social issues and problems.", "syllabus": "This course examines the comparative study of the essence, characteristics, structure and process of public policies. The assumption is that through comparative study on countries (regions) based on substantive differences in institutions, different governance styles, developmental stages, and varied political processes that will entail differences for us to learn from each other. Put it simply, comparative public policy is to explain policy outcomes by comparing different political units, whether they are national or sub-national governments. The course offers foundational concepts and approaches in the field of comparative public policy, and begins with an introduction to the concepts of understanding comparative public policy. Questions and issues such as why comparative approach is needed to the study of public policy; What the significances and benefits of doing this are; And how it is conducted comparatively will be tackled, among many others. Then we will focus on a few substantive policies subsequently such as anti-corruption policy, higher educational policy, housing policy, poverty issue and aging policy. All these illustrate and demonstrate the importance, significance and insight drawn from the comparative study of public policy. In short, both conceptual ideas and empirical policies will be studied to enhance our understanding of public policies in a comparative manner. Moreover, practical implications and lessons will be drawn and learned. Last, but not the least, group presentations will be encouraged in the final weeks of the class. The number of groups will depend on the size of the class and the presentations should provide an excellent forum for us to engage in an active mode of discussion. Ideas can be tested; points will be made, and, above all, judgements shall be formed. This will further cultivate a sense of group learning within a productive and an encouraging academic environment.", "required_readings": "Aberback, Joel D., and Bert A. Rockman. 1990. Problems of Cross-National Comparison. In Public Administration in Developed Democracies: A Comparative Study, edited by D.C. Rowat, 419–40. New York: Marcel Dekker.Bekke, Hans, James Perry, and Theo Toonen, eds. 1996. Civil Service Systems in Comparative Perspective. Bloomington: Indiana University Press.Jreisat, Jamil E. 2006. Comparative Public Administration Is Back In, Prudently Public Administration Review.  March/April 2005, Vol. 65, No. 2Heady, Ferrel. 2001. Public Administration: A Comparative Perspective. 6th ed. New York: Marcel Dekker.Riggs, Fred W. 1991. \"Public Administration: A Comparative Framework.\" Public Administration Review 51:473-77.Business Week. 2000. Special Report: Globalism. November 6, 72–100.Farazmand, Ali. 1999. Globalization of Public Administration. Public Administration Review 59(6): 505–22.Tsao King K. and Worthley, J. 2009.  “Civil Service Development in China and America: A Comparative Perspective” Public Administration Review, Special Issue, 2009, 88-94.Tummala, Krishna K. 1998. Comparative Study at the Section on Comparative and International Administration. Public Administration Review 58(1): 21–22.Welch, Eric, and Wilson Wong. 1998. Public Administration in a Global Context: Bridging the Gaps of Theory and Practice between Western and Non-Western Nations. Public Administration Review 58(1): 40–50.Worthley, John Abbott, and King K. Tsao. 1999. Reinventing Government in China: A Comparative Analysis. Administration and Society 31(5): 571–85.Kettl, Donald F. 1994. Reinventing Government? : Appraising the National Performance Review.  Washington, D.C.: Center for Public Management, Brookings Institution.Lane,Jan-Erik, 2000.  The Public Sector: Concepts, Models and Approaches.  London; Thousand Oaks, Calif.: Sage Publications, 2000.Osborne, David and Gaebler, Ted. 1992. Reinventing Government: How the Entrepreneurial Spirit is Transforming the Public Sector. Reading, Mass.: Addison-Wesley Pub. Co.Theodoulou, Stella Z. and Matthew A. Cahn. 1995. Public Policy: The Essential Readings. Englewood Cliffs: Prentice Hall.Thomas, Vinod. 1999. Globalization: Implications for Development Learning. Public Administration and Development 19(1): 5–17.Weimer, David and Aidan Vining.  1999.  Policy Analysis: Concepts and Practice.  3rd ed.  Englewood Cliffs, NJ: Prentice-Hall.Fa wu bu. Diao cha ju, Anti-corruption yearbook (Ministry of Justice Investigation Bureau, Republic of China, 2002)Gilholm, A. 2018. Xi Jinping’s New Watchdog: An Ever More Powerful Anti-Corruption Tool.Foreign Affairs, March 6.https://www.foreignaffairs.com/articles/china/2018-03-06/xi-jinpings-new-watchdogHuang, Shaojian, Independence of anti-corruption agencies in investigating corruption complaints against the head of state or head of government in selected places and Hong Kong (Hong Kong : Legislative Council Secretariat, Research and Library Services Division, 2008)Hsueh, Chao-Yung, \"Power and Corruption in Taiwan.\" In journal of Issues & Studies, Volume 43, Issue 1, 2007, pp. 1-39Independent Commission Against Corruption, Hong Kong Independent Commission Against Corruption (ICAC) (Hong Kong: Independent Commission Against Corruption, 2008)Klitgaard, Robert 1988 Controlling Corruption. Berkeley and Los Angeles: University of California Press.He Zengke, “Corruption and anti-corruption in reform China”, Communist and Post-Communist Studies, Volume 33, Issue 2, June 2000, pp.243-270Lee, Rance P. L., Corruption and its control in Hong Kong: situations up to the late seventies (Hong Kong: Chinese University Press, 1981)Lo, Jack M.K. \"Controlling Corruption in Hong Kong: From Colony to Special Administrative Region.\" In journal of Journal of Contingencies and Crisis Management, Volume 9 Issue 1, 16 Dec 2002, pp. 21-28Lo, Shiu Hing, Political development in Macau (Hong Kong: Chinese University Press, c1995)Lu, Xiaobo. 2000. Cadres and Corruption. Stanford, California: Stanford University Press. Introduction (pp1-30).Melanie Manion, Corruption by Design: Building Clean Government in Mainland China and Hong Kong, (Harvard University Press, 2004)Pan, Wai-fat, The impact of Chinese culture on corruption in Hong Kong (Hong Kong: University of Hong Kong, 2000)Tat Yan Kong, \"Corruption and the effect of regime type: the case of Taiwan.\" In the Journal of New Political Economy, Volume 9, Issue 3 September 2004, pp. 341–364 Tsao, King Kwun (2013). “Can Hong Kong stay corruption-free under China?” http://www.bbc.co.uk/news/world-asia-china-23223457      OR: http://www.bbc.co.uk/zhongwen/trad/multimedia/2013/07/130709_aud_anti_corruption_hongkong_tsao.shtmlTsao, King K. and John Worthley, 1996 \"China: Administrative Corruption Experience in a Comparative Context\" in Australian Journal of Public Administration 4:22-29.Williams, Robert and Doig, Alan, eds. 2000. Controlling Corruption. Cheltenham and Northampton: Edward Elgar Publishing LimitedAsian Development Bank: “Curbing corruption in public procurement in Asia and the Pacific: progress and challenges in 25 countries: thematic review” (Manila: Asian Development Bank, 2006)Quah, Jon S. T., \"Controlling corruption in city-states: A comparative study of Hong Kong and Singapore.\" In Journal of Crime, Law and Social Change, v22, 4, Dec 1994, pp. 391-414.Kidd, John, Fighting corruption in Asia: causes, effects, and remedies (London u.a. World Scientific 2003)Matia Warsta, Corruption in Thailand (International Management: Asia Swiss Federal Institute of Technology Zurich, 2004)Fritzen, S, The ‘misery’ of implementation: Governance, institutions and anti-corruption in Vietnam, in Tarling, N. (ed) Corruption and good governance in Asia (Routledge, New York, 2005) pp. 98-120Altbach, Philip G., “Higher Education and the WTO: Globalization Run Amok,” International Higher Education (Spring 2001).  entire document www.bc.edu/bc_org/avp/soe/cihe/newsletter/News23/text001.htm   Chen, 2003. Stride From a Country of Tremendous Population to a Country of Profound Human Resources. (China: Higher Education Press.)C John N. Hawkins, 2000. \"Centralization, decentralization, recentralization - Educational reform in China\", Journal of Educational Administration, Vol. 38 Iss: 5, pp.442 – 455Pretorius, S.G. and Y.Q. Xue, 2003. “The Transition from Elite to Mass Higher Education: A Chinese Perspective” in Prospects, Vol.33, No. 1, March.Li J. 2017. Educational Policy Development in China for the 21st Century: Rationality and Challenges in a Globalizing Age. Chinese Education and Society: 50: 133-141.Ryan, Janette (ed.), 2011. China’s Higher Education Reform and Internationalisation. London- New York, Routledge.Yang, Rui. 2003. Third Delight: The Internationalization of Higher Education in China. New York & London: Routledge.Zhu, Jiani, 2007. “Higher Education in China: In the Light of Manifestation and Demographic Change”, Octoberhttp://www.che.de/downloads/Higher_Education_in_China_AP97.pdf中國高等教育改革與發展網: http://www.hie.edu.cn/cbs/Articles on higher education can also be found http://www.usc.cuhk.edu.hk/wk.aspBloom, Gerald & Tang, Shenglan (eds) (2004), Health Care Transition in Urban China, Burlington, VT: Ashgate.Chen, Sheying, Powell, Jason L. (Eds.) 2012 Aging in China: Implications to Social Policy of a Changing Economic State. SpringerCheung, Anthony & Gu, Xingyuan (2004), ‘Health Finance’, in Wong, Linda, White, Lynn & Gui, Shixun (eds) Social Policy Reform in Hong Kong and Shanghai: A Tale of Two Cities, Armonk, N.Y.: M.E.Sharpe.Harvard Team, The 1999. “Improving Hong Kong’s Health Care System: Why and For Whom?” Hong Kong: Printing Department, Hong Kong Special Administrative Region Government. Or “Harvard Report”http://www.hwfb.gov.hk/hw/text/english/consult/hcs/hcs.htmKowal, Paul, Sharon Williams, Yong Jiang, Wu Fan, P. Arokiasamy, and Somnath Chatterji. (2012) “Ageing, Health, and Chronic Conditions in China and India: Results from the Multinational Study on Global Ageing and Adult Health” in Aging in Asia: Findings From New and Emerging Data Initiatives. SageOfra, Anson (2005), Healthcare in Rural China: Lessons From Hebei Province, Burlington, VT: Ashgate.Yuen, Peter P. & Lieu, Geoffrey S.Y.2003. “Hospital Governance: An Assessment by Governing Committee Members and Chief Executives of Hong Kong Public Hospitals” in Public Administration and Policy: A Hong Kong & Asia-Pacific Journal Vol. 12, no. 1, pp65-82.Ramesh M. and Ian Holliday, \"The Health Care Miracle in Southeast Asia: Activist State Provision in Post-Colonial Hong Kong, Malaysia and Singapore\", Journal of Social Policy 30 (2001) pp.637-651Christopher K. Johnson and Patrick L. Mason, 2012. “Theories of Poverty: Traditional Explanations and New Directions” Jefferson, Philip N, ed. 2012. The Oxford Handbook of the Economics of PovertySouth China Morning Post:--http://www.scmp.com/news/hong-kong/economy/article/1866074/more-elderly-people-hong-kong-living-below-poverty-line-- http://www.scmp.com/news/hong-kong/education-community/article/1938487/officials-scrap-plan-redraw-hong-kong-povertyWorld Bank:http://www.worldbank.org/en/country/china/overviewTang, Beibei, 2019. China's Housing Middle Class: Changing Urban Life in Gated Communities. Routledge.Long Term Housing Strategy Steering Committee, Hong Kong Government SAR, 2013. Long Term Housing Strategy Consultation DocumentLui, Hon-Kwong., 2011. “Hong Kong’s Housing Policy: A Case Study in Social Justice” Housing, Theory and Society. Vol. 29, issue 4Wang, Ya Ping, 2005. Chinese Housing Reform in State-owned Enterprises and Its Impacts on Different Social Groups. Urban Studies.Xu, Jiang, 2009. Decoding Urban Land Governance: State Reconstruction in Contemporary Chinese Cities Urban Studies, 46: 559-581Yuen, Belinda, 2007. \"Squatters no more: Singapore social housing\". Global Urban Development Magazine. 3.Deutsch, Karl W. 1987. Prologue: Achievements and Challenges in 2000 Years of Comparative Research. In Comparative Policy Research, edited by Meinhof Dierkes, Hans N. Weiler, and Ariane B. Anatal, 5–12. New York: St. Martin’s Press.Jreisat, Jamil E. 2002. Comparative Public Administration and Policy. Boulder, CO: Westview Press.Otenyo, Eric Edwin. 2006. Comparative Public Administration, titled Research in Public Policy Analysis and Management, volume 15.  Emerald Group Publishing.Zhao Yongfei & B.Guy Peters, 2009. “The State of the State: Comparing Governance in China and the United States” Public Administration Review, 122-128.http://onlinelibrary.wiley.com/doi/10.1111/j.1540-6210.2009.02099.x/full", "recommended_readings": "Additional reading materials will be assigned as the course runs, depending entirely upon the understandings, responses and interests of the whole class.", "terms": {"2020-21 Term 2": {"--LEC (1094)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [2], "locations": ["Cheng Yu Tung Building 203"], "instructors": ["Professor TSAO King Kwun"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 1": {"--LEC (1701)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [2], "locations": ["Wu Ho Man Yuen Bldg 306"], "instructors": ["Professor TSAO King Kwun"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11", "7/12", "14/12"]}}}, "assessments": {"Essays": "50", "Homework or assignment": "10", "Project": "25", "Participation": "15"}}, {"code": "5412", "title": "Crisis Management and Public Governance", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "This course discusses theories and applications of crisis management and governance in the public service sector. It will also focus on how professionals in the public sector can reduce risks, get prepared, respond to and recover from crises for providing good governance.", "outcome": "By the conclusion of the course, students should have developed a deeper understand- ing and enhanced appreciation of crisis management concepts that could be brought to practice in real cases. In particular, the students are expected to have attained the following knowledge by the end of the course: A solid theoretical and practical base for studying and analyzing crisis phenome- na. Application of theoretical and practical skills to convey effective messages in crisis contexts. Analytical thinking to dissect crisis cases and to identify good and bad strategies. Recognition of potential ethical and legal problems in crisis management. Be able to engage in multi-thinking and multi-tasking in a crisis. Be able to know how to prevent/ minimize a crisis from happening. Be able to conduct a crisis prevention/ management and post-crisis management plan.", "syllabus": "This course is designed to (1) introduce students to the theory and application of crisis management; (2) guide students to understand the challenges imposed by the 3.0 era that has made crisis management all the more essential; (3) develop students’ analytical ability to dissect good and bad crisis cases and situations; and (4) train students to grasp the effective crisis management skills that work in real situations.", "required_readings": "Lee, K.M. (2015). 公關公義 . Hong Kong Economic Times Press.Lee, K.M. (2018). 公關智商. Arcadia Press Ltd. ", "recommended_readings": "Bundy, Jonathan; Pfarrer, Michael D.; Short, Cole E.; Coombs, W. Timothy (2017). \"Crises and Crisis Management: Integration, Interpretation, and Research Development\". Journal of Management. 43 (6): 1661–1692.Alan B. Bernstein and Cindy Rakowitz (2012). Emergency Public Relations: Crisis Management in a 3.0 World. p. 5. Coombs, W. T. (1999). Ongoing Crisis Communication: Planning, Managing, and Responding. Thousand Oaks, CA: Sage.Lerbinger, O. (1997). The Crisis Manager: Facing Risk and Responsibility. Mahwah, NJ: Erlbaum.Smith, Larry and Dan Millar (2002). Crisis Management and Communication; How to Gain and Maintain Control (2nd ed.). San Francisco, CA: International Association of Business Communicators.", "terms": {"2020-21 Term 2": {"--LEC (4538)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [2], "locations": ["Cheng Yu Tung Building LT5"], "instructors": ["Professor LEE Kaman"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 2": {"--LEC (3844)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [2], "locations": ["Wu Ho Man Yuen Bldg 306"], "instructors": ["Professor LEE Kaman"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Attendance": "20", "Discussion": "20", "Essays": "25", "Presentation": "15", "Project": "20"}}, {"code": "5422", "title": "Environmental Policy Analysis", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy;or MSSc Government and Politics (Greater China)", "description": "This course introduces students to the fundamental concept of the environmental policy cycle in the context of the institutional setup, political ecology and advocacy of various stakeholders. The key considerations in environmental policy-making will be examined and appropriateness of different policy instruments in different context will be discussed. Students will be asked to discuss examples of current policies or policy instruments, in Hong Kong, China and the world.", "outcome": "At the end of the course, students are expected to be: (a) conversant with the environmental policy cycle and its complexity; (b) able to analyze and critique policies; (c) capable of choosing appropriate policy instruments; and (d) familiar with the dynamics of the environmental movement and pursuit for sustainability.", "syllabus": "Lecture will be given on the topics as follows:1) Introduction – framework for understanding environmental policy; nature of environmental problems – externality, tragedy of commons, institution failure, and the pursuit for sustainability2) Cost benefit analysis3) Exposure-effect analysis4) Environmental justice and politics, pollution haven hypothesis and sustainability5) Policy-making process and stakeholder dynamics – models of policy making, linear and looping process, environmental movement, advocacy groups, societal and institutional response to environmental issues, administrative efficiency, environmental effectiveness and equity, hurdle to change6) Environmental planning & environmental assessment7) Market utilization (tax, fee, subsidy removal, deposit-refund) and creation (property rights, cap and trade)8) Control of air pollution: SO2 mitigation in China9) Alternative management strategy10) Siting locally unwanted facilities11) Environmental and social safeguards of the Belt Road Initiative ", "required_readings": " Introduction Mitchell, B., 2002. “Change, Complexity, Uncertainty and Conflict”, In Chapter 1, Resource and Environmental Management, pp. 1-25. # Andrews, R.N.L., 2006. “US Environmental Politics, Policies and the Common Good”, Environment, 48(9): 28-44.   Bauhinia Foundation (2007) The Road to Better Policy-making and Governance in Hong Kong. Bauhinia Foundation Research Report. 236 pp. Helm, D., 2000. “Objectives, Instruments, and Institutions”, in D. Helm (ed.) Environmental Policy: Objectives, Instruments and Implementation, pp. 1-28, Oxford: Oxford U. Press. Roque, C.R., 1986. “Factors Influencing Environmental Policies in Developing Countries”, in Asian Development Bank (ed.) Environmental Planning and Management. Asian Development Bank. pp. 134 83. World Bank, 2005. Integrating Environmental Considerations in Policy Formulation:Lessons from Policy-Based SEA Experience. World Bank Report No. 32783 Young, O.R., King, L.A. and Schroeder H. (2002). Institutions and Environmental Change: Principal Findings, Applications, and Research Frontiers. MIT Press.  Cost benefit analysis Stern, N. 2007, Stern Review: The Economics of Climate Change, Executive summary Envist, P.-A., Naucler, T. and Rosander, J., 2007. \"A cost curve for greenhouse gas reduction.\" The McKinsey Quarterly (1): 35-45. Hanemann, W. M., 1994. \"Valuing the Environment through Contingent Valuation.\" Journal of Economic Perspectives 8(4): 19-43. World Bank, 2007. Cost of pollution in China: economic estimates of physical damages. Washington, D.C.  Exposure-effect analysis Liu J.L.Y. and Hedley A.J., 1996. “Epidemiologic and Economic Analyses of the Environment: Examples Dealing With Hong Kong's Air Pollution.” Asian Journal of Environmental Management 14(2): 121-130. Hedley A.J., McGhee, S.M., Wong, C.M., Barron, B., Chau, P., Chau, J., Thach, T.Q., Wong T.W., Loh C., 2006. Air Pollution: Cost and Paths to a Solution. Understanding the connection between visibility, air pollution and health costs in pursuit of accountability, environmental justice and health protection. Civic Exchange. Loh C., Stevenson A., Weldon, M., Hedley, A., McGhee S., Lai H.K., Chau J., Chau, P.Y.K., Wong, C.M., Wong, T.W., Ng, S., Lau, A., 2008. A Price too High: The Health Impacts of Air Pollution in Southern China. Civic Exchange. Lam, K.C, Brown, A.L,, van Kamp, I., Wong , T.W., Chan, Y.K., Yeung, M.K.L., Lui, A., Law , C.W., Chung, Y.T., 2012. A large scale study of the health effects of transportation noise in Hong Kong. Proceedings of Acoustics 2012, Hong Kong.  Environmental justice & politics Keohane, N. O., Revesz, R. L. and Stavins, R. N., 1998. \"The Choice of Regulatory Instruments in Environmental Policy.\" Harvard Environmental Law Review 22(2): 313-367. Hardin, G., 1968. \"Tragedy of Commons.\" Science 162(3859): 1243-1248. Wu, F., 2009. \"Environmental Politics in China: An Issue Area in Review.\" Journal of Chinese Political Science 14(4): 383-406. Almeida, P. and L. B. Stearns, 1998. \"Political opportunities and local grassroots environmental movements: The case of Minamata.\" Social Problems 45(1): 37-60. Vanhala, L., 2013. \"The comparative politics of courts and climate change.\" Environmental Politics 22(3): 447-474.  Policy-making Process and stakeholder dynamics Ahmed, K., Sanchez-Triana, E., 2008. Strategic Environmental Assessment for Policies – Chapter 3, pp. 37-59, World Bank. [Electronic resource through the university library website: http://site.ebrary.com/lib/cuhk/docDetail.action?docID=10236055] Cheung, A., 2007. “Policy Capacity in Post-1997 Hong Kong: Constrained Institutions Facing Crowding and Differentiated Polity”, The Asia Pacific Journal Of Public Administration, 29 (1): 51-75. Jordan, A., Wurzel, R.K.W., Zito R. & Brückner, L. (2003) Policy Innovation or 'Muddling Through'? 'New' Environmental Policy Instruments in the United Kingdom, Environmental Politics, 12(1), 179-200 Mitchell, R. K., Agle, B. R. and Wood, D.J.,  1997. “Toward a Theory of Stakeholder Identification and Salience: Defining the Principle of Who and What really Counts.”, Academy of Management Review 22(4): 853 - 888. Moser, S.C. and Ekstrom, J.A. 2010. “A framework to diagnose barriers to climate change adaptation”, PNAS, 107 (57): 22026-22031. Loh, C. 2001. “Air pollution, so much to do, so many roadblocks”, in Chan et. al. (eds.) The Air We Breathe: Air Pollution in Hong Kong, pp. 49-57. Reed, M.S. 2008. “Stakeholder participation for environmental management: A literature review”, Biological Conservation, 141: 2417-2431. Tsang, S., M. Burnett, P. Hills, R. Welford, 2009. “Trust, Public Participation and Environmental Governance in Hong Kong”, Environmental Policy and Governance (19): 99–114.  Environmental planning & environmental assessment Hopkinson, L., 2007. “Case Study of the EIA Ordinance”, in B. Leverett et.al. (eds.) Idling Engine: Hong Kong’s Environmental Policy in a Ten Year Stall, Chapter 10, Civic Exchange. Marsden, S., 2010. “Environmental Impact Assessment in Hong Kong: An evaluation of principles, procedure and practice Post1997”, Asia Pacific Journal of Environmental Law 13(1): 115-133. World Bank, 2011. Strategic Environmental Assessment in Policy and Sector Reform. World Bank Report.  Market utilization Goulder, L. H. and I. W. H. Parry, 2008. \"Instrument Choice in Environmental Policy.\" Review of Environmental Economics and Policy 2(2): 152-174. Blackman, A. and Harrington, W.  2000. \"The Use of Economic Incentives in Developing Countries: Lessons From International Experience With Industrial Air Pollution.\" The Journal of Environment Development 9(1): 5-44. Coase, R. H., 1960. \"The Problem of Social Cost.\" Journal of Law & Economics 3(Oct): 1-44. World Bank, 2019. State and Trends of Carbon Pricing. Washington, D.C.  Command and control – regulations, enforcement Glaeser, E. L., 1999. An overview of crime and punishment, Harvard University and NBER. Becker, G. S., 1968. \"Crime and Punishment - Economic Approach.\" Journal of Political Economy 76(2): 169-217. OECD, 2006. Environmental Compliance and Enforcement in China - An Assessment of Current Practices and Ways Forward. Paris, France. Xu, Y., 2011. \"Improvements in the Operation of SO2 Scrubbers in China's Coal Power Plants.\" Environmental Science & Technology 45(2): 380–385. Wu, D., Xu, Y., Leung, Y., & Yung, C. W., 2015. \"The Behavioral Impacts of Firm-level Energy-conservation Goals in China’s 11th Five-Year Plan.\" Environmental Science & Technology, DOI: 10.1021/es5031596.  Control of air pollution Schmalensee, R. and R. N. Stavins, 2013. \"The SO2 Allowance Trading System: The Ironic History of a Grand Policy Experiment.\" Journal of Economic Perspectives 27(1): 103-121. Xu, Y., 2013. Comparative Advantage Strategy for Rapid Pollution Mitigation in China. Environmental Science & Technology 47, 9596-9603. Gao, C. L., Yin, H. Q., Ai, N. S., and Huang, Z. W., 2009. \"Historical Analysis of SO2 Pollution Control Policies in China.\" Environmental Management 43(3): 447-457. Carlson, C., D. Burtraw, Cropper,  M. and Palmer, K. L. 2000. \"Sulfur Dioxide Control by Electric Utilities: What are the Gains from Trade?\" Journal of Political Economy 108(6): 1292-1326. Taylor, M. R., Rubin,  E. S. and Hounshell, D. A., 2005. \"Control of SO2 Emissions from Power Plants: A Case of Induced Technological Innovation in the U.S.\" Technological Forecasting and Social Change 72(6): 697-718.  Alternative management strategy Goulder, L. H. and Parry, I. W. H., 2008. \"Instrument Choice in Environmental Policy.\" Review of Environmental Economics and Policy 2(2): 152-174. Brown, A. L. (2012). A review of progress in soundscapes and an approach to soundscape planning. International Journal of Acoustics & Vibrations, 17(2), 73-81. Brown,A.L., & Lam, K.C. (2015, June). Soundscape Planning as a Complement to Environmental Noise Control. Noise/News International, 23(2),14-21 Creutzig, F.,  He, D., 2009. “Climate change mitigation and co-benefits of feasible transport demand policies in Beijing” Transport Research Pt. D, 14: 120-131.  Siting of locally unwanted facilities      Shaw, D. (2005). Visions of the future for facility siting. In S. H. Lesbirel, & D. Shaw (eds.), Managing Conflict in facility siting: An international comparison (pp. 196-207). Cheltenham, UK: Edward Elgar Dear, M. (1992). Understanding and overcoming the NIMBY syndrome.  Journal of the American Planning Association, 58(3), 288-300. Lesbirel, S. H., & Shaw, D. (1999). Facility siting: Issues and perspectives. Paper presented at International Workshop of Challenges and Issues in Facility Siting, Academia Sinica, Taipei. Available http://wwwc.cc.columbia.edu/sec/dlc/earthscape/rrlframe.html.    Environmental and social safeguards of Belt-Road Initiative Hu, Tao., Wang, Yiting (2014). Environmental and Social Risk Management of Chinese Transnational Corporations. Monograph: Yale School of Forestry and Environmental Studies.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (3398)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [3], "locations": ["Yasumoto Int'l Acad Park 505"], "instructors": ["Professor LAM Kin Che"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (3162)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 403"], "instructors": ["Professor LAM Kin Che, \n\rProfessor XU Yuan"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Discussion": "15", "Essays": "20", "Presentation": "15", "Report": "50"}}, {"code": "5432", "title": "Urban Planning and Development", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "In this course, different theories of planning and urban design are outlined, researched and adapted to current issues in Hong Kong and China. Urbanization, generic cities, the production of space, political planning, architectural culture and urban evolution will provide a contextual framework for the (re)vision of future environments in a critical and sustainable manner.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5433", "title": "Global Finance and Governance", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "The purpose of this course is to analyze both short-term and long-term flows of capital across borders, the patterns they assume, the forces driving them. It also examines the benefits and costs/risks arising as a result, the instruments developed by private agents to maximize their effectiveness, government efforts to minimize the disruption caused, and the institiutional architecture which is emerging as a by-product of their rapid expansion.", "outcome": "Upon completion of this course, students will be able:1. To gain insight into the structure and functioning of the global financial system and its components;2. To understand the underlying rationale for, scope of, and limitations of international and national (or equivalent) financial regulatory mechanisms.  ", "syllabus": "Weekly Themes: General economic backdrop General financial backdrop Foundations of international banking and money market Foundations of the international bond and equity markets Foundations of the foreign exchange market Foundations of the international monetary system International debt and banking crises Macro and balance-of-payments foundations of country risk assessment International policy cooperation Foundations of international financial regulation Reform of international financial regulatory architecture and impediments to progress Specific international regulatory mechanisms Politics of international financial regulation, anatomy of market failure, behavioural finance, and overview of regulatory policy", "required_readings": "Topics:  Introduction: ER, chap 1; DRS, chap 1. Introduction to financial intermediation: LC, chap 3; GT, chap 2. International banking and money market: ER, chap 11; HG, chap 8; JM, chap 3. International bond market: ER, chap 12; JM, chap 3; KP, chap 12; Richard Benzie, “The Development of the International Bond Market (available at https://www.bis.org/publ/econ32.htm). International equity markets: ER, chap 13; JM, chap 3; Faten Ben Slimane, “The Structural Evolution of Stock Exchanges” (available at https://www.cairn.info/revue-recherches-en-sciences-de-gestion-2012-6-page-47.htm). Foreign exchange market and currency derivatives: ER, chaps  5,7, 14; DRS, chap 9; GG, chap 2; HG, chap 1; JM, chaps 3, 5; KP, chaps 1, 12, 13. Exchange rate determination: ER, chap 6; LC, chaps 5-9, 12-15; DRS, chap 10; GG, chap 15; HG, chap 2, 3; JM, chap 4, 7, 8, 9; KP, chaps 6-9. Evolution of the international monetary system: ER, chap 2; HG, chap 1, 6, 7, 10; KP, chap 11. Exchange rate regimes, foreign exchange speculation and crises, and international monetary integration: LC, chaps 11, 16, 17; DRS, chaps 8, 10; GG, chaps 3, 20, 21, 22, 24; HG, chap 4; JM, chap 6; KP, chaps 10, 16, 17. Debt crises: LC, chap 17; GG, chaps 22, 24; HG, chap 9; KP, chap 15. Banking crises: CC, entire book; LC, chap 17; HG, chap 8; GNG, entire book; HM, entire book; JR, entire book; Daniel Mugge, \"Studying Macroeconomic Indicators as Powerful Ideas,\" Journal of European Public Policy, 2016, 410-427. Macro foundations of balance of payments analysis: LC, chap 4; DRS, chap 4; Daniel Mugge, \"Studying Macroeconomic Indicators as Powerful Ideas,\" Journal of European Public Policy, 2016, 410-427. Balance of payments analysis: ER, chap 3; GG, chap 5; JM, chap 2; KP, chaps 2, 3; wise-owl.com, \"Economic Indicators: Balance of Payments\" (available at https://www.wise-owl.com/investment-education/economic-indicators-balance-of-payments-bop). International macroeconomic policy coordination: GG, chap 24; KP, chap 14. The objectives of international financial regulation: ADE, chap 1; DG, chap 1. The current international regulatory system and international standard setting: ADE, chaps 1, 2; BR, entire book; CJ, entire book; DG, chap 2; MST, entire book; LP, entire book. The international legal framework for international financial regulation: ADE, chaps 3, 4; CJ, entire book; MST, entire book. Patterns of institutional and legal reform: ADE, chap 5; BR, entire book; CJ, entire book; MST, entire book; LP, entire book.  Incentives versus rules in international financial regulation: ADE, chap 6. Specific international regulatory mechanisms—capital controls and Tobin tax: Christopher J. Neely, “An Introduction to Capital Controls,” Federal Reserve Bank of Saint Louis Review, November/December, 1999, pp. 13-30; Neill McCulloch and Grazia Pacillo, The Tobin Tax: A Review of the Evidence (University of Sussex Institute of Development Studies). Politics of international financial regulation: CH, entire book; RG, entire book; HPZ, entire book. Anatomy of government failure: Clifford Winston, Government Failure versus Market Failure: Microeconomics Policy Research and Government Performance (Brookings Institution). Behavioural finance: Gulnur Muradoglu and Nigel Harvey, “Behavioural Finance: The Role of Psychological Factors in Financial Decisions,” Review OF Behavioural Finance, Issue 2, Volume 4, 2012, pp. 68-80. Overview of regulatory policy: Christopher Decker, Modern Economic Regulation: An Introduction to Theory and Practice (Cambridge University Press) (CD); OECD, Regulatory Policy and Governance: Supporting Economic Growth and Serving the Public Interest  (OECD).", "recommended_readings": "L.S. Copeland, Exchange Rates and International Finance (Financial Times/Prentice Hall) (LC).J.D.  Daniels, L.H. Radebaugh and D.P. Sullivan, International Business: Environments and Operations (Pearson Education) (DRS).G. Gandolofo, International Finance and Open-Economy Macroeconomics (Springer) (GG).H. Gibson, International Finance: Exchange Rates and Financial Flows in the International Financial System (Longman) (HG).S. I. Greenbaum and A. V. Thakor, Contemporary Financial Intermediation (Elsevier) (GT).J. Madura, International Financial Management (South-Western) (JF).R. Mayntz (ed), Crisis and Control: Institutional Change in Financial Market Regulation (RM).R.W. Melicher and E.A. Norton, Introduction to Finance: Markets, Investments and Financial Management (Wiley)(MN).H. Minsky, Stabilizing an Unstable Economy (McGraw-Hill) (HM).K. Pilbeam, Finance and  Financial Markets (Palgrave Macmillan)(KP1).K. Pilbeam, International Finance (Palgrave Macmillan) (KP2).G. N. Gregoriou, The Banking Crisis Handbook (CRC Press) (GNG).J.C. Rochet, Why Are there So Many Banking Crises? (Princeton University Press) (JR).C. Cooper, The Origins of Financial Crises: Central Banks, Credit Bubbles and the Efficient Market Fallacy (Harriman House Publishing) (CC).M.H. Bouchet, E. Clark and B. Groslambert, Country Risk Assessment: A Guide to Global Investment Strategy (BCG).K. Alexander and R. Dhumale (eds(, Research Handbook on International Financial Regulation (RD).H. Davies and D. Green, Global Financial Regulation: The Essential Guide (Polity) (DG).H. Mandanis Schooner and M.W. Taylor, Global Bank Regulation: Principles and Policies (MST).Georges Ugeux, International Finance Regulation: The Quest for Financial Stability (GU).H. Mandanis Schooner and M. W. Taylor, Global Bank Regulation: Principles and Policies (Academic Press) (MSW).C. Jordan, International Capital Markets: Law and Institutions (Oxford University Press) (CJ).J. H. Biggs and M. P. Richardson, Modernizing Insurance Regulation (Wiley) (BR). L. Powell, Risky Business: Insurance Markets and Regulations (Independent Institute) (LP).C.W. Calomiris and S.H. Haber, Fragile by Design: The Political Origins of Banking Crises and Scarce Credit (Princeton University Press) (CH).R. Germain, Global Politics and Financial Governance (Palgrave Macmillan) (RG).E. Helleiner, S. Pagliari and H. Zimmerman, Global Finance in Crisis: The Politics of International Regulatory Change (Routledge) (HPZ).Ariel Buira (ed), The IMF and the World Bank at Sixty (AB).D. Vines and C.L. Gilbert (eds), The IMF and its Critics: Reform of the Global Financial Architecture (VG).J.C. Baker, The Bank for International Settlements: Evolution and Evaluation (JB).E. Helleiner, The Financial Stability Board and International Standards (EH).S. Gadinis, ‘The Financial  Stability Board: The New Politics of International Financial Regulation’ Texas International Law Journal (2013) (SG).N. Lyngen, ‘Basel III: Dynamics of State Implementation’ Harvard International Law Journal (2012) (NL).H. Penikas, ‘History of Banking Regulation as Developed by the Basel Committee on Banking Supervision in 1974-2014 (Brief Overview)’ Financial Stability Journal of the Bank of Spain (2015) (HP).World Bank, Guide to the World Bank (WB).M. Goldman, Imperial Nature: The World Bank and Struggles for Social Justice in the Age of Globalization (MG).D.A. Phillips, Reforming the World Bank: Twenty Years of Trial and Error (DP).H. Stein, Beyond the World Bank Agenda: An Institutional Approach to Development (HS).C. Weaver, Hypocrisy Trap: The World Bank and the Poverty of Reform (CW).Brookings Institution, The WTO and GATT: A Principled History (BI).G.P. Sampson, The Role of World Trade Organization in Global Governance (GS).M. Matsushita, T.J. Schoenbaum and P.C. Mavroidis, The World Trade Organization: Law, Practice and Policy (MSM).C. VanGrasstek, The History and Future of the World Trade Organization (CV).R. Peet, Unholy Trinity: The IMF, World Bank, and WTO (RP).N. Woods, The Globalizers: The IMF, the World Bank, and their Borrowers (NW).J.M. Boughton, Is There a Future for International Monetary Coordination? (JB).J. Frenkel and M. Goldstein, Functioning of International Monetary System (FG).P.R. Masson (ed), Currencies, Crises, Fiscal Policy and Coordination (PM).D. Salvatore, ‘The International Monetary System: Past, Present and Future’ Fordham Law Review (1994) (DS).J.B. Taylor, International Monetary Policy Coordination: Past, Present and Future (JT1).J.B. Taylor, ‘International Monetary Coordination and the Great Deviation’ Journal of Policy Modeling (2013) (JT2).P.A. Verdier, ‘The Political Economy of International Financial Regulation’ Indiana Law Journal (2013) (PV).G. Corsetti, P. Pesenti and N. Roubini, What Caused the Asian Currency and Financial Crisis? (National Bureau of Economic Research) (CPR).B. Michhala (ed), Ten Year After: Revisiting the Asian Financial Crisis (Woodrow Wilson International Center for Scholars) (BM).S. Kim and M. Haque, ‘The Asian Financial Crisis of 1997: Causes and Policy Responses’ Multinational Business Review (2002) (KH).Peterson Institute, The Political Economy of the Asian Financial Crisis (PI).W.T. Woo, J. Sachs and K. Schwab (eds), The Asian Financial Crisis: Lessons for Resilient Asia (MIT Press) (WSS).Yu-Fu Chen, Michael Funke, and Nicole Glanemann, A Soft Edge Target Zone Model: Theory and Application to Hong Kong (Scottish Institute for Research in Economics) (CFG).Priscilla Chiu, Hong Kong’s Experience in Operating the Currency Board System (Hong Kong Monetary Authority) (PC).East Asian Institute, Money and Finance in Hong Kong: Retrospect and Prospect (World Scientific)(EAI).H. Genberg and C.H Hui, The Credibility of the Link from the Perspective of Modern Financial Theory (Hong Kong Monetary Authority) (GH).J. Greenwood, Hong Kong’s Link to the US Dollar: Origins and Evolution (Hong Kong University Press)(JG).K. Li, ‘Weakness in HK Currency Board System and Trading Opportunities in Betting a De-Peg of the Hong Kong Dollar’ International Finance and Banking (2017) (KL1).K.W. Li, The Hong Kong Economy: Recovery and Restructuring (McGraw-Hill) (KL2).Ho Yin Tsoi, ‘Should Hong Kong Maintain a Linked Exchange Rate System?’ Lingnan Journal of Banking Finance, and Economics (2015) (HT). J. Yam, The Future of the Monetary System of Hong Kong (Institute of Global Economics and Finance, Chinese University of Hong Kong) (JY).K. Gallagher et al, Capital Account Liberalization in China: A Cautionary Tale (https://www.bu.edu/pardeeschool/files/2014/11/China-Capital-Account-Policy-Brief.pdf )(KG).C. Lo, The Renminbi Rises (Palgrave Macmillan) (CL).", "terms": {"2020-21 Term 1": {"--LEC (3602)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [4], "locations": ["Cheng Yu Tung Building LT5"], "instructors": ["Professor MUSHKAT Miron"], "meetingDates": ["10/9", "17/9", "24/9"]}}, "2021-22 Term 1": {"--LEC (3334)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [4], "locations": ["Cheng Yu Tung Building LT5"], "instructors": ["Professor MUSHKAT Miron"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Attendance": "8", "Essays": "40", "Project": "40", "Participation": "12"}}, {"code": "5435", "title": "Government Relations, Diplomacy and Ethics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy.", "description": "The course provides students with understanding of policy and government landscape and analysis of how organizations which operate across geographic boundaries can develop a consistent approach to Government Relations and Partnership Agreement strategies while ensuring the approach adopted is in accordance with the nuances of the different structures and processes on the ground. The course also will examine theories and case examples of political and regulatory advocacy projects to help students develop strategies and skills to organise and implement campaigns.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5501", "title": "Public Policy in Hong Kong", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy.", "description": "With regard to Hong Kong as major case, the course will focus on and analyze the policy rationales and arguments put forward by the government, and the interaction between the administration and other stakeholders, including legislature, NGO, media and political parties. The course will also discuss the rising difficulties of the government in getting policy consensus from the general public and Legislative Council by illustrating intensive disputes of institutional reform, poverty problem, environment issues, and housing policies in Hong Kong.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5801", "title": "Topical Studies in Public Policy I", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "This course provides an in-depth analysis of important topics in public policy and government administration. Examples of these topics involve democratic governance, political sociology, social policy & welfare in Hong Kong & East Asia, political & economic transition in China, and program evaluation, etc. The topics of the course may vary according to the area of expertise of the instructor and the interest of the class.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5802", "title": "Topical Studies in Public Policy II", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "This course provides an in-depth analysis of important topics in public policy and government administration. Examples of these topics involve democratic governance, political sociology, social policy & welfare in Hong Kong & East Asia, political & economic transition in China, and program evaluation, etc. The topics of the course may vary according to the area of expertise of the instructor and the interest of the class.", "outcome": "1) To acquire basic understandings of a public policy topic or issue. 2) To be able to analyze public policy issues in selected topics.", "syllabus": "Lectures will be given on the topics as follows:1) Introduction2) A systems approach to political environment of public policy3) Regime Types and Political Systems4) Political Executives and Political Leaders5) The Assemblies6) Political Parties7) Interest Group and Media8) The General Public: Changing popular political culture9) Subnational Politics– Central-Local relations", "required_readings": "Almond, G.A. et al. 2002. Comparative Politics: A Theoretical Framework, 4th ed., New York, Pearson Longman. Blondel, J. 1995. Comparative Government, 2nd Edition, London, Prentice-Hall. Heywood, A. 2002. Politics, 2nd Edition, Palgrave Macmillan. Miners, N.J. 1998. Government and Politics of Hong Kong, Hong Kong, Oxford University Press. Lam, W.M., Lui, P.L.T., Wong, W. and Holliday, I. 2010. Eds. Contemporary Hong Kong Politics” Governance in the Post-1997 Era. Hong Kong, Hong Kong University Press. Scott, I. 2010. The Public Sector in Hong Kong: Government, Policy and People. Hong Kong, Hong Kong University Press. Ranney, 1996. Governing: An Introduction to Political Science, 7th edition, New Jersey, Prentice-Hall. Saich, T. 2011. Governance and Politics of China, 3rd edition, Palgrave Macmillan. Wang, J.C.F. 2002. Contemporary Chinese Politics: An Introduction, 7th Edition, Prentice-Hall  Internation, Inc.", "recommended_readings": "", "terms": {"2021-22 Term 2": {"--LEC (3306)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [2], "locations": ["Cheng Yu Tung Building LT4"], "instructors": ["Professor LO Wing Hung Carlos"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Examination": "50", "Homework or assignment": "20", "Presentation": "20", "Participation": "10"}}, {"code": "5803", "title": "Topical Studies in Public Policy III", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy.", "description": "This course provides an in-depth analysis of important topics in public policy and government administration. Examples of these topics involve democratic governance, political sociology, social policy & welfare in Hong Kong & East Asia, political & economic transition in China, and program evaluation, etc. The topics of the course may vary according to the area of expertise of the instructor and the interest of the class.", "outcome": "1) To acquire basic understandings of a public policy topic or issue.\r 2) To be able to analyze public policy issues in selected topics.", "syllabus": "Please refer to course outline to be distributed in the first class.", "required_readings": "Please refer to course outline to be distributed in the first class.", "recommended_readings": "Please refer to course outline to be distributed in the first class.", "terms": {"2020-21 Term 1": {"--LEC (3766)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [3], "locations": ["Cheng Yu Tung Building LT4"], "instructors": ["Professor TAM Kam Lan Annie"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12", "9/12"]}}, "2021-22 Term 1": {"--LEC (3232)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [3], "locations": ["Cheng Yu Tung Building LT4"], "instructors": ["Professor TAM Kam Lan Annie"], "meetingDates": ["8/9", "15/9"]}}}}, {"code": "5804", "title": "Topical Studies in Public Policy IV", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy.", "description": "This course provides an in-depth analysis of important topics in public policy and government administration. Examples of these topics involve democratic governance, political sociology, social policy & welfare in Hong Kong & East Asia, political & economic transition in China, and program evaluation, etc. The topics of the course may vary according to the area of expertise of the instructor and the interest of the class.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5901", "title": "Directed Studies", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Independent Study", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy.", "description": "Research on an approved topic under individualized guidance and supervision of a Programme teaching staff, culminating in an individual research paper. The paper is usually expected to be based on a research project that integrates the theory and practice of public policy, with the use of appropriate research methods. Students taking this course should first obtain the teacher’s consent.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]