[{"code": "5001", "title": "Global Health", "career": "Postgraduate - Research", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "The global nature of public health issues across the domains of practice are of growing importance. Chronic disease problems such as obesity and its consequences as well as communicable diseases such as HIV/AIDS, malaria and TB are of international concern. So too are the health effects of international policies and trade agreements. In addition, public health has a key role to play in disasters such as earthquakes, floods and Tsunami. This course will enable a deeper understanding of a global perspective to non –and communicable disease; the inequalities between nations; the impact of the wider environment on health; response to disasters; the role of international bodies.", "outcome": "Student should be able to: 1. Gain awareness of issues in global human health and security 2. Understand major measurements of the health of population and its determinants 3. Have the ability to interpret the reasons for health changes and variations of the world and its nations 4. Obtain skills in accessing, compiling and presenting the health situation of any country 5. Shape an evidence based world view and to be able to engage in debates in global health issues.", "syllabus": "   Overview of Global Health: Basic Concepts and Principles  Definitions of health/global health Determinants of health Health and population transitions Concept of demography and development Approaches to measuring health     Global health Challenges: Disaster and Humanitarian Assistances  Definition of disasters Different types of disasters Health impacts of disasters     Global Health Challenge: Environmental Concerns  Climate change Waste-hazards Indoor/outdoor air-pollution     Global Health Challenge: Non-Communicable Diseases  Definitions and global trends of NCDs (such as hypertension, diabetics, cancer) The case of injuries     Global health Challenges:  Migrants population  Injury     Child and Adolescent Health - global and local challenges   Global Health Challenge: Communicable Diseases  Disease eradication Neglected tropical diseases HIV/AIDs & TB The relationship of nutrition and communicable diseases     Country Development and Health:  Global public good Challenges of cross-border collaborations/governance The global health actors MDGs & post-2015 agendas    ", "required_readings": " Merson MH, Black RE & Mills A (2006) International Public Health:  Diseases, Programs, Systems, and Policies.  2nd Edition. Jones and Bartlett Publishers. Sudbury, Massachusetts.Selected articles of relevant topics will be distributed before classes", "recommended_readings": " Koop CE, Pearson CE & Schwarz MR (2001). Critical Issues in Global Health. Jossey-Bass. A Wiley Company. The World Bank (2004). The Millennium Development Goals for Health: Rising to the Challenges.", "terms": {"2020-21 Term 1": {"--LEC (3223)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Mr ZHOU Yitao, \n\rMs. SO Tsz Ning Cherryline, \n\rMs. TANG Hoi Ying Dior, \n\rProfessor CHAN Ying Yang Emily"], "meetingDates": ["07/09/2020 - 12/10/2020"]}}, "2021-22 Term 1": {"--LEC (1308)": {"startTimes": ["18:30", "9:30"], "endTimes": ["21:30", "12:30"], "days": [3, 6], "locations": ["Prince of Wales Hospital", "TBA"], "instructors": ["Professor CHAN Ying Yang Emily, \n\rProfessor CHUNG Pui Hong, \n\rProfessor HUNG Kei Ching Kevin", "Professor CHAN Ying Yang Emily, \n\rProfessor CHUNG Pui Hong, \n\rProfessor HUNG Kei Ching Kevin"], "meetingDates": ["29/9", "6/10", "13/10", "20/10", "2/10", "9/10", "16/10", "23/10", "30/10"]}}}, "assessments": {"Essays": "40", "Examination": "60"}}, {"code": "5003", "title": "Remote and Rural Health", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "This module examines the several aspects relating to rural and remote health such as inequity and inaccessibility to healthcare; ethnic minority and indigenous health; cases studies of rural and remote health programmes in low, middle and high income countries.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5004", "title": "Global Reproductive Health", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg student under School of Public Health:;- Master of Public Health / Postgraduate Diploma in Public Health;- MSc/PgD in Epidemiology and Biostatistics;- MSc/PgD in Health Services Management.", "description": "The purpose of this class is to examine reproductive health issues, services, programs, and policies from an international perspective. The course content will include social, environmental, economic, behavioral, and political factors that affect fertility, and pregnancy outcome, reproductive health, and family planning in developed and developing countries. The course will have four areas of focus: (1) reproductive health issues and trends; (2) interventions and programs to improve reproductive health; (3) measurement and interpretation of reproductive indices; (4) policies that affect reproductive health and health care provision.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5005", "title": "Global Child & Adolescent Health", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "The purpose of this class is to examine child and adolescent health in developed and developing countries. Biomedical, socio-medical, behavioural, economic and political factors affecting child and teen health will be systematically explored. Health services and health education for children and adolescents will also be addressed.", "outcome": "Student should be able to:  1. Apply public health principles to child and adolescent health  2. Examine and discuss issues that affect health outcomes on children and teens. Some of these key issues include vaccination, education, breast-feeding, screening for high-risk behaviors, anticipatory guidance  3. Understand and describe provision of health services to children and young people", "syllabus": "   Introduction to Child and Adolescent Public Health, Measuring mortality and morbidity, Social Determinants of Health             Global strategies to reduce child mortality from infectious diseases         Adolescent Health (Reproductive health;  risk-taking behaviour, addictions, mental health)         Breastfeeding in Hong Kong and globally. (Baby Friendly Hospital Initiative, the International Code of Marketing of Breastmilk Substitutes)               Global Status of Child Injuries         Nutrition, Growth and Obesity         Vaccines, Immunisations and the Global Vaccine Action Plan         Human Rights and Child Health        ", "required_readings": "   Blair, M., Stewart-Brown, S., Waterson, T., & Crowther, R.  Child Public Health. Oxford University Press (2003)   Selected references to be distributed before classes  ", "recommended_readings": "", "terms": {"2020-21 Term 3": {"--LEC (1066)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["Prince of Wales Hospital"], "instructors": ["Ms. SO Tsz Ning Cherryline, \n\rMs. TANG Hoi Ying Dior, \n\rProfessor Edmund Anthony Severn NELSON"], "meetingDates": ["8/4", "15/4", "22/4", "29/4", "6/5", "13/5", "20/5", "27/5"]}}, "2021-22 Term 2": {"--LEC (2859)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor Edmund Anthony Severn NELSON"], "meetingDates": ["20/1", "27/1"]}}}, "assessments": {"Essays": "30", "Presentation": "40", "Participation": "10", "Test or quiz": "20"}}, {"code": "5006", "title": "Disaster and Humanitarian Crisis", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "Disaster and humanitarian responses are crucial elements in public health practices. Humanitarian relief actions often highlight the importance of mitigation, preparedness, training and multidisciplinary collaborative response within and beyond the health and medical sector. This course offers an overview of the disaster management cycle and the public health and medical implications of disaster and humanitarian crisis. It aims to show how public health principles may be applied in disaster relief and how evidence-based health related humanitarian actions can be planned, implemented and evaluated.", "outcome": "After this course, the students will be able to: 1. understand and identify key health and medical implications in humanitarian settings; 2. apply public health principles in disaster response and humanitarian settings; 3. gain an overview of the disaster management cycle and its respective planning in humanitarian settings; 4. devise disaster risk reduction strategies for disaster management programs to respond to population needs in disaster and humanitarian relief settings.", "syllabus": "   Public health & Humanitarian Principles in Disaster Settings   Management of Natural and Man-made Hazards & Complex Emergencies    Lessons from Great East Japan Earthquake -Challenge in Addressing Complexity of Fukushima   SPHERE Standard&Case discussion  (1)- The Rohingya refugee crisis in Bangladesh / Myanmar   21st Century Challenge in Disaster and Humanitarian System     Responding to Medical and Health Needs in Disaster    Preparation of Simulation Exercise   Humanitarian Crisis: Simulation Exercise   International Policy in Risk Reduction   Case discussion (2) Fukushima Daiichi: The Path to Nuclear Meltdown   ", "required_readings": "   Book: Chan, E.Y.Y., 2017. Public health humanitarian responses to natural disasters. London: Routledge. Available from: https://www.routledge.com/products/9781138953703 Bradt, D. A. 2009. Evidence-based Decision-making in Humanitarian Assistance. Humanitarian Practice Network Paper, 67. London: Humanitarian Practice Network.  Chan, E.Y.Y., Murray, V. 2017. What are the health research needs for the Sendai Framework? The Lancet. Available from: http://www.sciencedirect.com/science/article/pii/S0140673617316707 Checchi, F., Gayer, M., Grais, R. F., & Mills, E. J. 2007. Public Health in Crisis-affected Populations: A Practical Guide for Decision-makers. Humanitarian Practice Network Paper, 61. London: Humanitarian Practice Network.  Guha-Sapir, D., Hoyois, P., Below, R.. 2014. Annual Disaster Statistical Review 2014: The Numbers and Trends. CRED. Brussels: CRED.  Lo S.T.T., Chan E.Y.Y.,, Chan G.K.W., Murray V, Abrahams J, Ardalan A, Kayano R, Chung J.W.Y. 2017. Health Emergency and Disaster Risk Management (Health-EDRM): developing the research field within the Sendai Framework paradigm. Int J Disaster Risk Sci. 2017. Available from: https://link.springer.com/article/10.1007%2Fs13753-017-0122-0 United Nations Office for the Coordination of Humanitarian Affairs. 2012. OCHA on Message: Humanitarian Principles. Available from: https://docs.unocha.org/sites/dms/Documents/OOM-humanitarianprinciples_eng_June12.pdf Twigg, J. 2015. Good Practice Review 9: Disaster Risk Reduction. London: Overseas Development Institute. Available from: http://goodpracticereview.org/wp-content/uploads/2015/10/GPR-9-web-string-1.pdf   ", "recommended_readings": "Castleden, M., McKee, M., Murray, V., Leonardi, G. 2001. Resilience Thinking in Health Protection. Journal of Public Health, 33(3), pp. 369-377. Chan, E.Y.Y. 2013. Bottom-Up Disaster Resilience. Nature Geoscience, 6, pp. 327-328.Available from: http://www.nature.com/ngeo/journal/v6/n5/pdf/ngeo1815.pdf Doocy, S., et al. 2013. The Human Impact of Tsunamis: a Historical Review of Events 1900-2009 and Systematic Literature Review. PLOS Currents Disasters. Doocy, S., et al. 2013. The Human Impact of Volcanoes: a Historical Review of Events 1900-2009 and Systematic Literature Review. PLOS Currents Disasters. Doocy, S., et al. 2013. The Human Impact of Floods: a Historical Review of Events 1980-2009 and Systematic Literature Review. PLOS Currents Disasters. Doocy, S.,et al. 2013. The Human Impact of Earthquakes: a Historical Review of Events 1980-2009 and Systematic Literature Review. PLOS Currents Disasters. IASC Reference Group for Mental Health and Psychosocial Support in Emergency Settings.2010. Mental Health and Psychosocial Support in Humanitarian Emergencies: What ShouldHumanitarian Health Actors Know?. Geneva: IASC.Available from: http://www.who.int/mental_health/emergencies/what_humanitarian_health_actors_should_know.pdf Inter-Agency Standing Committee (IASC). 2007. IASC Guidelines on Mental Health and PsychosocialSupport in Emergency Settings. Geneva: IASC.Available from: http://www.who.int/mental_health/emergencies/guidelines_iasc_mental_health_psychosocial_june_2007.pdf", "terms": {"2020-21 Summer Session": {"--LEC (1010)": {"startTimes": ["12:00"], "endTimes": ["12:00"], "days": [1], "locations": ["TBA"], "instructors": ["Mr. CHIU Cheuk Pong, \n\rProfessor CHAN Ying Yang Emily"], "meetingDates": ["28/6"]}}, "2021-22 Term 2": {"--LEC (3114)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [6], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor CHAN Ying Yang Emily"], "meetingDates": ["12/2"]}}, "2021-22 Summer Session": {"--LEC (1117)": {"startTimes": ["9:30", "9:30", "9:30", "9:30"], "endTimes": ["17:30", "17:30", "17:30", "17:30"], "days": [4, 2, 1, 3], "locations": ["TBA", "TBA", "Prince of Wales Hospital", "TBA"], "instructors": ["Professor CHAN Ying Yang Emily", "Professor CHAN Ying Yang Emily", "Professor CHAN Ying Yang Emily", "Professor CHAN Ying Yang Emily"], "meetingDates": ["7/7", "5/7", "4/7", "6/7"]}}}, "assessments": {"Essays": "45", "Presentation": "45", "Participation": "10"}}, {"code": "5007", "title": "Demography and Health", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg student under School of Public Health:;- Master of Public Health;- MSc/PgD in Epidemiology & Biostatistics; - MSc/PgD in Health Services Management;- PgD in Public Health", "description": "A survey course on demographic methods for application to public health. The course will survey methods in fertility, mortality and migration analysis to assist future global health workers in population policy. Demographic modeling and software will be introduced", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5008", "title": "Global Health Policy", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg students under School of Public Health", "description": "This course aims to provide an overview of global health policy, the area of public health concerned with decisions of policies that translate empirical and epidemiological evidence and political will into consensus and interventions in a global scale. Throughout the course, topics of global health policy will also be explored using the lens of public health ethics and justice.", "outcome": "Student should be able to: Learn about the history and development of globalization, the foundational concepts and frameworks of global health policy, governance, justice, and the right to health Understand the key concepts of poverty and social determinants of global health inequalities Learn about the foundations of health demography, especially the impact of demographic dynamics of urbanization and migration on global health and policies; Understand the financing of political economy of global health, and the multi-lateral foreign aid and corruption relevant to global health programs; Understand the impact of globalization on food security; Understand the global health policy’s responses to world’s rare and neglected diseases", "syllabus": "   Introduction to Global Health Policy and Justice   Poverty, Development, and Health Equity   Health Demography: Urbanization and Migration   Global Health Financing: Multi-lateral Foreign AidIn-class Quiz   Globalization and Food Security   Global Health Policy for Rare and Neglected Diseases   Global Pandemic PoliciesIn-class Quiz   Group Presentation  ", "required_readings": "There is no required reading.", "recommended_readings": "Brown GW, Yamey G, Wamala S, eds. The handbook of global health policy. Wiley Blackwell, UK; 2014.", "terms": {"2021-22 Term 2": {"--LEC (1232)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor CHUNG Roger Yat Nork"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Presentation": "40", "Test or quiz": "60"}}, {"code": "5011", "title": "Food Security : Local and Global Perspectives", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "Despite the advancement in economic development and food technology, there are people living without the basic supply of sufficient and clean foods require for their physiological well-being. The World Food Summit of 1996 defined food security as existing “when all people at all times have access to sufficient, safe, nutritious food to maintain a healthy and active life”. This course introduces the factors affecting the sustainability of the contemporary food systems at both local and global perspectives. Areas including technological advancement, economic drive, political stability, as well as socio-cultural influences will be analyzed critically as insights to tackle the challenge of future food crisis.", "outcome": "After completing this course, students should be able to: 1. Understand the principles and issues of emergency risk communication in disaster and humanitarian settings 2. Demonstrate a strong awareness of various communication models in different phases of emergency management 3. Realize the challenges and opportunities to engage media in disaster programmes 4. Reflect on partnership and timely engagement with the public in crisis 5. Conceptualize and apply the knowledge to develop an effective communication strategy in disaster and humanitarian crisis", "syllabus": "   Introduction to food security   Food system in the 21st century   Factors influencing the food system   Food security in different settings       Impact of food security on human’s health   Global standards in food security and food safety   Global efforts to achieve food security   Ensuring food safety to promote food security  ", "required_readings": " World food security: a history since 1945 / D. John Shaw FAO The State of Food Insecurity in the World Food safety : the science of keeping food safe / Ian C. Shaw The food system a guide / Geoff Tansey & Tony Worsley Food security and global environmental change / edited by John Ingram, Polly Ericksen, and Diana Liverman Global food security: emerging issues and economic implication / Munir A. Hanjra Food economics: industry and markets / Munir A. Hanjra Food Security and farm and protection in China  / Mao Yushi, Zhao Nong, Yang Xiaojing Public health nutrition / edited on behalf of the Nutrition Society The politics of land and food scarcity / Paolo De Castro Hygiene in food processing : principles and practice / edited by H.L.M. Lelieveld, J.T. Holah and D. Napper Food & drink : good manufacturing practice : a guide to its responsible management HACCP / Sara Mortimore and Carol Wallace ; compiling editor, Christos Cassianos The ISO 9000 quality system : applications in food and technology Food hygiene, microbiology and HACCP / S.J. Forsythe and P.R. HayesFood safety in China : a comprehensive review / Linhai Wu, Dian Zhu", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (1879)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Dr. YUNG Ka Chun, \n\rMs. SO Tsz Ning Cherryline, \n\rMs. TANG Hoi Ying Dior"], "meetingDates": ["11/01/2021 - 08/02/2021"]}}, "2021-22 Summer Session": {"--LEC (1094)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [1], "locations": ["Prince of Wales Hospital"], "instructors": ["Dr. YUNG Ka Chun"], "meetingDates": ["14/3", "21/3", "28/3", "4/4"]}}}, "assessments": {"Essays": "30", "Presentation": "30", "Test or quiz": "40"}}, {"code": "5012", "title": "Emergency Risk Communication in Disaster and Humanitarian Crisis", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "In a crisis, every word counts. The need to communicate risks as accurate as possible in a timely manner arises as much from public expectation as professional need. Communication not only helps build resilience of the community but also prevent disease, disability and death, and restore dignity of the people facing disasters. This course offers theoretical and practical framework of effective advocacy and emergency risk communication in an evolving media landscape, and covers cases ranging from outbreaks to natural disasters in humanitarian settings.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5013", "title": "Global Health Perspectives of Humanitarian Crisis & Human Security", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "Human security is an emerging paradigm in the global healthcare community that can be applied to guide local and global public health practices. It can also provide a basis to link up related themes under the United Nations Sustainable Development Goals (SDGs). Through various real-life case studies and practical applications, this course will provide participants with an understanding of how the human security and health security concepts are applied in public health practices, especially under emergencies and disasters. The challenges with putting the human security concept into operation will also be explored.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5014", "title": "Research Methodology for Disaster and Medical Humanitarian Response", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "Pre-requisite: EPID5001", "description": "Participants will receive technical training in research study to address public health needs of populations affected by catastrophic events and in resource-poor settings. On completing the course, the participants will understand the principles of planning, implementing, and disseminating research in the context of disaster and humanitarian settings. It aims to show how public health and research principles can be applied.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6801", "title": "Field Action Lab", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "LaboratoryLecturePracticum", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "This is a practicum course aims at providing a unique opportunity for students to gain familiarity with public health practice. Practicum experience allows students to integrate and apply the knowledge and skills they learned through coursework and prior experiences in a public health environment. Students are required to complete an approved public health practice related practicum (single or combined experience) in a variety of settings, including rural field trip, governmental and non-governmental health agencies, academic institutions, or community settings under the supervision of site administrators (mentors/ practicum supervisors) and the guidance from the School of Public Health and Primary Care. Students will be involved in project planning, field-based health needs assessment, health intervention, project evaluation and report writing during the field practicum.", "outcome": "Students will be able to: 1. gain familiarity with public health practices in programs planning, policies, and service delivery settings.  2. apply public health theories and concepts into practices in the community 3. use it as a recommended background course for practices-based Capstone.", "syllabus": "   Introduction of field action laboratory.Project planning and evaluation    Introduction of potential field sites   Field project management    Medical and health aspects of field based project & Humanitarian operations   Guidelines writing and  review reports  ", "required_readings": "Chan EYY. Building bottom-up health and disaster risk reduction programmes. Oxford University Press. 2017", "recommended_readings": "", "terms": {"2020-21 Term 3": {"--LEC (1201)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor CHAN Ying Yang Emily, \n\rProfessor HUNG Kei Ching Kevin"], "meetingDates": ["12/04/2021 - 14/06/2021"]}}, "2021-22 Term 3": {"--LEC (1037)": {"startTimes": ["9:30"], "endTimes": ["12:30"], "days": [6], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor CHAN Ying Yang Emily, \n\rProfessor HUNG Kei Ching Kevin"], "meetingDates": ["20/11", "27/11", "4/12", "11/12"]}}}, "assessments": {"Essays": "30", "Presentation": "30", "Project": "40"}}]