[{"code": "5001", "title": "Method and History of Religious Studies", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "LectureSeminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies or Master of Divinity", "description": "This course will be built around readings concerning methodology and history of the discipline of the “History of Religions”. Study of selected figures and methodological approaches to religions, including phenomenological, psychological, structural, hermeneutical and sociological methods, will also be covered. The purpose of this course is to acquaint students with a sophisticated knowledge of the theories and methods in research on different forms of religious manifestations.", "outcome": "- Become well-versed in the theoretical vocabulary of the field of religious studies; - Deepen understanding of key theories, methods, concepts and issues in the academic study of religion; - Reflect on the relationship between religion and the human condition; - Engage in critical analysis of religious phenomena using the perspectives of key theories and methods in the academic study of religion; - Develop a critical yet sympathetic attitude in discussing religious phenomena", "syllabus": " A Point of Departure  : Jonathan Z. Smith. “Religion, Religions, Religious” in Critical   Terms for Religious Studies, Edited by Mark C. Taylor, Chicago, University of Chicago Press, 1998, pp. 269-284.       2.     Introduction to the Study of Religion                    Reading: Pals. Nine Theories of Religion, “Introduction”, pp. 1-14 3.     Animism and Magic: E. B. TYLOR AND J. G. FRAZERReading: Pals. Nine Theories of Religion, Ch. 1, pp. 15-48 4.     Religion and Personality: SIGMUND FREUDReading: Pals. Nine Theories of Religion, Ch. 2, pp. 49-80 5.    Society as Sacred: ÉMILE DURKHEIMReading: Pals. Nine Theories of Religion, Ch. 3, pp. 81-112 6.     Religion as Alienation: KARL MARXReading: Pals. Nine Theories of Religion, Ch. 4, pp. 113-142 7.     A Source of Social Action: MAX WEBERReading: Pals. Nine Theories of Religion, Ch. 5, pp. 143-184 8.     The Verdict of Religious Experience: WILLIAM JAMESReading: Pals. Nine Theories of Religion, Ch. 6, pp. 185-226 9.     The Reality of the Sacred: MIRCEA ELIADEReading: Pals. Nine Theories of Religion, Ch. 6, pp. 227-262 10.  Society’s “Construct of the Heart”: E. E. EVANS-PRITCHARD Reading: Pals. Nine Theories of Religion, Ch. 7, pp. 263-292 11.   Religion as Cultural System: CLIFFORD GEERTZ              Reading: Pals. Nine Theories of Religion, Ch. 8, pp. 293-324 12.   ConclusionReading: Pals. Nine Theories of Religion, “Conclusion”, pp. 292-323 13.   Post-script : James Murphy. “Beyond ‘Religion’ and ‘Spirituality’: Extending a ‘Meaning Systems’ Approach to Explore Lived Religion” in Archive for the Psychology of Religion (2017) 1-26. REMARKS: The syllabus and assessment type may vary depending on the teaching staff. ", "required_readings": "Basic text:     Daniel L. Pals. Nine Theories of Religion. 3rd Ed. Oxford: Oxford University Press, 2015.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (1979)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor James D FRANKEL"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2021-22 Term 1": {"--LEC (4304)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Esther Lee Bldg 304"], "instructors": ["Professor James D FRANKEL"], "meetingDates": ["8/9", "15/9"]}}}, "assessments": {"Essays": "50", "Presentation": "30", "Participation": "20"}}, {"code": "5005", "title": "Theories of Religious Studies", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students of MA in Religious Studies, Master of Divinity", "description": "From the establishment of the sociological endeavor, the study of religion has been central to the understanding of modern societies. This course will continue in this tradition by surveying the interactions between religion and society while developing the sociological and Anthropological approach to the study of religion as a social institution. In particular, we will look at the ways in which religion is transformed by, and plays a role in the transformation of, a global society. This course is designed to give students tools and concepts with which to understand the social organization of religion and the role of religion in society. We will focus on classical and emerging themes in the field, and analyze case studies that relate to them. Students will: -learn how religion is shaped by and, in turn, shapes the larger social field in which it exists;-become familiar with the dynamics of secularization, ecological theories, and other developments;-develop an understanding of the ways in which religion interacts with other social institutions such as the state and economy, and culture. ", "outcome": "Knowledge Outcomes: - Upon completion of the subject, student will be able to  - Understand the establishment of knowledge of Religious Studies and research ethics;  - Learn the key writers on Religious Studies;  - Understand the key theories of Religious Studies in classical themes;  - Learn the major issues in the field of Religious Studies in contemporary scholarship;  - Develop the critical thinking on the debates regarding religious diversity, migration and religion, religious movement and so on.", "syllabus": "Introduction and Overview  The Construction of a Subject  Foundation and Methods I: Foundation II: Economics and Religion Foundation II: Economics and Religion Secularization Individuals, Rituals, and Practices Religion and Gender Organizations and Collectivities  Migration and Religion Religion and Social Change (in Chinese Society) Religion and the Public  Urban and Ecological Approach", "required_readings": "• Robert A.Orsi,\"Snakes Alive: Resituating the Moral in the Study of Religion\", In Face of the Facts: Moral Inquiry in American Scholarship, Cambridge: Cambridge University Press, 1998, Pages: 201-226. • Clifford Geertz, \"Religion as a Cultural System,” Interpretation of Cultures, New York: Basic Book, 1973, Pages: 87-125. • Emile Durkheim, \"Introduction and Chapter 1\", Elementary Forms of Religious Life, Oxford: Oxford University Press, 2001. • 黎志添：<導論：宗教研究的歷史舆方法>，《宗教研究舆詮释學》。香港：香港中文大學出版社，2003，頁1-12。 • Max Weber, The Protestant Ethic and the Spirit of Capitalism, New York: W.W. Norton & Co, 2009. Chapter 4 and 5.  • Peter Berger, \"Chapters 1-4\", The Sacred Canopy, New York: Garden City, 1967, Pages: 3-101. • Jose Casanova, \"Chapters 1 and 2\", Public Religions in the Modern World, Chicago: University of Chicago, 1994.  • James Beckford, \"Accounting for conversion\", British Journal of Sociology 29:2（1978）249-262.  • 譚偉倫，<中國地方宗教儀式>，《中國地方宗教儀式論集》。譚偉倫主編。香港：香港中文大學崇基學院宗教與中國社會研究中心，2011，頁1-15。 • Janet Jacobs, \"Women, Ritual and Secrecy: The Creation of Crypto-Jewish Culture,\" JSSR, 35. 2 (1996) 97-108.  • Saba Mahmood. “Feminist Theory, Embodiment, and the Docile Agent: Some reflections On the Egyptian Islamic Revival.” Cultural Anthropology 16.2 (2001): 202-236. • Stephen Warner, \"The Place of the Congregation in the Contemporary American Religious Configuration\", American Congregations, Chicago: University of Chicago Press, 1994. Pp. 54-99.  • Eileen Barker, \"New Religious Movements: Their Incidence and Significance\", New Religious Movements: Challenge and Response, London: Routledge, 1999. • Zhe JI. \"Buddhist Institutional Innovations\" in Modern Chinese Religion II: 1850-2015. Pp. 731-766.  • Stephen Warner and Judith Wittner, eds. Gatherings in the Diaspora: Religious Communities and the New Immigration. Philadelphia: Temple University Press, 1998.  • Vincent Goossaert and David Palmer. The Religious Question in Modern China. Chicago: University of Chicago Press, 2010.  • Richard Madsen, Democracy's Dharma: Religious Renaissance and Political Develpment in Taiwan, Berkeley: University of California Press, 2007. • Ammernam, Studying congregations: a new handbook, Nashville : Abingdon Press, 1998.", "recommended_readings": "• Max Weber, \"Chapters 1-4\", The Sociology of Religion, Boston : Beacon Press,1993, Pages: 1-59. • Nancy Ammerman, Bible Believers: fundamentalists in the modern world, London: Rutgers University Press, 1987.  • Peter Berger, \"Chapters 5-7\", The Sacred Canopy, New York: Garden City, 1967, Pages: 105-174.  • Bryan Wilson, Religion in Secular Society，London: Watts, 1966. • Ortner, \"Theory in Anthropology Since the 1960's \", Comparative Studies in Society and History 26:1(1984) 126-166.  • Robert Wuthnow, The Restructuring of American Religion, Princeton: Princeton University Press, 1988. • Jody Shapiro Davie, Women in the Presence, Philadelphia: University of Pennsylvania Press,1995.  • David Martin, Pentecostalism: The World Their Parish, Oxford: Blackwell Publishers, 2002. • Robert Weller, Alternate Civilities: Democracy and Culture in China and Taiwan, Boulder: Westview Press, 1999. • 邢福增，梁家麟：《五十年代三自運動的研究》，香港：建道神學院，1996. • 邢福增，《新酒與舊皮袋：中國宗教立法與<宗教事務條例解讀>》，香港：中文大學崇基學院宗教與中國社會研究中心，2006。", "terms": {"2020-21 Term 1": {"--LEC (3243)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor HUANG Weishan"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}, "2021-22 Term 1": {"--LEC (2119)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [1], "locations": ["Hui Yeung Shing Bldg G01"], "instructors": ["Professor LAI Chi Tim"], "meetingDates": ["6/9", "13/9", "20/9", "27/9", "4/10", "11/10", "18/10", "25/10", "1/11", "8/11", "15/11", "22/11", "29/11"]}}}, "assessments": {"Essays": "70", "Presentation": "30"}}, {"code": "5115", "title": "Reading on Chinese Religious Texts", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies or Master of Divinity", "description": "This course centres on the study of the literature of the Han Dynasty which is formative of the chief religious concepts such as cosmology, anthropology and soteriology, with the aim of understanding of the principles of religious theory construction in traditional China.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5118", "title": "Studies on Chinese Buddhism", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureSeminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies or MA Buddhist Studies", "description": "This course studies major traditions in Chinese Buddhism including Chan, Pure Land, Huayen and Tiantai Buddhism. We also seek to understand the Chinese Buddhist tradition by utilizing some recent researches in the field. Some examples are the research on northern school of Chan Buddhism by John McRae and Bernard Faure, on Pure Land Buddhism by Luis Gomez and Richard Payne, on Buddhism in the Song especially Tiantai Buddhism by Peter Gregory and Daniel Getz. Secondary sources will be used together with selected primary sources to stimulate discussion in class.", "outcome": "Knowledge outcomes\r - By the end of the course, students will have basic understanding of sinicization of Chinese Buddhism; understand the ideas and ideals of the great Buddhist masters in ancient China.\r Skill outcomes\r - Students will be able to develop skills in analytical reading, formal writing and critical thinking.\r Attitude outcomes\r - Students will relate Buddhist concepts and persuasions to their ethical cultivation and views of life as well as to their coexistence with the nature.", "syllabus": "1. Course introduction/ Introduction of the development and sources \r 2. The Previous Fruitful Result of the Research of Chinese Buddhism\r 3. Introduction to Buddhism: Brief History and Major Doctrine\r 4. The Entry of Buddhism to China\r 5. The Rise of the Eight Schools of Chinese Buddhism\r 6. Chan School of Chinese Buddhist\r 7. North and South Schools of Chan Buddhism\r 8. The Belief of Pure Land\r 9. Buddhism in the Sung\r 10. The Development of the Lay Buddhism\r 11. Humanistic Buddhism in Modern World\r 12. Practices of Buddhist Rituals\r 13. Contemporary Buddhism in Hong Kong", "required_readings": "*Zürcher, Erik (1959), The Buddhist Conquest of China. The Spread and Adaptation of Buddhism in Early Medieval China, Leiden (Brill), 2 delen, vol. 1: Text, vol. 2: Notes, bibliography, indexes, (Sinica Leidensia, vol. 11).\r Chen, Kenneth K. S. (1964), Buddhism in China, a historical survey (Princeton, N.J.: Princeton University Press).\r * -------------------------- (1973) Chinese Transformation of Buddhism (Princeton Uni. Press).\r *方立天 (1988),《中國佛教與傳統文化》(上海：上海人民出版社), 頁47-94.\r *方立天 (1988),《中國佛教與傳統文化》(上海：上海人民出版社), 頁69-94.\r *中村元主編 (1984),《中國佛教發展史》上 (臺北：天華出版事業),頁238-266.\r *方立天 (1988),《中國佛教與傳統文化》(上海：上海人民出版社), 頁69-94.\r *中村元主編 (1984),《中國佛教發展史》上 (臺北：天華出版事業),頁238-266.\r 黃偉雄，〈菩提達摩在中國禪宗史的地位〉載於《國際佛學研究第二期》（1992.12出版），頁12-27。(http://ccbs.ntu.edu.tw/FULLTEXT/JR-BJ006/bj6_2_01.htm)\r 楊維中(2002)，〈從南宗與北宗心性思想的差別看禪宗的正式形成〉，載於《中國禪學》(http://www.guoxue.com/magzine/zgcx/zgcx115.htm) \r 楊維中(1999)，〈佛性與禪悟---南宗禪三系心性思想的區別〉載於《哲學雜誌》第三十期 (http://ccbs.ntu.edu.tw/FULLTEXT/JR-MISC/misc093495.htm)\r *汪娟(1992.07)，〈唐代彌勒信仰與佛教諸宗派的關係〉載於《中華佛學學報》，第五期，pp.193-231。\r *方立天(1998)，〈人生理想境界的追求─中國佛教淨土思潮的演變與歸趣〉，載《法鼓文化》，頁287-304。\r *Gregory, Peter N. and Daniel A. Getz, Jr. edit. (1999), Buddhism in the Sung (Honolulu: University of Hawaii Press), ‘Introduction’.\r *釋聖嚴﹕〈明末居士佛教〉載於《華岡佛學學報》第五期，頁11網上版﹕(http://www.chibs.edu.tw/publication/c_index.htm)\r 溫金柯：〈臺灣居士佛教的展望〉，載江燦騰、龔鵬程主編之《臺灣佛教的歷史與文化》，(台灣﹕靈鷲山般若文教基金會國際佛學文化出版社, 1994)。\r 藍吉富編：〈當代中國人的佛教研究〉，載江燦騰主編之《商鼎佛學名著選刊》（一），商鼎文化出版社, 1993。\r *Don Pittman, Toward A modern Chinese Buddhism: Taixu’s Reforms. Honolulu: University of Havai’i Press, 2001: 13-60.\r *Chandler, Stuart, ‘Buddhism in China and Taiwan: The dimensions of Contemporary Chinese Buddhism’ in Berkwitz, Stephen C. (ed.), Buddhism in World Cultures: Comparative Perspectives (Santa Barbara (US): ABC-CLIO, 2006), pp.169-194.\r 陳兵, 鄧子美﹕《二十世紀中囯佛敎》 (北京市: 民族出版社, 2000),pp.196-217.\r 林子青﹕《中國佛敎規儀》(台北: 長春樹出版社, 1988).\r *Yo, Hsiang-Chou. (2001), “Chinese Buddhist Confessional Rituals: Their Origin and Spiritual Implications” in Kalupahana, David J. edited. 2001. Buddhist thought and ritual (Delhi: Motilal Banarsidass).\r Teiser, S. F. (1988), The Ghost Festival in Medieval China (Princeton: Princeton University Press).\r *牧田諦亮﹕〈水陸法會小考〉，載楊曾文、方廣錩編﹕《佛教與歷史文化》(北京﹕宗教文化出版社，2001)。\r Stevenson, Daniel B., 'Text, Image, and Transformation in the History of Shuilu fahui, the Buddhist Rite for Deliverance of Creatures of Water and Land', in Marsha Weidner (ed.), Cultural Intersections in Later Chinese Buddhism (Honolulu: University of Hawaii Press, 2001), pp.30-70. \r *Kwong, Chungwah, The Public Role of Religion in Post-Colonial Hong Kong: An Historical Overview of Confucianism, Taoism, Buddhism, and Christianity (Asian Thought and Culture, 53; New York: Peter Lang, 2002).\r *釋永明﹕《香港佛教與佛寺》 (香港﹕寶蓮禪寺, 1993).\r 葉文意﹕〈初期的香港佛教發展史﹕ 由晚清至1937〉, 載於《法相學會集刊》, Nov., 1992.\r 高永霄﹕〈香港佛教史〉, 載於《法相學會集刊》, Nov., 1992.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (1762)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor Douglas Matthew GILDOW"], "meetingDates": ["10/9", "17/9", "24/9"]}}}, "assessments": {"Attendance": "5", "Essays": "65", "Presentation": "25", "Participation": "5"}}, {"code": "5121", "title": "Popular Religion in China", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies or Master of Divinity", "description": "Recent researches on Chinese religion show that the term “three religions” or sanjiao monastic Buddhism, priestly Daoism, and Confucian philosophy - is not adequate to describe Chinese religiosity. To subsume several thousand years of Chinese religious experience under the term of “three religions”, in effect, is to exclude the vast majority of Chinese religious behaviour. In reality, only a few elite orient their lifestyles to the Buddhist or Taoist concepts of transcendence. Over emphasis on the intellectual and spiritual world of the scholarly official, the gentry and the literate elite, overlooks religious practices and beliefs of ordinary people, the peasants and the labourers who are the majority of the Chinese population. This course studies Chinese religion from the , traditional economy and village temples of various local societies in China.perspective of local society in South China. By making use of recent ethnographical studies on China, we examine Chinese religion from a holistic approach involving the analysis of lineage", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5123", "title": "Taoist Thought", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies or Master of Divinity", "description": "This course aims to introduce the thought and doctrine of religious Taoism. Topics that constitute the essences of Taoist doctrine such as the idea of Tao, Taoist gods, Taoist cosmology, Taoist philosophy of life and nature, the value and meaning of life, the function of ritual and self-cultivation, and ethics will be surveyed. Selected issues in modern scholarship on Taoist doctrine will also be touched on.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5126", "title": "History of Taoism I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "This course studies the early and medieval histories of religious Taoism during the period from the Six Dynasties until Tang Dynasty. The important historical development of the sects of the Way of Celestial Master, the Lingbao and the Shangqiing will be covered.", "outcome": "- Acquire basic understanding of history of Taoism;  - Develop skills in analytical reading, formal writing and critical thinking;  - Relate Taoism concepts and persuasions to their ethical cultivation and views of life", "syllabus": "The syllabus and assessment type vary according to the teaching staff and year of offering. Please refer to the course outline for details.", "required_readings": "The reading list varies depending of the teaching staff and the year of offering.Please refer to the course outline for details. ", "recommended_readings": "The reading list varies depending of the teaching staff and the year of offering.Please refer to the course outline for details. ", "terms": {"2020-21 Term 1": {"--LEC (1763)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor LAI Chi Tim"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}}, "assessments": {"Essays": "60", "Presentation": "40"}}, {"code": "5127", "title": "History of Taoism II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "This course will survey the developments of religious Taoism in late imperial China. The course will focus on the rise and spread of such new Taoist movements as the Quanzhen (Complete Perfection) school and Jingming (Pure Illumination) school, as well as the continuing penetration of the Zhengyi (Orthodox Unity) school into the national politics and local society.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5129", "title": "Taoism and Chinese Culture", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies or Master of Divinity", "description": "This course aims at a general study of Taoism in Chinese cultural context. The focus is on Taoist elements and values in Chinese art, music, drama, and literature. This will allow students not only to study Taoism as one of Chinese religious traditions, but also to understand the intersections of Taoism and various aspects of Chinese culture. No prior knowledge of Taoism is assumed.", "outcome": "Knowledge: - The understanding of Taoism in the historical settings and contemporary contexts - Learn the relationship between Taoism and Chinese Culture Skills: - Communication and presentation (oral and written) skills; - Critical and analytical skills; Attitude: - A heightened sensitivity to the Taoism dimension of human life, society and culture; - An analytical capability of the plurality and complexity of religious phenomena; - A critical yet sympathetic understanding and appreciation of religious tradition of Taoism", "syllabus": " 課程介紹:從文字學了解「道」與「道德」之義 道教神仙文化與中國人的鬼神觀(一)——神的概念及信仰 道教神仙文化與中國人的鬼神觀(二)——鬼的概念與拯救 道教與中國的喪葬文化 道教與中國的養生文化 道教與士人及儒家文化 道教與「積陰德」文化 道教與文學 道教與國家管治與發展 道教與中國式的神明啟示記錄 考察課 道教與地方信仰及節慶 道教與易經及術數文化(一) 道教與易經及術數文化(二)", "required_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline).", "recommended_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline). [日]小林正美：《中國的道教》。濟南：齊魯書社，2010。 [日]丹波元胤：《醫籍考》。北京：學苑出版社，2007。 [日]吉元昭治著，楊字譯：《道教與不老不死長壽醫學》。四川：成都出版 社，1992。 [日]志賀市子著，宋軍譯，志賀市子譯校：《香港道教與扶乩信仰──歷史 與認同》。香港：香港中文大學出版社，2013。 [法]戴思博（Despeux, Catherine）著、李國強譯：《〈修真圖〉──道教與人 體》。濟南：齊魯書社，2012。 [美]康豹（Katz, Paul R.）：《多面相的神仙──永樂宮的呂洞賓信仰》。濟南： 齊魯書社，2010。 [美]羅浩（Roth, Harold D）著，邢文主編：《原道──《內業》與道家神秘 主義基礎》。北京：學苑出版社，2009。 [德]衛禮賢（Wilhelm, Richard）著，鄧小松譯：《金花的秘密──中國生命 之書》。收有[瑞士]榮格撰（Jung, Carl）序。合肥：黃山書社，2011。 丁原明、白如祥、李延倉合著：《早期全真道教哲學思想論綱》。濟南：齊 魯書社，2011。 丁常春：《伍守陽內丹思想研究》。成都：巴蜀書社，2007。 孔令宏：《宋代理學與道家、道教》。北京：中華書局，2006。 尹志華：《王常月學案》。濟南：齊魯書社，2011。 巴瑞特（(Barrett, Timothy）著，曾維加譯：《唐代道教──中國歷史上黃金 時期的宗教與帝國》。濟南：齊魯書社，2012。 戈國龍：《全真道學術研究報告第三輯──性命雙修論》。香港：青松出版 社，2009。 戈國龍：《道教內丹學溯源》。北京：中央編譯出版社，2012。 王沐：《內丹養生功法指要》。北京：東方出版社，2011。 田合祿、田峰合著：《周易真原──中國最古老的天文科學體系》。太原： 山西科學技術出版社，2004。 任繼愈主編：《中國道教史》。中國：中國社會科學出版社，2001。 朱展炎：《馴服自我──王常月修道思想研究》。四川：巴蜀書社，2009。 朱越利主編：《理論‧視角‧方法──海外道教學研究》。濟南：齊魯書社，2013。 朱越利主編：《道教說略》。北京：北京燕山出版社，2009。 余國藩著，李奭學譯：《餘國藩西遊記論集》。臺北：聯經出版事業，1989。 吳亞魁：《江南全真道教》。香港：中華書局，2006。 吳銳：《神守傳統與道教起源》。臺北：東大，2008。 李崇高：《道教與科學》。北京：宗教文化出版社，2008。 李零：《中國方術考》。北京：人民中國出版社，1993。 李遠國：《神霄雷法──道教神霄派沿革與思想》。四川：四川心人民出版 社，2003。 李養正：《道教綜論》。香港：香港道教學院，2001。 李養生：《道教理義與《周易》關係述論》。香港：青松出版社，2005。 沈文華著，詹石窗編：《內丹生命哲學研究》。北京：東方出版社，2006。 于德潤：《長生久視──中華傳統內丹學的現代轉化》。北京：光明日報出 版社，2010。 林富士：《中國中古時期的宗教與醫療》。北京：中華書局，2012。 南懷瑾：《靜坐修道與長生不老》。上海：復旦大學出版社，2002。 胡孚琛：《丹道仙術入門》。北京：社會科學文獻出版社，2009。 胡孚琛：《道學通論》。北京：社會科學文獻出版社，2009。 胡孚琛主編：《中華道教大辭典》。北京：中國社會出版社，1995。 胡海牙、武國忠主編：《陳攖寧仙學精要》。北京：宗教文化出版社，2008。 胡喬木總編：《中國大百科全書‧宗教卷》。北京：中國大百科全書出版社， 1988． 范家偉：《六朝隋唐醫學之傳承與整合》。香港：香港中文大學，2004。 范家偉：《北宋校正醫書局新探──以國家與醫學為中心》。香港：中華書 局，2014。 卿希泰：《中國道教史》第四冊 。四川：四川人民出版社，1996。 袁康就：《鍾呂內丹道德觀研究》。北京：宗教文化出版社，2004。 張志堅：《道教神仙與內丹學》。北京：宗教文化出版社，2003。 張廣保：《唐宋內丹道教》。上海：上海文化出版社，2001。 張廣保：《道家的根本道論與道教的心性學》。成都：巴蜀書社，2008。 郭武：《丘處機學案》。濟南：齊魯書社，2011。 郭健：《取經之道與務本之道──《西遊記》內丹學發微》。四川：巴蜀書 社，2008。 陳禾源：《丹道修煉與養生學》。北京：社會科學文獻出版，2007。 程雅君：《金元四大醫家與道家道教》。四川：巴蜀書社，2006。 程樂松：《即神即心：真人之誥與陶弘景的信仰世界》。北京：中國人民大 學出版社，2010。 遊子安：《道風百年──香港道教與道觀》。香港：道教文化資料庫-文利出） 社，2002。 蓋建民：《道教醫學》。北京：宗教文化出版社，2001。 劉力紅：《思考中醫》。桂林：廣西師範大學出版社，2006。 劉永霞：《茅山宗師陶弘景的道與術》。北京：社會科學文獻出版社，2010。 劉紹雲：《宗教律法與社會秩序：以道教戒律為例的研究》。四川：巴蜀書 社，2009。 蔡波林：《神藥之殤：道教丹術轉型的文化闡釋》。四川：巴蜀出版社， 2008.8． 蔣朝君：《道教科技思想史科舉要──以《道藏》為中心的考察》。北京： 科學出版社，2012。 黎志添：《廣東地方道教研究：道觀，道士及科儀》。香港：中文大學出版 社，2007。 蕭進銘：《反身體道──內丹密契主義研究》。台灣：新文豐出版社，2009。 賴錫三：《丹道與易道──內丹的性命修煉與先天易學》。台灣：新文豐， 2010． 霍克功：《內丹解碼──李西月西派內丹學研究》。北京：人民出版社，2008。 繆天綬：《宋元學案》。台灣：商務印書局，2009。 薜芳芸：《宋代文人通醫現象研究》。山西：山西人民出版社，2012。 謝路軍：《中國道教文化》。北京：九州出版社，2008。", "terms": {"2021-22 Term 1": {"--LEC (1384)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [5], "locations": ["Hui Yeung Shing Bldg G04"], "instructors": ["Staff"], "meetingDates": ["10/9", "17/9", "24/9"]}}}, "assessments": {"Essays": "40", "Presentation": "40", "Report": "20"}}, {"code": "5131", "title": "Biblical Hermeneutics in Asian Perspectives", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies or Master of Divinity or MA Christian Studies", "description": "The course will focus on the recent development in biblical interpretation in Asia in the larger context of theological endeavours and religious studies of Asian scholars in their coming to terms with the diversity of Asian realities. Adequate attention will be paid to methodological issues in relation to the pluralistic religio-cultural traditions and the complex socio-political experiences of the Asian peoples. Biblical interpretation developed in various Asian countries will also be studied.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5132", "title": "Advanced Biblical Exegesis I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "ClassworkLecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies or Master of Divinity", "description": "This course will focus on exegesis of selected passages from the Hebrew Bible or the New Testament. It would be an advantage if students have gone through either Hebrew Exegesis or New Testament Greek Exegesis.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5133", "title": "Advanced Biblical Exegesis II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "ClassworkLecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies or Master of Divinity", "description": "This course will focus on exegesis of selected passages from the Hebrew Bible or the New Testament. It would be an advantage if students have gone through either Hebrew Exegesis or New Testament Greek Exegesis.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5134", "title": "Gender Critical Interpretation of the Bible", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies or Master of Divinity or MA Christian Studies", "description": "The course introduces the approaches to reading and interpreting the Bible for the sake of gender equality and justice. It looks into the effects of gender injustice in the history of biblical interpretation and theology, and promotes interpreting the Bible with sensitivity towards gender inclusivity. It will cover both feminist and masculinity interpretations of the Bible.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5135", "title": "Religion and Literature of the Bible", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For MPhil-PhD Religious Studies", "description": "This course is an advanced study of the biblical text (the Hebrew Bible and/or the New Testament) in the light of the contemporary critical biblical scholarship. The religious and cultural issues of ancient Israel and/or the early Christian church are to be tackled.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5139", "title": "Readings in Semitic Languages", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "This course is designed to introduce student to Semitic languages relating to the Hebrew Bible. Students will read some long and some short excerpts from either a) Aramaic and its many offshoots including Syriac, or b) Ugaritic or c) Akkadian, with its 2500-year-old history, or e) Classical Arabic, with elementary readings from the Qur’an or f) a comparative study of various Semitic languages which are similar. The direction the course will take depends upon the students’ needs and interests. This course will have in mind both the student of the Hebrew Bible, and the student who wants to gain a wider knowledge of the thought of ancient West Asia. In both cases, knowledge of Hebrew is required.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5143", "title": "Contemporary Issues in Ethics, Society and Religion", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies", "description": "This course attempts to explore the complexity of contemporary issues raised by ethics and society through a religious perspective. How religious thinking can be enriched and challenged by issues of bioethical, business, legal and political nature.", "outcome": "After completion of the course, students are able to: - To adopt multi-disciplinary approaches to identify, analyze and evaluate the contemporary issues. - To articulate and apply religious resources to respond to the contemporary issues. - To develop appropriate manner, honest exchange of idea and skill to solve problems in group discussions. - To use public reasoning to communicate the findings to a range of audiences.", "syllabus": " Course Introduction: Clarification of Concepts Understanding of Human Choice and Freedom (1): Utilitarianism and Deontology Understanding of Human Choice and Freedom (2): Virtue Ethics Ethical Issues of the Birth of Life: Comparative Perspectives Religion and Moral Evaluation on Euthanasia Marriage: Comparative Perspectives Tolerance or Intolerance on Sexual Variations: Christian Perspective and Buddhist Perspectives Work: Comparative Perspectives Cosmos, Climate and Ecosystem: Comparative Perspectives Religion and Social Participation: Christianity and Buddhism, violence and non-violence", "required_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline). Christine E. Gudorf, Comparative Religious Ethics: Everyday Decisions for Our Everyday Lives, Minneapolis: Fortress Press, 2013. (e-book; access via CU library) ", "recommended_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline). “Ethics and Spirituality in Religion,” Comparative Religious Ethics: Everyday Decisions for Our Everyday Lives, chapter 1 & 7 “Religions on Making Work Human,” Comparative Religious Ethics: Everyday Decisions for Our Everyday Lives, chapter 3. “Religions on Sexuality and Marriage,” Comparative Religious Ethics: Everyday Decisions for Our Everyday Lives, chapter 5. Bede Benjamin Bidlack, “Daoism and the Universal Declaration of Human Rights and Bioethics”, Religious Perspectives on Bioethics and Human Rights, Springer, 127-138. Buddhism:  pp. 120-145 Denise and John Carmody, “Homosexuality and Roman Catholicism,” Homosexuality and World Religions, ed. Arlene Swidler, 135-148. Howard Brody, “Religion and bioethics: toward an expanded Understanding.” Theoretical Medicine and Bioethics (2013) 34:133–145 (http://link.springer.com/content/pdf/10.1007%2Fs11017-013-9244-6.pdf) Islam:  pp. 68-90 Jacob Nuesner, ed. Making an Honest Living (Wadsworth 2001) Jose Ignacio Cabezon, “Homosexuality and Buddhism,” in Homosexuality and World Religions, ed. Arlene Swidler, pp. 81-102. Keown, Damien, and John Keown. \"Killing, karma and caring: euthanasia in Buddhism and Christianity.\" Journal of medical ethics 21.5 (1995): 265-269. Laura Palazzani, “The Christian-Catholic Religious Perspective: Human Rights, Cultural Pluralism and Bioethics”, Religious Perspectives on Bioethics and Human Rights, Springer, 183-197. Lisa Cahill, “Official Catholic Social Thought on Gospel Nonviolence” paper delivered in the Conference on Nonviolence and Just Peace, 2016. Mackinnon, Barbara. (2008). Ethics: Theory and Contemporary Issues, chapter 1. Marvin Ellison, “Homosexuality and Protestantism,” Homosexuality and World Religions, ed. Arlene Swidler, 149-190. Marvin M. Ellison, “Common Decency: A New Christian Sexual Ethics” Sexuality and the Sacred: Sources for Theological Reflection, pp. 236-241. Michael Naughton and Gene R. Laczniak (1993) “A Theological Context of Work from the Catholic Social Encyclical Tradition” Journal of Business Ethics, pp. 981-994. Queen, Christopher S. \"Introduction: The shapes and sources of engaged Buddhism.\" Engaged Buddhism: Buddhist Liberation Movements in Asia (1996): 1-44 宮哲兵. \"早期基督教與漢晉道教的性倫理觀比較.\" 中國性科學 14.1 (2005): 1-4. 羅秉祥，儒家的生死價值觀與安樂死，《生命倫理學的中國哲學思考》，中國人民大學出版社（2013）。 莊慶信. \"天主教的生態倫理與生態靈修\" 《輔仁宗教研究》 27 (2013): 185-217. 莊慶信. \"宗教倫理與環保倫理—基督宗教與佛教的對話\" 《哲學與文化》 25.6 (1998): 557-574. 趙祥祿. \"論道德判斷的基礎\" 《山西師大學報: 社會科學版》 35.2 (2008): 1-5.", "terms": {"2020-21 Term 2": {"--LEC (4456)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [4], "locations": ["Wu Ho Man Yuen Bldg 305"], "instructors": ["Dr. LAM Wing Kwan Anselm"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}}, "assessments": {"Attendance": "10", "Discussion": "15", "Essays": "40", "Presentation": "35"}}, {"code": "5146", "title": "Religious Education and Personal Growth", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies", "description": "This course will attempt to study some of the modern developmental theories such as Piaget’s cognitive developmental theory, Erikson’s socio-psychological theory, Kohlberg’ s moral developmental theory and Fowlers’ faith developmental theory. Special attention will be given to the evaluation of their signifi cance to education in a religious context.", "outcome": "Upon completing the course, students should be able to: - Comprehend the developmental themes throughout the life span and the related theories of developmental psychology.  - Understand the theories related to moral, faith and spiritual development.  Self-examine the student’s own understanding and philosophy of religious education.  - Self-examine the student’s stage of personal and spiritual development, reflecting on the implications for her/his role as a religious educator.  - Critically apply concepts in developmental psychology to specific educational contexts.", "syllabus": " Course Introduction: Different Perspectives on Human Growth / Personal Development The Goal of Human Growth / Personal Development from Religious Perspectives Religion and Identity Formation Religion and Moral Development Religion and Faith Development Religion and Spiritual Development in Childhood and Adolescence Gender Issues in Human Development Death and Dying (Guest Speaker; To be Confirmed) Religious Practices for Spiritual Development Conclusion", "required_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline). Grimmitt, Michael. Religious Education and Human Development: the Relationship between studying Religions and Personal, Social and Moral Education. England: McCrimmon Pub., 1987.", "recommended_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline).", "terms": {"2021-22 Term 1": {"--LEC (3689)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [3], "locations": ["Esther Lee Bldg 403"], "instructors": ["Dr. CHOW Wai Yin"], "meetingDates": ["8/9", "15/9"]}}}, "assessments": {"Discussion": "20", "Essays": "45", "Presentation": "35"}}, {"code": "5219", "title": "The Hebrew Bible in Contexts", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies", "description": "This course aims at introducing students to the approaches to reading the Hebrew Bible (The Christian Old Testament) in its literary, socio-political and religio-cultural contexts. The literary setting and historical background will be surveyed and explored in order to enhance students’ understanding of the text and the dynamics of the reading process.", "outcome": "Knowledge Outcomes (1) Describe a. what the study of Hebrew Bible constitutes. b. with the help of resources, the general background and contexts of the biblical books. (2) Explain a. the necessity of understanding contexts of when studying the Hebrew Bible. b. the literary, socio-political and religio-cultural contexts of a specified period in biblical history. c. the necessity and limitations in biblical scholarship for reconstructing contexts. (3) Distinguish a. what is “historical Israel” and “biblical Israel”. b. the different contexts for interpreting scriptures. (4) Recite the main historical epochs of biblical Israel. (5) Examine and analyse the contexts of a given text using quality resources. (6) Sketch an interpretation of a given text integrating a current context to a passage in the Hebrew Bible. (7) Comment and evaluate on those information that were presented differently in church. Determine the consequences of the information.  (8) Reflect and discuss on the implications of academic study and its impact on faith-based communities.  (9) Construct interpretations that take the contexts of the biblical text/s seriously and also relevant to one’s context.   Attitude Outcomes: (1) Appreciate by listing the contributions of the diverse interpretations of scriptures throughout history and their historical and contextual developments. (2) Respect for the historical development of Old Testament scholarship in its entirety by pointing out their relevance to current contexts – within the communities of faith and also within the academia. (3) Develop keen insights to read texts meaningfully and responsibly by reading up and constructing different contextual interpretations of biblical texts – for the sake of peace and justice, understanding and acceptance to all humanity and living creatures of God’s creation.", "syllabus": " Course Introduction: The Awareness of the Context(s) Ancient Contexts: Archaeology and Mythology (Genesis) Ancient Contexts: History, History Writing and Historiography (Exodus) The Nature of Criticism (Leviticus and Numbers) Ancient Context: Literary Convention in the Ancient World (Samuel-Saul-David) Ancient Contexts: The Empire and the Exile (Second Temple literature) Ancient Contexts: Social studies and Socio-Economic Contexts (the Book of the Twelve) Contemporary Contexts: Modern mind as context (Joshua and Judges; SOS) Contemporary Contexts: Post-Modernity as context (Job and Qohelet) Contemporary Contexts: Judaism and the Church as context; Term Paper Proposal (Ruth) Contemporary Contexts: The Public Space as context (Jeremiah) The Reception of the Texts (Isaiah) A Retrospect and a proposal", "required_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline). Auld, Graeme. 2001. “Prophecy.” Pp. 88–106, in John Barton (ed.), The Biblical World. Vol. I. London/New York: Routledge. Barton, John and Bowden, Julia. 2004. “How Should We Live? Ethics in the Old Testament.” Pp. 77–90, in The Original Story: God, Israel and the World. Michigan / Cambridge (U.K.): Eerdmans. Brueggemann, Walter. 2003. “Introduction.” Pp. 1–13, in An Introduction to the Old Testament: The Canon and Christian Imagination. Kentucky: Westminster John Knox. Carmichael, Calum. 2006. “Law and Narrative in the Hebrew Bible.” In Leo G. Perdue (ed.), The Blackwell Companion to the Hebrew Bible. Oxford/New Jersey: Blackwell. Blackwell Reference Online. Carr and Conway. 2010. “Narrative and Prophecy amidst the Rise and Fall of the Northern Kingdom.” Pp. 85–117, in An Introduction to the Bible: Sacred Texts and Imperial Contexts. Sussex: Wiley-Blackwell. Carr and Conway. 2010. “Persian Empire and the Emergence of a Temple-Centered Jewish Community.” Pp. 181–204, in An Introduction to the Bible: Sacred Texts and Imperial Contexts. Sussex: Wiley-Blackwell. Carr, David M., and Conway, Colleen M. 2010. “Studying the Bible in its Ancient Context(s).” Pp. 15–32, in An Introduction to the Bible: Sacred Texts and Imperial Contexts. Sussex: Wiley-Blackwell. Coogan and Chapman. 2009. “Creations.” Pp. 27–40, in A Brief Introduction to the Old Testament: The Hebrew Bible in Its Contexts. New York / Oxford: Oxford University. Coogan, Michael D. and Chapman, Cynthia. 2009. “The Formation of the Pentateuch and the Primeval History.” Pp. 41–57, in A Brief Introduction to the Old Testament: The Hebrew Bible in Its Contexts. New York / Oxford: Oxford University. Dalley, Stephanie. 2002. “Near Eastern Myths and Legends.” Pp. 41–64, in John Barton (ed.), The Biblical World. Vol. I. London/New York: Routledge. Dell, Katherine. 2001. “Wisdom.” Pp. 107–128, in John Barton (ed.), The Biblical World. Vol. I. London/New York: Routledge. Gerstenberger, Erhard S. “The Psalter.” The Blackwell Companion to the Hebrew Bible. John J. Collins. 2006. “The Apocalyptic Literature.” In Leo G. Perdue (ed.), The Blackwell Companion to the Hebrew Bible. Oxford/New Jersey: Blackwell. Blackwell Reference Online. Klein, Ralph. 2006. “Narrative Texts: Chronicles, Ezra and Nehemiah,” In Leo G. Perdue (ed.), The Blackwell Companion to the Hebrew Bible. Oxford/New Jersey: Blackwell. Blackwell Reference Online. Spieckermann, Hermann. 2006. “Former Prophets: The Deuteronomistic History.” In Leo G. Perdue (ed.), The Blackwell Companion to the Hebrew Bible. Oxford/New Jersey: Blackwell. Blackwell Reference Online. West, Gerald. 2006. “Contextuality.” In John F. Sawyer (ed.), The Blackwell Companion to the Bible and Culture. Oxford/New Jersey: Blackwell. [electronic resource available via cuhk library] Wills, Lawrence M. 2001. “The Jewish Novel.” Pp. 149–61, in John Barton (ed.), The Biblical World. Vol. I. London/New York: Routledge.", "recommended_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline).", "terms": {"2020-21 Term 1": {"--LEC (4322)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Dr. LI Kwan Hung Leo"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12"]}}}, "assessments": {"Discussion": "10", "Essays": "50", "Homework or assignment": "10", "Report": "30"}}, {"code": "5273", "title": "Catholic Social Ethics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies or Master of Divinity", "description": "This course attempts to examine the principles and ways of Church’s responses to social issues from the Catholic faith tradition. Topics include the relationship between morality and spirituality, the foundation of social ethics, the methods of theological reflection and pastoral actions. Particular attention is given to Catholic Social Teachings and its development, and its perspectives on issues like human rights, economic justice and globalization, work and labour, ecology, political participation, racism, women’s status and so on. Catholic social movements and individuals will also be introduced.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5275", "title": "Spirituality and Religious Congregations", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies or Master of Divinity", "description": "This course offers a textual and thematic survey of developments of the major religious traditions in the Catholic Church, as they reflect the experience of God and its expression in piety, practice and ministry. Common characteristics and representative figures will be studied through lectures, critical reading and discussion of primary texts. The class will also examine modern interpretation of more traditional forms of spirituality.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5300", "title": "The Study of Islam", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies or Master of Divinity", "description": "This course will introduce the basic concepts of Islam to the students i.e. fundamentals of faith, rituals of worship, Seerah of the Prophet of Islam, Islamic Civilization and Muslim contribution to different cultures. It will help the students to understand the contemporary issues in the light of Islamic teachings and the methodogical issues in Islamic Studies. The course has been designed for such students who have never studied Islamic Studies so far.", "outcome": "Knowledge: - Understand the basic concepts of Islam; - Understand the contemporary issues in the light of Islamic teachings and methodological issues in Islamic Studies. Skills: - Communication and presentation (oral and written) skills; - Critical and analytical skills; - Research skills.  Attitude:  - A heightened sensitivity to the religious dimension of human life, society and culture; - An analytical capability of the plurality and complexity of religious phenomena related to Islam; - A critical yet sympathetic understanding and appreciation of Islam.", "syllabus": " The Roots of Islam: Pre-Islamic Arabia (Jāhiliyya); Judeo-Christian connections; Neighboring civilizations. Muhammad and the Early Muslim Community Qurʾān Ḥadīth and Sunna Islām: Submission as Orthopraxy; An Umma on the Five Pillars Islamic Law: Sharīʿa and Fiqh Islamic Theology: Kalām Islamic Sectarianism: The Sunni-Shīʿa Schism Islamic Mysticism: The Ṣūfī Tradition Islamic Modernism and Revivalism Women and Gender in Islam Fundamentalism and Extremism in Islam", "required_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline). Ali, Abdullah Yusuf, trans. The Qur'an Translation. Tahrike Tarsile Qur'an; 25th edition, 2009. (If you have another translation of the Qurʾān, you may use it, or an online version, instead.) Goldziher, Ignaz. Introduction to Islamic Theology and Law (Modern Classics in Near Eastern Studies). (Paperback) Translated by Andras and Ruth Hamori. Princeton, NJ: Princeton University Press, 1981. Sachiko Murata and William C. Chittick, The Vision of Islam. St. Paul, MN: Paragon House, 1994.", "recommended_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline). Sachiko Murata and William C. Chittick, “Preface” in The Vision of Islam (St. Paul, MN: Paragon House, 1994), ix-xiii. Peter J. Awn, “Faith and Practice” and Fazlur Rahman, “The Message and the Messenger,” in Islam: The Religious & Political Life of a World Community, ed. Marjorie Kelly (New York: Praeger, 1984), 1-3, 28-32.“Pre-Islamic Poetry,” Trans. by Michael Sells. “Introduction,” in The Vision of Islam, xix-xxiv. “Traditional Muslim Chronology of Muhammad’s Life”. Fazlur Rahman, “Muhammad, The Prophet of God,” in Islam: The Religious & Political Life of a World Community, 32-42. “Excerpt From Dante’s Inferno and a 17th c. French Traveler’s Account”. “Introduction,” in The Vision of Islam, xiv-xix. Abdullah Yusuf Ali, The Qur'an Translation (Tahrike Tarsile Qur'an; 25th edition, 2009), Sūra 1, 2, 4, 7, 9, 12, 18, 26, 75-114. “The Message,” in Islam: The Religious & Political Life of a World Community, 42-54. “Introduction,” and “The Koran and Sunna,” in The Vision of Islam, xxv-xxxix, 28-30. Roy P. Mottahedeh, “Qur’an and Sunna,” in Islam: The Religious & Political Life of a World Community, 57-59. “Selected Hadīth”. “Part I: ISLAM,” in The Vision of Islam, 3-27. Peter J. Awn, “Philosophical Theology and the First Pillar of Islam” and“Islamic Praxis and the Four Remaining Pillars of Islam,” in Islam:  The Religious & Political Life of a World Community, 3-13. Ignaz Goldziher, “The Development of Law,” in Introduction to Islamic Theology and Law, trans. Andras and Ruth Hamori (Princeton, NJ: Princeton University Press, 1981), 31-66. “Law,” in Textual Sources for the Study of Islam, 105-115. “The Growth and Development of Dogmatic Theology,” in Introduction to Islamic Theology and Law, 67-114. “The Sects,” in Introduction to Islamic Theology and Law, 167-229. Peter J. Awn, “Diversity in the Umma: Shi’ism,” in Islam: The Religious & Political Life of a World Community, 14-17. “Theoretical Sufism,” “Philosophy,” “The Two Poles of Understanding,” and “Sufism’s Vision,” in The Vision of Islam, 246-257, 262-264. Peter J. Awn, “Sufism,” in Islam: The Religious & Political Life of a World Community, 17-22. “Sufi Ascetical Texts” “Ch. 10 The Contemporary Situation,” in The Vision of Islam, 329-335. Voll, John O., Ch. 8: “Muslim Responses to Colonialism,” in Islam: The Religious & Political Life of a World Community, 157-172. “Modernist Islamic Texts”. Ch. 4, “Rights and Roles of Women: Some Controversies,” in Amina Wadud, Qurʿan and Woman: Rereading the Sacred Text from a Woman’s Perspective. New York: Oxford University Press, 1999, pp. 62-93. Ch. 6, “‘Reduce but do not destroy’: Female ‘Circumcision’ in Islamic Societies,” in Kecia Ali, Sexual Ethics and Islam: Feminist Reflections on Qurʿan, Hadith and Jurisprudence. Oxford: Oneworld, 2006, pp. 97-111. Albertini, Tamara. “The Seductiveness of Certainty: The Destruction ofIslam's  Intellectual Legacy by the Fundamentalists,” in Philosophy East and West, Vol. 53, No. 4 (Oct., 2003), pp. 455-470. Wood, Graeme. “What ISIS Really Wants,” in The Atlantic, March, 2015 Issue.", "terms": {"2021-22 Term 2": {"--LEC (1165)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [4], "locations": ["Chen Kou Bun Bldg 109"], "instructors": ["Professor James D FRANKEL"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Discussion": "35", "Essays": "45", "Participation": "20"}}, {"code": "5312", "title": "Hindu Visions of Divinity", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies", "description": "Hindu religious traditions offer a rich variety of concepts as well as visualizations of divinity, from highly abstracted and nuanced notions of the Deity to highly tangible and specific images seen and elaborately venerated in temples. By close readings of classical sacred texts (in translation), viewing iconography, and discussion of India’s historical and social contexts in which texts and images have been embedded, this course will explore the fascinating amalgam of ritual, yoga, textual exegesis, and devotionalism of the Hindu religious world.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5314", "title": "Buddhism and Culture", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students of MA in Religious Studies or MA in Buddhist Studies", "description": "This course provides an overview of the historical development of Buddhist culture in Asia. Main features elements of Buddhism in the diversified culture is highlighted. Theoretical foundations of Buddhist philosophy is delivered at the beginning, with reference to the development of the various Buddhist traditions, such as Theravada, Mahayana and Vajrayana. Their impact, evolution and integration on and into different cultures are being studies, with reference to the contemporary Buddhist practices. Comparisons amongst various cultural elements would be made, providing a greater in depth understanding of the different aspects of Buddhist Culture and the dynamism of Buddhism in its adaptation to different cultures. The course will end with discussing the role of Buddhism in its influence in reshaping the culture of modern society, highlighting facts that will help in the formation of a harmonious society.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5316", "title": "Studies of Humanistic Buddhism", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students of MA in Religious Studies", "description": "From more than 2500 years, Buddhism has spread almost all parts of the world, and undergone the developments from Primitive Buddhism, Theravada, Mahayana, to Tantriyana. In the contemporary world, Humanistic Buddhism has become one of the mainstreams of Buddhist developments. And the ideas and practices for the welfare of society and benefit of humanity have dominated Buddhist activities. This course designed to study the development of Humanistic Buddhism, including the history, thoughts, and practices. This course is divided into three parts yet each part is organically connected with the others. We first investigate the basic doctrines of traditional Buddhism related to the arising and practice of humanistic Buddhism, such as the Four Noble Truth, the Dependent-Origination, the ideas and practices of Bodhisattva. Having understood the doctrinal foundation of Humanistic Buddhism, we then examine the history of humanistic Buddhism in the early Republic era (1912-1949). Social, political, religious, as well as economic background in which Humanistic Buddhism arose will be discussed so that students could have holistic picture about the interaction between Buddhist institutions and society then. The teaching and practice of some pioneers of Humanistic Buddhism, such as Ven. Taixu will be examined to reveal the contents of Humanistic Buddhism. Towards the end of semester, we explore the contemporary developments of humanistic Buddhism in general, and Foguan Shan Buddhism in particular.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5322", "title": "Research Paper in Religious Studies", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies;Pre-requisite: RELS5005", "description": "The research paper in Religious Studies, which is planned with our faculty and those faculty members in relevant fields, allows students to develop some of the ideas and skills they have acquired during their study with us. Every student must write a research paper in Religious Studies of not less than 15,000 words (in Chinese or English) on an approved topic under individualized supervision. Students will be able to acquire some fundamental skills and methodologies of doing research and writing a dissertation in Religious Studies. They will also be better equipped for an application for MPhil/PhD programmes. Even though there will be group and individual supervision to guide students through from start to finish, this is largely a self-taught course and student initiative is most important.", "outcome": "Knowledge Outcomes:  - In-depth understanding of a chosen topic in Religious Studies  - Research on and organization of primary and original materials  Skills Outcomes:  - Independent study - Construction of proposal and thesis through research and reading - Articulation of theory and practice Attitude Outcomes:  - Confidence in independent research - Sound judgment on selecting research topics and source materials", "syllabus": " Introduction. Research proposal. How to write an abstract and academic paper? / Methods 2. Three group meetings At least two consultation meetings with supervisors.", "required_readings": "The required readings depend on the research topic. Always check the most updated version via the department's website (course outline).", "recommended_readings": "The recommended readings depend on the research topic. Always check the most updated version via the department's website (course outline).", "terms": {"2020-21 Term 2": {"-J01-PRJ (4380)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [2], "locations": ["Esther Lee Bldg 302"], "instructors": ["Dr. CHOW Wai Yin"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 2": {"-J01-PRJ (3701)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [2], "locations": ["Chen Kou Bun Bldg UG03"], "instructors": ["Dr. CHOW Wai Yin"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Attendance": "10", "Essays": "80", "Report": "10"}}, {"code": "5323", "title": "Life and Death in World Religions", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-tripLecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies", "description": "The problem of life and death constitutes the core concern of practically all religions of the world. The values and beliefs that relate to life and death have far-reaching impacts on different dimensions of religious practice. This course takes a thematic approach by examining and comparing the issues of life and death in some major religions in the world, including mainly the Indian, Chinese and Abrahamic traditions. The emphases and peculiarities of each religion will be illustrated from the doctrinal, textual, ritual and symbolic perspectives. Through the study of religion in different cultures, students will be equipped with a broadened horizon and fundamental framework for taking more advanced courses in all area of religious studies.", "outcome": "Upon successful completion of this course, students should be able to: - Understand the issues of life and death in major religions of the world in their historical settings and contemporary contexts;  - Enhance their ability to have a critical and yet sympathetic understanding and appreciation of different religious traditions;  - Engage in a critical analysis of religions from doctrinal, textual and ritual perspectives.", "syllabus": " Introduction: Religion, Death and the Meaning of Life Death and Afterlife in Ancient Egypt, Near East and Ancient Greek Thought Death and Afterlife in Judaism Understanding of Death in Early Church Fathers Death, Eternal Life and Hope in Christianity Death and afterlife in Chinese Religions Life, Death, and Afterlife in Taoism Islamic Images of Life, Death and Afterlife Hindu Views on Life and Death Buddhist View on Life and Death: Bardo", "required_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline). Obayashi, H., ed. Death and Afterlife: Perspectives of World Religions. New York: Greenwood Press, 1992.", "recommended_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline). Angelika Cedzich, “Ghost and Demons, Law and Order: Grave Quelling Tests and Early Taoist Liturgy,” Taoist Resources 4 (1993) no.2 , 23-35. Bailey, L.R. “The Old Testament View of Life After Death.” Themelios, vol. 11 (1986), no. 2 George E. Mendenhall, “From Witchcraft to Justice: Death and Afterlife in the Old Testament,” Death and After Life: Perspectives of World Religions. Hiroshi Obayashi, “Death and eternal life in Christianity,” Death and After Life: Perspectives of World Religions. Jerrold S. Cooper, “The Fate of Mankind: Death and Afterlife in Ancient Mesopotamia.” (Chapter 2) In Death and After Life: Perspectives of World Religions. Edited by Hiroshi Obayahsi. Pricenton, 1992 Judith Berling, “Death and Afterlife in Chinese Religions.” (Chapter 13) In Death and After Life: Perspectives of World Religions. Thomas J. Hopkins, “Hindu Views on Life and Death.” (Chapter 10) In Death and After Life: Perspectives of World Religions. William C. Chittick, “Your sight Today is Piercing.” (Chapter 9) In Death and After Life: Perspectives of World Religions. 林中澤, 陳賢哲. \"早期拉丁教父的死亡觀評析.\" 暨南學報(哲學社會科學版) 2 (2011). 索甲仁波切著，鄭振煌譯：《西藏生死書》，第七至八章，臺北市：張老師，1996。 鄭志明. \"傳統社會生命教育的生死信仰.\" 第四屆台灣密宗國際學術研討會 (2008): 1-29. 黎志添：〈從打齋儀式看道教對死亡的處理──一個死魂遠遊旅程的救濟：拔罪、救苦、度亡及成仙〉，收入梁美儀、張燦輝合編：《凝視死亡──死與人間的多元省思》。香港：中文大學出版社，2005，頁 55-78。", "terms": {"2020-21 Term 1": {"--LEC (4282)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. CHOW Wai Yin"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10"]}}}, "assessments": {"Attendance": "15", "Discussion": "10", "Essays": "45", "Presentation": "30"}}, {"code": "5325", "title": "Christianity in Chinese Literature", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies", "description": "This course adopts an innovative approach to examine the interactions between Christianity and Chinese literature from the 19th to early 20th centuries. Literary texts to be analyzed include mainly the late Qing missionary novels, and works of May Fourth writers (such as Lu Xun, Bing Xin and Xu Dishan). This course aims to widen the students’ perspectives in the indigenization of Christianity in Chinese religious and literary contexts, the rhetorical influences of the Bible on the emergence of modern Chinese literature, and the interdisciplinary study of literature and religion.", "outcome": "- 學生能了解基督教與中國文學傳統的相遇和融合； - 學生能掌握晚清基督教小說的宗教內涵和文學特徵； - 學生能分析中國現代文學中的基督教思想和主題。", "syllabus": " 導論：晚清基督教小說                       夾敘夾議：賓為霖《正道啟蒙》(1864)                     且譯且評：胡德邁《勝旅景程》(1870)                     異端闢疑：郭實獵《正邪比較》(1838)                     聖經演義：理雅各《約瑟紀畧》(1852)                             神魔之爭：郭子符《驅魔傳》(1895)                                                         借歌證道：張佃書《無名小說》(1895)                     愛的哲學：冰心《聖詩集》(1921)                             耶穌之死：魯迅《復仇》(1924)                                 耶佛會通：許地山《綴網勞蛛》(1922)                     寓教於樂：武國棟《古聖若瑟白話演義》(1925)     贖罪意識：曹禺《雷雨》(1933) 課程總結         ", "required_readings": "The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline). 晚清基督教小說  Patrick Hanan, “The Missionary Novels of Nineteenth-Century China,” Harvard Journal of Asiatic Studies 60.2 (2000), pp. 413-443. 黎子鵬編注：《晚清基督教敘事文學選粹》，新北：橄欖出版有限公司，2012，導論，頁xv-xlvii。 John T. P. Lai, “Fictional Representation of the Bible: Chinese Christian Novels of the Late 19th Century”, Literature and Theology: An International Journal of Religion, Theory and Culture, Vol. 28, No. 2 (June 2014), pp. 201-225.   賓為霖《正道啟蒙》  黎子鵬編注：《晚清基督教敘事文學選粹》，頁79-180。 黎子鵬：〈晚清基督教文學：《正道啟蒙》(1864)的中國小說敍事特徵〉，《道風：基督教文化評論》， 第三十五期(2011)，頁279-299。   胡德邁《勝旅景程》  黎子鵬編注：《晚清基督教敘事文學選粹》，頁227-399。 黎子鵬：〈從《勝旅景程》的小說評點看傳教士「耶儒會通」的策略〉，《基督教文化學刊》，第30輯( 2013年秋)，頁201-225。 黎子鵬：《經典的轉生──晚清〈天路歷程〉漢譯研究》，香港：基督教中國宗教文化研究社，2012，頁99-186。   郭實獵《正邪比較》  黎子鵬編注：《贖罪之道傳──郭實獵基督教小說集》，頁334-367。 宋莉華：《傳教士漢文小說研究》，上海：上海古籍出版社，2010，頁78-93。 莊欽永：〈”鍍金鳥籠”裡的吶喊：郭實獵政治小說《是非略論》析論〉，北京外國語大學中國海外漢學研究中心、中國近現代新聞出版博物館編：《西學東漸與東亞近代知識的形成與交流》(上海：上海人民出版社，2012)，頁259-290。   理雅各《約瑟紀畧》  吳淳邦、李奭學、黎子鵬主編：《清代基督宗教小說選注》，上卷，頁293-328。 黎子鵬：〈《聖經》的中國演義：理雅各史傳小說《約瑟紀畧》(1852)研究〉，《漢學研究》，第31卷第1期(2013年3月)，頁161-185。   郭子符《驅魔傳》  吳淳邦、李奭學、黎子鵬主編：《清代基督宗教小說選注》，上卷，頁449-486。 Hanan, Patrick, “The New Novel Before the New Novel—John Fryer’s Fiction Contest”, Chinese Fiction of the Nineteenth and Early Twentieth Centuries (New York: Columbia University Press, 2004), pp. 124-143. 黎子鵬：〈清末時新小說《驅魔傳》中鬼魔的宗教原型及社會意涵〉，《中國現代文學研究叢刊》，2013年第11期，頁173-189。   張佃書《無名小說》  黎子鵬、鄺智良：〈譯本的轉生－－清末時新小說對《天路歷程》的重寫〉，《或問》，第25號(2014年6月)，頁15-29。 黎子鵬：〈張佃書《無名小說》(1895)的宗教表述──以其「時調」為重點的分析〉，《漢學研究》，第33卷第1期( 2015年3月)，頁295-318。 姚達兌：〈主體間性和主權想像－－1895年傅蘭雅時新小說徵文和中國現代小說的興起〉，《清華大學學報》(哲學社會科學版)2014年第2期，頁26-36。   冰心《聖詩集》  康泳：〈論冰心創作中的母愛意識與基督教文化的影響〉，《昆明理工大學學報（社會科學版）》，2009/12，頁51-55。 程小娟：〈冰心的上帝觀〉，《蘭州學刊》，2009/10，頁188-190。   魯迅《復仇》  梁工：〈中國現代作家對耶穌形象的重塑〉，《東方論叢》，2008/04，頁124-129。 葛體標：〈一個人的受難——論魯迅《野草》中的復仇（其二）〉，《魯迅研究月刊》，2010/06，頁15-22。   許地山《綴網勞蛛》  陳偉強：〈以愛超越耶佛間之差異：許地山的生平與文學〉，賴品超編著：《近代中國佛教與基督宗教的相遇》，香港：道風書社，2003，頁275-312。 楊國良：〈從顯現到隱藏：許地山的宗教性追求〉，《中國比較文學》，2006/03，頁75-84。   武國棟《古聖若瑟白話演義》  黎子鵬編注：《古聖若瑟劇本──民國天主教聖經戲劇選輯》，頁301-453。 John T. P. Lai, “Performing Religion: Chinese Catholic Biblical Drama in the Republican Era,” Journal of Chinese Religions 45.1 (May 2017), pp. 39–62. 黎子鵬：〈寓教於樂──天主教聖經戲劇《古聖若瑟白話演義》研究〉，《聖經文學研究》第14輯(2017)，頁142-167。   曹禺《雷雨》  高虹：〈靈魂的懺悔與救贖——從周樸園的形象看曹禺作品的原罪意識〉，《現代語文（文學研究）》，2010/04，頁64-66。 曾敏敏：〈罪與救贖：曹禺《雷雨》、《日出》的基督情懷〉，《語文學刊》，2008/12，頁69-72。  ", "recommended_readings": "  The reading list will be updated if deem necessary. Always check the most updated version via the department's website (course outline). 宗教與文學  輔仁大學外語學院編：《文學與宗敎：第一屆國際文學與宗敎會議論文集》，臺北：時報文化出版企業有限公司，1987。 劉勇強：《中國古代小說史敘論》，北京：北京大學出版社，2007。 童慶炳：《文學理論新編》，北京：北京師範大學出版社，2005。 Frye, Northrop. The Great Code: The Bible and Literature. San Diego, New York & London: Harcourt Brace Jovanovich, 1983. Michael Lieb, Emma Mason and Jonathan Roberts eds., The Oxford Handbook of the Reception History of the Bible (Oxford: Oxford University Press, 2013).   晚清基督教文學  顧長聲：《傳教士與近代中國》(第三版)，上海：上海人民出版社，2004。 韓南著，徐俠譯：《中國近代小說的興起》，上海：上海教育出版社，2004。 黎子鵬：《經典的轉生──晚清〈天路歷程〉漢譯研究》，香港：基督教中國宗教文化研究社，2012。 黎子鵬編注：《晚清基督教敘事文學選粹》，新北：橄欖出版有限公司，2012。 黎子鵬編注：《贖罪之道傳──郭實獵基督教小說集》，新北：橄欖出版有限公司，2013。 黎子鵬編注：《道德除害傳──清末基督徒時新小說選》，新北：橄欖出版有限公司，2015。 黎子鵬編著：《中國基督教文字事業編年史(1860-1911)》，香港：基督教文藝出版社，2015。 黎子鵬：《福音演義──晚清漢語基督教小說的書寫》，臺北：臺大出版中心，2017。 黎子鵬編注：《古聖若瑟劇本──民國天主教聖經戲劇選輯》，台北：周聯華牧師紀念基金會，2019。 黎子鵬、鄺智良：〈譯本的轉生－－清末時新小說對《天路歷程》的重寫〉，《或問》，第25號(2014年6月)，頁15-29。 宋莉華：《傳教士漢文小說研究》，上海：上海古籍出版社，2010。 宋莉華：《近代來華傳教士與兒童文學的譯介》，上海：上海古籍出版社，2015。 吳淳邦、李奭學、黎子鵬主編：《清代基督宗教小說選注》，臺北：中研院中國文哲研究所，2018。 姚達兌：〈主體間性和主權想像－－1895年傅蘭雅時新小說徵文和中國現代小說的興起〉，《清華大學學報》(哲學社會科學版)2014年第2期，頁26-36。 袁進：〈試論西方傳教士對中文小說發展所作的貢獻〉，蔡忠道主編：《第三屆中國小說戲曲國際學術研討會論文集》(臺北：里仁書局，2008年)，頁415–425。 周欣平主編：《清末時新小說集》(十四冊)，上海：上海古籍出版社，2011。 Hanan, Patrick. Chinese Fiction of the Nineteenth and Early Twentieth Centuries. New York: Columbia University Press, 2004. Lai, John T. P. Negotiating Religious Gaps: The Enterprise of Translating Christian Tracts by Protestant Missionaries in Nineteenth-century China. Sankt Augustin: Institut Monumenta Serica, 2012. Lai, John T. P. Literary Representations of Christianity in Late Qing and Republican China Leiden: Brill, 2019.       基督教與中國現代文學  陳偉華：《基督教文化與中國小說敍事新質》，北京：中國社會科學出版社，2007。 陳偉強：《基督教與中國宗教相遇──許地山研究》，香港中文大學哲學博士論文，2002。 劉麗霞：《中國基督教文學的歷史存在》，北京：社會科學文獻出版社，2006。 路易斯‧羅賓遜(Lewis S. Robinson)著；傅光明、梁剛譯：《兩刃之劍──基督教與二十世紀中國小說》(Double-edged Sword)，台北：業強，1992。 馬佳：《十字架下的徘徊：基督宗敎文化和中國現代文學》，上海：學林出版社，1995。 王本朝：《20世紀中國文學與基督敎文化》，合肥：安徽敎育出版社，2000。 王列耀：《基督敎文化與中國現代戲劇的悲劇意識》，上海：上海三聯書店，2002。 許正林：《中國現代文學與基督教》，上海：上海大學出版社，2003。 楊劍龍編：《文學的綠洲──中國現代文學與基督教文化》，香港：學生福音團契出版社，2006。 楊劍龍：《基督教文化對五四新文學的影響》，臺北：新銳文創，2012 Robinson, Lewis Stewart. Double-edged Sword: Christianity & 20th Century Chinese Fiction. Hong Kong: Tao Fong Shan Ecumenical Centre, 1986.    ", "terms": {"2020-21 Term 2": {"--LEC (2468)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 301"], "instructors": ["Professor LAI Tsz Pang"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}}, "assessments": {"Essays": "70", "Participation": "10", "Report": "20"}}, {"code": "5326", "title": "Chinese Religion and Literature", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Religious Studies", "description": "Chinese literature has long been intertwined with religion. While Confucian, Buddhist and Daoist thoughts permeates classical Chinese literature, a large number of works constitute a lively epitome of Chinese religious culture. This course aims to investigate the interactive relationship between Chinese religion and literature. Students will be guided to examine the literary value and rhetorical devices of Chinese religious classics and the ways in which religious thoughts and symbols shape the themes, narratives and language of the literary works. Texts selected for reading include Chinese religious classics like The Lotus Sutra and The Divine Classic of Nan Hua, classical novels such as The Story of the Stone and The Journey to the West, as well as Chan/Zen and Daoist poetry.", "outcome": "Upon successful completion of this course, students should be able to:\r 1.Demonstrate a knowledge of the relationship between religion and literature;  2.Appreciate the literary value of the major works of Chinese religious classics;  3.Analyze and comment on the religious dimensions in Chinese literature.", "syllabus": "1.Relationship between religion and literature\r 2.Major characteristics of Chinese religions \r 3.Literary value of Chinese religious classics \r 4.Rhetorical devices in The Lotus Sutra (法華經)\r 5.Rhetorical devices in The Divine Classic of Nan Hua (南華經) \r 6.Religious dimensions in Chinese literature \r 7.Religious reading of The Story of the Stone (紅樓夢): Part 1\r 8.Religious reading of The Story of the Stone (紅樓夢): Part 2 \r 9.Religious reading of The Journey to the West (西遊記): Part 1 \r 10.Religious reading of The Journey to the West (西遊記): Part 2 \r 11.Religious and literary features of Chan/Zen poetry (禪詩)\r 12.Religious and literary features of Daoist poetry (遊仙詩) \r 13.Conclusion", "required_readings": "", "recommended_readings": "陳洪：《佛敎與中國古典文學》，天津：天津人民出版社，1993。\r 陳允吉：《佛教與中國文學論稿》，上海：上海古籍出版社，2010。\r 輔仁大學外語學院編：《文學與宗敎：第一屆國際文學與宗敎會議論文集》，臺北：時報文化出版企業有限公司，1987。\r 苟波：《道教與神魔小說》，成都：巴蜀書社，1999。\r 黃子平主編：《中國小說與宗敎》，香港：中華書局，1998。\r 侯傳文：《佛經的文學性解讀》，臺北：慧明文化事業有限公司，2002。\r 蔣振華：《唐宋道教文學思想史》，長沙：嶽麓書社，2009。\r 李豐楙、廖肇亨主編：《聖傳與詩禪：中國文學與宗教論集》，臺北：中央研究院中國文哲研究所，2007。\r 李豐楙：《誤入與謫降：六朝隋唐道敎文學論集》，臺北：臺灣學生書局，1996。\r 李生龍：《道家及其對文學的影響》(修訂本)，長沙：岳麓書社，2005。\r 柳存仁：《中國傳統小說與社會》，新加坡：新加坡國立大學，1998。\r 柳存仁等著：《中國大文學史》，上海：上海书店出版社，2001。\r 柳存仁：〈全真教和小說西遊記〉，氏著：《和風堂文集》，上海：上海古籍出版社，1991，頁1319-1392。\r 劉夢溪等著：《紅樓夢十五講》，北京：北京大學出版社，2007。\r 劉敏：《天道與人心：道教文化與中國小說傳統》，北京：中國社會科學出版社，2007。\r 劉勇強：《中國古代小說史敘論》，北京：北京大學出版社，2007。\r 魯迅：《中國小說史略》，香港：三聯書店，1996。 \r 孫昌武：《禪思與詩情》，北京：中華書局，1997。\r 孫昌武：《詩苑仙蹤：詩歌與神仙信仰》，天津：南開大學出版社，2005。\r 孫昌武編注：《漢譯佛典翻譯文學選》，天津：南開大學出版社，2005。\r 孫昌武：《佛教與中國文學》(第2版)，上海：上海人民出版社，2007。\r 孫遜：《中國古代小說與宗敎》，上海：復旦大學出版社，2000。\r 吳光正等主編：《想像力的世界：二十世紀「道教與古代文學」論叢》，哈爾濱：黑龍江人民出版社，2006。\r 吳言生：《經典禪詩》，臺北：東大圖書股份有限公司，2002。\r 吳言生：《禪宗詩歌境界》，北京：中華書局，2001。\r 楊義：《中國古典小說十二講》，香港：三聯書店，2006。\r 永祥：《佛教文學對中國小說的影響》，臺北：佛光山宗務委員會，1998。\r 余國藩著；李奭學編譯：《余國藩西遊記論集》，臺北：聯經出版公司，1989。\r 余國藩著；李奭學編譯：《重讀石頭記：〈紅樓夢〉裏的情欲與虛構》，北京：麥田出版，2004。\r 余國藩著；李奭學編譯：《〈紅樓夢〉、〈西游記〉與其他：余國藩論學文選》，北京：生活‧讀書‧新知三聯書店，2006。\r 詹石窗：《道教文化十五講》，北京：北京大學出版社，2003。\r 朱耀偉編：《中國作家與宗敎》，香港：中華書局，2001。\r Detweiler, Robert & David Jasper, eds. Religion and Literature: A Reader. Louisville:Westminster John Knox Press, 2000. \r Plaks, Andrew H. Archetype and Allegory in the Dream of the Red Chamber. Princeton, N.J.: Princeton University Press, 1976.\r Yu, Anthony C. Rereading the Stone: Desire and the Making of Fiction in Dream of the Red Chamber. Princeton, N.J.: Princeton University Press, 1997.", "terms": {"2021-22 Term 2": {"--LEC (3766)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [1], "locations": ["Hui Yeung Shing Bldg G01"], "instructors": ["Professor LAI Tsz Pang"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Essays": "60", "Others": "10", "Presentation": "30"}}, {"code": "5327", "title": "Wisdom in Religious Classics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For the students of MA in Religious Studies", "description": "The classics of different religious traditions offer a wealth of knowledge, insight and wisdom about nature, reality and life. The store of ancient wisdom accumulated in various cultures is oftentimes still relevant to our contemporary contexts. This course takes a textual and story approach by examining the notions and themes of wisdom in some major religions of the world. Through guided reading of selected passages from the religious classics, students may draw from the well of profound wisdom to stimulate their reflection on the approach of life, the way of looking at the world, and the recurring issues facing humanity. Texts selected for reading may include Zhuangzi, the Lotus Sutra, the Bible and the Quran, the Bhagavad Gītā, and so forth. The exact list of texts may be modified by the teacher who offers the course in a particular year.", "outcome": "Upon successful completion of this course, students should be able to:\r 1.Enhance their ability to have a critical and yet sympathetic understanding and appreciation of different religious traditions;  2.Understand the notions of wisdom in major world religions in their historical and cultural settings and apply them in contemporary contexts;  3.Engage in a critical analysis of religious classics from textual and comparative perspectives.", "syllabus": "1. Interpreting religious classics\r 2. Notions and themes of wisdom \r 3. Wisdom in Zhuangzi: Harmony between human and nature in “The Happiness of Fish”\r 4. Wisdom in Zhuangzi: Transformation of life in “The Butterfly Dream” \r 5. Wisdom in the Lotus Sutra: Attachment and enlightenment in “The Parable of the Burning House” \r 6. Wisdom in the Lotus Sutra: Delusion and truth in “The Parable of the Poor Son” \r 7. Wisdom in the Bible: Making sense of loss and suffering in Job\r 8. Wisdom in the Bible: Futility and transience of life in Ecclesiastes \r 9. Wisdom in the Quran: Submission of human will to God’s will\r 10. Wisdom in the Quran: Mercy and moral behaviour in daily living\r 11. Wisdom in the Bhagavad Gītā: War as the allegory of struggling human soul \r 12. Wisdom in the Bhagavad Gītā: Yoga as the path of enlightenment and transcendence \r 13. Conclusion", "required_readings": "", "recommended_readings": "Afridi, Maulana Mohammad Razi Khan and Mohammad Ilyas Navaid, eds. \r  Encyclopaedia of Quranic Studies. New Delhi: Anmol Publications, 2006.\r Brodd, Jeffery and Gregory Sobolewski. World Religions: A Voyage of Discovery. \r  Winona, Minn.: Saint Mary's Press, 2003.\r Cole, Alan, \"Simplicity for the Sophisticated: Re-reading the Daode Jing for the \r Polemics of Ease and Innocence,\" in History of Religions, August 2006, pp. 1-49.\r Conze, Edward. Buddhist Wisdom Books: Containing the \"Diamond Sutra\" and the \r  \"Heart Sutra\" (new edition). London: Thorsons, 1975.\r Coogan, Michael D. A Brief Introduction to the Old Testament. New York: Oxford \r  University Press, 2009.\r Cornille, Catherine, ed. Song Divine: Christian Commentaries on the Bhagavad Gītā. \r  Grand Rapids, Michigan: Wm. B. Eerdmans Publishing Co., 2006. \r Crenshaw, J. L. Old Testament Wisdom: An Introduction. Louisville, Ky.: \r  Westminster John Knox Press, 2010.\r Crenshaw, J. L. \"The Wisdom Literature\", in Douglas A. Knight and Gene M. Tucker, \r eds. The Hebrew Bible and Its Modern Interpreters. Philadelphia, Pa.: Fortress Press, 1985.\r Eliade, Mircea, translated by Willard R. Trask. A History of Religious Ideas. Chicago: \r  University of Chicago Press, 1984.\r Feldmeier, Peter and Leo D. Lefebure. The Path of Wisdom: A Christian Commentary \r on the Dhammapada. Grand Rapids, Michigan: Wm. B. Eerdmans Publishing Co., 2011.\r Fox, Douglass. The Heart of Buddhist Wisdom: A Translation of the Heart Sutra with \r Historical Introduction and Commentary. Lewiston and Queenston Lampeter: Edwin Mellen Press, 1985.\r Geshe Kelsang Gyatso. Heart of Wisdom: An Explanation of the Heart Sutra. London: \r  Tharpa Publications, 2001.\r Jung, Carl, translated by R. F. C. Hull. Answer to Job. Princeton, N.J.: Princeton \r  University Press, 1973.\r Kaltenmark, Max, translated by Roger Greaves. Lao Tzu and Taoism. Stanford: \r  Stanford University Press, 1969.\r Klaus, Hilmar. The Tao of Wisdom. Laozi-Daodejing. Aachen: Verlag Mainz, 2009.\r Klostermaier, Klaus K. A Concise Encyclopedia of Hinduism. Oxford: Oneworld, \r  1998.\r Kohn, Livia and Michael LaFargue, eds. Lao-Tzu and the Tao-Te-Ching. Albany: \r  State University of New York Press, 1998.\r Lefebure Leo D. The Buddha and the Christ: Explorations in Buddhist and Christian \r  Dialogue. Maryknoll, N.Y. : Orbis Books, 1993.\r Marcus, Paul. Ancient Religious Wisdom, Spirituality, and Psychoanalysis. Westport, \r  Conn.: Praeger, 2003.\r Murphy, R. E. The Tree of Life: An Exploration of Biblical Wisdom Literature. New \r  York: Doubleday, 1990.\r Neville, Robert Cummings, ed. Ultimate Realities. Albany: State University of New \r  York Press, 2001.\r Neville, Robert Cummings, ed. The Human Condition. Albany: State University of \r  New York Press, 2001.\r Neville, Robert Cummings, ed. Religious Truth. Albany: State University of New \r  York Press, 2001.\r Nhat Hanh, Thich. The Heart of Understanding: Commentaries on the \r  Prajñaparamita Heart Sutra. Berkeley, Calif.: Parallax Press, 2009.\r Nursi, Said, translated by Huseyin Akarsu. The Gleams: Reflections on Qur'anic \r  Wisdom and Spirituality. Somerset, N.J.: Tughra Books, 2008. \r Oldmeadow, Harry. Light from the East: Eastern Wisdom for the Modern West. \r  Indiana: World Wisdom Inc., 2007.\r Palmer, E. H. trans. The Wisdom of the Koran. New York: Citadel Press, 2001.\r Perdue, Leo. The Sword and the Stylus: An Introduction to Wisdom in the Age of \r  Empires. Grand Rapids, Mich.: W. B. Eerdmans Pub. Co., 2008.\r Perdue, Leo. Wisdom and Creation: the Theology of Wisdom Literature. Nashville: \r  Abingdon Press, 1994.\r Setzer, Claudia. The Quotable Soul: Inspiring Quotations Crossing Time and Culture. \r  New York: Wiley, 1994.\r Theodor, Ithamar. Exploring the Bhagavad Gītā: Philosophy, Structure, and Meaning. \r  Farnham, Surrey: Ashgate Publishing Ltd., 2010.\r Van Buitenen, J. A. B. The Bhagavadgītā in the Mahābhārata: Text and Translation. \r  Chicago: University of Chicago Press, 1981. \r  何躍青編著：《心經的智慧》，臺北：廣達文化事業有限公司，2007。\r 林松：《〈古蘭經〉在中國》，銀川：寧夏人民出版社，2007。\r 孟欣：《老子哲學與人生智慧》，青島︰青島出版社，2006。\r 星雲大師︰《般若心經的生活觀》，台北︰有鹿文化事業有限公司，2010。\r 陳俊偉，謝文郁，樊美筠編：《東西方的人生智慧觀》，香港︰天道書樓，2005。\r 陳鼓應︰《老子今註今譯及評介》，台北︰台灣商務印書館，1991。\r 陳鼓應︰《莊子今註今譯》，台北︰台灣商務印書館，1999。\r 張易編著：《道家的智慧》，臺北：廣達文化事業有限公司，2009。\r 張保勝譯：《薄伽梵歌》，北京：中國社會科學出版社，2007。\r 葉舟編著：《老子的智慧》，臺北：廣達文化事業有限公司，2007。\r 葉舟編著：《佛經的智慧》，臺北：廣達文化事業有限公司，2006。\r 黃儀章：《活出智慧人生︰舊約智慧書資訊研究︰箴言約伯記傳道書》，香港︰天道書樓有限公司，2004。\r 新元、豔品編著：《古蘭經智慧物語》，北京︰大眾文藝出版社，1999。\r 詹衡宇：《禪的人生智慧》，瀋陽︰萬卷出版公司，2005。\r 濟群：《心經的人生智慧》，蘭州︰甘肅民族出版社，2007。\r 戴浩輝︰《智慧文學導論》，香港︰道聲出版社，2008。", "terms": {"2021-22 Term 2": {"--LEC (3163)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [3], "locations": ["Chen Kou Bun Bldg UG05"], "instructors": ["Dr TONG Sau Lin, \n\rDr. CHOW Wai Yin"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Essays": "60", "Others": "10", "Presentation": "30"}}, {"code": "5328", "title": "Taoism, Health and Nourishing of Life", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "for the students of MA in Religious Studies", "description": "This course is designed to explore the rich heritage of Taoist self-cultivation tradition. The course begins with an understanding of Taoist cosmology and its correlation with human body by indepth reading of major Taoist texts, e.g. Inner Chapters of Baopu zi neipian, Wuzhen pian, Lingbao bifa, and Jinhua zongzhi. Students of this course will be taught how are how Taoist concept of qi shapes the understanding of health and perfection of human body, and develops the practices of self cultivation, e.g. inner alchemy, meditation, qigong exercises and etc. The approach of this course emphasizes lecture, discussion of reading materials and practice.", "outcome": "Upon successful completion of this course, students should be able to:\r  - Understand the development of Taoist cultivation practice and its religious meaning in China. \r - Analyze Taoism’s worldview with respect to the cosmos, human existence, health, and cultivation practice.\r - Analyze Taoism’s healthy and moral life with respect to its cultivation practices. \r - Compare and contrast Taoism and Western philosophy under the categories of human life, health and cultivation.", "syllabus": "1. Introduction: What is Keeping the One?\r 2. Qi, Cosmology, and Human Body \r 3. History of Daoist Tradition of Inner Alchemy * \r 4. Taoism, Illness, and Perfection of life \r 5. Health and Body in Taoism and the West \r 6. Reading on the Inner Chapters of Baopu zi neipian \r 7. Reading on the Wuzhen pian \r 8. Reading on the Lingbao bifa \r 9. Reading on the Jinhua zongzhi \r 10. Taoist Inner Alchemy Practice \r 11. Taijiquan, Qigong and Taoism \r 12. Field Study: Taoist Self-Cultivation Practice in Hong Kong Taoist Communities\r 13. Conclusion", "required_readings": "General References\r  Schipper, Kristofer. The Taoist Body. Berkeley: University of California Press, 1993.\r Robinet, Isabelle. The World Upside Down: Essays on Taoist Internal Alchemy, ed. and tr. By Fabrizio Pregadio. Mountain View, CA: Golden Elixir Press, 2011.", "recommended_readings": "Other References\r  Eskildsen, Stephen. Asceticism in Early Taoist Religion. Albany: State University of New York Press, 1998.\r Fromm, Mallory. Qi Energy for Health and Healing. New York, NY: Avery, 2003.\r Kohn, Livia. Myth and Meaning in Early Taoism: The Theme of Chaos (Hun-tun). Daoism and Chinese Culture. Cambridge. MA: Three Pines Press, 2001.\r Kohn, Livia. The Taoist Experience: An Anthology. Albany: State University of New York Press, 1993.\r Kohn, Livia. Early Chinese Mysticism: Philosophy and Soteriology in the Taoist Tradition. Princeton: Princeton University Press, 1992.\r Robinet, Isabelle. Taoism: Growth of a Religion. Stanford: Stanford University Press, 1997.\r Robinet, Isabelle. Taoist Meditation: the Mao-shan Tradition of Great Purity, tr. by Julian F. Pas and Norman Girardot. Albany: State University of New York Press, 1993.\r Wong, Eva. The Tao of Health, Longevity, and Immortality: The Teachings of Immortals Chung and Lü. Boston: Shambhala, 2000.\r  李遠國：《中國道教氣功養生大全》。成都市：四川辭書出版社，1991。\r 張廣保：《金元全真道內丹心性學》。北京：生活、讀書、新知三聯書店，1995。\r 胡孚琛，呂錫琛：《道學通論：道家‧道教‧丹道》。北京：社會科學文獻出版社，2004。 \r 胡孚琛，呂錫琛：《道學通論：道家‧道教‧仙學》。北京市：社會科學文獻出版社，1999。 \r 胡衛國、宋天彬（著）：《道教與中醫》。台北市：文津出版社，1997。 \r 張振國：《返朴歸真：道教與人生》。上海：上海書店出版社，2003。 \r 陳禾原：《丹道修煉與養生學》。北京：社會科學文獻出版社，2006。\r 陳攖寧：《道教與養生》。北京：華文出版社，2000。 \r 黎志添：〈《抱朴子內篇》的歷史意義：葛洪神仙思想的宗教社會意義〉，《清華學報》29 (1999) ，頁35-58。", "terms": {"2020-21 Term 1": {"--LEC (2840)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. LUK Tsing Tsing Crystal"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12"]}}}, "assessments": {"Essays": "40", "Others": "20", "Presentation": "40"}}, {"code": "5329", "title": "Buddhism, Right Mindfulness and Meditation", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For the students of MA in Religious Studies", "description": "Centering on the notion of “right mindfulness”, this course aims to introduce students to the core topics on the Buddhist way to inner peace and happiness. The course will therefore address subjects such as affliction, self and no-self, the middle way, right mindfulness, and etc. Furthermore, the course will touch upon some common issues in modern life, and will investigate how they can gain inspirations from Buddhist perspectives, whether theoretical or practical. Towards the middle and the end of the course, students will learn essential methods of meditation based on Buddhist mindfulness. Students will thereby acquire an initial experience of meditation and take the benefits of meditative concentration into every aspect of their life.", "outcome": "※ Knowledge Outcomes:\r Upon completion of the subject, students will be able to:\r (1) enlarge and refine their understanding of the fundamental doctrines of the Buddhist way to liberation; (2) understand the key concepts and principles in Buddhist meditation techniques; (3) experience an initial grasp of insight meditation exercise; (4) demonstrate critical reflections on the relation between the Buddhist ultimate truth and worldly truth.\r  ※ Attitude Outcomes:\r (1) nurture a larger sensitivity to the value of religious practice in human life; (2) relate their personal growth and everyday life to Buddhist meditation practice so as to develop a sense of mindfulness and cultivate a constructive outlook on the self, life and the world.", "syllabus": "1. An Overview: Buddhist Perspective of Spiritual Growth and Happiness \r 2. Affliction, Desire and Impermanence\r 3. The Idea of No-Self: What Buddhism Teaches about the Self?\r 4. Enlightened Truth, Worldly Truth and Wisdom of the Middle Way\r 5. Right Understanding and Right Mindfulness\r 6. Insight Meditation and Discovery of the Inner Self\r 7. Outside-Class Meditation Exercise \r 8. Buddhist view of Self-Actualisation and Secular Achievements\r 9. Buddhist Attitude toward Lay Ethics\r 10. Cultivating Good Interpersonal Relationship with Metta Meditation (慈心禪)\r 11. Outside-Class Meditation Exercise\r 12. Group Presentation\r 13. The Power of Being Present: Inspirations of Zen Koans", "required_readings": "Ajahn Sumedho, The Mind and the Way: Buddhist Reflections on Life. Boston: Wisdom, 1995. \r Ayya Khema, Who Is My Self? A Guide to Buddhist Meditation. Boston: Wisdom, 1997.\r Charles S. Prebish and Damien Keown, Introducing Buddhism. New York :  Routledge, 2006.\r Dales S. Wright, The Six Perfections: Buddhism and the Cultivation of Character. Oxford ; New York : Oxford University Press, 2009.\r Damien Keown, Buddhist Ethics: A Very Short Introduction. Oxford ; New York : Oxford University Press, 2005. \r Ed. Damien Keown, Contemporary Buddhist Ethics, Richmond : Curzon, 2000.\r John W. Schroeder, Skillful Means: The Hearts of Buddhist Compassion. Honolulu:\r University of Hawai’i Press, 2001.\r Leslie Kawamura, “The Middle Path According to the Kāśyapaparivarta-sūtra”.ed. Jonathan A. Silk, Wisdom, Compassion, and the Search for Understanding: The Buddhist Studies Legacy of Gadjin M. Nagao. Honolulu: University of  Hawai’i Press, 2000. \r Lobsang Gyatso, Bodhicatta: Cultivating the Compassionate Mind of Enlightenment. Ithaca, New York: Snow Lion, 1997.\r Peter Harvey, The Selfless Mind. Surrey : Curzon Press, 1995. \r Pérez Remón, Joaquín, Self and Non-Self in Early Buddhism. The Hague: Mouton, 1980.\r Phra Thēpwēthī (Prayut), trans. Grant A. Olson, Buddhadhamma : natural laws and values for life. Albany : State University of New York Press, 1995. \r Sarah Shaw, Buddhist meditation : an anthology of texts from the Pāli canon. London ; New York : Routledge, 2006. \r Sarah Shaw, Introduction to Buddhist Meditation. London and New York: Routledge. 2009.\r Susan Blackmore, Ten Zen Questions. Oxford: Oneworld, 2009.\r Thict Nhat Hanh, The Heart of the Buddha’s Teaching: Transforming Suffering into Peace, Joy and Liberation. New York : Broadway Books, 1999.\r Thich Nhat Hanh, edited by Arnold Kotler, Peace is every step : the path of mindfulness in everyday life. New York, N.Y. : Bantam Books, 1991.\r Tse-fu Kuan, Mindfulness in early Buddhism : new approaches through psychology and textual analysis of Pali, Chinese and Sanskrit sources. London ; New York : Routledge, 2008. \r 一行禪師：《一行禪師釋佛：正念，從現在開始》，北京：中國長安， 2005。\r 王仲堯：《慈善喜捨 : 佛教財富觀》，北京: 宗教文化，2004。\r 印順：《學佛三要》，台北：正聞，1983(民72)。\r 印順：《中觀今論》，台北：正聞，1971(民60)。\r 阿姜查著，賴隆彥譯：《阿姜查的禪修世界‧慧》，台北：橡樹林，2004(民93)。 \r 吳怡：《公案禪語》，台北：東大，1991(民80)。\r 波卡仁波切著，吳嘉真等譯：《照見清淨心：禪修入門指引》,台北：張老師，1999。\r 愚子：《五戒現代觀‧上》，北京：宗教文化，2004。\r 聖嚴法師：《公案100》，台北：法鼓文化，2001。\r 聖嚴法師：《法鼓全集》七之十四〈八正道〉，台北：法鼓文化，2005(民94)。\r 聖嚴法師：《是非要温柔》，台北：法鼓文化，1999(民88)。", "recommended_readings": "", "terms": {"2021-22 Term 2": {"--LEC (1738)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [5], "locations": ["Hui Yeung Shing Bldg G01"], "instructors": ["Dr TONG Sau Lin"], "meetingDates": ["14/1", "21/1", "28/1"]}}}, "assessments": {"Essays": "50", "Others": "20", "Presentation": "30"}}, {"code": "5331", "title": "Special Topic in Religious Studies I", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For the students of MA in Religious Studies", "description": "The specific topics of this course vary from year to year, depending on the expertise of the teacher of that particular year. Generally, they can be topics and issues related to different religious traditions, religion and society, religion and culture, or religion and life.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5332", "title": "Special Topic in Religious Studies II", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For the students of MA in Religious Studies", "description": "The specific topics of this course vary from year to year, depending on the expertise of the teacher of that particular year. Generally, they may be more advanced themes and theories related to different religious traditions, religion and society, religion and culture, or religion and life.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5333", "title": "Field Studies of Religious Culture", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Others", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students of MA in Religious Studies.", "description": "Integrating classroom learning with field work in relation to religious culture, this course is designed to help students truly comprehend textual knowledge and develop deeper insights into religious understanding by engaging in the spatial, geographical and material dimensions of particular religious traditions. This is a three-credit course in which the majority of the academic work is accomplished through group study and travel to some carefully selected religious sites, whether overseas or domestic. It aims to provide students with a lively and effective learning experience at an off-campus location for a minimum of three overnights, and enhances the student’s classroom learning through first-hand exposure to the religious relics and material culture. Each study tour will be organized and headed by experienced members of teaching staff. The specific sites of visit will depend on the subject and theme of study designed by the teacher who offers the course in a particular year.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5335", "title": "Understanding Religion through Film", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA in Religious Studies", "description": "This course is designed to assist students in recognizing religious concepts, east and west, through analyzing movies that seem to have to do with “religion” per se. The course will help students explore how religion may be treated as an integral human phenomena and how religion involves the fullness of the human world through film watching.In addition, the course provides students with opportunities to think critically about a wide range of meanings concerning the existence of human beings through particular films. A religious notion of interpretation will be taken to examine how the meanings are constructed and transmitted to viewers through various visual narrative forms and symbols. It also encourages students to appreciate the form of cinematic aesthetics and symbols from the interdisciplinary perspectives.", "outcome": "Upon successful completion of the course, students are expected to:\r  Knowledge Outcomes:\r 1. the components of religious worldviews common to most religions; 2. understand how religion and film intersect;  Attitude Outcomes:\r 1. higher sensitivity to the contributing role of religions in human culture and history; 2. move beyond viewing films as mere entertainment to understanding them as multi-layered texts\r  Skill Outcomes:\r 1. develop skills in analytical reading, formal writing, and critical thinking\r 2. critically evaluate particular cinematic works in their various forms through the lenses of Religious\r  Studies.", "syllabus": "1. Course introduction: How Religion and film intersect?\r Weiner, Robert G, “Film & Religion: An Introduction”, in The Journal of Popular Culture, 2009, Vol.42(3), pp.583-584.\r Wright, Melanie J, Religion and Film : An Introduction. Chapters I & II. London ; New York : I.B. Tauris, New York : Distributed in the U.S. by Palgrave Macmillan, 2007.\r  2. Shawshank’s Redemption (1994): Hope and Redemption\r Paul V.M. Flesher, Robert Torry, “Violence and Redemption, “ in Film & religion : an introduction. Chapter 8, Nashville, TN : Abingdon Press, 2007.\r  3. The Exorcist (1973): Religion and Science\r Alister E. McGrath, Science and Religions: A New Introduction, Wiley Blackwell. Part III, 18, 23, 24\r 徐英瑾等主編：《科學與宗教：二十一世紀的對話──英美四名家復旦演講集》第四講、第六講，上海：復旦大學出版社，2008。\r  4. Life of Pi (2012): What is Religion?\r Berger, Peter L. 1969: The Sacred Canopy : Elements of a Sociological Theory of Religion (New York) (中譯：《神聖的帷幕 : 宗教社會學理論的要素 》（台北：商周，2003）, pp. 37-62.\r Mircea Eliade, The Sacred And the Profane: The Nature of Religious Myth, Symbolism,and Ritual Within Life and Culture. New York: A Harvest/HBJ Book, 1957, pp. 8-113。(中譯本──伊利亞德著，楊素娥譯：《聖與俗──宗教的本質》。台北：桂冠圖書，2001, 第一章及第二章)\r  5. Life of Pi (2012): Religious Plurality\r John Hick著，陳志平、王志成譯: 《理性與信仰：宗教多元論諸問題》(Problems of Religious Pluralism) (成都：四川人民出版社，2003) ，第三章，頁31-51。\r  6. Simon of the Desert (1965): Celibacy in Religious Traditions\r Edited by Carl Olson, Celibacy and Religious Traditions [electronic resource] . Chapter 1, New York : Oxford University Press, 2007.\r  7. Samsara (2001) : Indulgence or Abstinence?\r David Webster, The philosophy of desire in the Buddhist Pali canon. pp. 1-17. London ; New York : Routledge Curzon, 2005.\r 呂大吉：〈概說宗教禁欲主義〉，《中國社會科學》，頁159-174，1989年5月。\r  8. Running On Karma (2003): Karma and Reincarnation \r Richard Gombrich, How Buddhism Began: the conditioned genesis of the early teachings. Ch. II. Atlantic Highlands, N.J. : Athlone Press, 1996.\r 平川彰：《印度佛教史》，pp.61-68。臺北市：商周出版，2002。\r  印順法師：《佛法概論》，第十一章。上海：上海古籍出版社，1998。(electronic resource)\r  9. Zen (禅)(2009): Zen and Buddha Nature\r 波卡仁波切著，吳嘉真等譯：《照見清淨心：禪修入門指引》，第四至六章，台北：張老師，1999。\r Siderits, Mark, “Does a Table Have Buddha-Nature?” Philosophy East and West, 2013, Vol.63(3), pp.373-386.\r  10. Departures (禮儀師の奏鳴曲)(2008): Religion, Death and the Meaning of Life\r Bolt, Peter G. “Life, Death, and the Afterlife in the Greco-Roman World.” In Life in the Face of Death: The Resurrection Message of the New Testament. Grand Rapids: Eerdmans, 1991.\r Swenson, “The Dignity of Human Life.” In The Meaning of Life. p.20. Edited by E. D. Klemke. New York: Oxford University Press, 1981.\r  11. 千と千尋の神隠し(2001): Souls, Ghosts and Death\r Rebecca L. Stein, The Anthropology of Religion, Magic, and Witchcraft, pp. 161-188. Boston : Pearson/A and B, 2008\r  12. The Truman Show (1998) : What is Self? \r Dharm P. S. Bhawuk, “Indian Concept of Self,” in Spirituality and Indian Psychology: Lessons from the Bhagavad-Gita, pp. 65-91, New York : Springer 2011.\r Peter Harvey, The Selfless Mind. chapters 1-4, Surrey : Curzon Press, 1995.\r  13. 春去春又來 (2003): The three Poisons (Greed, Anger and Ignorance) and Buddhist ethics\r 楊斐芬：〈電影《春去春又來》的佛教倫理觀〉，建國科技大學《第六屆職業倫理與職業道德教育研討會》，2009年5月。\r Damien Keown, Buddhist ethics : a very short introduction. Oxford ; New York : Oxford University Press, 2005.", "required_readings": "Weiner, Robert G, “Film & Religion: An Introduction”, in The Journal of Popular Culture, 2009, Vol.42(3), pp.583-584.\r Wright, Melanie J, Religion and Film : An Introduction. Chapters I & II. London ; New York : I.B. Tauris, New York : Distributed in the U.S. by Palgrave Macmillan, 2007.\r  Paul V.M. Flesher, Robert Torry, “Violence and Redemption, “ in Film & religion : an introduction. Chapter 8, Nashville, TN : Abingdon Press, 2007.\r  Alister E. McGrath, Science and Religions: A New Introduction, Wiley Blackwell. Part III, 18, 23, 24\r 徐英瑾等主編：《科學與宗教：二十一世紀的對話──英美四名家復旦演講集》第四講、第六講，上海：復旦大學出版社，2008。\r  Berger, Peter L. 1969: The Sacred Canopy : Elements of a Sociological Theory of Religion (New York) (中譯：《神聖的帷幕 : 宗教社會學理論的要素 》（台北：商周，2003）, pp. 37-62.\r Mircea Eliade, The Sacred And the Profane: The Nature of Religious Myth, Symbolism,and Ritual Within Life and Culture. New York: A Harvest/HBJ Book, 1957, pp. 8-113。(中譯本──伊利亞德著，楊素娥譯：《聖與俗──宗教的本質》。台北：桂冠圖書，2001, 第一章及第二章)\r  John Hick著，陳志平、王志成譯: 《理性與信仰：宗教多元論諸問題》(Problems of Religious Pluralism) (成都：四川人民出版社，2003) ，第三章，頁31-51。\r  Edited by Carl Olson, Celibacy and Religious Traditions [electronic resource] . Chapter 1, New York : Oxford University Press, 2007.\r  David Webster, The philosophy of desire in the Buddhist Pali canon. pp. 1-17. London ; New York : Routledge Curzon, 2005.\r 呂大吉：〈概說宗教禁欲主義〉，《中國社會科學》，頁159-174，1989年5月。\r  Richard Gombrich, How Buddhism Began: the conditioned genesis of the early teachings. Ch. II. Atlantic Highlands, N.J. : Athlone Press, 1996.\r 平川彰：《印度佛教史》，pp.61-68。臺北市：商周出版，2002。\r  印順法師：《佛法概論》，第十一章。上海：上海古籍出版社，1998。(electronic resource)\r  波卡仁波切著，吳嘉真等譯：《照見清淨心：禪修入門指引》，第四至六章，台北：張老師，1999。\r Siderits, Mark, “Does a Table Have Buddha-Nature?” Philosophy East and West, 2013, Vol.63(3), pp.373-386.\r  Bolt, Peter G. “Life, Death, and the Afterlife in the Greco-Roman World.” In Life in the Face of Death: The Resurrection Message of the New Testament. Grand Rapids: Eerdmans, 1991.\r Swenson, “The Dignity of Human Life.” In The Meaning of Life. p.20. Edited by E. D. Klemke. New York: Oxford University Press, 1981.\r  Rebecca L. Stein, The Anthropology of Religion, Magic, and Witchcraft, pp. 161-188. Boston : Pearson/A and B, 2008\r  Dharm P. S. Bhawuk, “Indian Concept of Self,” in Spirituality and Indian Psychology: Lessons from the Bhagavad-Gita, pp. 65-91, New York : Springer 2011.\r Peter Harvey, The Selfless Mind. chapters 1-4, Surrey : Curzon Press, 1995.\r  楊斐芬：〈電影《春去春又來》的佛教倫理觀〉，建國科技大學《第六屆職業倫理與職業道德教育研討會》，2009年5月。\r Damien Keown, Buddhist ethics : a very short introduction. Oxford ; New York : Oxford University Press, 2005.", "recommended_readings": "*Highly recommended\r  (I) On Religion\r * Claude Levi‐Strauss, Myth and Meaning, London: Routledge and K.Paul, 1978. (中譯本：李維斯陀，楊德睿譯：《神話與意義》(台北：麥田出版社, 2001。)\r  Emile, Durkeim. Elementary Form of Religious Life, translated by Karen E. Fields, Book III, pp.303‐448, New York: The Free Press, 1995. (中譯本：涂爾幹著，芮傳明、趙學元譯：《宗教生活的基本形式》，台北：桂冠圖書股份有限公司。第三篇，頁 339‐507 。)\r  * Turner, Victor, The Ritual Process: Structure and Anti‐Structure, Ithaca, N.Y.: Cornell University Press,\r 1969.\r  Ricoeur, Paul, The Symbolism of Evil, Boston: Beacon Press, 1967, part II, 161‐358.\r  [中譯本(1) 保羅．里克爾著、翁紹軍譯：《惡的象徵》下篇：〈起源的神話和終結的神話〉，頁\r 167‐386。台北：桂冠圖書：1992。或中譯本(2) 保羅．里克爾著、公車譯：《惡的象徵》下篇〈 起\r 源的神話和終結的神話〉，頁 163‐371。上海：上海人民出版社，2003。]\r   Wolf, Arthur P, \"Gods, Ghosts, and Ancestors,\" in Religion and Ritual in Chinese Society, ed. Arthur P.\r Wolf (Stanford: Stanford University Press, 1974), 131-182.\r  * Geertz, Clifford, “Religion as a Cultural System,” The Interpretation of Cultures (New York: Basic Books,\r 1973).\r  (II) On Film\r * Bordwell, David and Kristin Thompson, Film Art: An Introduction, New York: McGraw Hill, 1996. \r  (Reserved at UL)\r  Corrigan, Timothy, A Short Guide to Writing about Film, 2nd ed, San Francisco, CA: HarperCollins, 1994. Giannetti, Louis, Understanding Movies, New Jersey: Person Prentice Hall, 2008.\r 大衛‧博維爾著，何慧玲譯，李焯桃編：《香港電影王國》。香港：洪葉書店，2001。\r   (III) On Religion and Film\r  Bandy, Mary Lea and Antonio Monda, editors, The Hidden God: Film and Faith. New York: The Museum of\r Modern Art, 2003.\r Fielding, Julien R. Discovering World Religions At 24 Frames Per Second. Lanham, Md. : Scarecrow Press, 2008.\r Flesher, Paul V. M. and Robert Torry, Film and Religion: An Introduction, Nashville, TN: Abingdon, 2007. Gabler, Neal, Life the Movie: How Entertainment Conquered Reality. New York: Alfred A. Knopf, 1998. Holloway, Richard. Beyond the Image: Approaches to the Religious Dimension in the Cinema .Geneva: WCC,1977.\r  Hoover, Stewart and Knut Lundby, eds. Rethinking Media, Religion and Culture. London: Sage, 1997.\r  * Lyden, John C., Film as Religion: Myths, Morals, and Rituals, New York and London: New York University\r Press, 2003.\r  * Plate, S. Brent, editor, Representing Religion in World Cinema: Filmmaking, Mythmaking, Culture Making.\r New York: Palgrave Macmillan, 2003.\r  Warren, Michael, Seeing Through Media: A Religious View of Communications and Cultural\r Analysis. Harrisburg, PA: Trinity, 1997.\r  侯軍：《基督教與西方電影》。北京：文化藝術出版社，2006。\r  Lebeau, Vicky, 陳儒修、鄭玉菁譯。《佛洛伊德看電影》。台北：書林出版有限公司，2004。\r  鄭泰丞：《電影觀賞：現世的宗敎意含》。台北市：桂冠圖書股份有限公司，2001。", "terms": {"2020-21 Term 2": {"--LEC (9079)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [5], "locations": ["Wu Ho Man Yuen Bldg 301"], "instructors": ["Dr TONG Sau Lin"], "meetingDates": ["15/1", "22/1", "29/1", "5/2"]}}}, "assessments": {"Essays": "60", "Presentation": "40"}}, {"code": "5336", "title": "Religion and Migration", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Classwork", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students of MA in Religious Studies", "description": "This course introduces students to the contemporary state of research on religion and migration. It scrutinizes forms and contents of migrants’ individual religiosity, analyzes the role of religion in migrants’ socio-economic integration trajectories, discusses religious underpinnings of transnational migrant networks, and studies political controversies over religious diversity as induced by international migration. Covering quantitative and qualitative research in the USA, Asia, and Europe, the course puts particular emphasis on contextual factors of the interplay between religion and migrant incorporation/integration. Throughout the course, students will be made familiar with major theoretical and empirical work addressing the link between religion and migrant incorporation. Moreover, they will learn how to think creatively about comparative research designs that allow disentangling individual, group, and contextual factors.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6001", "title": "Graduate Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "The purpose of this course is to give first-year M. Phil. and Ph.D. students an opportunity to report on and discuss their independent research and thesis writing.", "outcome": "- Engage in literary analysis of texts and images related to graduate students’ research topics; - Acquire critical familiarity with the uses and limitations of major theoretical approaches and frameworks for analysis of the topics concerned", "syllabus": "1. Introduction2. Lecture3. Discussion of paper4. Discussion of paper5. Discussion of paper6. Preparing literature survey7. Preparing research paper8. Literature survey9. Literature survey 10. Literature survey11. Research paper12. Research paper13. Research paper The syllabus and assessment type may vary according to the teaching staff and year of offering. Please refer to the course outline for details. ", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "terms": {"2020-21 Term 2": {"-S01-SEM (2469)": {"startTimes": ["13:30"], "endTimes": ["16:15"], "days": [4], "locations": ["Lady Shaw Bldg C3"], "instructors": ["Professor LAI Chi Tim"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 2": {"-S01-SEM (2388)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Lee Shau Kee Building 203"], "instructors": ["Professor LAI Chi Tim"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Essays": "60", "Presentation": "20", "Report": "20"}}, {"code": "6002", "title": "Graduate Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "The purpose of this course is to give second-year M. Phil. and Ph.D. students an opportunity to report on and discuss their independent research and thesis writing.", "outcome": "- Engage in literary analysis of texts and images related to graduate students’ research topics; - Acquire critical familiarity with the uses and limitations of major theoretical approaches and frameworks for analysis of the topics concerned", "syllabus": "1. Course introduction2. Class discussion3. Presentation preparation4. Presentation preparation5. Presentation preparation6. Presentation and discussion7. Presentation and discussion8. Presentation and discussion9. Presentation and discussion10. Presentation and discussion11. Course conclusion The syllabus and assessment type may vary according to the teaching staff and year of offering. Please refer to the course outline for details. ", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "terms": {"2020-21 Term 1": {"-S01-SEM (3955)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor LAI Pan Chiu"], "meetingDates": ["10/9", "17/9", "24/9"]}}, "2021-22 Term 1": {"-S01-SEM (3880)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Wong Foo Yuan Bldg 402"], "instructors": ["Professor LAI Pan Chiu"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Discussion": "20", "Essays": "60", "Presentation": "20"}}, {"code": "6113", "title": "Chinese Religions: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on selected issues related to studies of Chinese religions. Emphasis will be placed on the interactions among different religious traditions in local Chinese society. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "- Engage in literary analysis of texts and images related to topics in Chinese religions; - Acquire critical familiarity with the uses and limitations of major theoretical approaches and frameworks for analysis of topics in Chinese religions", "syllabus": "The syllabus and assessment type may vary according to the teaching staff and year of offering. Please refer to the course outline for details.", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "terms": {"2021-22 Term 1": {"-S01-SEM (3115)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor TAM Wai Lun"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}}, "assessments": {"Essays": "60", "Presentation": "40"}}, {"code": "6114", "title": "Chinese Religions: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on selected issues related to studies of Chinese religions. Emphasis will be placed on the interactions among different religious traditions in local Chinese society. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6115", "title": "Buddhist Studies: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "This seminar examines Buddhism as a dynamic process of borrowing, conflict and interaction between and within traditions that have been identified as Buddhist. We will begin by studying some representative works of both primary and secondary source (such as those put together by Donald Lopez in his Buddhism in Practice). Specific themes and topics will then be chosen in accordance with students’ interest for in-depth examination. The specific content will be designed by the teacher who offers the courses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6116", "title": "Buddhist Studies: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "This seminar examines Buddhism as a dynamic process of borrowing, conflict and interaction between and within traditions that have been identified as Buddhist. We will begin by studying some representative works of both primary and secondary source (such as those put together by Donald Lopez in his Buddhism in Practice). Specific themes and topics will then be chosen in accordance with students’ interest for in-depth examination. The specific content will be designed by the teacher who offers the courses.", "outcome": "- Acquire basic knowledge of Buddhist studies;  - Develop skills in analytical reading, formal writing and critical thinking; - Relate Buddhist concepts and persuasions to their ethical cultivation and views of life as well as to their coexistence with the nature.", "syllabus": "The syllabus and assessment type may vary according to the teaching staff and year of offering. Please refer to the course outline for details.", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "terms": {"2021-22 Term 2": {"-S01-SEM (2747)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Douglas Matthew GILDOW"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Essays": "60", "Presentation": "40"}}, {"code": "6121", "title": "Taoist Studies: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on selected issues related to Taoism. Readings may include Taoist Canon, Taoist ritual manuscripts, and recent scholars’ work on Taoist studies. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6122", "title": "Taoist Studies: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on selected issues related to Taoism. Readings may include Taoist Canon, Taoist ritual manuscripts, and recent scholars’ work on Taoist studies. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "- Acquire basic knowledge of Taoist studies;  - Develop skills in analytical reading, formal writing and critical thinking; - Relate Taoist concepts and persuasions to their ethical cultivation and views of life as well as to their coexistence with the nature", "syllabus": "The syllabus and assessment type may vary according to the teaching staff and year of offering. Please refer to the course outline for details.", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "terms": {"2020-21 Term 2": {"-S01-SEM (1821)": {"startTimes": ["16:45"], "endTimes": ["18:45"], "days": [3], "locations": ["TBA"], "instructors": ["Professor LAI Chi Tim"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}}, "assessments": {"Essays": "60", "Presentation": "40"}}, {"code": "6131", "title": "Biblical Studies: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on special issues related to biblical studies. Students are allowed to take these courses for more than once, and gain the units each time they pass the course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6132", "title": "Biblical Studies: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "LectureSeminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on special issues related to biblical studies. Students are allowed to take these courses for more than once, and gain the units each time they pass the course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6140", "title": "Christian Studies: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "LectureSeminarInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on specific issues related to Christian studies. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "- Be able to study the classical Christian studies;  - Acquire knowledge on the historical background and the main trends of development;  - Develop skills in analytical reading of some of the classical texts of Christian studies", "syllabus": "1         Introduction2        Theological & Philosophical Approaches to Religious DiversityReading: Chapters 1-3, 賴品超。《宗教都是殊途同歸？宗教研究與漢語神學的視角》。香港：道風書社，2020.11（出版中）。3         Comparative Studies of Religions    Reading: Chapters 4-6, 賴品超。《宗教都是殊途同歸？》。4         Chinese and Western Theologies of Religious Diversity  Reading: Chapters 7-9, 賴品超。《宗教都是殊途同歸？》。5         Pluralistic Understanding of Salvation(s)                Reading: Chapters 10-12, 賴品超。《宗教都是殊途同歸？》。6       Student presentation journal article / book chapter7       Student presentation journal article / book chapter8       Student presentation journal article / book chapter9        Buddhism and Christianity                Reading: (1) Lai, Pan-chiu. “Christian Mission and Buddhists.” Oxford Handbook of Mission Studies, edited by Kirsteen Kim and Alison Fitchett Climenhaga (Oxford: Oxford University Press, forthcoming 2021); (2) Lai, Pan Chiu and Rouyan Gu. “Self-love and Altruistic Love in Bodhicaryāvatāra: A Christian Theological Reflection.” The Brill Companion to Comparative Theology, edited by Pim Valkenburg (Leiden: Brill, forthcoming 2021); 10       Christian Theology and Public IssuesReading: (1) Lai, Pan-chiu. “Political Forgiveness: A Contextual and Multidisciplinary Dialogue with Reinhold Niebuhr.” Theology Today (forthcoming October 2020), forthcoming; (2) Lai, Pan-chiu. “Ecological Heritage of Protestantism in Chinese Christian Perspective.” Submitted to Ching Feng (New Series) 18.2 (forthcoming 2021).11     Student presentation of paper12      Student presentation of paper13      Student presentation of paper The syllabus and assessment type may vary according to the teaching staff and year of offering. Please refer to the course outline for details.", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "terms": {"2020-21 Term 1": {"-S01-SEM (3956)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor LAI Pan Chiu"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}}, "assessments": {"Discussion": "10", "Essays": "70", "Presentation": "20"}}, {"code": "6145", "title": "History of Christianity: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "LectureSeminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on specific issues related to history of Christianity. Students are allowed to take these courses for more than once, and gain the units each time they pass the course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6146", "title": "History of Christianity: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "LectureSeminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on specific issues related to history of Christianity. Students are allowed to take these courses for more than once, and gain the units each time they pass the course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6147", "title": "Chinese Christianity: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "This seminar course aims to reconsider various Christian doctrines from Chinese religious, philosophic and socio-cultural contexts. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6148", "title": "Chinese Christianity: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "This seminar course aims to reconsider various Christian doctrines from Chinese religious, philosophic and socio-cultural contexts. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6149", "title": "Christian Studies: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on specific issues related to Christian studies. Students are allowed to take these courses for more than once, and gain the units each time they pass the course. The specific content will be designed by the teacher who offers the courses.", "outcome": "- Be able to study the classical Christian studies;  - Acquire knowledge on the historical background and the main trends of development;  - Develop skills in analytical reading of some of the classical texts of Christian studies", "syllabus": "The syllabus and assessment type may vary according to the teaching staff and year of offering. Please refer to the course outline for details.", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "terms": {"2020-21 Term 2": {"--LEC (4245)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [5], "locations": ["Lee Shau Kee Building 206"], "instructors": ["Professor LAI Pan Chiu"], "meetingDates": ["19/2", "26/2", "5/3", "12/3", "19/3", "26/3"]}}, "2021-22 Term 2": {"--LEC (3845)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor LAI Pan Chiu"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Discussion": "10", "Essays": "70", "Presentation": "20"}}, {"code": "6151", "title": "Religion and Society: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "LectureSeminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on specific issues related to Religion and Society. Students are allowed to take these courses for more than once, and gain the units each time they pass the course.", "outcome": "- Engage in literary analysis of texts and images related to topics in religion and society; - Acquire critical familiarity with the uses and limitations of major theoretical approaches and frameworks for analysis of topics in religion and society", "syllabus": "The syllabus and assessment type may vary according to the teaching staff and year of offering. Please refer to the course outline for details.", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering.Please refer to the course outline for details.", "terms": {"2020-21 Term 2": {"-S01-SEM (3325)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["No Room Required"], "instructors": ["Professor HUANG Weishan"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 1": {"-S01-SEM (1175)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor LAI Pan Chiu"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}}, "assessments": {"Essays": "60", "Presentation": "40"}}, {"code": "6152", "title": "Religion and Society: Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "LectureSeminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "Discussion in seminar setting on specific issues related to Religion and Society. Students are allowed to take these courses for more than once, and gain the units each time they pass the course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6160", "title": "Islamic Studies: Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD in Religious Studies", "description": "This seminar examines Islam as a religion and civilization characterized by dynamics of borrowing, conflict, and interaction between and within traditions that are identified as “Islamic”. We will begin by studying some representative works of both primary and secondary source. Specific themes and topics will then be chosen in accordance with students’ interest for in-depth examination. The specific content will be designed by the teacher who offers the course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "8003", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student’s academic progress.", "outcome": "- Engage in research related to students’ research topics by attending conferences, conducting field works, participating in exchange programmes, regular meetings with supervisors, presentations and scholarly exchange with peers and visiting academic parties", "syllabus": "The syllabus and assessment type may vary according to the teaching staff. ", "required_readings": "The reading list may vary depending of the teaching staff and the year of offering. ", "recommended_readings": "The reading list may vary depending of the teaching staff and the year of offering. ", "terms": {"2020-21 Term 1": {"-M01-TMC (3281)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Douglas Matthew GILDOW, \n\rProfessor HUANG Weishan, \n\rProfessor James D FRANKEL, \n\rProfessor KUNG Lap Yan, \n\rProfessor KWAN Shui Man, \n\rProfessor LAI Chi Tim, \n\rProfessor LAI Pan Chiu, \n\rProfessor LAI Tsz Pang, \n\rProfessor TAM Wai Lun, \n\rProfessor YING Fuk Tsang, \n\rProfessor YIP Ching Wah Francis"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-M01-TMC (3370)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Douglas Matthew GILDOW, \n\rProfessor HUANG Weishan, \n\rProfessor James D FRANKEL, \n\rProfessor KUNG Lap Yan, \n\rProfessor KWAN Shui Man, \n\rProfessor LAI Chi Tim, \n\rProfessor LAI Pan Chiu, \n\rProfessor LAI Tsz Pang, \n\rProfessor TAM Wai Lun, \n\rProfessor YING Fuk Tsang, \n\rProfessor YIP Ching Wah Francis"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-M01-TMC (2048)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor KUNG Lap Yan, \n\rProfessor KWAN Shui Man, \n\rProfessor LAI Pan Chiu, \n\rProfessor TAM Wai Lun"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-M01-TMC (2117)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor KUNG Lap Yan, \n\rProfessor KWAN Shui Man, \n\rProfessor LAI Pan Chiu, \n\rProfessor TAM Wai Lun"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Discussion": "50", "Participation": "50"}}, {"code": "8006", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "6.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student’s academic progress.", "outcome": "- Engage in research related to students’ research topics by attending conferences, conducting field works, participating in exchange programmes, regular meetings with supervisors, presentations and scholarly exchange with peers and visiting academic parties", "syllabus": "The syllabus and assessment type may vary according to the teaching staff.", "required_readings": "The reading list may vary depending of the teaching staff.", "recommended_readings": "The reading list may vary depending of the teaching staff.", "terms": {"2020-21 Term 1": {"-M01-TMC (3282)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Douglas Matthew GILDOW, \n\rProfessor HUANG Weishan, \n\rProfessor James D FRANKEL, \n\rProfessor KUNG Lap Yan, \n\rProfessor KWAN Shui Man, \n\rProfessor LAI Chi Tim, \n\rProfessor LAI Pan Chiu, \n\rProfessor LAI Tsz Pang, \n\rProfessor TAM Wai Lun, \n\rProfessor Tobias BRANDNER, \n\rProfessor YING Fuk Tsang, \n\rProfessor YIP Ching Wah Francis"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-M01-TMC (3854)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Douglas Matthew GILDOW, \n\rProfessor HUANG Weishan, \n\rProfessor James D FRANKEL, \n\rProfessor KUNG Lap Yan, \n\rProfessor KWAN Shui Man, \n\rProfessor LAI Chi Tim, \n\rProfessor LAI Pan Chiu, \n\rProfessor LAI Tsz Pang, \n\rProfessor TAM Wai Lun, \n\rProfessor Tobias BRANDNER, \n\rProfessor YING Fuk Tsang, \n\rProfessor YIP Ching Wah Francis"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-M01-TMC (2049)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Douglas Matthew GILDOW, \n\rProfessor James D FRANKEL, \n\rProfessor KUNG Lap Yan, \n\rProfessor KWAN Shui Man, \n\rProfessor LAI Chi Tim, \n\rProfessor LAI Pan Chiu, \n\rProfessor LAI Tsz Pang, \n\rProfessor TAM Wai Lun, \n\rProfessor Tobias BRANDNER, \n\rProfessor YIP Ching Wah Francis"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-M01-TMC (2389)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Douglas Matthew GILDOW, \n\rProfessor James D FRANKEL, \n\rProfessor KUNG Lap Yan, \n\rProfessor KWAN Shui Man, \n\rProfessor LAI Chi Tim, \n\rProfessor LAI Pan Chiu, \n\rProfessor LAI Tsz Pang, \n\rProfessor TAM Wai Lun, \n\rProfessor Tobias BRANDNER, \n\rProfessor YIP Ching Wah Francis"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Discussion": "50", "Participation": "50"}}, {"code": "8012", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "12.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MPhil-PhD Religious Studies", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student’s academic progress.", "outcome": "- Engage in research related to students’ research topics by attending conferences, conducting field works, participating in exchange programmes, regular meetings with supervisors, presentations and scholarly exchange with peers and visiting academic parties", "syllabus": "The syllabus and assessment type may vary according to the teaching staff.", "required_readings": "The reading list may vary depending of the teaching staff.", "recommended_readings": "The reading list may vary depending of the teaching staff.", "terms": {"2020-21 Term 1": {"-M01-TMC (3280)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Douglas Matthew GILDOW, \n\rProfessor HUANG Weishan, \n\rProfessor James D FRANKEL, \n\rProfessor KUNG Lap Yan, \n\rProfessor KWAN Shui Man, \n\rProfessor LAI Chi Tim, \n\rProfessor LAI Pan Chiu, \n\rProfessor LAI Tsz Pang, \n\rProfessor TAM Wai Lun, \n\rProfessor YING Fuk Tsang, \n\rProfessor YIP Ching Wah Francis"], "meetingDates": ["07/09/2020 - 30/11/2020"]}}, "2020-21 Term 2": {"-M01-TMC (3855)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Douglas Matthew GILDOW, \n\rProfessor HUANG Weishan, \n\rProfessor James D FRANKEL, \n\rProfessor KUNG Lap Yan, \n\rProfessor KWAN Shui Man, \n\rProfessor LAI Chi Tim, \n\rProfessor LAI Pan Chiu, \n\rProfessor LAI Tsz Pang, \n\rProfessor TAM Wai Lun, \n\rProfessor YING Fuk Tsang, \n\rProfessor YIP Ching Wah Francis"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 1": {"-M01-TMC (2047)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor James D FRANKEL, \n\rProfessor KUNG Lap Yan, \n\rProfessor KWAN Shui Man, \n\rProfessor LAI Chi Tim, \n\rProfessor LAI Pan Chiu, \n\rProfessor LAI Tsz Pang, \n\rProfessor TAM Wai Lun"], "meetingDates": ["06/09/2021 - 29/11/2021"]}}, "2021-22 Term 2": {"-M01-TMC (2390)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor James D FRANKEL, \n\rProfessor KUNG Lap Yan, \n\rProfessor KWAN Shui Man, \n\rProfessor LAI Chi Tim, \n\rProfessor LAI Pan Chiu, \n\rProfessor LAI Tsz Pang, \n\rProfessor TAM Wai Lun"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Discussion": "50", "Participation": "50"}}]