[{"code": "1001", "title": "Introduction to Sociology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Not for students who have taken SOCI1102 or UGEC1823.", "description": "This course introduces basic concepts and principles in the field of sociology, helping students to make sense of their social life. Ideas such as social norms, social roles, social interactions, social institutions and social processes will be examined. This course also gives a brief introduction to major classical and contemporary sociological theories which explain how individuals and society are related to each other, especially how personal experiences are rooted in a particular social setting. Through these discussions, students should be able to think more critically towards a wide range of social issues and taken for granted social practices.\r", "outcome": "    Untitled Document   1. overview of sociology as a discipline;  2. basic understanding of important sociological concepts and theories;  3. basic understanding of sociological research method;  4. thinking critically;  5. reflection on one's values and way of life.   ", "syllabus": "    Untitled Document   Overview and Introduction I. Basic Concepts and the Birth of a Discipline   II. Founding Fathers and Sociological Perspectives   III. Research Methods and Ethics   Basic Concepts and Theories IV. Culture and Society   V. Socialization and Social Interaction   VI. Groups and Organizations   VII. Stratification and Mobility   VIII. Race and Inequality   IX. Sex and Gender   ", "required_readings": "    Untitled Document   None.   ", "recommended_readings": "    Untitled Document   Textbook:   Schaefer, Richard T. Sociology (Boston: McGraw Hill, 12th edition) OpenStax College. 2013. Introduction to sociology. Rice University. Supplementary Readings:  Mills, C. Wright, The Sociological Imagination (NY: Oxford University Press, 1959)  Berger, Peter, Invitation to Sociology: A Humanistic Perspective (Garden City: Doubleday, 1963)   ", "terms": {"2020-21 Term 1": {"A-LEC (6064)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. OR Tsz Ming"]}, "AT01-TUT (6065)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Dr. OR Tsz Ming"]}}, "2020-21 Term 2": {"B-LEC (6556)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor CHOI Yuk Ping"]}, "BT01-TUT (6515)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHOI Yuk Ping"]}}}, "assessments": {"Essays": "0", "Essay test or exam": "0", "Presentation": "0", "Short answer test or exam": "0", "Selected response test or exam": "0"}}, {"code": "1002", "title": "Approaching Sociology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "Designed for major students new to sociology, this course serves as an extended introduction to sociology’s distinctive approach to the study of social life. It also aims at setting the foundation for the development of a variety of skills required for the study of discipline. It is also part of the Sociology Department’s academic mentorship programme that helps students better adjust to studying sociology and plan for themselves in their undergraduate years. (Advisory: For Sociology Majors only.)\r", "outcome": "       (1) Familiarize with the sociological approach to social phenomena and the distinctive vocabulary and perspectives by which sociologists study them       (1) Familiarize with the sociological approach to social phenomena and the distinctive vocabulary and perspectives by which sociologists study them.   (2) Learn how to solve concrete self-directed research problems in a collaborative team setting and acquire first-hand experience in how social research is conducted.   (3) Become aware of the importance of a variety of study skills highlighted in the programme learning outcomes and the channels by which those skills could be developed in undergraduate studies.   (4) Better adjust to studying in the sociology programme in particular and plan for themselves in their undergraduate years.      ", "syllabus": "        \"Curriculum will be individualized by teachers responsible for individual sections but to be discussed and confirmed by a meeting of the four section instructors in the summer each year.\"      ", "required_readings": "   Untitled Document    None.   ", "recommended_readings": "    Untitled Document   To be provided by the teacher of each section.   ", "terms": {"2020-21 Term 1": {"AS01-SEM (8492)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor TAM Hong Wing"]}, "BS01-SEM (8491)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor CHOI Yuk Ping"]}, "CS01-SEM (6592)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor TAM Hong Wing"]}}}, "assessments": {"Essays": "0", "Others": "0", "Presentation": "0"}}, {"code": "1102", "title": "Sociology and Modern Society", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Not for students who have taken SOCI1001 or UGEC1823.", "description": "(UGEC1823 is double-coded with SOCI1102.) This course explores into the significance of sociological perspectives in understanding modern society. Attention will be given to the application of sociological concepts in the observation and analysis of social phenomena in modern society. The course is designed particularly to develop intellectual skills, as part of a student's general education, for a better understanding of the nature of modern society.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1201", "title": "Hong Kong Society: Identities and Boundaries", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Not for students who have taken UGEC2865/GEJC1020.", "description": "From the “borrowed time and borrowed place”, Hong Kong has evolved into a global city with its own identity. Since the 1950s, the city experienced an economic miracle, withstood numerous financial crises, and is in the process of economic restructuring. Politically, it has turned from “the last Colony” of Great Britain into a Special Administrative Region of the PRC. Culturally, the flourishing Canto pop-culture coincides with the emergence of a local identity. Using a sociological perspective, this course critically reflects on the impact of these profound changes on the construction of the so-called ‘Hong Kong identity’. Who is a HongKongese? This seemingly simple question underlies critical issues and boundaries about nationality, ethnicity, language, culture, class, and citizenship. The construction of a Hong Kong identity necessitates the drawing of boundaries that include and exclude, defines who is entitled to resources and power and who is not, and projects differential expectations of rights and responsibilities on insiders and outsiders. The question thus has profound impacts on how resources and power are distributed in society, and affects the life chances of individuals, families and society.(Advisory: Not for Sociology Majors.)\r", "outcome": "        本課程期望達到以下五個學習成果:    1.     希望透過本課程, 以社會學的視野去幫助同學對香港戰後經歷過的經濟發展, 政治變化, 及文化上的衝擊有更深入及批判性的了解;  2.     使同學能夠全面思考身份的建構如何受社會, 經濟和政治環境影響, 並明白身份建構背所涉的權利與義務, 和政治與經濟資源分配.    3.     以一個社會變遷 (social change) 的角度去討論身份. 使同學明白香港人這一身份的建構與香港過去半世紀的社會改變, 包括本土化, 去工業化, 經濟轉型, 全球化, 新中產階級的興起, 主權移交等的關係.    4.     以一個較宏觀全面的角度去了解 ‘香港人’ 這個身份是如何受社會結構 (social structure) 與個人的互動的影響; 並啟發學生思考‘個人身份’ (individual identity)與群體 (groups), 社區(communities), 社會系統, (systems), 和制度 (institutions) 的關係.      5.     透過多樣化的學習方式, 包括嘉賓講者,多媒體影音教材播放及討論, 和小組專題習作 使同學對香港社會的歷史, 結構, 文化和在這個社會裡生活的不同社群有一個較深入的了解, 亦能學習到以較全面宏觀的角度去思考問題.    ", "syllabus": "        １.  導論  ２.  身份與界限  ３.  半世紀的變革：由歷史開始, 誰的歷史? ４.  本土化與香港人身份的建構   ５.  “新移民”身份的污名化  ６.  香港社會研究: 理論與實踐  ７.  貧窮與身份  ８.  中產階級身份危機與新一代的文化資本戰  ９.  認識香港的上層階級, 解讀統治霸權 １０.            與弱勢社群對話–香港的小數族裔(巴基斯坦青年和志願組織) １１.            五十萬的外籍傭工: 種族,性別與階級的角力 １２.            性小眾的邊緣化  １３.            挑戰社會不平等: 由新社會運動建立的另類集體身份  １４.            一個小結       ", "required_readings": "        主要參考資料 呂大樂 (1997) <唔該埋單 >. 閒人行.   謝均才編 .(2002). <我們的地方, 我們的時間>, 牛津大學出版社. Chiu, Stephen & Lui Tai-lok. (2004). Global City, Dual City? Globalization and social polarization in Hong Kong since the 1990.    Lamont, Michele and Virag Molnar (2002) The Study of Boundaries in the Social Sciences, Annual Review of Sociology, 28:167-195.   蔡玉萍. 2010. 誰是香港人? 身份與認同. 進一步出版社.      ", "recommended_readings": "        其他資料 *Anderson, Benedict. (1996). Imagined Communities. London: Verso. Chapter 10.  *Bourdieu, Pierre. (1986). The forms of capital. In Handbook of Theory and Research for the Sociology of Education. John G. Richardson, ed. 241-258. New York: Greenwood Press.  *Buechler, Steven M. (1995) New Social Movement Theories, Sociology Quarterly, 36(3):441-464. *Gellner, Ernest. (1983). Nations and Nationalism. Oxford: Blackwell. (Pp.1-5) *Rubin, Gayle. (1984). Thing Sex: Notes for a Radical Theory of the Politics of Sexuality. In Vance, Carole S. (Ed.) Pleasure and Danger. London: Routledge. Pp. 267-319.  Bourdieu, Pierre, and J. C. Passeron. (1977). Cultural Reproduction and Social Reproduction.” In Power and Ideology in Education, Jerome Karabel and A. H. Halsey, Eds. 487-511. New York: Oxford University Press.  Chiu, Stephen and Lui Tai-Lok (2009) Hong Kong: Becoming a Chinese Global City. Oxon: Routledge. Pp.81-102.  Chiu, Stephen and Lui Tai-Lok ed. (2000) The Dynamics of Social Movement in Hong Kong. Hong Kong: Hong Kong University Press. Pp. 1-19.  Constable, Nicole. (1996). “Jealousy, Chastity, and Abuse: Chinese Maids and Foreign Helpers in Hong Kong”. Modern China (October) 22:448-479.  Constable, Nicole. (2000). “Dolls, T-Birds, and Ideal Workers: The Negotiation of Filipino Identity in Hong Kong”, in Kathleen M. Adams and Sara Dickey (eds.) Home and Hegemony: Domestic Service and Identity Politics in South and Southeast Asia. Ann Abrbor: The University of Michigan Press. Pp.221-248.  Hong Kong Census and Statistics Department (2009). Thematic Household Survey on Racial Acceptance. Hong Kong: Hong Kong Census and Statistics Department, Hong Kong SAR Government. Leung Hon-Chu. (2004). “Politics of incorporation and exclusion: Immigration and citizenship issues.” In Agnes S. Ku & Ngai Pun (eds.) Remaking Citizenship in Hong Kong: Community, nation and the global city. London: Routledge Curzon. Pp. 97-114.  Poon, Alice (2005) Land and the Ruling class in Hong Kong. Richmond, Canada: A.Poon   Sautman, Barry. 2004. “Hong Kong as a semi-ethnocracy: “race,” migration and citizenship in a globalized region. In Agnes S. Ku & Ngai Pun (eds.) Remaking Citizenship in Hong Kong: Community, nation and the global city. London: Routledge Curzon. Pp. 115-138.  Travis, Kong. (2010). Chinese Male Homosexualities: Memba, Tongzhi, and Golden Boy. London: Routledge. (pages to be announced).  Weiss, Anita M. (1991).”香港的南亞穆斯林: ‘本地仔’ 身份的創造” , 刊於陳慎慶編 < 諸神嘉年華>. 香港: 牛津大學出版社.   Wong Day. (2004). “(Post-) Identity politics and anti-normalization: (Homo)sexual rights movement”, in Agnes S. Ku & Ngai Pun (eds.) Remaking Citizenship in Hong Kong: Community, nation and the global city. London: Routledge Curzon. Pp. 115-138. 吳俊雄 (2003). “尋找香港本土意識”, 刊於吳俊雄, 張志偉編 <閱讀香港普及文化>, 牛津大學出版社. 頁86-95. 呂大樂, 王志錚 (2003) <香港中產階級處境觀察>, 香港 : 三聯書店(香港)有限公司. Pp. 49-58. 樂施會(2003) <香港邊緣勞工口述＞第二版, 香港: 樂施會. 澄雨 (2002). “不速之客: 八十年代香港電影的大陸來客形象初探”, 刊於吳俊雄, 張志偉編 <閱讀香港普及文化>, 牛津大學出版社. 頁181-186. 王宏志 (2000). 歷史的沉重.香港: 牛津出版社. 頁1-70.  葉蔭聰 (2010) <為當下懷舊: 文化保育的前世今生>, 香港: 香港中文大學香港亞太研究所. Pp. 27-52.  許寶強 (2010) <限富扶貧：富裕中的貧乏>, 香港: 香港中文大學香港亞太研究所. Pp. 39-59.  謝均才 (2002) “歷史視野下的香港社會”, 刊於謝均才編<我們的地方, 我們的時間>,  牛津大學出版社. 頁1-38. 陳效能 (2011) <性通識: 本性權利與道德爭議>, 香港: 香港中文大學香港亞太研究所. Pp.125-140. 陳錦華, 梁麗清 (2002). “社會政策與[積極不干預]”, 刊於謝均才編<我們的地方, 我們的時間>. 牛津大學出版社. 頁 315-342.  馬傑偉, 曾仲堅.  (2010).影視香港: 身份認同的時代變奏. 香港中文大學亞太研究所: 社會科學通識叢書.       ", "terms": {"2020-21 Term 1": {"--LEC (8971)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr. LAU Siu Lun"]}}}}, {"code": "1202", "title": "Sociology of Everyday Life", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Not for students who have taken UGED2933 or SOCI2109.", "description": "This is a course on some essential dimensions of modern life including love, sex, work, public life, illness and death. To marry or not to marry? To die sooner or later? These are real choices for some people but irrelevant questions for many. Do we have freedom to lead a life of our own or has society already chosen the path of life for each of us? These are issues either taken for granted or deliberately avoided in our everyday life. In this course, sociological theories will be introduced to analyse how social institutions in the modern world have affected the meaning and pattern of life. Students are encouraged to have a reflective mind so as to contemplate what life style, or at least what attitude, we can choose regarding these dimensions of life.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2003", "title": "Social Research Methods", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "This course is an introduction to the fundamental principles and procedures of empirical research in sociology. Students will be presented with the theoretical and practical challenges involved in problem formulation, research design, data collection, and data analysis. We will examine some of the major types of both qualitative and quantitative social research methods (e.g., structured interviews, questionnaires, qualitative interviews, and ethnography) and the sampling, measurement and analysis issues involved with their use. Students will be asked to conduct and report a basic qualitative interview project.", "outcome": "       1       1.        To understand the role of evidence and qualitative and quantitative methods in sociology; 2.        To get knowledge about the basic concepts in social science research methods 3.        To grasp technical skills involved in data collection, data management and data analysis; 4.        To develop analytical and critical-thinking skills through the application of theories, concepts and skills  5.        To be able to design and conduct a real empirical research; 6.        To further develop transferable skills beyond disciplinary requirements, including written, communication and information technology skills.      ", "syllabus": "    Untitled Document   Part One: Introduction to Social Research • Introduction • Research strategies  • Research designs  • Ethics & writing up Part Two: Qualitative Research  • The nature of qualitative research   • Ethnography   • Qualitative interviews   • Qualitative data analysis  Part Three: Quantitative Research  • The nature of quantitative research   • Sampling   • Structured interviewing and questionnaires  • Quantitative data analysis    ", "required_readings": "   Untitled Document    None.   ", "recommended_readings": "    Untitled Document   Bryman, A. (2016). Social Research Methods (International ed.). Oxford: Oxford University Press.   ", "terms": {"2020-21 Term 1": {"--LEC (8622)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor Christian W. K. GREIFFENHAGEN"]}, "-T01-TUT (8623)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor Christian W. K. GREIFFENHAGEN"]}}}, "assessments": {"Essays": "0", "Others": "0", "Short answer test or exam": "0", "Selected response test or exam": "0"}}, {"code": "2004", "title": "Social Statistics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Not for students who have taken DSME2010, DSME2020, DSME2011, DSME2021, ECON2121, GRMD2102, SEEM2430, SPED2600, PSYC2010, STAT1011, STAT1012, STAT2001, STAT2006, STAT2101, STAT2102.", "description": "This course introduces the basic principles of statistical reasoning and its applications in social research. The objectives are to understand the basic assumptions of statistical methods and to interpret statistical findings in social surveys and experiments. Emphasis will be given to those descriptive and inferential methods that are frequently used for analyzing causal relationships among social variables and for testing social theories and hypotheses. The course will train students in analyzing social life and its changes.", "outcome": "        1.     To grasp the basic principles of descriptive statistics and statistical inference. 2.     To appreciate how statistical methods can be used to study social phenomena. 3.     To be able to design and conduct a real empirical research with quantitative method. 4.     To develop the quantitatively analytical and critical-thinking skills to current social issues. 5.     To acquire hands-on knowledge on using statistical software to manage real socioeconomic data.    ", "syllabus": "    Untitled Document   Topics: 1. Introduction 2. Descriptive statistics 3. Inferential statistics 4. Association and Causation 5. Analysis of a continuous variable 6. Analysis of a discrete variable   ", "required_readings": "   Untitled Document    None.   ", "recommended_readings": "    Untitled Document   Textbook:         Healey, Joseph F. 2012. Statistics: A tool for Social Research, 9th edition. Belmont, CA: Wadsworth Cengage Learning.  References: Ritchey, Ferris Joseph. 2008. The Statistical Imagination: Elementary Statistics for the Social Sciences, 2nd edition. Boston: McGraw Hill.  Shavelson, Richard J. 1996. Statistical Reasoning for the Behavioral Sciences, 3rd edition. Boston, Mass.: Allyn and Bacon.    ", "terms": {"2020-21 Term 2": {"--LEC (6741)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor JIN Lei"]}, "-T01-TUT (6742)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor JIN Lei"]}}}, "assessments": {"Essay test or exam": "60", "Others": "40"}}, {"code": "2101", "title": "Development of Chinese Social Thought", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "This course examines the origin, the transformation, and the characteristics of major Chinese thought in the past two millennia, so as to understand the sources of the values that guide the behaviour of Chinese people. The thought under examination include Confucianism, Legalism, Daoism, Moism, Liberalism, as well as different versions of Socialism. Methodologically speaking, this course will look at the structural forces that produce social thought and vice versa, rather than undue attention to particular times and events in history.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2103", "title": "Japan in a Global Perspective", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Not for students who have taken UGEC2260 or GESC2160 or UGEC1232/JASP1100.", "description": "The course examines the social and cultural dynamics of Japanese society. Emphasis will be given to the sociological implications of Japanese social organization and national identity especially as productions of a historical relationship with China and the West. Topics include: class and stratification, economic organization and work culture, marriage and the family, sex and gender, popular culture and everyday life, and the ideological system.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2104", "title": "Sociology and Hong Kong", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Not for students who have taken SOCI1201, UGEC2865 or GEJC1020.", "description": "The objective of this course is to review and reflect on the efforts made by sociologists to understand the development of the Hong Kong society over the past half century. What is so special about Hong Kong? Why did it fascinate sociologists for so long in the post-war era? What had been the questions that caught their imagination? Has Hong Kong been falling out of the radar of sociologists? What do sociologists know about Hong Kong, and what more have to be done?", "outcome": "1. To understand and reflect on the contribution of sociology in the understanding of Hong Kong. 2. To master the dominant themes of sociological research on Hong Kong society. 3. To familiarize with and learn how to draw on the common primary and secondary sources of sociological research on Hong Kong society.4. Integrating personal interests with existing research, to develop a personal agenda on the understanding of Hong Kong society.5. To locate sociological research on Hong Kong from a developmental and comparative perspective.  ", "syllabus": " 1. Sociology in HK  2. A Sense of History: Beyond colonialism  3. Politics: SK Lau and Beyond  4. Economy: The Laissez-faire Miracle?  5. Class & Mobility: Land of Opportunity?  6. Globalization and Inequality  7. The HK Family: From Tradition to Modernity  8. Culture and Identity: From Left-Right to HK-China  9. Social Movement: The Rise, Fall, and Revival of Social Movements  10. Cultural Industry: The Boom nd Bust of Hong Kong Movies  11. Conclusion: What shall we do from here?  ", "required_readings": " None.  ", "recommended_readings": "  Recommended reading list :  Lui Tai-lok et al eds., Routledge Handbook of Contemporary Hong Kong (Milton: Routledge, 2018)   Chiu, Stephen WK, and Tai-lok Lui. 2009. Hong Kong: Becoming a Chinese Global City. London: Routledge.   Lee, Rance Pui-leung and Lau Siu Kai, The Birth and Growth of Academic Sociology in Hong Kong (HK: Hong Kong Institute of Asia-Pacific Studies, CUHK, 1993)  Leung, Benjamin K.P. (Ed). 2003. Hong Kong: Legacies and Prospects of Development. Aldershot: Ashgate Publishing Ltd.   Mathews, Gordon, Eric Ma, and Tai-lok Lui. 2008. Hong Kong, China: Learning to Belong to a Nation. London: Routledge.  Carroll, John M. 2007. A Concise History of Hong Kong. Hong Kong: Hong Kong University Press.  Other References : Lau Siu Kai, Society and Politics in Hong Kong (Hong Kong, CUHK Press, 1984)  Other References :   Chiu, Stephen WK 2012. \"Family Changes and Income Inequality under Globalization: The Case of Hong Kong\" pp. 201-242 in Stephen WK Chiu and Siu-lun Wong (eds.) Hong Kong Divided: Structures of Social Inequality in the Twentieth-First Century. Hong Kong: The Institute of Asia-Pacific Studies, The Chinese University Press.  Chiu, Stephen WK, Lisanne S.F. Ko and Rance P.L. Lee 2005. “Decolonization and the Movement for Institutionalization of Chinese Medicine in Hong Kong: a Political Process Perspective” Social Science & Medicine. 61: 1045-1058   Chiu, Stephen WK, Susanne Y P Choi and Kwok-fai Ting. 2005. “Getting Ahead in the Capitalist Paradise: Migration from China and Socioeconomic Attainment in Colonial Hong Kong” The International Migration Review. 39: 203-227   Chiu, Stephen WK, and Tai-lok Lui. 2000. The Dynamics of Social Movement in Hong Kong. Hong Kong: The Hong Kong University Press.  Chiu, Stephen WK, Ho K.C. and Lui T. L, City States in the Global Economy: Industrial Restructuring in Hong Kong and Singapore (Boulder, CO: Westview Press, 1997)  Chiu, Stephen WK and Victor KW Shin. 2013. \"The Fall of Hong Kong Movies: A Post-mortem Investigative Report.\" Occasional Paper No. 225, The Institute of Asia-Pacific Studies.  Lau, Siu-kai. 2000. “Hongkongese or Chinese: The Problem of Identity on the Eve of Resumption of Chinese Sovereignty over Hong Kong.” pp. 255-284. in Lau Siu-kai (ed.) Social Development and Political Change in Hong Kong. Hong Kong: The Chinese University Press.  Lui, Tai-lok. 2009. “Hong Kong’s changing opportunity structures: Political concerns and sociological observations.” In Kwok-bun Chan, Agnes S. Ku and Yin-wah Chu (Ed.). Social Stratification in Chinese Societies. Leiden: Brill, pp.141-163.  Lui, Tai-lok and Stephen W.K. Chiu. 2007. “Governance crisis in Post-1997 Hong Kong: A political economy perspective.” The China Review, Vol.7, No.2, pp.1-34.  Ma, Ngok, Political Development in Hong Kong: State, Political Society and Civil Society, Chapter 5, 6. (Hong Kong: Hong Kong University Press, 2007)  Ngo, Tak-wing. 1999. “Colonialism in Hong Kong revisited.” In Tak-wing Ngo (Ed.), Hong Kong's History: State and Society Under Colonial Rule. London: Routledge.   So, Alvin, “The Economic Success of Hong Kong: Insights from a World-System Perspective”, Sociological Perspectives, vol. 29, No. 2, April, 1986, pp. 241-258.Chiu, W.K. Stephen, 'Unravelling Hong Kong's Exceptionalism: The Politics of Laissex-faire in the Industrial Takeoff', Political Power and Social Theory, vol. 10, 1996, pp.229-56.", "terms": {"2020-21 Term 2": {"--LEC (6474)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. LAU Siu Lun"]}, "-T01-TUT (8410)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Dr. LAU Siu Lun"]}}}, "assessments": {"Essays": "30", "Essay test or exam": "40", "Lab reports": "15", "Presentation": "15"}}, {"code": "2106", "title": "Economic Reform and Social Impacts in China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Not for students who have taken GESC2118, UGEA2190 or UGEC2883.", "description": "(UGEC2883 is double-coded with SOCI2106.) \r This course is to examine the economic reforms and its social consequences in China from different theoretical perspectives and to probe into the problems, difficulties and constraints facing China’s economy and society. After taking this course, students should be able to grasp the intellectual debates about social impacts of economic reforms from a wide range of aspects, such as labour, migration, gender, environment, grassroots participation, human rights and civil society.", "outcome": "  Students should be able to explain the main aspects of economic reform and social impacts in contemporary China.  Students should be able to identify the key social science concepts and theories through which the underlying forces changing China today are studied.  Students should be able to apply the theories and methods to analyze the close interaction and dilemma between society, economy, and humanistic concerns.", "syllabus": " (*Essential reading)   Lecture 1  The Great Transformation *Wang,Shaoguang (2008)“The Great Transformation: The Double Movement in China”,boundary 2(2008)35 (2): 15-47.   Hui,Elaine Sio-ieng (2017)Putting the Chinese State in its Place: A March from Passive Revolution to Hegemony,Journal of Contemporary Asia,47:1,66-92.   Saich,Tony (2011)“Chapter 3 China’s Changing Road to Development: political history,1949 to 1978’,Governance and Politics of China. New York: Palgrave,pp 34-66.   Lecture 2   The Chinese Development Miracle *So,Alvin and Chu,Yin-Wah (2016)  “Part I: The Chinese Development Miracle”The Global Rise of China. Cambridge: Polity Press,pp. 29-114   Saich,Tony (2011)“Chapter 4 China under Reform,1978 to 2010’,Governance and Politics of China. New York: Palgrave,pp 67-107.   Naughton, Barry (2007) “Chapter 4: Market Transition: Strategy and Process.” The Chinese Economy: Transitions and Growth,Cambridge,Mass: Massachusettes Institute of Technology Press,pp 55-84.   Lecture 3 Regional Varieties in Development  *Jun,Zhanga & Peck,Jamie (2014)“Variegated Capitalism,Chinese Style: Regional Models,Multi-scalar Constructions,”in Regional Studies.   Lim,Kean Fan & Horesh,Niv (2017)The Chongqing vs. Guangdong developmental ‘models’in post-Mao China: regional and historical perspectives on the dynamics of socioeconomic change,Journal of the Asia Pacific Economy,22(3): 372-3   Pereira,Alexius A. (2006)“The Suzhou industrial park experiment: the case of China–Singapore governmental collaboration,”in Journal of Contemporary China.   O’Dennell,Marry Ann et. al. (ed). Learning from Shenzhen: China’s post-Mao experiment from Special Zone to model city,Chicago: University of Chicago Press,pp1-19 (essentially Chapter 1 and 3).   Lecture 4 Globalization and Labour Standard *Chan,Anita (2003)A “Race to the Bottom”: Globalisation and China's labour Standards. China Perspectives. March April pp. 41to 49.   Pun,Ngai (2005),“Global Production,Company Codes of Conduct and Labour Conditions in China: A Case Study of Two Factories”. China Journal, July,101–113.   Xu,Yi & Chan,Chris K.C. (2018). “Conductive activism: Anti-sweatshop campaigns across Hong Kong and mainland China”. Journal of Contemporary Asia,48(1): 88-112.     Lecture 5 Changing identities and Class Politics *Lee,Ching. Kwan (1995)Engendering the Worlds of Labor: Women Workers,Labor Markets,and Production Politics in the South China Economic Miracle. American Sociological Review,Vol. 60,No. 3 (Jun.,1995),pp. 378-397   Pun,Ngai (1999),“Becoming Dagongmei: the Politics of Identity and Difference in Reform China”,The China Journal, 42. July: 1–19.   Lee,Ching. Kwan (2007)Against the Law: Labor Protests in China’s Rustbelt and Sunbelt,Berkeley: University of California Press. (Part I).   Chan,C.K.C. (2012). Class or citizenship? Debating workplace conflict in China. Journal of Contemporary Asia.42(2). 308 - 327.   Lecture 6 Workers’  Grievance and Trade Union Reform *Chen,F. (2003). ‘Between the state and labour: The conflict of Chinese trade unions' double identity in market reform.’The China Quarterly,176:1006-1028.   Taylor,Bill and Li,Qi (2007). ‘Is the ACFTU a union and does it matter?’Journal of Industrial Relations,49: 701–15   Liu,Ming Wei (2010). Union Organizing in China: Still a Monolithic Labor Movement? ILR Review,64(1): 30-52.   Hui,E. S.I. and Chan,C.K.C. (2015)‘Beyond the Union-Centred Approach: A Critical Evaluation of Recent Trade Union Elections in China’. British Journal of Industrial Relations53(3): 601-627.   Lecture 7  Pollution and Environmental Protests * Steinhardt,H. Christoph,and Fengshi Wu. \"In the name of the public: environmental protest and the changing landscape of popular contention in China.\" The China Journal75,no. 1 (2016): 61-82.   Jian,Lu,and Chris King-Chi Chan. \"Collective Identity,Framing and Mobilisation of Environmental Protests in Urban China: A Case Study of Qidong's Protest.\" China: An International Journal14,no. 2 (2016): 102-122.   Ho,Peter. \"Greening without conflict? Environmentalism,NGOs and civil society in China.\" Development and Change32,no. 5 (2001): 893-921.   Lecture 8  Gender, Family and Marriage *Fincher L.H. (2014). Leftover Women : The Resurgence of Gender Inequality in China. London: Zed Books. (Chapter 3)   Davis,D.S. & Friedman,S.L. (2014). Wives, husbands, and lovers: marriage and sexuality in Hong Kong, Taiwan, and urban China.Stanford,California: Stanford University Press. (Chapter 2-5)   Choi,S.Y.P. & Peng,Y. (2016). Masculine Compromise: Migration, Family, and Gender in China. Oakland,California: University of California Press   Lecture 9 State and Society Relations * Fu,Diana and Distelhorst,Greg (2017)Grassroots Participation and Repression under Hu Jintao and Xi Jinping (October 30,2017). The China Journal. Available at SSRN: https://ssrn.com/abstract=3003614   Tang,Wen Fang (2016)Populist Authoritarianism: Chinese Political Cultural and Regime Sustainability.  Oxford: Oxford University Press. Chapter2.   White,Gordon,Howell,Jude and Shang,Xiao Yuan (1996)In Search of Civil Society: Market Reform and Social Change in Contemporary China,Oxford: Clarendon Press. Chapter 1   Unger,J. and Chan,A. (1995)China,corporatism and the East Asian Model,The Australian Journal of Chinese Affairs,33,29–53.   Lecture 10 China’s Global Impact and its limits *Starrs,Sean Kenji (2018)“Can China Unmake the American Making of Global Capitalism?” in Leo Panitch and Greg Albo (eds.)Socialist Register 2019: A World Turned Upside Down?London: Merlin Press;New York: Monthly Review Press.   Jacques,Martin (2012)When China Rules the World. London: Penguin Books. Chapter 1.   So,Alvin and Chu,Yin-Wah (2016)The Global Rise of China. Cambridge: Polity Press,Chapter 5.   Lee,Ching Kwan (2014)“The Spectre of Global China”,New Left Review,89: 29-65   Lecture 11 China-Hong Kong Relations *Fong,Brian Chi-hang. (2014)“The Partnership between the Chinese Government and Hong Kong’s Capitalist Class: Implications for HKSAR Governance. 1997-2012.”The China Quarterly217: 195-220.   Hung,Ho-fung. (2019). “Chinese State Capitalist in Hong Kong”in Lui Tai-lok,Chiu Stephen W.K. & Ray Yep (eds.). Routledge Handbook of Contemporary Hong Kong. Oxon: New York: Routledge.   Hung,Ho-fung & zip,Iam-Chong. (2012)“Hong Kong’Democratic Movement and the Making of China’s Offshore Civil Society.”Asian Survey 52(3): 504-527.     Remark: A visit to NGOs will be organized.", "required_readings": " Please refer to the course syllabus above.", "recommended_readings": " Please refer to the course syllabus above.", "terms": {"2020-21 Term 1": {"--LEC (5194)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor CHAN King Chi"]}, "-T01-TUT (5191)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHAN King Chi"]}}}, "assessments": {"Essays": "30", "Presentation": "20", "Report": "20", "Short answer test or exam": "30"}}, {"code": "2116", "title": "Criminals and the Law", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-tripLecture", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "(UGEC2983 is double-coded with SOCI2116.) Students enrolled in this cross-disciplinary course will address three basic questions: “why do people become criminals”, “who makes criminal law”, and “how is criminal law enforced”. Specifically, this course will include topics such as the social causes of criminal behaviour, the role of criminal law in social control, and the operation of the criminal justice system (their internal interaction and external interaction with other social organizations). Comparative and local empirical research will also be drawn to explore the crime problems and the development of criminal law and the criminal justice system in USA, PRC, Taiwan and Hong Kong. In addition, to strengthen the students’ understandings on the current criminal justice system, students will be given one field opportunity to directly experience police departments, courts or prisons in Hong Kong.", "outcome": "1.        To recognize major data sources, methodological approaches and issues in the study of crime, law and criminal justice;2.        To identify diverse patterns and types of crime in the United States, mainland China, Hong Kong and Taiwan, and discuss their connection to processes of social change, social stratification and social control in the larger society;3.        To differentiate the major theories of crime, law and criminal justice；4.        To be able to apply concepts and theories in the student’s “hometown” community; 5.       To demonstrate analytical and critical-thinking skills through the application of concepts and theories, as well as a broadened and more appreciative view of self and the society in which we live.   ", "syllabus": "This course is an introduction of concepts and theories on crime, law and criminal justice system and their application to Chinese society. It will focus on how social structure and social policy could influence criminal behaviours and how society reacts to such behaviours. 1.        Overview of Crime, Law and Justice: subject matters and key research questions2.        Types of crime, crime patterns, and crime statistics (official data, self-report data, and victimization data)3.        Organization of crime, such as fencing networks and black society4.        Social change and crime trends5.        Theories to explain crime: deterrence, rational choice, disorganization, anomie, social learning, social control, opportunity/routine activity, labelling, and conflict theory etc.6.         Classical Thoughts on Law and Society7.        Law-making: state power and benefit groups; balance between liberty and public safety; penology8.        Law-processing: the role of law in social control; Paradigms and models of the criminal justice system9.        Police: operation, theories and research10.     Courts: operation, theories and research11.      Correction: operation, theories and research   ", "required_readings": "   Topic 1: Introduction to Criminology, Sociology of Law, and Criminal Justice—subject matters and research questions Corresponding Reading:   Vago, Steven. 2009. Law and Society (9th ed.) Chapter 9. Upper Saddle River, N.J.: Pearson/Prentice Hall.   Topic 2: Types of crime, crime patterns, and crime statistics (official data, self-report data, and victimization data)  Corresponding Reading:   Calavita, Kitty and Henry N. Pontell. 1994. “The State and White-Collar Crime: Saving the Savings and Loans.” Law and       Society Review 28: 297-324.  Gilfus, Mary. 1992. “From victims to survivors to offenders: Women’s routes of entry and immersion into street crimes.”      Women and Criminal Justice 4: 63-90.  Laub, Johh H. and Robert J. Sampson. 2003. Shared Beginnings, Divergent Lives (Chapter 3). Cambridge, MA: Harvard      University Press.   Topic 3: Organization of crime Corresponding Reading:  Steffensmeier, Darrell. 1986. The fence: in the shadow of two worlds (Chapter 1, 8, 12&13). Rowman & Littlefield.  Zhang, Sheldon and Ko-Lin Chin. 2002. “Enter the dragon: Inside Chinese human smuggling organizations.” Criminology 40:       737-767.   Topic 4: Social change and crime trends Corresponding Reading:   Liu, Jianhong, Lening Zhang, and Steven F. Messner (ed.). 2001. Crime and social control in a changing China (Chapter 1 &         7). Greenwood Press.    Gaylord, Mark S. and Graeme Lang. 1997. “Robbery, Recession and Real Wages in Hong Kong.” Crime, Law & Social         Change 27: 49-71.    Messner, Steven F. and Richard Rosenfeld. 1997. \"Political Restraint of the Market and Levels of Criminal Homicide: A         Cross-National Application of Institutional-Anomie Theory.\" Social Forces 75:1393-1416.   Topic 5: Theories to explain crime and criminals Corresponding Reading:   Akers, Ronald L and Christine S. Sellers. 2009. Criminological Theories (5th ed.) Chapter 5-8. NY: Oxford University Press.    Topic 6: Classical Thoughts on Law and Society Corresponding Reading:   Vago Chapter 1 & 2  Unger, Roberto Mangabeira. 1976. Law in modern society: toward a criticism of social theory (Chapter 2). NY: Free Press.     Topic 7: Law-Making Corresponding Reading:   Vago Chapter 7    Reiman, Jeffrey. 2007. The Rich Get Richer and the Poor Get Prison (8th ed.). Boston: Allyn & Bacon.       Topic 8: Law-Processing   Corresponding Reading:   Braithwaite, John and Biles, David. 1980. “Empirical verification and Black’s The Behavior of Law”. American Sociological       Review 45: 334-338.    Bernard, Thomas J. and Engel, Robin S. 2001. “Conceptualizing criminal justice theory”. Justice Quarterly 18 (1): 1-30.      Topic 9: Police--operation, theories and research  Corresponding Reading:     Klinger, David A. 1997. “Negotiating order in patrol work: an ecological theory of police response to deviance”. Criminology         35: 277-306.   Topic 10: Courts—operation, theories and research   Corresponding Reading:    Ulmer, Jeffery. 1997. Social worlds of sentencing: court communities under sentencing Guidelines (Chapter 1, 2&8). State        University of New York Press.   Topic 11: Correction--operation, theories and research   Corresponding Reading:     DiIulio, Jr., John J. 1987. Governing Prisons: A Comparative Study of Correctional Management (Chapter 1). NY: Free Press.    Feeley, Malcolm M., and Simon, Jonathan. 1992. “The new penology: notes on the emerging strategy of corrections and its           implications”. Criminology 39 (4): 449-474.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (8283)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor ZHONG Hua"]}, "-F01-FLD (8316)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor ZHONG Hua"]}}}}, {"code": "2203", "title": "Social Problems and Social Policy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "Both the objective conditions and the subjective definitions of social problems will be analysed in the context of social and economic development of society. The first emphasis of this course will be placed upon the application of basic sociological perspectives to the understanding of social issues and problems in Hong Kong and other societies. The second will examine the impact of sociological research of social problems on the formulation and improvement of social policy in response.", "outcome": "    Untitled Document   By the end of the course, students will be better able to: (a) look beyond common sense or public perception in understanding social problems in Hong Kong, and (b) analyze social problems in Hong Kong from sociological perspectives.   ", "syllabus": "    Untitled Document   Part I. Theoretical framework  1. Introduction – What is social problem? What is social policy?  2. Theorizing social problem I and II: Functionalist perspective and conflict perspective  3. Theorizing social problem III: Symbolic interactionist perspective  Part II. Social problems and choices of policy responses  4. Gambling – Pathological habit or commodified risk? A public health model of gambling 5. Drug use – Risk society and the normalization of drug? Harm reduction versus abstinence policies  6. Sex work – Evolving perspectives on sex work? Decriminalization policies and reduction of public health risk 7. Problems in the cyber world – Internet addiction and other misuse. Policy response 8. Domestic abuse – What causes spousal violence and child abuse? Dilemmas in domestic violence policy Part III. Tackling social inequalities  9. Social welfare policy: theoretical development and Hong Kong’s status  10. Poverty – Dependency culture or a lack of social capital? Ideological debate concerning anti-poverty policies 11. Racism – Why does racism exist? Who supports affirmative action policy? Some research evidence 12. Aging and ageism – What is ageism? Life-course perspective and active aging policy Course Structure The course will consist of : (1) lectures, (2) tutorials, (3) field observation, (4) video presentation in a tutorial, and (4) a talk given by invited guests.  Course Assessment Individual tutorial participation (e.g. discussions):  In-class problem solving activities: 10%  Group proposal for policy paper (<1,000 words): 5%  Group presentation of policy paper and field work/interview result (if any) in tutorial: 10% Group report on policy paper (<3,000 words; can recycle content of proposal): 10%  Class test (Short and long essay questions): 20% 45% All assignments must be submitted through first the VeriGuide and then the  WebCT where there are instructions for submission. You must also submit a hard copy of your assignment to the general office, with the signed VeriGuide form attached. Submission through email is generally not accepted.   Tutorials There will be five tutorials. Each tutorial lasts for two sessions. For details please refer to handouts “Tutorial Guideline” and “Policy Paper Guideline”.  Writing a policy paper  Students will form group and draft a policy paper on a self-selected social problems. Each group will gather firsthand data from stakeholders. Students will then apply sociological perspectives to analyze the issue, propose policy response and indicate possible dilemmas. Proposed policy area and results of data collection (e.g. from interview of stakeholders or/and field observation) will be discussed in tutorials.     ", "required_readings": "    Untitled Document   None.   ", "recommended_readings": "    Untitled Document   Textbook: - Rubington, E. and Weinberg, M.S. 2011. The Study of Social Problems: Seven Perspectives. 7th ed., NY: Oxford University Press.  - Dwyer, P. and Shaw S. 2013. An Introduction to Social Policy. NY: Sage.  Reading list by topics: Social policy and Hong Kong  - Lee, Eliza W.Y. 2005. The Politics of Welfare Developmentalism in Hong Kong. Social Policy and Development Programme Paper Number 21. United Nations Research Institute for Social Development.  - Wong, H. 2012. “Changes in social policy in Hong Kong since 1997: old wines in new bottles?”. In W.M. Lam, P. L. Lui, & W. Wong (Eds.) Contemporary Hong Kong Government and Politics: Expanded Second Edition (pp.277-296). Hong Kong: Hong Kong University Press.  - 李健正、趙維生、梁麗清及陳錦華編。1999。《新社會政策》。香港：中文大學出版社。  - 陳錦華及王志錚編。2004。《香港社會政策評論》。香港：中文大學出版社。  Gambling - Frey, J. 1984. “Gambling: A Sociological Review.” Annals of the American Academy of Political and Social Sciences 474: 107-1212. - Young, M. 2010. “Gambling, Capitalism and the State. Towards a new Dialectic of the Risk Society.” Journal of Consumer Culture 19(2): 254-273.  - Cheung, Nicole W.T. 2016. “Social Strain, Self-Control, and Juvenile Gambling Pathology: Evidence from Chinese Adolescents.” Youth & Society 48(1): 77-100.  Policy concerning gambling - Chan, C.C., William W.L. Li and Eugene C.I. Leung. 2016. Problem Gambling in Hong Kong and Macao. Etiology, Prevalence and Treatment. Singapore: Springer.  - Korn, David A., and Howard J. Shaffer. 1999. \"Gambling and the health of the public: Adopting a public health perspective.\" Journal of gambling studies 15.4: 289-365.  Drug use - Parker, H., L. Williams and J. Aldridge. 2002. “The Normalization of ‘Sensible’ Recreational Drug Use.” Sociology 36(4): 941-964.  - Cheung, Nicole W.T. and Y.W. Cheung. 2009. “Is Hong Kong Experiencing Normalization of Adolescent Drug Use? Some Reflections on the Normalization Thesis.” Substance Use & Misuse 41(14): 1967-1990.  Policy concerning drug use  - Cheung, Yuet W. & Nicole W. T. Cheung. 2003. “Social Capital and Risk Level of Posttreatment Drug Use: Implications for Harm Reduction among Male Treated Addicts in Hong Kong.” Addiction Research & Theory 11(3): 145-162.  - Erickson, Patricia G. 1999. \"Introduction: the three phases of harm reduction. An examination of emerging concepts, methodologies, and critiques.\" Substance Use & Misuse 34.1: 1-7. - Reinarman, C., Peter D. A. Cohen, and Hendrien L. Kaal. 2004. “The Limited Relevance of Drug Policy: Cannabis in Amsterdam and in San Francisco.” American Journal of Public Health 94.5: 836-842.  - Cheung, Yuet W., and James MN Ch'ien. 1996. \"Drug use and drug policy in Hong Kong: Changing patterns and new challenges.\" Substance use & misuse 31(11-12): 1573-1597. Sex work - Weitzer, R. 2009. “Sociology of sex work.” Annual Review of Sociology 35: 213-234. - Davis, K. 1937. “The sociology of prostitution.” American Sociological Review 2(5): 744-755.  - Kong, Travis S.K. 2006. “What it feels like for a whore: The body politics of women performing erotic labour in Hong Kong.” Gender, Work and Organization 13(5): 409-434.  - Jolin, Annette. 1994. “On the backs of working prostitutes: feminist theory and prostitute policy.” Crime and Delinquency 40(1): 69-83.  - Wong, W. C., Holroyd, E., & Bingham, A. 2011. “Stigma and sex work from the perspective of female sex workers in Hong Kong.” Sociology of health & illness 33(1): 50-65.  - Wong, W. C., Holroyd, E., Chan, E. Y., Griffiths, S., & Bingham, A. 2008. “\" One country, two systems\": Sociopolitical implications for female migrant sex workers in Hong Kong.” BMC international health and human rights 8(1): 1. - Kong, T. S. 2009. “More than a sex machine: Accomplishing masculinity among Chinese male sex workers in the Hong Kong sex industry.” Deviant Behavior 30(8): 715-745.   Policy concerning sex work  - Joint United Nations Programme on HIV/AIDS (UNAIDS). 2012. UNAIDS Guidance Note on HIV and Sex Work. Joint United Nations Programme on HIV/AIDS. United Nations.  - Choi, Susanne YP, Y.W. Cheung, and K. Chen. 2006. \"Gender and HIV risk behavior among intravenous drug users in Sichuan Province, China.\" Social science & medicine 62.7: 1672-1684.  Problems in the cyber world - Caplan, Scott E. 2002. \"Problematic Internet use and psychosocial well-being: development of a theory-based cognitive–behavioral measurement instrument.\" Computers in human behavior 18.5: 553-575. - Kim, J. H., Lau, C. H., Cheuk, K. K., Kan, P., Hui, H. L., & Griffiths, S. M. 2010. “Brief report: Predictors of heavy Internet use and associations with health-promoting and health risk behaviors among Hong Kong university students.” Journal of adolescence, 33(1), 215-220.  - Ngai, Steven S.Y. 2007. \"Exploring the validity of the Internet Addiction Test for students in grades 5–9 in Hong Kong.\" International Journal of Adolescence and Youth 13.3: 221-237.  - Golub, A, and K. Lingley. 2008. “Just Like the Qing Empire” Internet Addiction, MMOGs, and Moral Crisis in Contemporary China.\" Games and Culture 3.1: 59-75.  - Choliz, M. 2010. \"Mobile phone addiction: a point of issue.\" Addiction 105.2: 373-374. - Williams, Kirk R., and Nancy G. Guerra. \"Prevalence and predictors of internet bullying.\" Journal of adolescent health 41.6 (2007): S14-S21. - Wong, Dennis SW, H.C. Oliver Chan, and Christopher HK Cheng. 2014. \"Cyberbullying perpetration and victimization among adolescents in Hong Kong.\" Children and Youth Services Review 36: 133-140.  Policy concerning internet addiction - Shek, Daniel TL, Vera MY Tang, and C. Y. Lo. \"Evaluation of an Internet addiction treatment program for Chinese adolescents in Hong Kong.\" Adolescence 44.174 (2009): 359. - Koh, Young-Sam. 2015. “The Korean national policy for Internet addiction.\" In C. Montag and M. Reuter. Internet Addiction: Neurosientific Approaches and Therapeutical Interventions. Springer. (pp.219-233).  Domestic abuse - Johnson, Michael P., and Kathleen J. Ferraro. 2000. \"Research on domestic violence in the 1990s: Making distinctions.\" Journal of Marriage and Family 62.4: 948-963.  - Anderson, K. L. 1997. “Gender, status, and domestic violence: An integration of feminist and family violence approaches.” Journal of Marriage and the Family, 655-669. - Chan, K. L., Brownridge, D. A., Tiwari, A., Fong, D. Y., & Leung, W. C. 2008. “Understanding violence against Chinese women in Hong Kong an analysis of risk factors with a special emphasis on the role of in-law conflict.” Violence Against Women, 14(11), 1295-1312. - Choi, Susanne Y.P., Cheung, Y.W. and Adam K.L. Cheung. 2012. “Social Isolation and Spousal Violence: Comparing Female Marriage Migrants with Local Women.” Journal of Marriage and Family 74(3): 444-461.  Policy concerning domestic abuse Sherman, L. W., Smith, D. A., Schmidt, J. D., & Rogan, D. P. 1992. “Crime, punishment, and stake in conformity: Legal and informal control of domestic violence.” American Sociological Review, 680-690.  Sack, Emily J. 2004. \"Battered women and the state: The struggle for the future of domestic violence policy.\" Wisconsin Law Review: 1657. Poverty - Lewis, O. 1966. “The Culture of Poverty.” Scientific American 215(4):19-25.< /p> - Cattell, Vicky. 2001. “Poor people, poor places, and poor health: the mediating role of social networks and social capital.” Social Science and Medicine 52: 1501-1516. - Newman, Katherine S., and Rebekah Peeples Massengill. 2006. \"The texture of hardship: Qualitative sociology of poverty, 1995-2005.\" Annual Review of Sociology 32: 423-446.  - Lee, Kim-ming, Hung Wong, and Kam-yee Law. 2007. \"Social polarisation and poverty in the global city the case of Hong Kong.\" China Report 43(1): 1-30. Wong, H. 2006. “Human capital, social capital and social exclusion: Impacts on the opportunity of households with youth to leave poverty.” International Journal of Adolescent Medicine and Health, 18(3), 521-534. Policy concerning poverty - Wong, Hung. 2007. “Misled Intervention by a Misplaced Diagnosis: The Hong Kong SAR Government's Policies for Alleviating Poverty and Social Exclusion.” China Review 7(2): 123-147.  - Narayan, Deepa. 1999. Bonds and Bridges: Social Capital and Poverty. Policy Research working paper 2167. World Bank.  - Wong, Hung. 2015. The hope of poverty eradication: Examination of poverty problem in Hong Kong (Revised Edition) (「無窮」的盼望: 香港貧窮問題探析增訂版) . Hong Kong: Chung Hwa Book Co. (in Chinese). Racism Clair, M., and Jeffrey S. Denis. 2015. “Sociology of Racism” James D. Wright (edited). The International Encyclopedia of the Social and Behavioral Sciences. 19:857-863.  - Bobo, Lawrence, and Vincent L. Hutchings. 1996. \"Perceptions of racial group competition: Extending Blumer's theory of group position to a multiracial social context.\" American Sociological Review: 951-972.  - Quillian, Lincoln. 1995. \"Prejudice as a response to perceived group threat: Population composition and anti-immigrant and racial prejudice in Europe.\" American sociological review: 586-611. - Sigelman, Lee, and Susan Welch. 1993. \"The contact hypothesis revisited: Black-white interaction and positive racial attitudes.\" Social forces 71.3: 781-795. - Pettigrew, Thomas F., and Linda R. Tropp. 2006. \"A meta-analytic test of intergroup contact theory.\" Journal of personality and social psychology 90.5: 751. - Bun, K.H. 2006. “Body, Dress and Cultural Exclusion: Experiences of Pakistani Women in ‘Global’ Hong Kong.” Asian Ethnicity 7(3): 285-302.  Policy concerning poverty - Phillips, C. 2011. “Institutional racism and ethnic inequalities: an expanded multilevel framework.” Journal of Social Policy, 40 (1):173-192. - Croby, F. J., Iyer, A., & Sincharoen, S. 2006. “Understanding affirmative action.” Annu. Rev. Psychol., 57, 585-611. - Law, K.Y. and K.M. Lee. 2012. “The Myth of Multiculturalism in ‘Asia’s World City’: Incomprehensive Policies for Ethnic Minorities in Hong Kong.” Journal of Asian Public Policy 5(1): 117-134.  Aging and ageism - Moen, P., Dempster-McClain, D., & Williams Jr, R. M. 1992. “Successful aging: A life-course perspective on women's multiple roles and health.” American Journal of Sociology, 1612-1638.  - Hagestad, G. O., & Uhlenberg, P. 2005. “The social separation of old and young: A root of ageism.” Journal of social issues 61(2): 343-360.  - Nelson, T. D. 2005. “Ageism: Prejudice against our feared future self.” Journal of Social Issues 61(2): 207-221.  - Lee, William Keng Mun. 2003. \"Women and retirement planning: Towards the “feminization of poverty” in an aging Hong Kong.\" Journal of women & aging 15.1: 31-53.  - Lee, William Keng-mun, and Kwok Hong-Kin. 2005. \"Differences in expectations and patterns of informal support for older persons in Hong Kong: Modification to filial piety.\" Ageing International 30.2: 188-206.  - Minichiello, V., Browne, J., & Kendig, H. 2000. “Perceptions and consequences of ageism: views of older people.” Ageing and Society 20(3): 253-278.  Policy concerning aging and ageism - World Health Organization. 2002. Active Ageing. A Policy Framework. Noncommunicable Disease Prevention and Health Promotion Department, World health Organization.    ", "terms": {"2020-21 Term 2": {"--LEC (6650)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Dr. LEE King Wa"]}, "-T01-TUT (6651)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Dr. LEE King Wa"]}}}, "assessments": {"Essays": "30", "Essay test or exam": "45", "Others": "15", "Presentation": "10"}}, {"code": "2204", "title": "e-Research Skills", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Pre-requisite(s): SOCI1003.", "description": "In response to the ever-expanding global electronic information network, learning and researching through IT applications are inevitable. Sociology students with basic social research skills need to apply IT skills more vigorously to conduct social inquiry in well-structured, organized and tactical manners. The objective of this course is to integrate the sociological approach with the process of digitized information researching. The course emphasizes further hands-on skills in: (1) researching, collating and compiling electronic information; (2) authoring and publishing online materials; and (3) research data collection, management, analysis and presentation. (Advisory: For Sociology Majors and Minors and Social Research Minors only.)", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2208", "title": "Urban Sociology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "Sociology has always had an intimate relationship with cities. Urbanization — the increase of the share of the population living in cities — was one of the developments that early sociologists sought to study and explain. Since then, the global urban population has only continued to increase. Today, over half of humanity lives in cities and towns. Understanding urban society is no less essential than it was in the nineteenth and twentieth centuries. Urban sociology has many sides, but in this course students will learn about four main topics: 1) the distinctive social character of the “urban experience,” 2) the economic role of cities within society, 3) the dynamics of investment in urban land and the construction of the “built environment” in cities, and 4) major social problems facing urban areas today including poverty, affordability, safety, and the effects of climate change. Through all of these topics, the readings and lectures will focus on international examples and trends, while the assignments will require students to reflect on their own experience of city life and to undertake hands-on observation and analysis of Hong Kong.", "outcome": "1) To familiarize students with the questions asked and answers proposed by urban sociologists in four main areas: the distinctive social character of the urban experience, the economic role of cities within society including how that role has changed over time, the dynamics of investment in urban land and the construction of the \"built environment,\" and major social problems faced by cities today, including proverty, affordability, safety, and climate change. 2) To give students an international, comparative perspective on urban social phenomena and problems.  3) To induce students to reflect on and reconsider urban life in Hong Kong in light of the theories and international comparisons offered in course readings and lectures.   ", "syllabus": "  Part I: The Urban Experience  These three weeks will present macro, micro, and meso-level sociological accounts of the sociological significance of urban areas and life. What is it like to live in a city? How do people interact with each other in cities? How is it different from life and social interactions in rural areas or smaller towns? The size and density of cities turn out to make for distinctive ways of living and interacting.  Part II: Industrial and Post-Industrial Cities  This three-week section will consider the changing economic significance of cities in modern society. Why do particular industries cluster together in cities or neighbourhoods? How is globalization and financialization changing cities? What are the challenges faced by cities in the Global South today?  Part III: Use and Exchange of Urban Space  In these three weeks, the readings and lectures will consider different sociological accounts of the spatial development of urban areas. What are the consequences of the fact that cities are both spaces where people live and work and investment markets for profit-seeking developers? This will touch on phenomena including gentrification and property bubbles.  Part IV: Urban Problems; Whose Solutions?The final four weeks will look at some challenges confronting cities today. How is increasing inquality impacting urban life? How can crises surrounding housing availabiliy, control of public space, and climate change be dealt with? Cities are as much sites of struggle as they are of industry and commerce. A major emphasis will be on how different proposed solutions tend to meet unequally the interests of different social groups.", "required_readings": " None.  ", "recommended_readings": "Bridge, Gary and Sophie Watson. (eds.) 2010. The Blackwell City Reader. 2nd ed. Malden, MA: Wiley-Blackwell. Duneier, Mitchell. 2001. Sidewalk. New York: Farrar, Straus and Giroux. Gottdiener, Mark and Ray Hutchison. 2011. The New Urban Sociology. 4th ed. Boulder, CO: Westview Press.Lin, Jan and Christopher Mele, eds. 2013. The Urban Sociology Reader. 2nd ed. London: Routledge.Sassen, Ksakia. 2000. Cities in a World Economcy. 2nd ed. Thousand Oaks, Calif.: Pine Forge Press.Smith, Neil. 1996. The New Urban Frontier: Gentrification and the Revanchist City. London: Routledge.  ", "terms": {"2020-21 Term 2": {"--LEC (6418)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor Mark Simon COHEN"]}, "-T01-TUT (6434)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor Mark Simon COHEN"]}}}, "assessments": {"Essays": "75", "Participation": "25"}}, {"code": "2216", "title": "Social Problems in China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Not for students who have taken UGEC2963.", "description": "(UGEC2963 is double-coded with SOCI2216.) China’s opening to the world has led to not only massive social and economic transformations, but also the emergence of social problems. This course explores some of these social problems, especially since the economic reform after 1978. The nature of these social problems and their possible causes will be critically examined, in the context of modernization, with the help of related concepts and theories in sociology. By the end of the course, students are expected to have a basic understanding of the major social problems in contemporary China and their implications for social and economic developments of China in the future.", "outcome": " 1. Students will be able to gain a basic intellectual understanding of the nature and possible causes of the major social problems faced by a changing China.  2. Students will be able to develop critical thinking on the public perception of social problems in China.  3. Students will be able to apply the theoretical perspectives and concepts gained from this course to analyze social problems they encounter in contemporary China.", "syllabus": " With the help of related concepts and theories in sociology, this course will critically examine the nature of some of the social problems and their possible causes faced by China under modernization.  The topics include:  1. Theoretical approaches to social problems  2. Modernization and social problems in China  3. The evolution of the Communist Party and State since 1978  4. Rural problems  5. Urbanization and migration  6. Social inequality  7. Social resistance  8. Aging population  9. Crime trends and responses of criminal justice system  10. Environmental problems  11. Food and drug safety  12. Illicit Drugs and AIDS", "required_readings": "  Theoretical approaches to Social Problems       Rubington, E. and M.S. Weinberg. 2011. The Study of Social Problems—Seven Perspectives (Chapter 1).  London: Sage Publications.     Merton, R.K. 1961. “The Study of Social Problems”, Pp 3-17 in Contemporary Social Problems, edited by R.K. Merton and R.A. Nisbet. New York: Harcourt, Brace & World.                 Modernization and Social Problems in China      Levy, M.J. 1954. Contrasting Factors in the Modernization of China and Japan. Economic Development and Cultural Change 2 (3): 161-197.     Saich, Tony. 2004. “China’s Changing Road to Development: Political History, 1949-78”, Pp 25-56  in Governance and Politics in China. NY: Palgrave MacMillan.      Evolution of the Communist Party and State since 1978      Walder, Andrew G. 1995. “The Quiet Revolution from Within: Economic Reform as a source of Political Decline”,  Pp. 1-26 in The Waning of the Communist State: Economic Origins of Political Decline in China and Hungary. Berkeley: University of California Press.     Chan, K.M. 2001. “Towards an integrated model of corruption: Opportunities and control in China.” International Journal of Public Administration 23(4):507-551.      Rural Problems      Oi, Jean C. and Scott Rozelle. 2000. “Elections and Power: the Locus of Decision-Making in Chinese Villages.” The China Quarterly 162: 513-539.     Huang, Philip, Gao Yuan, and Yusheng Peng. 2012. “Capitalization without Proletarianization in China’s Agricultural Development.” Modern China 38 (2): 139-173.      Urbanization and migration      Hu, X., Wang, G.T. and Zou, Y. 2002. “Political economy of the floating Chinese population.” Journal of Contemporary Asia 32(4):536-552.     Zhao, Shaohua. 2011. “What determines migrant workers’ life chances in contemporary China? Hukou, social exclusion and the market.” Modern China 37: 243-285.      Social inequality      Bian, Yanjie. 2002. “Chinese Social Stratification and Social Mobility.” Annual Review of Sociology 28: 91-116.     Wu, Xiaogang. 2009. “Income Inequality and Distributive Justice: A Comparative Analysis of Mainland China and Hong Kong”. China Quarterly 200: 1033-1052.      Social Resistance      Ostegaard, C.S. and Petersen, C. 1991. “Official profiteering and the Tiananmen Square demonstrations in China.” Corruption and Reform 6:87-107.     Pei, Min Xin. 2010. “Rights and resistance: the changing contexts of the dissident movement ”, Pp 22-46 in Chinese society: change, conflict and resistance, edited by Elizabeth J. Perry and Mark Selden. New York: Routledge.      Aging Population      Greenhalgh, Susan. 2003. \" Science, Modernity, and the Making of China's One-Child Policy\". Population and Development Review 29: 163-196.  Zhao, Zhongwei & Wei Chen. 2011. “China's far below-replacement fertility and its long-term impact: Comments on the preliminary results of the 2010 census”. Demographic Research 25: 819-835.      Crime trends and responses of criminal justice system      Liu, J. 2005. “Crime patterns during the market transition in China.” British Journal of Criminology 45: 613-633.     Gong, T. 2004. “Dependent judiciary and unaccountable judges: Judicial corruption in contemporary China.” The China Review 4(2):33-54.      Environmental Problems      Wanxin Li and Paul Higgins. 2013. Controlling local environmental performance: An analysis of three national environmental management programs in the context of regional disparities in China. Journal of Contemporary China 22 (81): 409-427.     Blackman, A. and W. Harrington, 2000. \"The Use of Economic Incentives in Developing Countries: Lessons From International Experience With Industrial Air Pollution.\" The Journal of Environment Development 9(1): 5-44.      Food and drug safety      Dellios, R. et al.  2009. “Food Safety and the Role of the Government: Implications for CSR Policies in China”.  Ibusiness 1: 75-84.     Yi, H., Miller, G., Zhang, L., Li, S., & Rozelle, S. 2015. “Intended and unintended consequences of china's zero markup drug policy”. Health Affairs 34(8): 1391-16C.      Illicit Drugs and AIDS      Clarke, R. 2008. “Narcotics trafficking in China: Size, scale, dynamic and future consequences.” Pacific Affairs 81(1):73-93.     Choi, S.Y.P., Cheung, Y.W. and Chen, K. 2006. “Gender and HIV risk behavior among intravenous drug users in Sichuan Province, China.” Social Science and Medicine 62:1672-1684.   ", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (5590)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor ZHONG Hua"]}, "-T01-TUT (5591)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor ZHONG Hua"]}}}}, {"code": "2218", "title": "Marriage and Family", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Not for students who have taken SOCI3222 (old code) or GESC2320.", "description": "This course discusses the major theoretical debates in sociology of marriage and family. Particularly, it looks at family structure and processes from various theoretical perspectives. Topics include major family transitions in adult life, such as love, mate selection, cohabitation, marriage, parenthood, divorce and remarriage. Special attention will be given to diversity of family forms, changing sex-role norms, class and childrearing practices, power and division of family labour, linkages between the family and the work systems. Whenever possible, family issues will be discussed and illustrated with examples in Chinese society.", "outcome": " Course Objectives: (1) To understand major theoretical approaches in marriage and family (2) To learn the dynamics and recent trends of marriage and family (3) To grasp issues of marriage and family in the Hong Kong context (4) To be aware of problems that challenge modern marriage and family  ", "syllabus": "  1. What is Family?  Sociological significance and theoretical issues  Defining the family  Cherlin, Andrew J. (2013). Public & Private Families: an Introduction. New York, NY, McGraw-Hill, chapter 1.   *Coontz, Stephanie (2000). \"Historical Perspectives on Family Diversity\". In David H. Demo, Katherine R. Allen and Mark A. Fine, Handbook of Family Diversity. New York, Oxford University Press: 17-31.   *Luxton, Meg and Bonnie Fox (2014). \"Analyzing the Familiar: Definition, Approaches, and Issues at the Hear of Studying Families\". In Bonnie Fox, Family Patterns, Gender Relations. Don Mills, Ont.; Canada, Oxford University Press.   2. The emergence of the modern family and its unique features  Historical changes in marriage and family  *Cancian, Francesca M. (1987). Love in America: Gender and Self-development. Cambridge, Cambridge University Press, chapter 2.   Coltrane, Scott and Randall Collins (2001). Sociology of Marriage & the Family: Gender, Love, and Property. Australia; Belmont, CA, Wadsworth/Thomson Learning, 66-125. *Mintz, Steven and Susan Kellogg (1989). Domestic Revolutions: a Social History of American Family Life. New York, Free Press, chapter 5, 6 and 9.   Young, Michael Dunlop and Peter Willmott (1974). The Symmetrical Family. Pantheon Books, New York, chapter 3.   Changing meaning of childhood   *   3. Chinese familism  Leung, Benjamin Kwan Pun (1996). “The family and society,” pp. 75–93 in Perspective on Hong Kong Society. Hong Kong: Oxford University Press.  吳俊雄(1989)。「家庭危機，誰的危機？」，載 《明報月刋》，1989年1月號，頁3-10。  4 The discontent to the modern family  • The anti-social family  • Marital relations: his and her marriage  *Barrett, Michèle and Mary McIntosh (1991). The Anti-social Family. London; New York, Verso, p.43-80.   Coltrane, Scott and Randall Collins (2001). Sociology of Marriage & the Family: Gender, Love, and Property. Australia; Belmont, CA, Wadsworth/Thomson Learning, 66-125.  Bernard, Jessie (1982). The Future of Marriage. New Haven, Yale University Press, chapter 1-3.   *Thorne, Barrie (1992). \"Feminism and the Family: Two Decades of Thought\". In Barrie Thorne and Marilyn Yalom, Rethinking the Family: Some Feminist Questions. Boston, Northeastern University Press: 3-30.   5. Marriage and family in crisis?  • The marriage debate: marital-in-decline VS marital-resilience perspective  *Amato, Paul R. (2004). \"Tension Between Institutional and Individual views of Marriage.\" Journal of Marriage and Family 66(4): 959-965.  *Cherlin, Andrew J. (2004). \"The Deinstitutionalization of American Marriage.\" Journal of Marriage and Family 66(4): 848-861.  Popenoe, David (1993). \"American Family Decline, 1960-1990: A Review and Appraisal.\" Journal of Marriage and Family 55(3): 527-542.  6. Individualization of marriage and family:  *Beck, Ulrich and Elisabeth Beck-Gernsheim (1995). The Normal Chaos of Love. Cambridge, UK, Polity Press, p. 1-44.   *Giddens, Anthony (1992). The Transformation of Intimacy: Sexuality, Love and Eroticism in Modern Societies. Cambridge, Polity Press, chapter 1 and 3. (CC Reserve 1 day: HQ21.G48)  7. Mate selection  *Buss, D. M., T. K. Shackelford, et al. (2001). \"A Half Century of Mate Preferences: The Cultural Evolution of Values.\" Journal of Marriage and Family 63(2): 491-503  *Chang, Lei, Yan Wang, et al. (2011). \"Chinese Mate Preferences: Cultural Evolution and Continuity Across a Quarter of a Century.\" Personality and Individual Differences 50(5): 678-683.  *South, Scott J. (1991). \"Sociodemographic Differentials in Mate Selection Preferences.\" Journal of Marriage and Family 53(4): 928-940.  * Zhou, Yun (2019). “Economic Resources, Cultural Matching, and the Rural-Urban Boundary in China’s Marriage Market”. Journal of Marriage and Family 81(3): 567-583.  8. Whose wedding is that? Traditional and individualized wedding  Boden, Sharon (2007). Consuming Pleasure on the Wedding Day: the Lived Experience of Being a Bride. Gender and Consumption: Domestic Cultures and the Commercialisation of Everyday Life. Emma Casey and Lydia Martens. Aldershot, Hampshire; Burlington, VT, Ashgate: 109 - 122.  Carter, Julia and Simon Duncan (2017). “Wedding Paradoxes: Individualized Conformity and the “Perfect Day””. The Sociological Review 65(1): 3-20.  Tso, Ho Yee Vienne (2015). “It’s Our Day: the Negotiation of Wedding Arrangements” in Social Transformations in Chinese Societies”, Vol. 11, No. 2.  9. Paid work and dual earner family   *Luxton, Meg (2009). \"Family Coping Strategies Balancing Paid Employment and Domestic Labour.\" In B. Fox, Family Patterns, Gender Relations. Don Mills, Ont.; New York, Oxford University Press: 453-473.   Strong, Bryan and Theodore F. Cohen (2014). The Marriage and Family Experience: Intimate Relationships in a Changing Society. Belmont, CA, Wadsworth, chapter 11. Bianchi, Suzanne M. and Melissa A. Milkie (2010). \"Work and Family Research in the First Decade of the 21st Century.\" Journal of Marriage and Family 72(3): 705-725.  10. Managing the Families  10.1 Household financial control and management  Lauer, S. R. and C. Yodanis (2011). \"Individualized Marriage and the Integration of Resources.\" Journal of Marriage and Family 73(3): 669-683.  Ting, Kwok Fai and Tso Ho Yee Vienne (2013), “Individualization and the Marital Quality”, in W.K.S. Chiu, Ting, Kwok-fai and Wan, Po-shan (ed.) Families in Hong Kong: A Collective Portrait. Hong Kong Institute of Asia Pacific Studies, chapter 3. (in Chinese) Eickmeyer, Kasey, Manning, Wendy and Susan Brown (2019). “What’s Mine Is Ours? Income Pooling in American Families”. Journal of Marriage and Family 81(4): 968-978.  Ting, Kwok Fai and Tso Ho Yee Vienne (2013), “Individualization and the Marital Quality”, in W.K.S. Chiu, Ting, Kwok-fai and Wan, Po-shan (ed.) Families in Hong Kong: A Collective Portrait. Hong Kong Institute of Asia Pacific Studies, chapter 3. (in Chinese)   *Vogler, Carolyn, Clare Lyonette, et al. (2008). \"Money, Power and Spending Decisions in Intimate Relationships.\" The Sociological Review 56(1): 117-143.  A general review:  *Bennett, Fran (2013). \"Researching Within-Household Distribution: Overview, Developments, Debates, and Methodological Challenges.\" Journal of Marriage and Family 75(3): 582-597.  10.2 Division of housework  Cheung Adam Ka Lok and Lake Lui (2015). Hiring Domestic Help in Hong Kong. Journal of Family Issues, 38(1), 73-99.  *Choi, Yuk Ping Susanne and Kwok Fai Ting (2009). A Gender Perspective on Families in Hong Kong. Mainstreaming Gender in Hong Kong Society. F. M. Cheung and E. Holroyd: 159-80.   Fuwa, Makiko (2004). \"Macro-Level Gender Inequality and the Division of Household Labor in 22 Countries.\" American Sociological Review 69(6): 751-767.  *Tai, Tsui-o and Judity Treas (2013). “Housework Task Hierarchies in 32 Countries”. European Sociological Review 29(4): 780-791.  11. Parenting  • Fertility trend  • Trends and changing meaning of childhood and parenthood  • Parenting style  *Coltrane, S. and R. Collins (2001). “Contraception and Reproduction: Making Babies in a Technological Age.” In Sociology of Marriage & the Family: Gender, Love, and Property. Australia; Belmont, CA, Wadsworth/Thomson Learning: Ch. 10.   LeVine, Robert A. and Merry White (1992). \"The Social Transformation of Childhood\". In Arlene S. Skolnick and Jerome H. Skolnick, Family in transition. Boston, Allyn and Bacon: 295-315. (UL HQ518 .F3359 1994)  Strong, Bryan and Theodore F. Cohen (2014). The Marriage and Family Experience: Intimate Relationships in a Changing Society. Belmont, CA, Wadsworth, chapter 10. Biblarz, Timothy J. and Judith Stacey (2010). \"How Does the Gender of Parents Matter?\" Journal of Marriage and Family 72(1): 3-22.  Umberson, Debra, Tetyana Pudrovska, et al. (2010). \"Parenthood, Childlessness, and Well-Being: A Life Course Perspective.\" Journal of Marriage and Family 72(3): 612-629.   ", "required_readings": "  ", "recommended_readings": "  Please refer to the course syllabus.   ", "terms": {"2020-21 Term 1": {"--LEC (8107)": {"startTimes": ["11:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor TSO Ho Yee Vienne"]}, "-T01-TUT (8265)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor TSO Ho Yee Vienne"]}}}, "assessments": {"Essays": "35", "Essay test or exam": "30", "Others": "5", "Presentation": "30"}}, {"code": "3001", "title": "Complex Organization", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "The purpose of this course is to familiarize students with: (1) the nature, significance, issues and concepts of complex organizations in modern societies; (2) the approaches to, or the schools of thought on, organizational analysis; and (3) the structure and behaviour of complex organizations.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3002", "title": "Social Stratification", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "This course discusses principles of allocation and reallocation of valuable social resources among different sectors of the population. Topics include fundamental concepts of social stratification, historical development of social inequality, classical and contemporary theories of class, social mobility, contradiction between equality and equity, implications of labour market segmentation and globalization on social equality.\r", "outcome": "    Untitled Document   This course will review some of the classical and contemporary approaches to understanding the differential distribution of valued goods and the social processes. Students are encouraged to critically think of and discuss about six categories of questions as below: (a) What are the major forms of stratification in human history? Is inequality an inevitable feature of human life? (b) How many social classes are there? What are the principal? \"fault lines\" or social cleavages that define the class structure? Are these cleavages strengthening or weakening with the transition to advanced industrialism? (c) How frequently do individuals cross occupational or class boundaries? Are educational degrees, social contacts, and \"individual luck\" important forces in matching individuals to jobs and class positions? What other social and institutional forces affect occupational attainment and allocation? (d) How are the lifestyles, attitudes, and personalities of individuals shaped by their class locations? Are there identifiable \"class cultures\" in past and present societies? (e) What types of social processes and state policies serve to maintain or alter racial, ethnic, and sex discrimination in labor markets? Have these forms of discrimination weakened or strengthened with the transition to advanced industrialism? (f) Will stratification systems take on new and distinctive forms in the future? Is a \"new class\" of professionals and intellectuals emerging? Are the stratification systems of modern societies gradually shedding their distinctive features and converging towards some generic post-industrial or postmodern regime?   ", "syllabus": "        1. Introduction   2. Classical Theory on Class and Stratification: Marxist and Weberian Approaches   3. Contemporary Theory on Class and Stratification   4. Social Mobility    5. Education, Cultural Capital and Social Reproduction   6. Consumption Patterns and Cultural Distinction   7. Social Networks and Social Capital   8. Poverty and Underclass   9. Other Sources of Social Stratification   10. Conclusion      ", "required_readings": "       Required readings       Required readings * Grusky, David B. Social Stratification: Class, Race, and Gender in Sociological Perspective (2nd edition). Bourdieu, Pierre. 1973. \"Cultural Reproduction and Social Reproduction\" from Richard Brown (ed.), Knowledge, Education, and Cultural Change. Bourdieu, Pierre. 1986. The forms of capital. In Handbook of Theory and Research for the sociology of Education, ed. J. G. Richardson, 241-58. Coleman, James S. 1988. \"Social Capital in the Creation of Human Capital.\" AJS 94:S95-S120.     ", "recommended_readings": "        Recommended readings Barbara Schneider and David Stevenson. 1999. Ambitious Generation. Yale University Press. Bowles, Samuel. and  Herbert Gintis. 1976. Chapter 4: Education, Inequality, and the Meritocracy. In Schooling in Capitalist America. Chiu, Stephen S.W., Susanne Y.P. Choi and K.F. Ting., 2005. “Getting ahead in the capitalist paradise: Migration from China and socioeconomic attainment in colonial Hong Kong” International Migration Review 39 (1): 203-227.  Leung, B. 1996. “Social class and social mobility,” pp. 29-48 in Perspectives on Hong Kong Society. Hong Kong: Oxford University Press. Lui, Tai-lok. 2003. “Rearguard Politics: Hong Kong’s Middle Class.” The Developing Economies XLI-2 Post, David. 1994. “Educational Stratification, School Expansion, and Public Policy in Hong Kong.” Sociology of Education, 67:121-138 Post, David. 1996. The Massification of Education in Hong Kong: Effects on the Equality of Opportunity, 1981-1991. Sociological Perspectives. 39(1). Post, David. 2003. “Post-secondary education in Hong Kong - Repercussions for inequality and civil society.” Asian Survey 43 (6): 989-1011. Post, David. 2003. “Hong Kong Higher Education, 1981-2001: public policy and re-emergent social stratification.” Oxford Review of Education, 29(4):545-570. Post, David. 2010. “Postsecondary educational expansion and social integration in Hong Kong” in Globalization, Changing Demographics, and Educational Challenges in East Asia. Bingley, UK: Emerald. Pong, Suet-ling, and Wing Kwong Tsang. 2010. “The educational progress of mainland Chinese immigrant students in Hong Kong” pp. 201-230 in Globalization, Changing Demographics, and Educational Challenges in East Asia. Bingley, UK: Emerald. Post, David. 2004. “Family resources, gender, and immigration: Changing sources of Hong Kong educational inequality, 1971-2001” SOCIAL SCIENCE QUARTERLY 85 (5): 1238-1258. Wong, Yi-lee. 2004. “A Unified Middle Class or Two Middle Classes? A Comparison of Career Strategies And Intergenerational Mobility Strategies Between Teachers And Managers In Contemporary Hong Kong.” British Journal of Sociology. 55: 167-186.    ", "terms": {"2020-21 Term 2": {"--LEC (8409)": {"startTimes": ["11:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr. OR Tsz Ming"]}, "-T01-TUT (8411)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Dr. OR Tsz Ming"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "40", "Others": "10", "Presentation": "30"}}, {"code": "3003", "title": "Classical Sociological Theory", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "This course examines the foundations of sociological theory as laid out by the classic writers at the end of the nineteenth century. The main focus will be on the work of the three great founding theorists of sociology: Karl Marx, Max Weber, and Emile Durkheim.The focus of this course will be a close examination of original texts and the ideas expressed in them (rather than their application to contemporary issues). The aim is for student to appreciate the complexity, possibly even inconsistency, of these writers, something that gets lost in textbook representation of Marx, Weber, and Durkheim.\r", "outcome": "        Familiarity with the major classic theories and perspectives   Understanding the foundational concepts and conceptual framework of sociological theory   Ability to assess critically theoretical arguments and their links with empirical evidence   Ability to analyse historical and contemporary social phenomena from different sociological perspectives   Inclination to think innovatively of solutions to social problems    ", "syllabus": "    Untitled Document   Introduction: What is Classical Sociological Theory?  Precursors Karl Marx   • Background & Alienation  • Historical Materialism  • Capitalism and the Labour Process Max Weber  • Background & Methodology  • Religion & Politics  Emile Durkheim  • Background & Social Facts  • Solidarity and Modern Life  • Religion    ", "required_readings": "    Untitled Document   None.   ", "recommended_readings": "    Untitled Document   Calhoun, C., Gerteis, J., Moody, J., Pfaff, S., & Virk, I. (Eds.) (2012), Classical Sociological Theory (Third edition). Chichester: John Wiley. Hughes, J. A., Sharrock, W. W., & Martin, P. J. (2003). Understanding Classical Sociology (Second edition). London: Sage.   ", "terms": {"2020-21 Term 1": {"A-LEC (6040)": {"startTimes": ["8:30"], "endTimes": ["10:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor TAO Lin"]}, "AT01-TUT (6041)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor TAO Lin"]}}, "2020-21 Term 2": {"B-LEC (8169)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor Christian W. K. GREIFFENHAGEN"]}, "BT01-TUT (8175)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor Christian W. K. GREIFFENHAGEN"]}}}, "assessments": {"Essays": "0", "Essay test or exam": "0", "Others": "0", "Short answer test or exam": "0"}}, {"code": "3102", "title": "Social Networks and Social Capital", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Not for students who have taken UGEC2013.", "description": "Social networks affect many aspects of our lives, and their effect persists over the life course. The science of social networks focuses on measuring, modeling, and understanding the different ways that people are connected to one another. In this course, we will use a broad toolkit of theories and methods drawn from the social, natural, and mathematical sciences to learn what a social network is, to understand how to work with social network data, and to illustrate some of the ways that social networks can be useful in theory and in practice. We will see that network ideas are powerful enough to be used everywhere from Center for Health Protection and Department of Health, where network models help epidemiologists prevent the spread of diseases, to private sectors (e.g., Apple, Amazon, etc.), where data scientists use network ideas to build products that enable people all across the globe to connect with one another. Throughout the course, you will:• identify key network concepts and principles• examine data collection, measurement, and computer analysis techniques• acquire a sufficient grasp of the contemporary network literatures • investigate applications in sociology, public health, political science, public administration, organization studies, and related disciplines.\r", "outcome": "    Untitled Document   By the end of the course, you should be able to: - define social networks and identify the ways that affect health, attitudes and behaviors, and quality of life - describe several important studies and controversies in the social network literature - critically examine the theory, methodology, and findings of research that incorporates social network analysis - conduct innovative and balanced research approaches based on social network theories and methods - Evaluate the implications of the social network research   ", "syllabus": "    Untitled Document   Outline Week 1 Course overview and introduction Recommended reading - Easley and Kleinberg (2010), Chapter 1. Overview: Crowds, and Markets: Reasoning about a Highly Connected World. New York: Cambridge University Press. Week 2  Fundamentals and background Required reading - Connected, Chapter 1 Recommended reading - Easley and Kleinberg (2010), Chapter 2. Graphs: Crowds, and Markets: Reasoning about a Highly Connected World. New York: Cambridge University Press. Week 3 Network rules in real life  Required reading - Connected, Chapter 1 - (#) Travers and Milgram (1969). An Experimental Study of the Small World Problem. Sociometry. Recommended reading - Milgram et al. (1969). Note on the drawing power of crowds of different size. Journal of Personality and Social Psychology. - (#) Dodds et al. (2003), An Experimental Study of Search in Global Social Networks. Science. - (#) McPherson et al. (2006). Social Isolation in America: Changes in Core Discussion Networks over Two Decades. American Sociological Review. - Milgram (1967). The small world problem. Psychology Today. - Strogatz, S. (2012). Friends you can count on. New York Times.  - Small (2013). Weak ties and the core discussion network: Why people discuss important matters with unimportant alters. Social Networks.  - Fischer (2009). The 2004 GSS Finding of Shrunken Social Networks: An Artifact? American Sociological Review. Week 4  Emotion, love, and sex Required reading - Connected, Chapters 2 and 3 - (#) Flower and Christakis (2008), Dynamic Spread of Happiness in a Large Social Network, BMJ. - (#) Jin et al. (2010). Preliminary Evidence Regarding the Hypothesis That the Sex Ratio at Sexual Maturity May Affect Longevity in Men. Demography. Recommended reading - Larson and Richards (1994), Family Emotions: Do Young Adolescents and Their Parents Experience the Same States?, Journal of Research on Adolescence.  - (#) Cacioppo et al. (2009). Alone in the crowd: The structure and spread of loneliness in a large social network. Journal of Personality and Social Psychology. - Jones et al. (2007). Social Transmission of Face Preferences Among Humans. Proceedings of the Royal Society B.  - (#) Bearman and Brückner. (2001). Promising the Future: Virginity Pledges and First Intercourse. American Journal of Sociology. - Young et al. (1963). The Mortality of Widowers. The Lancet. - (#) Elwert and Christakis. (2006). Widowhood and Race. American Sociological Review. - Elwert and Christakis (2008), The Effect of Widowhood on Mortality by the Causes of Death of Both Spouses, American Journal of Public Health. Week 5  Contagion and context (I) Required reading - Connected, Chapters 2 and 3 Week 6  Contagion and context (II) Required reading - Connected, Chapters 2 and 3 - (#) Morris and Kretzschmar (1997). Concurrent partnership and the spread of HIV. AIDS. Recommended reading - McPherson et al. (2001). Birds of a Feather: Homophily in Social Networks. Annual Review of Sociology. - Mayer and Puller. (2008). The old boy (and girl) network: Social network formation on university campuses. Journal of Public Economics. - Ugander et al. (2012). Structural diversity in social contagion. Proceedings of the National Academy of Sciences. Week 7  NO LECTURE Week 8  Spread of disease and health behaviors (I) Required reading - Connected, Chapter 4 - (#) Bearman et al. (2004). Chains of Affection: The Structure of Adolescent Romantic and Sexual Networks. American Journal of Sociology. - (#) Christakis and Fowler (2007). The spread of obesity in a large social network over 32 years. New England Journal of Medicine. Recommended reading - (#) Helleringer and Kohler (2007). Sexual network structure and the spread of HIV in Africa: evidence from Likoma Island, Malawi. AIDS. - (#) Centola, D. (2010). The Spread of Behavior in an Online Social Network Experiment. Science. - Laumann and Youm (1999). Racial/Ethnic Group Differences in the Prevalence of Sexually Transmitted Diseases in the United States: A Network Explanation. Sexually Transmitted Diseases. Week 9  Spread of disease and health behaviors (II) Required reading - Connected, Chapter 4 - (#) Christakis and Fowler (2008). The Collective Dynamics of Smoking in a Large Social Network. New England Journal of Medicine. - (#) Abrutyn and Mueller (2014). Are Suicidal Behaviors Contagious in Adolescence? Using Longitudinal Data to Examine Suicide Suggestion. American Sociological Review. Recommended reading - Raspe et al. (2008). Back pain, a communicable disease? International Journal of Epidemiology. - Phillips (1974). The Influence of Suggestion on Suicide: Substantive and Theoretical Implications of the Werther Effect. American Sociological Review. - (#) Bearman and Moody (2004). Suicide and Friendships Among American Adolescents. American Journal of Public Health. - Cohen-Cole and Fletcher (2008). Is obesity contagious? Social networks vs. environmental factors in the obesity epidemic. Journal of Health Economics. - (#) Cohen-Cole and Fletcher (2008). Detecting implausible social network effects in acne, height, and headaches: longitudinal analysis. BMJ.  Week 10 Economic networks Required reading - Connected, Chapter 5 - (#) Granovetter (1973), The Strength of Weak Ties, American Journal of Sociology. - (#) Banerjee et al. (2013). The Diffusion of Microfinance. Science. Recommended reading - Onnela et al. (2007). Structure and tie strengths in mobile communication networks. Proceedings of the National Academy of Sciences.  - Banerjee et al. (2018). Changes in social network structure in response to exposure to formal credit markets. Working Paper. Week 11 Genes, networks, and society Required reading - Connected, Chapter 7 - (#) Fowler et al. (2011). Correlated genotypes in friendship networks. Proceedings of the National Academy of Sciences. - (#) Boardman et al. (2012). How social and genetic factors predict friendship networks. Proceedings of the National Academy of Sciences. Recommended reading - Fowler et al. (2009). Model of genetic variation in human social networks. Proceedings of the National Academy of Sciences. - (#) Domingue et al. (2018). The social genome of friends and schoolmates in the National Longitudinal Study of Adolescent to Adult Health. Proceedings of the National Academy of Sciences. Week 12 Social network interventions  Required reading - Connected, Chapter 9 - (#) Christakis and Fowler (2010). Social Network Sensors for Early Detection of Contagious Outbreaks. PLoS ONE. - (#) Kim et al. (2015). Social network targeting to maximise population behaviour change: a cluster randomised controlled trial. The Lancet. - (#) Bond et al. (2012). A 61-million-person experiment in social influence and political mobilization. Nature. Recommend reading - Wing and Jeffery (1999). Benefits of recruiting participants with friends and increasing social support for weight loss and maintenance. Journal of Consulting and Clinical Psychology. - Shattuck et al. (1992). How women’s adopted low-fat diets affect their husbands. American Journal of Public Health. - Gorin et al. (2008). Weight loss treatment influences untreated spouses and the home environment: evidence of a ripple effect. International Journal of Obesity. - Buller et al. (1999). Randomized trial testing the effect of peer education at increasing fruit and vegetable intake. Journal of the National Cancer Institute. - Sikkema et al. (2000). Outcomes of a randomized community-level HIV prevention intervention for women living in 18 low-income housing developments. American Journal of Public Health. - Bahr et al. (2009). Exploiting Social Networks to Mitigate the Obesity Epidemic. Obesity. - (#) Paluck et al. (2016). Changing climates of conflict: A social network experiment in 56 schools. Proceedings of the National Academy of Sciences. Week 13 Final exams     ", "required_readings": "   Untitled Document    Textbook Required: Understanding Social Networks (2012) by C. Kadushin    ", "recommended_readings": "    Untitled Document   Textbook (1) Required textbook - Christakis and Fowler (2009). Connected: The Surprising Power of Our Social Networks and How They Shape Our Lives. New York: Little, Brown and Company. (2) Recommended reading - (*) Easley and Kleinberg (2010). Networks, crowds, and markets: Reasoning about a highly connected world. New York: Cambridge University Press. https://www.cs.cornell.edu/home/kleinber/networks-book/ - (^) Valente (2010). Social Networks and Health: Models, Methods, and Applications. New York: Oxford University Press. - (^) Borgatti et al. (2013). Analyzing Social Networks. Thousand Oaks: Sage Publications. - (^) Knoke and Yang (2008). Social Network Analysis: Second Edition. Thousand Oaks: Sage Publications. - (*) Kadushin (2012). Understanding Social Networks: Theories, Concepts and Findings. New York: Oxford University Press. - (+) Wasserman and Faust (1994). Social Network Analysis: Methods and Applications. New York: Cambridge University Press. Note: + Difficult; * Intermediate; ^ Easy   ", "terms": {"2020-21 Term 1": {"--LEC (7602)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor LEE Jaemin"]}, "-T01-TUT (7603)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor LEE Jaemin"]}}}, "assessments": {"Essay test or exam": "42", "Lab reports": "10", "Others": "18", "Selected response test or exam": "30"}}, {"code": "3202", "title": "Sociology and Current Affairs", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Pre-requisite(s): SOCI1001 or SOCI1102 or UGEC1823.", "description": "This is a seminar course designed to integrate theory and research, and to facilitate critical reflection and analysis of major current issues and events. It should help students review and creatively synthesize central themes and concepts from the discipline. In this course, students should demonstrate both knowledge of the discipline and sensitivity to the multilayered meanings of social phenomena.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3204", "title": "Sociology of Crime and Deviance", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "This course introduces students to the nature and social correlates of deviance and crime from the sociological approach. Methodological problems in the measurement of criminality and their implications for various theories of crime will be examined. Lastly, issues in formal and informal control and prevention of crime will be discussed.", "outcome": " After completing the course, the students should be able to:   1 gain an intellectual understanding of the nature and possible causes of criminal and deviant behaviors; 2 capture an overview of sociological theories on crime and deviance; 3 identify and critically evaluate certain commonly-held views regarding crime and deviance; and 4 analyze the issues of crime and deviance in Hong Kong from various sociological perspectives.     ", "syllabus": " (I) What is Crime and Deviance? - Intellectual Background of Criminology - Crime Measurement  (II) Explaining Crime and Deviance - Theories of Structural-functionalism and Strain - Control Theories and Developmental Criminology - Theory of Control-Balance: Crime and deviance as a result of too little control and too much control  - Environmental Criminology: Spatial analysis of crime - Learning Theories and Neutralization Theory: Criminals are not born - Marxist/Critical Criminology: Who defines crime and deviance?  - Postmodern Criminology: Crime and deviance as a function of linguistic domination - Labeling Theory, Reintegrative Shaming, and Peacemaking Criminology  (III) Explaining Victims of Crime - Victimology and Routine Activities Theory      ", "required_readings": " None.  ", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (6930)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor CHEUNG Wai Ting"]}, "-T01-TUT (6684)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHEUNG Wai Ting"]}}}, "assessments": {"Essay test or exam": "40", "Others": "40", "Presentation": "20"}}, {"code": "3207", "title": "Economic Sociology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "As an academic specialty, economic sociology faces a problem. Isn’t the social science that studies the economy just … economics? The economic sociologist must contend, in response to such a doubt, that there are some distinctive insights that result from a sociological perspective on the economy. The purpose of this course is to introduce students to some of these insights. The first half of the course lays out the general perspectives that have been developed by economic sociologists, and the second half covers some of the specific topics of research that have been major focuses for economic sociology. In all, students will leave this course with an appreciation of the lenses through which sociologists view the economy as well as a deeper knowledge of important contemporary economic institutions and trends.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3208", "title": "Gender and Society", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "This course takes up gender as the primary object of study and category of analysis. It aims to: 1. understand the conceptualization of sex and gender by various scholars and the implications of their theorization; 2. understand the process of becoming a woman/ man via the social construction of masculinity, femininity, sexuality and the body;3. understand the implications of being a woman/man on our lived experience, and the mechanisms that reproduce and maintain the observed gaps between the two sexes in daily lives.\r", "outcome": "       Students in this course should study and demonstrate understanding of the following: the discipline of sociology and its role in contributing to our understanding of social order and its changes; the role of theory in sociology; the role of evidence and        Students in this course should study and demonstrate understanding of the following: the discipline of sociology and its role in contributing to our understanding of social order and its changes; the role of theory in sociology; the role of evidence and qualitative methods in sociology; basics concepts in sociology and their fundamental theoretical interrelations; critical thinking; further develop transferable skills beyond disciplinary requirements; development of values, such that the student will see the utility of the sociological perspective as a useful and meaningful perspective on social reality and individual biography, for reflection of value positions and life choices.    ", "syllabus": "          1.      Introduction    Theorizing gender  2.  Sex and gender    Beauvoir Simone de. 2000. ‘Woman as Other’ in Evelyn Ashton-Jones, Gary A. Olson, and Merry G. Perry (ed.) The Gender Reader. Boston: Allyn and Bacon. (p.53-59).    Butler, Judith. 1986. Sex and Gender in Simone de Beauvoir’s Second Sex. Yale French Studies, No.72:35-49.    Rubin Gayle. 1975. ‘The Traffic in Women: Notes on the “Political Economy” of Sex ‘. In R R Reire (ed.) Toward an Anthropology of Women. New York: Monthly Review Press. Pp. 157-183.     3. Gender role socialization and its critique    Parsons T. (1956). ‘Family structure and the socialization of the child’, in T. Parsons and R. Bales (eds) Family: Socialization and Interaction Process. London: Routledge.   Connell, R. W. (1987) “Sex Role Theory” in Gender and Power: Society, the Person and Sexual Politics. Stanford: Stanford University Press. Pp. 47-54.   Mackie, Gerry. Ending Footbinding and infibulation: A convention account. American Sociological Review, 61:999-1017.     Risman, B. 1987. Intimate Relationships from a microstructural perspective: men who mother. Gender and Society 1:6-32.    4. “Doing” gender    Connell, R. W. 1985. Theorizing Gender. Sociology, vol.19 (2):260-272.    *Goffman E. 1977. “The arrangement between the sexes”. Theory and Society vol4 (3):301-331.    *West, Candace & Zimmerman, Don H. 1987. “Doing Gender”. Gender and Society Vol. 1 (2):125-151.      5. Hegemonic masculinity    *Connell R. W. 1993. “The Big Picture: Masculinities in Recent World History”. Theory & Society 22:597-623.                  *Connell R W. 1992. “A Very Straight Gay: Masculinity, Homosexual Experience, and the Dynamics of Gender”. American Sociological Review Vol 57:735-751.    Demetriou, Demetrakis Z. 2001. Connell’s Concept of Hegemonic Masculinity: A Critique. Theory and Society, vol.30, No.3, pp.337-361.    Bourgois, P. 1996. In Search of Masculinity. The British Journal of Criminology 36:412-427.    6.  Understanding gender and doing research on gender:  Notes on proposal writing, research design, and gender analysis     7. Gender and the body   * Carlitz Katherine. 1994. Desire, Danger, and the Body: Stories of Women’s Virtue in Late Ming China. In Christina K. Gilmartin, Gail Hershatter, Lisa Rofel and Tyrene White (ed.) Engendering China: Women, Culture, and the State.     Phua. Lily, Yeoh. Brenda S.A. 2002. “Nine months: women’s agency and the pregnant body in Singapore.” In Brenda S.A. Yeoh, Peggy Teo and Shirlena Huang  (ed.) Gender Politics in the Asia-Pacific Region. London: Routledge.    Stearns, C. A. 1999. Breastfeeding and the Good Maternal Body. Gender and Society, 13:308-325.    Martin, E. 1991. The Egg and the Sperm. Signs 16(3).    Kessler, S. 2002. Defining and Producing Genitals, in Stevi Jackson and Sue Scott (eds.) Gender: A sociological Reader. London: Routledge Student Readers. Pp. 373-447-456.    8. Structure and agency in gender embodiment:  movie viewing    Boddy, J. 1998. “Violence Embodied? Circumcision, Gender Politics, and Cultural Aesthetics” in R. Emerson Dobash & Russell P. Dobash (eds.) Rethinking Violence Against Women. Thousand Oaks, CA: Sage Publications.      9. Gendered Sexuality     *Foucault, Michel. 1998. Scientia Sexualis. In The History of Sexuality 1: The Will To knowledge. Pp.53-73.    Foucault, Michel. 1998. Right of Death and Power over Life. In The History of Sexuality 1: The Will To knowledge. Pp.135-159.    Rubin, Gayles S. 1993. “Thinking Sex: Notes for a Radical Theory of the Politics of Sexuality.” In ken Plummer, edited. Sexualities: Critical Concepts in Sociology. London: Routledge. Pp. 188-241.    *Rich, Adrienne. 1983. Compulsory heterosexuality and lesbian existence. In Powers of desire: The politics of sexuality, edited by A. Snitow, C. Stansell, and S. Thompson. New York: monthly Review Press.    Tolman, Deborah L. 1994. Doing Desire: Adolescent Girls’ Struggles for/with Sexuality. Gender and Society, vol.8 No.3:324-342.    *BolsǾ, Agnes. 2001. When Women Take: Lesbians Reworking Concepts of Sexuality. Sexualities, vol 4 (4):455-473.    Debunking gender in institutions  10.  Gender and Education  Martin, K. A. 1998. Becoming a Gendered Body: Practices of Preschools. American Sociological Review, 63:494-511.    Thorne, B. 2004. Gender Play: Girls and Boys in School. New Brunswick, New Jersey: Rutgers University Press. Pp. 29-48 (optional also 49-110).   Kessler, S., Ashenden, D. J., Connell, R. W., Dowsett, G. W. 1985. Gender Relations in Secondary Schooling. Sociology of Education, Vol.58, No.1: 34-48.    11. Gender in family     Hochschild, Arlie Russel. 2003. The Second Shift. New York: Penguin Books. (Chapters 2, 4, 5)    Berk, S. F. 1985. The Gender Factory: The Apportionment of Work in American Households. New York & London: Plenum Press. Pp. 201-211.    Choi P. K. & Lee C. K. 1997. “The Hidden Abode of Domestic Labor: The Case of Hong Kong”, in Cheung, Fanny (ed.), Engendering Hong Kong Society: A Gender Perspective of Women’s Status. Hong Kong: The Chinese University Press   12. Gender and paid employment  Hochschild,  Arlie Russell. 2003. The Managed Heart: commercialization  of human feeling. Berkeley: University of California Press. (Chapters 6 & 8).    Sally Ann Davies-Netzley. 1998. Women above the Glass Ceiling: perceptions on corporate mobility and strategies for success.  Gender and Society, 12:339-355.  Charles, M., Grusky, D.B., (2004) Occupational Ghettos: The Worldwide Segregation of Women and Men, Stanford University Press (pages to be announced) Crompton, Rosemary, (2006) Employment and the family: the reconfiguration of work and family life in contemporary societies, Cambridge University Press (Pages to be announced)      ", "required_readings": "   Untitled Document    None.   ", "recommended_readings": "    Untitled Document    Beauvoir Simone de. 2000. 'Woman as Other' in Evelyn Ashton-Jones, Gary A. Olson, and Merry G. Perry (ed.) The Gender Reader. Boston: Allyn and Bacon. (p.53-59). Butler, Judith. 1986. Sex and Gender in Simone de Beauvoir's Second Sex. Yale French Studies, No.72:35-49. Rubin Gayle. 1975. 'The Traffic in Women: Notes on the \"Political Economy\" of Sex '. In R R Reire (ed.) Toward an Anthropology of Women. New York: Monthly Review Press. Pp. 157-183. Parsons T. (1956). 'Family structure and the socialization of the child', in T. Parsons and R. Bales (eds) Family: Socialization and Interaction Process. London: Routledge. Connell, R. W. (1987) \"Sex Role Theory\" in Gender and Power: Society, the Person and Sexual Politics. Stanford: Stanford University Press. Pp. 47-54. Mackie, Gerry. Ending Footbinding and infibulation: A convention account. American Sociological Review, 61:999-1017.  Risman, B. 1987. Intimate Relationships from a microstructural perspective: men who mother. Gender and Society 1:6-32. Connell, R. W. 1985. Theorizing Gender. Sociology, vol.19 (2):260-272. *Goffman E. 1977. \"The arrangement between the sexes\". Theory and Society vol4 (3):301-331. *West, Candace & Zimmerman, Don H. 1987. \"Doing Gender\". Gender and Society Vol. 1 (2):125-151. *Connell R. W. 1993. \"The Big Picture: Masculinities in Recent World History\". Theory & Society 22:597-623. *Connell R W. 1992. \"A Very Straight Gay: Masculinity, Homosexual Experience, and the Dynamics of Gender\". American Sociological Review Vol 57:735-751. Demetriou, Demetrakis Z. 2001. Connell's Concept of Hegemonic Masculinity: A Critique. Theory and Society, vol.30, No.3, pp.337-361. Bourgois, P. 1996. In Search of Masculinity. The British Journal of Criminology 36:412-427. * Carlitz Katherine. 1994. Desire, Danger, and the Body: Stories of Women's Virtue in Late Ming China. In Christina K. Gilmartin, Gail Hershatter, Lisa Rofel and Tyrene White (ed.) Engendering China: Women, Culture, and the State.  Phua. Lily, Yeoh. Brenda S.A. 2002. \"Nine months: women's agency and the pregnant body in Singapore.\" In Brenda S.A. Yeoh, Peggy Teo and Shirlena Huang (ed.) Gender Politics in the Asia-Pacific Region. London: Routledge. Stearns, C. A. 1999. Breastfeeding and the Good Maternal Body. Gender and Society, 13:308-325. Martin, E. 1991. The Egg and the Sperm. Signs 16(3). Kessler, S. 2002. Defining and Producing Genitals, in Stevi Jackson and Sue Scott (eds.) Gender: A sociological Reader. London: Routledge Student Readers. Pp. 373-447-456. Boddy, J. 1998. \"Violence Embodied? Circumcision, Gender Politics, and Cultural Aesthetics\" in R. Emerson Dobash & Russell P. Dobash (eds.) Rethinking Violence Against Women. Thousand Oaks, CA: Sage Publications.  *Foucault, Michel. 1998. Scientia Sexualis. In The History of Sexuality 1: The Will To knowledge. Pp.53-73. Foucault, Michel. 1998. Right of Death and Power over Life. In The History of Sexuality 1: The Will To knowledge. Pp.135-159. Rubin, Gayles S. 1993. \"Thinking Sex: Notes for a Radical Theory of the Politics of Sexuality.\" In ken Plummer, edited. Sexualities: Critical Concepts in Sociology. London: Routledge. Pp. 188-241. *Rich, Adrienne. 1983. Compulsory heterosexuality and lesbian existence. In Powers of desire: The politics of sexuality, edited by A. Snitow, C. Stansell, and S. Thompson. New York: monthly Review Press. Tolman, Deborah L. 1994. Doing Desire: Adolescent Girls' Struggles for/with Sexuality. Gender and Society, vol.8 No.3:324-342. *BolsǾ, Agnes. 2001. When Women Take: Lesbians Reworking Concepts of Sexuality. Sexualities, vol 4 (4):455-473. Martin, K. A. 1998. Becoming a Gendered Body: Practices of Preschools. American Sociological Review, 63:494-511. Thorne, B. 2004. Gender Play: Girls and Boys in School. New Brunswick, New Jersey: Rutgers University Press. Pp. 29-48 (optional also 49-110). Kessler, S., Ashenden, D. J., Connell, R. W., Dowsett, G. W. 1985. Gender Relations in Secondary Schooling. Sociology of Education, Vol.58, No.1: 34-48. Hochschild, Arlie Russel. 2003. The Second Shift. New York: Penguin Books. (Chapters 2, 4, 5) Berk, S. F. 1985. The Gender Factory: The Apportionment of Work in American Households. New York & London: Plenum Press. Pp. 201-211. Choi P. K. & Lee C. K. 1997. \"The Hidden Abode of Domestic Labor: The Case of Hong Kong\", in Cheung, Fanny (ed.), Engendering Hong Kong Society: A Gender Perspective of Women's Status. Hong Kong: The Chinese University Press   ", "terms": {"2020-21 Term 2": {"--LEC (8173)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor CHOI Yuk Ping"]}, "-T01-TUT (5244)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHOI Yuk Ping"]}}}, "assessments": {"Essays": "85", "Presentation": "15"}}, {"code": "3215", "title": "Senior Seminar on China Studies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Pre-requisite(s): SOCI1101 or UGEA2190.", "description": "A lecture-discussion course in which students with a foundation in the study of modern Chinese history and society focus on topics now on the frontier of sociological research. The course will focus on analysis of the following subjects: transformations of the workplace and the reward system, growth of the private sector, poverty and inequality, grassroots resistance movements, changes in family and associational lives, religious resurgence, community and non-governmental organizations, and the emergence of civil society. (Advisory: For Sociology Majors only.)", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3219", "title": "Historical Sociology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Prerequisite: SOCI1001 or 1102 or UGEC1823 or its equivalent.", "description": "This course gives a survey of the methodological and conceptual issues in historical sociology. Students will be introduced to the methodological debates concerning historical and comparative analysis. They are also expected to learn how sociological theories can inform their interpretations of historical events and changes. Emphasis will be placed on how historical transformations in modern societies were brought about by economic, social, political and cultural changes.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3221", "title": "Introduction to Social Psychology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "The course introduces students to social psychology, a field that bridges the disciplines of sociology and psychology. With a sociological emphasis, the course focuses on the link and interrelationship between individual level and group level phenomena. It examines three main areas: (1) a person’s inner attributes, motives, and feelings, and how these are influenced by group and social forces; (2) interactions and interpersonal relationships among individuals; (3) group dynamics and social structures as emergent phenomena from individual and interpersonal processes.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3223", "title": "Contemporary Sociological Theory", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Prerequisite: SOCI1001 or 1102 or UGEC1823.", "description": "Most every sociology course on a specific domain of social life includes a discussion of the major theories proposed by sociologists in that specialty. This course is different. Here, students will learn not about theories of some specific sociological specialty, but instead contemporary sociological theories — period, full stop. What is offered by this course is an introduction to perspectives on society that link together the different facets of social life. These perspectives claim that the same insights can illuminate not just, say, education but also work and the family. They represent lens that can be used to view and understand these various social spheres, or they identify common trends that affect them. Students will gain from this course a deeper understanding of the most general questions asked by sociologists today, and which link together the more narrowly focused view of each individual study or subfield.We strongly encourage students to take SOCI3003 before taking this course.", "outcome": "1. To build skills in reading and discussing conceptually sophisticated arguments about society.2. To acquire familiarity with the major theorists, theorists, and enduring questions of sociological theory in the past several decades.3. To enhance the capacity to confront social life from a critical viewpoint through the application of theoretical perspectives to concrete examples.", "syllabus": "Part I: Theory and SocietyStudents will be introduced to a few of the most influential kinds of sociological theory, with a focus on the key point that they paint very different pictures of society and, based on their different images of what society is, offer very different proposals for how sociologists should go about investigating it.Part II: Problems with PowerThe second part of the course centers on the concept of power, which has been a central concern for generations of social theorists. A main theme of these readings and lectures is that social relations of power and domination have many more facets and dimensions than are apparent to the naive eye.Part III: Troubling TrendsThe third part of the course confronts the question of how contemporary society should be understood. The readings of these weeks offer descriptions and explanations of the driving dynamics of the recent past. A key theme is the extent to which these dynamics represent a major shift from the heyday of industrial capitalism in the mid-20th century.", "required_readings": " None.  ", "recommended_readings": "Beck, Ulrich. 1992. Risk Society: Towards a New Modernity. London: Sage Publications.Benzecry, Claudio E. and Daniel Winchester. 2017. “Varieties of Microsociology.” Pp. 42–74 in Social Theory Now, edited by C. E. Benzecry, M. Krause, and I. A. Reed. Chicago: University of Chicago Press.Bourdieu, Pierre. 1998. Practical Reason: On the Theory of Action. Cambridge: Polity Press.Calhoun, Craig J. 2012. Contemporary Sociological Theory. Chichester, West Sussex ; Malden, MA: John Wiley & Sons.Chibber, Vivek. 2017. “Rescuing Class from the Cultural Turn.” Catalyst 1(1):26–55.Fraser, Nancy. 2014. “Can Society Be Commodities All the Way down? Post-Polanyian Reflections on Capitalist Crisis.” Economy and Society 43(4):541–58.Han, Sang-Jin and Young-Hee Shim. 2010. “Redefining Second Modernity for East Asia: A Critical Assessment.” The British Journal of Sociology 61(3):465–88.Lukes, Steven. 2005. Power: A Radical View. 2nd ed. Basingstoke ; New York: Palgrave Macmillan.Smith, Dorothy E. 1974. “Women’s Perspective as a Radical Critique of Sociology.” Sociological Inquiry 44(1):7–13.Streeck, Wolfgang. 2012. “How to Study Contemporary Capitalism?” European Journal of Sociology / Archives Européennes de Sociologie / Europäisches Archiv Für Soziologie 53(1):1–28.West, Candace and Don H. Zimmerman. 1987. “Doing Gender.” Gender & Society 1(2):125–51.", "terms": {"2020-21 Term 1": {"--LEC (5461)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor Mark Simon COHEN"]}, "-T01-TUT (5462)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor Mark Simon COHEN"]}}}, "assessments": {"Essays": "35", "Presentation": "25", "Short answer test or exam": "40"}}, {"code": "3224", "title": "Democracy and Society", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Not for students who have taken UGEC2873.", "description": "This course investigates the relationships between society, culture and political system with emphasis on the social base of democracy. Topology of regimes, philosophical and institutional meanings of democracy, transition from totalitarianism or authoritarianism to democracy, the complex relationships between democracy and civil society, civic culture, economic development and other social factors will be discussed.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3225", "title": "Research Writing", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "This course is designed to enhance the writing skills of sociology students so that they are more competent in meeting the writing needs of their discipline, especially in preparing adequate research-related papers such as proposals and reports. Students will learn such essential skills as writing effective sentences and coherent paragraphs, summarizing, paraphrasing, acknowledging sources and listing references, and understanding and describing data. They will study actual research papers to see how each main section is prepared in a proper academic style, and will practise writing paragraphs that represent the various sections of a research report.Advisory: For Sociology Majors only. Students are required to take a written test before admission to this course.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3226", "title": "Sociology and Films", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "This course introduces students to the understanding of the motion picture industry in sociological perspectives. It will focus on the key theoretical approaches from sociology to the study of the media and culture, and show how they can be applied to empirical research on the film industry. It will draw on both academic research and a range of multimedia resources and illustrative materials, including media texts and video, to explore the changing role and constitution of the motion picture industry in contemporary societies.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3227", "title": "Social Demography", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Not for students who have taken UGEC2033.", "description": "This course investigates social demographic phenomena in both structural and dynamic aspects. Causes and consequences of demographic trends at local, national and global levels will be examined. Subjects like population theories; determinants of population dynamics such as fertility, mortality and migration; and the integration of social and demographic theories will also be discussed.\r", "outcome": "        1.   To stimulate students’ interest in the science of demography. 2.   Not simply to teach demography, but how to learn demography through an introduction to the perspectives and tools of demography.    ", "syllabus": "        Texts & Readings John R. Weeks. Population: An Introduction to Concepts and Issues. 10th  Edition. Belmont, California: Wadsworth Publishing Company, 2008.   Schedule and Readings (Subject to minor changes throughout term) Topic 1: Introduction: Overview of Social Demography Required reading McFalls, Joseph A. Jr. 2003. “Population: A Lively Introduction, 4th Edition.” Population Bulletin 58(4): 1-40. Weeks, Chapter 1.   Topic 2: World Population Growth and Theories of Population Growth Required reading Weeks, Chapter 2 & 3. Recommended Reading: Population Reference Bureau. “Transition in World Population.” Population Bulletin 59(1): 1- 40.   Topic 3: Demographic Data Required reading Weeks, Chapter 4   Topic 4: First Demographic Transition/Fertility Transition Required reading Weeks, Chapter 6. Recommended reading: Dudley L. Poston. 2000. “Social and Economic Development and the Fertility Transitions in Mainland China and Taiwan.” Population and Development Review, 26(supplement): 40-60. Schoen, Robert, Young J. Kim, Constance A. Nathanson, Jason Fields, and Nan Marie Astone. 1997. “Why Do Americans Want Children?” Population and Development Review 23:333-358.   Topic 5: Second Demographic Transition  Required reading Weeks, Chapter 10 Susan E. Short, Feinian Chen, Barbara Entwisle and Zhai Fengying. 2002. “Maternal Work and Child Care in China: A Multi-method Analysis. Population and Development Review 28:38-57.   Recommended readings: Judith Seltzer et al. 2005. “Explaining Family Change and Variation: Challenges for Family Demographers.” Journal of Marriage and Family 67 (4):908-925. McLanahan, Sara. 2004. “Diverging Destinies: How Children are Faring under the Second Demographic Transition.” Demography 41(4): 607 – 627.   Topic 6: Mortality Decline, Epidemiological/Health Transition and the Social Consequences Required reading Weeks, Chapter 5. Recommended reading: Jim Oeppen and James W. Vaupel. 2002. “Broken Limits to Life Expectancy.” Science296, No 5570: 1029-31.   Topic 7: Age and Sex Structure of Population: Population Aging and Sex Ratio Required reading Weeks, Chapter 8 Recommended readings: Eimer, David. 2005. “Bride-Trafficking Grows as China’s Population of Single Men Soars.” The Independent, 31 July Kinsella, Kevin and David R. Philips. 2005. “Global Aging: The Challenge of Success.” Population Bulletin 60(1): 1 – 42. Murphy, Rachel. 2003. “Fertility and Distorted Sex Ratios in a Rural Chinese County: Culture, State, and Policy.” Population and Development Review 29(4): 595-626. Chen, Feinian and Guangya Liu. 2009. “Population Aging in China” International Handbook of Population Aging. Edited by Peter Uhlenberg, Springer   Topic 8: Causes and Consequences of Migration and Immigration Required reading Weeks, Chapter 7 Recommended reading: X.Yang and F. Guo. 1999. “Gender Differences in Determinants of Temporary Labor Migration in China: a Multilevel Analysis.” International Migration Review 33(4):929-253.   Topic 9: Population Policy and Social Security Recommended readings: “Hong Kong Population Policy Report.” 2003. Hong Kong Central Policy Unit. \"Chinese Government White Paper on Family Planning.\" 1996. Population and Development Review, 22, 2 (June): 385-390.      ", "required_readings": "   Untitled Document    None.   ", "recommended_readings": "       Please refer to Course Syllabus for reading list.   ", "terms": {"2020-21 Term 1": {"--LEC (8183)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor TONG Yuying"]}, "-T01-TUT (8184)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor TONG Yuying"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "45", "Presentation": "10", "Selected response test or exam": "25"}}, {"code": "3229", "title": "Quantitative Data Analysis", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "This course introduces methods of multivariate statistical analyses for modelling social dynamics. Students will learn how to conduct social research based on causal analyses between social variables. Discussion includes linear regression, path models and other multivariate methods. The course-design also emphasizes hands-on experience with statistical software in analysing survey data. No prior computing experience is required. \r", "outcome": "    Untitled Document   (1) To understand the logic of statistical analysis  (2) To acquire practical experience with a statistical package (SPSS)  (3) To learn multiple regression analysis  (4) To conduct regression diagnostics  (5) To learn the basics of logistic regression analysis  (6) To write a research report based on regression analysis   ", "syllabus": "    Untitled Document   1 Review of basic concepts 1.1 Basic concepts 1.2 Descriptive and inferential statistics 1.3 Hypothesis testing  Knoke, Bohrnstedt & Mee. 2002. Chapters 1 – 3, pages 3-100. Freund, Wilson & Sa. 2006. Chapter 1, pages 5-17.  2 Simple regression 2.1 Bivariate relations 2.2 Regression analysis 2.3 Estimation method: Ordinary least square 2.4 Significant test of regression coefficients 2.5 Model evaluation: R2  Allison. 1998. Chapter 5, pages 97-117. Freund, Wilson & Sa. 2006. Chapter 2, pages 35-67.  3 Multiple regression 3.1 Basic model 3.2 Partial effects 3.3 Standardization  Allison. 1998. Chapter 1 to 3, pages 1-70. Freund, Wilson & Sa. 2006. Chapter 3, pages 75-106. 4 Modeling techniques 4.1 Group differences 4.2 Interaction effects 4.3 Nonlinear effects  Allison. 1998. Chapter 8, pages 153-174. Kahane. 2007. Chapter 5, pages 79-107.  5 Regression diagnostics 5.1 Regression assumptions 5.2 Detection of assumption violation 5.3 Remedies of assumption violation 5.4 Multi-collinearity  5.5 Robustness to influential cases  Allison. 1998. Chapter 6 & 7, pages 119-152. Freund, Wilson & Sa. 2006. Chapter 4, pages 119-175. Freund, Wilson & Sa. 2006. Chapter 5, pages 177-221.    ", "required_readings": "   Untitled Document    None.   ", "recommended_readings": "    Untitled Document   Allison, P. D. 1998. Multiple Regression: A Primer. Thousand Oaks, CA: Sage. Freund, RJ, William JW, and Ping S. 2006. Regression Analysis: Statistical Modeling of a Response Variable. Burlington, MA: Academic Press. Kahane, LH. 2007. Regression Basics. Los Angeles, CA: Sage. Knoke, D, GW. Bohrnstedt, and AP Mee. 2002. Statistics for Social Data Analysis. Itasca, Ill: Wadsworth Publishing.   ", "terms": {"2020-21 Term 2": {"--LEC (4625)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Wong Foo Yuan Bldg LT4"], "instructors": ["Professor LEE Jaemin"]}, "-T01-TUT (4626)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor LEE Jaemin"]}}}}, {"code": "3230", "title": "Globalization and China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Not for students who have taken UGEC2514.", "description": "In media coverage and many popular discussions on the topic, China features prominently as the “driver” of globalization or as the “workshop of the world”. Yet these simple observations leave much un-said. What is exactly meant by “globalization”? What is China’s experience of globalization? What are the political, cultural, and economic implications of living in an increasingly globalized world? Is China’s experience in this regard unique or similar to those of other countries? These are among the questions we will set out to explore in this course.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3231", "title": "Qualitative Research", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Pre-requisite(s): SOCI2003.", "description": "This course introduces students to different types of qualitative research methods used in social science research. It begins with a discussion of the differences and similarities between quantitative and qualitative research methods, and the rationale behind each method. It then proceeds to introduce different types of qualitative methods, including participant observation, in-depth interviews, focus groups, oral history, and content analysis.", "outcome": " Students in this course should study and demonstrate understanding of the following: the discipline of sociology and its role in contributing to our understanding of social order and its changes; the role of theory in sociology; the role of evidence and qualitative methods in sociology; basics concepts in sociology and their fundamental theoretical interrelations; critical thinking; further develop transferable skills beyond disciplinary requirements; development of values, such that the student will see the utility of the sociological perspective as a useful and meaningful perspective on social reality and individual biography, for reflection of value positions and life choices.    ", "syllabus": "  1: Introduction   Emerson, Robert (ed.). 2001. Contemporary Field Research. Los Angeles: University of California Press. Introduction. Pp. 1-22.  Hammersley, M., and P. Atkinson.1995. “What is ethnography?” In Ethnography: Principles in Practice, 2nd ed. London: Routledge, Pp. 1-22.  Newman, W. Lawrence. 2000. Social Research Methods: Qualitative and Quantitative Approaches. Boston: Allyn and Bacon. (Chapter 4: The meanings of methodology). Pp. 63-88.   2: Reading qualitative research   Tolman, Deborah L. Doing Desire: Adolescent Girl’s Struggles for/with Sexuality. Gender and Society 8:324-342.   Bourgois, P. 1996. In Search of Masculinity. The British Journal of Criminology 36:412-427.   3: Ethnography   *Whyte, W. F. 1993. “On the evolution of Street Corner Society.” In Journeys through Ethnography. Boulder CO: Westview Press, pp. 11-72.  Burawoy, Michael. et. al. 2000. Global Ethnography: Forces, Connections and Imaginations in a Postmodern World. Berkeley: University of California Press. Chapter 1.   4: Field experiences and field notes   *Robert Emerson, Rachel Fretz, and Linda Shaw, Writing Ethnographic Fieldnotes, Chapters 2-4 (1995)  5: Interviewing techniques   Susan A. Ostrander. \"Surely you're not in this just to be helpful \": Access, Rapport, and Interviews in Three Studies of Elites.” Journal of Contemporary Ethnography 22(1):7-27, 1993.   *Weiss Robert. 1995. Learning from Strangers: The art and method of qualitative interview studies. New York: The Free Press. Chapters 3-5.   *Mishler Elliot. 1986. Research Interviewing: context and narrative. Cambridge: Harvard University Press. (chapter 3)  6: Focus group and oral history   Morgan, David L. 1988. Focus Group as Qualitative Research. London: Sage. (page to be announced)  Charles T. Morrissey. 1987. The two-sentence format as an interviewing technique in oral history fieldwork. Oral History Review 15:43-53.   7: Case studies and grounding theory  *Ragin, Charles C. 2000. “Casing” and the process of social inquiry. In Charles C. Ragin * Howard S. Becker (edited) What is a Case: Exploring the Foundations of Social Inquiry. London: Cambridge University Press. Pp, 217-226.   *Charmaz, Kathy. 2001. Grounded Theory. In Contemporary Field Research: Perspectives and Formulations. Pp.335-352.  Burawoy, Michael. 2002. “The Extended Case Method,” Sociological Theory, 16(1). Pp 4-33.   8: Coding practice Strauss, Anselm L. 2001. Qualitative Analysis For Social Scientists. Chapters 3-4. or   Corbin, Juliet and Strauss Anselm. “Grounded Theory Research: Procedures, Cannons, and Evaluative Criteria.” Qualitative Sociology 13:3-21.   9: Writing qualitative research  Wolcott, Harry F. 2009. Writing up Qualitative Research. Los Angeles: Sage Fieldtrips and students presentations will be organized.    ", "required_readings": " None.  ", "recommended_readings": "  Core readings include:  Bryman, Alan (2016) Social Research Methods, Oxford: Oxford University Press  Emerson, Robert (ed.). 2001. Contemporary Field Research. Los Angeles: University of California Press. Introduction. Pp. 1-22.  Hammersley, M., and P. Atkinson.1995. “What is ethnography?” In Ethnography: Principles in Practice, 2nd ed. London: Routledge, Pp. 1-22.  Newman, W. Lawrence. 2000. Social Research Methods: Qualitative and Quantitative Approaches. Boston: Allyn and Bacon. (Chapter 4: The meanings of methodology). Pp. 63-88.   *Whyte, W. F. “On the evolution of Street Corner Society.” In Journeys through Ethnography. Boulder CO: Westview Press, pp. 11-72.  * Burgess, Robert G. 1991. In the Field: An Introducation to Field Research. London: Routledge. Chapter 3.   *Robert Emerson, Rachel Fretz, and Linda Shaw, Writing Ethnographic Fieldnotes, Chapters 2-4 (1995)  Susan A. Ostrander. \"Surely you're not in this just to be helpful \" : Access, Rapport, and Interviews in Three Studies of Elites.” Journal of Contemporary Ethnography 22(1):7-27, 1993.   *Weiss Robert. 1995. Learning from Strangers: The art and method of qualitative interview studies. New York: The Free Press. Chapters 3-5.   *Mishler Elliot. 1986. Research Interviewing: context and narrative. Cambridge: Harvard University Press. (chapter 3)  Morgan, David L. (1988) Focus Group as Qualitative Research. London: Sage.   Charles T. Morrissey. The two-sentence format as an interviewing technique in oral history fieldwork. Oral History Review 15:43-53, 1987.   Katherine S. Newman. Falling from Grace: The Experience of Downward Mobility in the American Middle Class. New York: Free Press, 1988. Chapter 6, Blue-collar work. Pp.174-199, 280-284 (notes)   Carol A. B. Warren, Tori Barnes-Brus,. Heather Burgess, Lori Wiebold- Lippisch, with Jennifer Hackney, Geoffrey harness, Vickie Kennedy, Robert Dingwall, Paul C. Rosenblatt, Ann Ren, and Roger Shuy. After the interview. Qualitative Sociology 26(1):93-110, 2003.   *Ragin, Charles C. 2000. “Casing” and the process of social inquiry. In Charles C. Ragin * Howard S. Becker (edited) What is a Case: Exploring the Foundations of Social Inquiry. London: Cambridge University Press. Pp, 217-226.   *Charmaz, Kathy. 2001. Grounded Theory. In Contemporary Field Research: Perspectives and Formulations. Pp.335-352.Wolcott, Harry F. 2009. Writing up Qualitative Research. Los Angeles: Sage", "terms": {"2020-21 Term 2": {"--LEC (4777)": {"startTimes": ["8:30"], "endTimes": ["10:15"], "days": [2], "locations": ["Yasumoto Int'l Acad Park LT4"], "instructors": ["Professor CHAN King Chi"]}, "-T01-TUT (4778)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor CHAN King Chi"]}}}}, {"code": "3233", "title": "Sexualities and Society", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "This course critically explores how sexual desires, behaviors, and identities interact with larger cultural, social, economic and political forces. Throughout the course, it discusses how sexualities are bound up with struggles over citizenship, rights, entitlement and inequalities. As a whole, the course aims to open up space to debate how we may learn to live with ‘differences’ in an increasingly diverse world.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3234", "title": "Policing and Society: Critical Debates and Practices", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Pre-requisite(s): SOCI1001.", "description": "This course introduces the sociology of policing to students who wish to advance their understanding of the enforcement of law in a society. With a comparative perspective, the course examines institutions of police with regard to their role, function, organizational structures and culture in the contemporary world. Starting with a historical review of colonial policing in Hong Kong, the course unfolds gradually to reveal common policing issues and proceeds to assess the impact of transnational events like cross-border crime and global protest on local policing. Case studies of police practices in both local and global contexts are critically evaluated to identify the social forces that shape the respective social control process.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3235", "title": "Social Interaction and Video Analysis", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Workshop", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "This course explores social phenomena that are so familiar they can escape our notice. Yet, they are highly organized and massively important to our lives. We will introduce the methodology of video analysis in sociology as a way to investigate social interaction in everyday life. Video analysis has been used to study a large variety of activities, for example, how people greet each other, how families eat together, how people taste cheese before buying, how skateboarders take turns in pool skate sessions, how people pass through doors, how tourists use Google maps to navigate through a city, and so on. The course is hands-on. You will be taught how to make your own video-recordings, as well as how to transcribe and analyse your data. There will be frequent in-class activities and discussions, so you are expected to be prepared and ready to contribute. Through your engagement in the course, you will gain an appreciation of the importance of real-time, observable behaviours for the accomplishment and maintenance of social interaction. You will also develop your powers of observation, attention to detail, and analytical skills.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3236", "title": "Migration, Entrepreneurship and Policy Reflection on Global Citizenship", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Not for students who have taken SOCI3453.", "description": "Any consideration of global citizenship is incomplete without an examination of migration as part and parcel of the contemporary world. This course provides an introductory understanding of immigrant entrepreneurs. To understand the operation of immigrant entrepreneurs, we first discuss the general theories of immigrant adaptation. The theoretical framework for understanding migration ranges from the classic Chicago School to the recent institutional approach to migration. We then explore how immigrant entrepreneurship is related to the adaptation and survival strategies taken by immigrants. We focus on how immigrant resources to start their businesses and their impact to ethnic communities. Policies governing immigration and their impact on global citizenship are also discussed. Students have an option to visit Taiwan and learn about immigrant and social entrepreneurship there.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3237", "title": "Medical Sociology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Not for students who have taken UGEC2003 or SOCI4207 (old code).", "description": "Health is a fundamental aspect of human existence and medicine is arguably the crown jewel of modern science. We all want good health, effective treatments of illness and affordable health care. Yet present-day health care is the flashpoint of many controversies: about the conflicts between patients and doctors; about the safety of medical treatments and reliability of medical knowledge; about inequality in health and longevity; and about the ever-increasing health care spending. This course dissects these issues from a sociological perspective. We ask questions such as: What counts as illness? How do people understand illness? How does illness affect people’s life? Who gets ill and why? What is the role of medical technology in fostering health? Why do doctors and patients have trouble communicating? How should health care systems be organized?\r", "outcome": "    Untitled Document   1. Students are expected to learn to critically assess biomedicine from sociological perspectives.  2. Students are expected to gain insight into the constituent components of the healthcare system and the social and political factors related to the quality, cost and accessibility of healthcare.  3. Students are expected to learn to critically compare medicine to other social systems.  4. Students are expected to gain understanding of sociological theories from empirical examples in health and medicine.  5. Students are expected to learn to draw links between their daily experience and observation, and conceptual issues.    ", "syllabus": "    Untitled Document   Week 1: Overview of the course; Introduction to medical sociology (Sept. 4)  Chapter 1: Medical Sociology pp 3 – 30  Chapter 2: Epidemiology pp 31 – 56  McKinlay, John and Sonja M. McKinlay. 2005. \"Medical Measures and the Decline of Mortality.\" Pp. 5-19 in The Sociology of Health and Illness: Critical Perspectives, edited by P. Conrad: St. Martin’s.  Part 1: Social determinants of health  Week 2: Socioeconomic status and health over the life course (Sept. 11)  Chapter 3: The Social Demography of Health: Social Class pp 57 – 83  Willson, Andrea E., Kim M. Shuey, and Jr. Elder Glen H. “Cumulative Advantage Processes as Mechanisms of Inequality in Life Course Health.” American Journal of Sociology 112, no. 6 (May 1, 2007): 1886–1924. doi:10.1086/512712.  Link, Bruce G., and Jo Phelan. “Social Conditions as Fundamental Causes of Disease.” Journal of Health and Social Behavior 35 (1995): 80–94.  Week 3: Relative social status and health (Sept. 18)  Thoits, Peggy A. “Stress and Health: Major Findings and Policy Implications.” Journal of Health and Social Behavior 51, no. 1_suppl (March 1, 2010): S41–53. doi:10.1177/0022146510383499.  Marmot, Michael. “Relatively Speaking.” In Status Syndrome: How Social Standing Affects Our Health and Longevity, 82–104. New York: Times Books, 2004.  Link, Bruce G., Richard M. Carpiano, and Margaret M. Weden. “Can Honorific Awards Give Us Clues about the Connection between Socioeconomic Status and Mortality?” American Sociological Review 78, no. 2 (April 1, 2013): 192–212. doi:10.1177/0003122413477419.  Week 6: Contextual social inequality and health (Sept. 25)  Wilkinson, Richard, and Kate Pickett. 2009. \"Physical health and life expectancy.\" & \"How inequality gets under the skin.\" in The spirit level : why more equal societies almost always do better. London; New York Allen Lane.  Wong, Irene O. L., Benjamin J. Cowling, Su-Vui Lo, and Gabriel M. Leung. 2009. \"A multilevel analysis of the effects of neighbourhood income inequality on individual self-rated health in Hong Kong.\" Social Science & Medicine 68:124-132.  Week 5: No class (Oct. 2) Week 6: Social networks and health I (Oct. 9)  Durkheim, Emile. 1951. \"Anomic Suicide.\" Pp. 241-76 in Suicide: a Study in Sociology: The Free Press. Umberson, Debra, and Jennifer Karas Montez. 2010. \"Social Relationships and Health.\" Journal of Health and Social Behavior 51:S54-S66.  Miller, Greg. “Why Loneliness Is Hazardous to Your Health.” Science 331, no. 6014 (January 14, 2011): 138–40. doi:10.1126/science.331.6014.138.  Week 7: Social capital, neighborhood and health (Oct. 16)  Klinenberg, Eric. 2002. \"Race, Place and Vulnerability: Urban Neighborhood and the Ecology of Support.\" Pp. 79-128 in Heat Wave: a Social Autopsy of Disaster in Chicago. Chicago, IL: The University of Chicago Press.  Domínguez, Silvia, and Tammi Arford. “It Is All about Who You Know: Social Capital and Health in Low-Income Communities.” Health Sociology Review 19, no. 1 (April 1, 2010): 114–29. doi:10.5172/hesr.2010.19.1.114.  Week 8: Genes, environment and health (Oct. 23)  Liu, Hexuan, and Guang Guo. “Opportunities and Challenges of Big Data for the Social Sciences: The Case of Genomic Data.” Social Science Research, Special issue on Big Data in the Social Sciences, 59 (September 1, 2016): 13–22. doi:10.1016/j.ssresearch.2016.04.016.  The Social Construction of Illness and illness experience  Week 9: The Social Construction of Illness (Oct. 30)  Conrad, Peter. 1992. \"Medicalization and Social Control.\" Annual Review of Sociology 18:209-232. Rosenhan, D. L. 1973. \"On Being Sane in Insane Places.\" Science 179:250-258.  Watch excerpts from “Selling Sickness”, a documentary on the role of commercial interests in defining illness (in class)  Week 10: Health Behavior, the Social Context and Public Policy (Nov. 6)  Chapter 6: Health Behavior and Lifestyles pp 120-141  Mello, Michelle M., David M. Studdert, and Troyen A. Brennan. 2006. \"Obesity -- The New Frontier of Public Health Law.\" New England Journal of Medicine 354:2601-2610.  The Social Organization of Medicine  Week 11: Social Changes and the Health Care System in China (Nov. 13)  Blumenthal, David and William Hsiao. 2005. \"Privatization and its discontents — the evolving Chinese health care system.\" New England Journal of Medicine 353:1165-70.  Yip, Winnie and William C. Hsiao. 2008. \"The Chinese Health System at a Crossroads.\" Health Affairs 27:460-468.  Weeks 12: The Organization of Health Care in Developed Countries (Nov. 20)  Chapter 15: Health Care Reform and Social Policy in the United States pp319-332  Chapter 16: Global Health Care pp 344-367  Watch excerpts from “Sicko”, a documentary on health care systems in the US and other industrialized countries (in class)  Week 13: Patient-doctor Relationship (Nov. 27)  Chapter 9: Doctor-Patient Interaction pp 184-207  Lutfey, Karen, and Jeremy Freese. “Toward Some Fundamentals of Fundamental Causality: Socioeconomic Status and Health in the Routine Clinic Visit for Diabetes.” American Journal of Sociology 110, no. 5 (March 1, 2005): 1326–72. doi:10.1086/428914.    ", "required_readings": "   Untitled Document    None.   ", "recommended_readings": "    Untitled Document   Cockerham, William C. 20012. Medical Sociology. Upper Saddler River, NJ: Prentice Hall.  McKinlay, John and Sonja M. McKinlay. 2005. \"Medical Measures and the Decline of Mortality.\" Pp. 5-19 in The Sociology of Health and Illness: Critical Perspectives, edited by P. Conrad: St. Martin’s.  Willson, Andrea E., Kim M. Shuey, and Jr. Elder Glen H. “Cumulative Advantage Processes as Mechanisms of Inequality in Life Course Health.” American Journal of Sociology 112, no. 6 (May 1, 2007): 1886–1924. doi:10.1086/512712.  Link, Bruce G., and Jo Phelan. “Social Conditions as Fundamental Causes of Disease.” Journal of Health and Social Behavior 35 (1995): 80–94.  Thoits, Peggy A. “Stress and Health: Major Findings and Policy Implications.” Journal of Health and Social Behavior 51, no. 1_suppl (March 1, 2010): S41–53. doi:10.1177/0022146510383499.  Marmot, Michael. “Relatively Speaking.” In Status Syndrome: How Social Standing Affects Our Health and Longevity, 82–104. New York: Times Books, 2004.  Link, Bruce G., Richard M. Carpiano, and Margaret M. Weden. “Can Honorific Awards Give Us Clues about the Connection between Socioeconomic Status and Mortality?” American Sociological Review 78, no. 2 (April 1, 2013): 192–212. doi:10.1177/0003122413477419.  Wilkinson, Richard, and Kate Pickett. 2009. \"Physical health and life expectancy.\" & \"How inequality gets under the skin.\" in The spirit level : why more equal societies almost always do better. London; New York Allen Lane.  Wong, Irene O. L., Benjamin J. Cowling, Su-Vui Lo, and Gabriel M. Leung. 2009. \"A multilevel analysis of the effects of neighbourhood income inequality on individual self-rated health in Hong Kong.\" Social Science & Medicine 68:124-132.  Durkheim, Emile. 1951. \"Anomic Suicide.\" Pp. 241-76 in Suicide: a Study in Sociology: The Free Press.  Umberson, Debra, and Jennifer Karas Montez. 2010. \"Social Relationships and Health.\" Journal of Health and Social Behavior 51:S54-S66.  Miller, Greg. “Why Loneliness Is Hazardous to Your Health.” Science 331, no. 6014 (January 14, 2011): 138–40. doi:10.1126/science.331.6014.138.  Klinenberg, Eric. 2002. \"Race, Place and Vulnerability: Urban Neighborhood and the Ecology of Support.\" Pp. 79-128 in Heat Wave: a Social Autopsy of Disaster in Chicago. Chicago, IL: The University of Chicago Press.  Domínguez, Silvia, and Tammi Arford. “It Is All about Who You Know: Social Capital and Health in Low-Income Communities.” Health Sociology Review 19, no. 1 (April 1, 2010): 114–29. doi:10.5172/hesr.2010.19.1.114.  Liu, Hexuan, and Guang Guo. “Opportunities and Challenges of Big Data for the Social Sciences: The Case of Genomic Data.” Social Science Research, Special issue on Big Data in the Social Sciences, 59 (September 1, 2016): 13–22. doi:10.1016/j.ssresearch.2016.04.016. Conrad, Peter. 1992. \"Medicalization and Social Control.\" Annual Review of Sociology 18:209-232. Rosenhan, D. L. 1973. \"On Being Sane in Insane Places.\" Science 179:250-258.  Mello, Michelle M., David M. Studdert, and Troyen A. Brennan. 2006. \"Obesity -- The New Frontier of Public Health Law.\" New England Journal of Medicine 354:2601-2610.  Blumenthal, David and William Hsiao. 2005. \"Privatization and its discontents — the evolving Chinese health care system.\" New England Journal of Medicine 353:1165-70.  Yip, Winnie and William C. Hsiao. 2008. \"The Chinese Health System at a Crossroads.\" Health Affairs 27:460-468.  Lutfey, Karen, and Jeremy Freese. “Toward Some Fundamentals of Fundamental Causality: Socioeconomic Status and Health in the Routine Clinic Visit for Diabetes.” American Journal of Sociology 110, no. 5 (March 1, 2005): 1326–72. doi:10.1086/428914.    ", "terms": {"2020-21 Term 1": {"--LEC (8346)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor JIN Lei"]}, "-T01-TUT (8345)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor JIN Lei"]}}}, "assessments": {"Essays": "0", "Essay test or exam": "0", "Others": "0"}}, {"code": "3451", "title": "Selected Topics in Sociology I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "The content of the course will vary with the instructor. It may focus on major theoretical issues and research areas in contemporary sociology or on particular aspects of social life and development in one or more countries.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3452", "title": "Selected Topics in Sociology II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "The content of the course will vary with the instructor. It may focus on major theoretical issues and research areas in contemporary sociology or on particular aspects of social life and development in one or more countries.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3453", "title": "Selected Topics in Sociology III", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "The content of the course will vary with the instructor. It may focus on major theoretical issues and research areas in contemporary sociology or on particular aspects of social life and development in one or more countries.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3510", "title": "Senior Thesis I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Grade point average 3.30 or above for sociology courses taken in the terms prior to application.", "description": "Students are to plan and conduct research on an approved topic for writing a thesis under the close supervision of a faculty member. (Advisory: For Sociology Majors only.)", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3520", "title": "Senior Thesis II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Pre-requisite: SOCI3510.", "description": "Students are to plan and conduct research on an approved topic for writing a thesis under the close supervision of a faculty member. (Advisory: For Sociology Majors only.)", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4010", "title": "Graduation Thesis I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Others", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "Students are to plan and conduct research on an approved topic for writing a thesis under the supervision of a faculty member. (Advisory : Students are advised to take this course in their final year of studies.)", "outcome": "   Untitled Document    Knowledge Domain (1) understand the role of Sociology in contributing to our knowledge of social order and its changes; (2) apply basic concepts derived from sociological theories in the understanding of social phenomenon; Skills Domain (3) master basic qualitative and quantitative methods in Sociology; (4) think critically; Values Domain (5) reflect on his or her own value position and appreciate:  sociology as a useful and meaningful perspective on social reality and individual biography;  the importance of ethics, honesty, and transparency in research and academic settings; and  the importance of sociological analyses for reflection of value positions and life choices.   ", "syllabus": "   Untitled Document    Topic to be confirmed between the supervisor and the student.   ", "required_readings": "   Untitled Document      ", "recommended_readings": "   Untitled Document    To be confirmed when the topic is identified.   ", "terms": {"2020-21 Term 1": {"AO01-OTH (6066)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor CHOI Yuk Ping"]}, "BO01-OTH (7175)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor CHEUNG Wai Ting"]}, "CO01-OTH (8182)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor TONG Yuying"]}}}, "assessments": {"Essays": "0", "Others": "0"}}, {"code": "4020", "title": "Graduation Thesis II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Others", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Pre-requisite(s): SOCI4010.", "description": "Students are to plan and conduct research on an approved topic for writing a thesis under the supervision of a faculty member. (Advisory : Students are advised to take this course in their final year of studies.)\r", "outcome": "   Untitled Document    Knowledge Domain (1) understand the role of Sociology in contributing to our knowledge of social order and its changes; (2) apply basic concepts derived from sociological theories in the understanding of social phenomenon; Skills Domain (3) master basic qualitative and quantitative methods in Sociology; (4) think critically; Values Domain (5) reflect on his or her own value position and appreciate:  sociology as a useful and meaningful perspective on social reality and individual biography;  the importance of ethics, honesty, and transparency in research and academic settings; and  the importance of sociological analyses for reflection of value positions and life choices.   ", "syllabus": "   Untitled Document    Topic to be confirmed between the supervisor and the student.   ", "required_readings": "   Untitled Document      ", "recommended_readings": "   Untitled Document    To be confirmed when the topic is identified.   ", "terms": {"2020-21 Term 2": {"AO01-OTH (8356)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor CHOI Yuk Ping"]}, "BO01-OTH (8778)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor CHEUNG Wai Ting"]}, "CO01-OTH (8779)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor TONG Yuying"]}}}, "assessments": {"Essays": "0", "Others": "0"}}, {"code": "4201", "title": "Survey Methods and Sampling", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLaboratoryLecture", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Pre-requisite(s): SOCI2003 and SOCI2004.", "description": "The course focuses on the practical procedures of conducting sample survey and an applied analysis of complex survey data with applications in the social sciences. This course aims to provide guidance on correct application of modern techniques for design-based analysis of complex sample survey data. The emphasis of this course is primarily on breadth, and in that spirit we aim at minimizing the use of mathematics without sacrificing accuracy. The course will broadly cover formation of research problem and hypothesis, sampling methods, questionnaire construction, types of data collection, nonresponse, fieldwork management and interviewing, data processing and management, as well as statistical analysis and inferences. The course also emphasizes hand-on experiences with statistical software in data processing and analysis.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4202", "title": "Teaching Workshop for Sociology Students", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureWorkshop", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "The course “Teaching Workshop for Sociology Students” is designed to provide students an opportunity to enhance their knowledge on sociology and/or research by service learning. The course aims to 1) consolidate students’ knowledge on sociology; 2) facilitate students with basic teaching and classroom communication skills; 3) provide an opportunity for students to conduct at least one lecture of Liberal Studies (LS) or related subject in real school setting; and finally, 4) reflect on these experiences in structured in-class discussion and in writing assignment with sociological perspective. This is a listed course for the students who want to take the Area of Specialization in Sociology and LS.", "outcome": "  Students are able to:  1. consolidate and deepen the sociological knowledge they have acquired from the major curriculum in the course of teaching their secondary counterparts  2. appreciate the value of serving the community and understand how sociological knowledge could contribute to the improvement of the community  3. develop a better understanding of the teaching career as a sociology student and make informed decisions on whether to pursue such a career development    ", "syllabus": "  Topics:  - Introduction: Course objectives and structure;   - Liberal Studies and its pedagogical context  - Workshop 1: Teaching Sociology with current issues - Sociology of (reflective) teaching  - Workshop 1: Teaching Sociology with current issues   - Workshop 2: Teaching strategies: role-play, case study, structured discussion and storytelling  - Workshop 3: Teaching in context: Liberal Studies  - Workshop 4: IES skills: Formulating research questions  - Workshop 5: IES skills: Methodologies  - Mock Teaching and Teaching practicum  - Develop your own teaching portfolio/ School Lecture Review/ Conclusion  ", "required_readings": "  ", "recommended_readings": "  Readings and Resources:  On your mark: Sociology  Mills, C. Wright (1996). “The sociological imagination” in Pollard, Andrew (edited). Readings for reflective teaching in the primary school. London: Cassell.  Dussel, Ines (2010). “Foucault and education” in Apple, Michael W., Stephen J. Ball & Luis Armando Gandin (eds.) The Routledge international handbook of the sociology of education. London: Routledge.  Teaching career  Reed, Arthea J.S. & Verna E. Bergemann (1992) “2. Who can teach?” In the classroom: An introduction to education. Guilford, Conn.: Dushkin Pub. Group.  Sociology of Teaching: The Real Classroom  Ball, Stephen [et al.] (1984) “The tyranny of the “devil’s mill”: Time and task at school” in Delamont, Sara (ed.) Readings on interaction in the classroom. London: Methuen.  Denscombe, Martyn (1984). “’Keeping’em quite’: The significance of noise for the practical activity of teaching” in Delamont, Sara (ed.) Readings on interaction in the classroom. London: Methuen.  Keddie, N (1984). “Classroom knowledge” in A. Hargreaves & P. Woods (eds.) Classrooms and Staffrooms: The Sociology of Teachers and Teaching. Milton Keynes: OUP.   Hargreaves, A. (1984) “The significance of classroom strategies” in A. Hargreaves & P. Woods (eds.) Classrooms and Staffrooms: The Sociology of Teachers and Teaching. Milton Keynes: OUP.   Wragg, E.C. & Wood, E.K. (1984) “Teachers First Encounters with their Classes in Classroom Teaching Skills” in Wragg E.C. (ed.) Classroom teaching skills: The research findings of the Teacher Education Project. London: Croom Helm Ltd.  (Classroom Ethnography)  Hammersley, Martyn & Peter Woods (eds.)(1984). Life in school: The sociology of pupil culture. Milton Keynes: Open University Press.  Ball, Stephen. “Banding, identity and experience”   ── “Initial encounters in the classroom and the process of establishment”  Furlong, V.J.. “Interaction sets in the classroom: towards a study of pupil knowledge”   Gannaway H. “Making sense of school”  Woods, P. “Negotiating the demands of schoolworks”  Hammersley M. & G. Turner “Conformist pupils?”  Teaching Sociology (Selected articles)  Albers, B. D, & R. Bach. “Rockin' soc: Using popular music to introduce sociological concepts”. 2003:31(2).  Burns, E.A. “Bathroom politics: Introducing students to sociological thinking from the bottom up”. 2003:31(1).  Ghoshal, R. A., C. Lippard, V. Ribas & K. Muir. “Beyond bigotry: Teaching about unconscious prejudice.” 2012:41(2).  Hedley, M. & L. Markowitz. “Avoiding moral dichotomies: Teaching controversial topics to resistant students.” 2001:29(2).  Hollander, J. A. “Learning to discuss: Strategies for improving the quality of class discussion.” 2002:30(3).  Hochschild, Thomas R. Jr., M. Farley & V. Chee. “Incorporating sociology into community service classes.” 2014:42(2)  Johnson, D.R., L. Renzulli, J. Bunch & M. Paino. “Everyday observations: Developing a sociological perspective through a portfolio term Project.” 2013:41(3).  Maxine, P. A. & A.N. Hunt. “Inquiry-guided learning in sociology.” 2008:36(1).  Larson, J. A. & W. Tsitsos. “Speed dating and the presentation of self: A teaching exercise in impression management and formation.” 2014:41(3).  Maxine, P. A. & A.N. Hunt. “Inquiry-guided learning in sociology.” 2008:36(1).    Messinger, A.M. “Teaching content analysis through Harry Potter.” 2014:40(4)  Misra, J. ”Integrating \"the real world\" into introduction to sociology: Making sociological concepts real.” 2000:28(4).  Straus, Roger A. “Simple Games for Teaching Sociological Perspectives: Four Examples of the Do-It-Yourself  Approach”. 1986:14(2)   Trepagnier, B. “Mapping sociological concepts”. 2002:30(1).  Other Journals  Paul, John (2006) ““Flushing” Out Sociology: Using the Urinal Game and other Bathroom Customs to Teach the Sociological Perspective”. Electronic Journal of Sociology [on-line]. Available: http://www.sociology.org/ejs-archives/.  Pollard, Andrew (1988). “Reflective teaching－The sociological contribution” in Woods, Peter & Andrew Pollard (eds.) (1988). Sociology and Teaching. London: Croom Helm Ltd.  Teachers’ lives in context  Apple, Michael (1996). “Deskilling and intensification” in Pollard, Andrew (edited). Readings for reflective teaching in the primary school. London: Cassell.  Ball, Stephen J. (2003) “The teachers’ soul and the terrors of performativity”. Journal of Education Policy 18(2): 215-228.  Carlyle, Denise & Peter Woods (eds.) (2002). “Origins of stress I” ‘Eggshell days’ in school” in The emotions of teacher stress. Stoke-on-Trent: Trentham.  Hughes, M., F. Wikeley & T. Nash  (1996). “Parents as consumers” in Pollard, Andrew (edited). Readings for reflective teaching in the primary school. London: Cassell.  Lortie, D.C. (1984). “Teacher career and work rewards” in A. Hargreaves & P. Woods (eds.) Classrooms and Staffrooms: The Sociology of Teachers and Teaching. Milton Keynes: OUP.   Meanwell, E. & S. Kleiner (2014). “The Emotional Experience of First-time Teaching: Reflections from Graduate Instructors, 1997–2006”. Teaching Sociology. 2014:42(1).  Menter, I. [et al.] (1996). “Management in the new educational ‘market’” in Pollard, Andrew (edited). Readings for reflective teaching in the primary school. London: Cassell.  Whitty, Geoff (2001). “Teacher professionalism in new times” In Gleeson D. & C. Husbands (eds.) The Performing Schools: Managing, teaching and learning in a performance culture. London: Routledge.  Woods, Peter (1984) \"Teaching for Survival\" in A. Hargreaves & P. Woods (eds.) Classrooms and Staffrooms: The Sociology of Teachers and Teaching. Milton Keynes: OUP.  (Selected) Classroom Skills  Brown G.A. & R. Edmondson (1984). “Asking questions” in Wragg E.C. (ed.) Classroom teaching skills: The research findings of the Teacher Education Project. London: Croom Helm Ltd.  Harlen, Wynne [et al.] (1996). “Assessment purposes and principles” in Pollard, Andrew (edited). Readings for reflective teaching in the primary school. London: Cassell.  Hill, A., T. Arford, A. Lubitow & L. M. Smollin. “’I’m ambivalent about It’: The dilemmas of PowerPoint.” Teaching Sociology. 2012:40(3)  Jone, Vern (1996). “Classroom management” in Sikula, J., T.J. Buttery & E. Guyton (eds.) Handbook of research on teacher education: A project of the Association of Teacher Educators (2nd edition). New York: Macmillan Pub. Co.  King, Ronald (1996). “Methods of classroom control” in Pollard, Andrew (edited). Readings for reflective teaching in the primary school. London: Cassell.  Wragg, E.C. (2001) “The two Rs - rules and relationships” in Class management in the secondary school. London: Routledge/Falmer.  Service Learning  Teaching Portfolio  Official stuff: Policy Document and resources Hurst, Beth [et al.] (1998). “Professional Teaching Portfolios.” Phi Delta Kappan. Apr. 98. Vol.79. Iss. 8.  Official stuff: Policy Document and resources   Curriculum Development Council & Hong Kong Examinations and Assessment Authority (2014). Liberal Studies Curriculum and Assessment Guide (Secondary 4 - 6) [On-line]. Available: http://334.edb.hkedcity.net/doc/eng/curriculum/LS%20C&A%20Guide_updated_e.pdf.   香港教育城｢通識教育科網上資源平台｣[線上]。載於：http://ls.edb.hkedcity.net/。  ", "terms": {"2020-21 Term 2": {"--LEC (5070)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Hui Yeung Shing Bldg G01"], "instructors": ["Dr. KOO Wai Sze"]}, "-W01-WKS (5071)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [1], "locations": ["Hui Yeung Shing Bldg G01"], "instructors": ["Dr. KOO Wai Sze"]}}}, "assessments": {"Essays": "35", "Others": "55", "Presentation": "10"}}, {"code": "4204", "title": "Sociology of Education", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "This course offers a sociological perspective on the structure, process and outcomes of schooling. It seeks to draw on modern empirical research findings to challenge students to think critically about the profound meaning and significance of schools and schooling experiences. We will review major perspectives on social effects of schools and schooling on individuals and society. Major topics include: education as socializing individuals and as legitimizing social institutions, the stratification system, social and individual factors affecting individual educational attainment, education as a competitive arena, and the social organization of schooling.", "outcome": "    Untitled Document   1. To be familiarized with sociological concepts, theories, and perspectives that illuminate our understanding of the relationships between education and society. 2. To review the social effects of education on both the society and the individual. 3. To examine the system of educational stratification and the extent of its impact on educational achievement and attainment. 4. To be able to apply sociological perspectives to the empirical study of aspects of schooling and education.   ", "syllabus": "    Untitled Document   SOCIOLOGICAL INTERPRETATIONS AND THEORETICAL METHOD  • Functional Perspectives  • Conflict Perspectives  • Institutional Perspectives   II. MAJOR ISSUES AND DEBATES  • Does Schooling Matter? • What Makes Effective Learning in School?  • Educational Competition: Social and Cultural Dynamics • Gender and Schooling  • Education and Civic Culture   ", "required_readings": "   Untitled Document    None.   ", "recommended_readings": "        Alan R. Sadovinik, “Theories in the Sociology of Education” in Jeanne H. Ballantine and Joan Z. Spade.  Schools and Society: A Sociological Approach to Education.  Wadsworth, 2004.   Talcott Parsons, \"The School Class as a Social System: Some of Its Functions in American Society, \" in Jeanne H. Ballantine and Joan Z. Spade.  Schools and Society: A Sociological Approach to Education.  Wadsworth, 2004. Pp. 38-46 and in Harvard Education Review 29 (1959), 297-313.   John W. Meyer, \"The Charter: Conditions of Diffuse Socialization in Schools.\" Pp.564-78 in Social Processes and Social Structurtes, edited by W.  R. Scott.  New York: Holt, inehart & Winston, 1970.   John Meyer, \"The Effects of Education as an Institution,\" American Journal of Sociology, 83:55,1977.                  John Meyer,\"Levels of the Educational System and Schooling Effects,\" in C. Bidwell and D. Windham, eds., The Analysis of Educational Productivity, II,  Ballinger, 1980.   John Meyer and Brian Rowen,  \"The Structure of Educational Organizations,\" Capter 3 in John Meyer and Richard Scott, Organizational Environments: Ritual and Rationality, Newbury Park: Sage, 1992.   Karl Weick, \"Educational Organizations as Loosely Coupled Systems,\" Administrative Science Quarterly, 1976.   Jeanne H. Ballantine and Joan Z. Spade.  Schools and Society: A Sociological Approach to Education.  Pine Forge Press (4th ed.), 2011.   Steven Brint.  Schools and Societies.  Thousand Oaks:  the newest edition, 2006.   Walter Feinberg and Jonas F. Soltis.   School and Society, Fifth Edition (Thinking about Education).  New York: Teachers College Press, 2009 [CC   LC191 .F4 2009 ].   J. Karable and A. H. Halsey, (eds.), Power and Ideology in Education.  New York: Oxford University Press, 1977.   R. Morrow and C. Torres.  Social Theory and Education: A Critique of theories of Social and Cultural Reproduction.  New York: State University of New York Press, 1995.   Alan R. Sadovnik (ed.).  Sociology of education : a critical reader. [CC  LC191.2 .S632 2011]  New York:  Routledge, 2011.   Michael W. Apple, Stephen J. Ball and Luis Armando Gandin eds.). The Routledge international handbook of the sociology of education. New York : Routledge, 2010. [ CC LC191 .R684 2010]   Richard Arum, Irenee R. Beattie, Karly Ford (eds.).  The structure of schooling : readings in the sociology of education.  Los Angeles : Pine Forge Press, an imprint of SAGE Publications, c2011 (2nd ed).  [CC  LC189 .S87 2011]   Emily Hannum, Hyunjoon Park, Yuko Goto Butler.  Globalization, changing demographics, and educational challenges in East Asia.  Bingley, UK : Emerald, 2010   Yasemin N. Soysol and Suk-Ying Wong \"Educating Future Citizens in Europe and Asia,\" chapter 4 in School Knowledge in Comparative and Historical Perspective: Changing Curricula in Primary and Secondary Education, edited by Aaron Benavot and Cecilia Braslavsky. New York and London: Springer, 2006.                                              David Frank, Suk-Ying Wong, John Meyer and Francisco Ramirez “What Counts As History: A Cross-National and Longitudinal Study of University Curricula”, Comparative Education Review, Vol. 44, No. 2, February, 2000.   Aaron Benavot, Y-K Cha, D. Kamens, John W. Meyer and S-Y Wong. \"Knowledge for the Masses: World Models and National Curricula, 1920-1986\".  American Sociological Review, 1991, 56: 85-100.   Suk-Ying Wong, \"The Evolution of Social Science Instructions (1900-1986): A Cross-National Study.\"  Sociology of Education, 1991, 64: 33-47.        ", "terms": {"2020-21 Term 1": {"--LEC (5210)": {"startTimes": ["11:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor SHEN Wensong"]}, "-T01-TUT (4823)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor SHEN Wensong"]}}}, "assessments": {"Others": "25", "Presentation": "25", "Short answer test or exam": "50"}}, {"code": "4205", "title": "Social Movement", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "This course is designed as a survey of the major sociological theories of social movements. These theories will be further elucidated by discussing different types of social movements such as labour movement, the women’s movement, gay right movement, environmental movement, pro-democracy movements and the U.S. civil rights movement.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4208", "title": "Cultural Sociology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "The first part of this course introduces students to the diverse perspectives of cultural sociology. Both classical and contemporary approaches will be covered, from Karl Marx and Max Weber to the critical theorists and the postmodernists. The second part of the course centres upon the empirical facets of culture, tackling such cultural issues and phenomena as subculture, high culture, popular culture, material culture, culture and the media, culture and power, as well as culture and ideology.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4209", "title": "Religion in Modern Society", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Not for students who have taken SOCI4352 or CURE3112.", "description": "Many sociologists predicted that religion would gradually fade away in modern society and ‘modernity’ would eventually triumph over the ‘enchanted world’. On the contrary, the revival of traditional religions, blooming of new religious cults/sects, wide spread charismatic movement and fundamentalist movement of various sorts are taking place. Some contemporary sociologists therefore argued that we are in an age of ‘re-enchantment’ instead of ‘disenchanted’ modern society.The course will be divided in two parts. In the first part, we will start from Max Weber’s theory to see how sociologists conceived the relation between religion and modernity as well as their conflicts. In the second part, we will go through contemporary issues concerning religious fundamentalism, religion and society in East Asia, China and Hong Kong.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4210", "title": "Science and Technology Studies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "What is science? What, if anything, is special about the way that scientists generate knowledge? And is scientific knowledge free of social influences? The first part of this course reviews how skeptical arguments from the philosophy of science (e.g., Popper and Kuhn) paved the way for the argument that scientific knowledge may be ‘socially constructed’. The second part provides an introduction to theory and empirical research in the growing field of science and technology studies (STS), which emphasize the social, cultural and contingent nature of scientific development.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4351", "title": "Selected Topics in Sociology IV", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "The content of the course will vary with the instructor. It may focus on major theoretical issues and research areas in contemporary sociology or on particular aspects of social life and development in one or more countries.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4352", "title": "Selected Topics in Sociology V", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "The content of the course will vary with the instructor. It may focus on major theoretical issues and research areas in contemporary sociology or on particular aspects of social life and development in one or more countries.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4353", "title": "Selected Topics in Sociology VI", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "The content of the course will vary with the instructor. It may focus on major theoretical issues and research areas in contemporary sociology or on particular aspects of social life and development in one or more countries.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4410", "title": "Directed Studies I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "-", "description": "With permission of the instructor, a student may pursue a special reading course in consultation with and under the supervision of the instructor. The topic and content of the course will be individually determined.Advisory: For Sociology Majors only.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4420", "title": "Directed Studies II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Dept of Sociology", "requirements": "Pre-requisite(s): SOCI3410.", "description": "This course is designed for those students who have taken SOCI4410 to extend their intellectual pursuit. Advisory: For Sociology Majors only.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5501", "title": "Sociology and Modern Life", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in MA Sociology", "description": "The course introduces major concepts, theories, and issues commonly utilized within the major areas of sociological investigation. It is designed to familiarize students with sociologically way of thinking, in contrast to other ways of seeing the world around us. We will emphasize the crucial importance of institutions in mediating the relations between the individual and the larger society in a historical context, from the rise of modernity to the “late modernity”.", "outcome": "Upon the completion of the course, students will be able to1. have a basic understanding of sociological perspective and a number of selected sociological key concepts.2. demonstrate the ability to think in a sociological way.3. apply different sociological perspectives/ key concepts on everyday life.", "syllabus": "1. Sociology and Its Promise2. Asking and Answering Sociological Questions: Theories, Perspectives and Researches3. The Changing World: The Rise of Modern Society and After4. The Life Course5. Social Interaction and Everyday Life6. Social Institution7. Social Divide", "required_readings": "Anderson, Benedict (2006). Imagined Communities: Reflections on the Origin and Spread of Nationalism. Verso Books.Bauman, Zygmunt & Tim May (2001). Thinking Sociologically (2nd Edition). Wiley-Blackwell.Beck, Ulrich (1992). Risk Society: Towards a New Modernity. London: Sage.Berger, Peter L. (1966) Invitation to sociology: a humanistic perspective. Harmondsworth, Eng.: Penguin Books. Berger, Peter & Thomas Luckmann (1991). The social construction of reality; a treatise in the sociology of knowledge. Garden City, N.Y., Doubleday.Castells, M. (2000). The Rise of the Network Society (2nd Edition). Oxford: Blackwell.Drucker, Peter F. (1993). Post-Capitalist Society. New York: Harper Business.Giddens, Anthony & Phillip Sutton (2013). Sociology (7th Edition). U.K. Cambridge: Polity Press.Giddens, Anthony & Phillip Sutton (2017). Essential concepts in sociology (2th edition). Cambridge, UK: Polity Press.Mills,  C. Wright (1959). The Sociological Imagination. New York: Oxford University Press.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (2294)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["Chen Kou Bun Bldg UG04"], "instructors": ["Dr. KOO Wai Sze"]}}}, "assessments": {"Essays": "0", "Essay test or exam": "0", "Others": "0", "Short answer test or exam": "0"}}, {"code": "5502", "title": "Decoding Hong Kong Society", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in MA Sociology and MSSc General Education", "description": "In-depth analysis of selected issues and aspects of Hong Kong society from a sociological perspective. Topics discussion include Hong Kong’s business organization and economic development, social stratification and social mobility, political changes and conflict, urban development, culture, and family.", "outcome": "1. After the course, students would have a good understanding of major trends in Hong Kong society.\r 2. Students would be equipped with the ability to analyze social issues with the aid of social theory.\r 3. Through guided tour and writing exercises, the ability to observe and research in social phenomenon will be cultivated.", "syllabus": "1 .Hong Kong society from a world system theory perspective\r 2. Group formation and identity formation\r 3. The development of Canton pop in Hong Kong Society\r 4. Modernization and citizenship in Hong Kong\r 5. Governance in Hong Kong\r 6. Hong Kong economy from sociological perspective\r 7. Hong Kong discourse in contest.", "required_readings": "References (part of the list)\r Faure, David. Colonialism and the Hong Kong Mentality. Hong Kong: Centre of Asian Studies, 2003.\r Hopkins, Keith (ed.) Hong Kong: The Industrial Colony. Hong Kong: Oxford University Press, 1971.I\r Jarvie, Ian, and Joseph Agassi (eds.) Hong Kong: A Society in Transition. New York: Frederick Praeger Publishers, 1969.\r King, Ambrose Y.C. and Rance P.L. Lee (eds.) Social Life and Development in Hong Kong. Hong Kong: Chinese University Press, 1981.\r Lau, Siu-Kai. Society and Politics in Hong Kong. Hong Kong: Chinese University Press, 1982.\r Lau, Siu-Kai (ed.) Social Development and Political Change in Hong Kong. Hong Kong: Chinese University Press, 1999.\r Leung, Benjamin K.P. Perspectives on Hong Kong Society. Hong Kong: Oxford University Press, 1996.\r Leung, Benjamin K.P. (ed.) Hong Kong: Legacies and Prospects of Development. Aldershot: Ashgate Publishing Ltd., 2003.\r Ngo, Tak-wing (ed.) Hong Kong’s History. London: Routledge.\r Salaff, Janet. Working Daughters of Hong Kong 2nd Edition. New York: Cambridge University Press, 1995.\r Scott, Ian. Political Change and The Crisis of Legitimacy in Hong Kong. Hong Kong: Oxford University Press, 1989.\r Wong, Siu-lun. Emigrant Entrepreneurs. Hong Kong: Oxford University Press, 1988.\r 謝均才 (編) 《我們的地方，我們的時間：香港社會新編》。香港：牛津大學出版社，2001。\r 吳俊雄、張志偉 (合編) 《閱讀香港普及文化》。香港：牛津大學出版社，2001。\r 劉兆佳 (編) 《香港二十一世紀藍圖》。香港：香港中文大學出版社，2000。", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (1477)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["Esther Lee Bldg LT2"], "instructors": ["Dr. LAU Siu Lun"]}}}, "assessments": {"Essays": "0", "Essay test or exam": "0", "Others": "0", "Presentation": "0", "Short answer test or exam": "0"}}, {"code": "5503", "title": "Methods of Social Inquiry", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in MA Sociology", "description": "This course is a general introduction to social research methods. Over the course of the semester we will cover four general topics: (1) research design, (2) conducting research, (3) analyzing data, and (4) evaluating research. We will also consider the goals and ethical implications of social research. By the end of the semester, you will be equipped with the skills to conduct solid research as well as critically examine and evaluate the findings and assertions of others. Most importantly, this course is an opportunity to be exposed to useful tools to help you study and think about the things that interest you, and improve your ability to tell a story about what you learned in a convincing and nuanced manner. Through lectures, discussion, and practice we will:• discuss the relationship between theory and research• explore the nature, principles, and methods of conducting social research• practice an array of research methodologies• grapple with some of the ethical implications of studying human beings• acquire a greater knowledge and understanding of the discipline of sociology", "outcome": "By the end of the course, you should be able to:\r 1. conceptualize a research problem and formulate good research questions\r 2. develop a number of complementary research designs that will help you find answers to your particular research question(s)\r 3. collect your own data using a variety of methods\r 4. acquire a greater knowledge and understanding of both qualitative and quantitative data analysis techniques to determine the ones that will be most relevant to your own research questions and data collection methods\r 5. present and discuss your own findings verbally and in writing\r 6. evaluate the work of other academics as well as the use of social science research in more popular outlets (e.g., The New York Times, Star Tribune, Wired, ESPN, cosmopolitan, etc.) and arguments in general\r 7. appreciate different ways to observe and analyze the social world", "syllabus": "1. Introduction / Research foundations \r 2. Research ethics / From concepts to model \r 3. Evaluating research: Reliability and Validity \r 4. Sampling strategies \r 5. Survey research \r 6. Experimental research \r 7. Quantitative analysis \r 8. Evaluation research \r 9. Ethnography / In-depth interviewing \r 10. Materials-based research / Social network analysis \r 11. Qualitative analysis / Communicating research findings \r 12. Group project presentation", "required_readings": "Carr et al. (2017). The Art and Science of Social Research. New York: W. W. Norton & Company.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (2021)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [6], "locations": ["Yasumoto Int'l Acad Park LT2"], "instructors": ["Professor JIANG Bo"]}}}, "assessments": {"Essays": "0", "Essay test or exam": "0", "Others": "0", "Presentation": "0", "Short answer test or exam": "0"}}, {"code": "5504", "title": "Statistics for Social Research", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in MA Sociology", "description": "This course discusses the basic principles of statistical reasoning and their applications in social research. Basic techniques for descriptive and inferential analysis will be discussed to enhance students’ ability in analysing associations between social variables in the context of theory and hypothesis testing. Students will be given opportunities to use statistical software for analysing survey data. No prior computing experience is required.", "outcome": "The learning outcomes include: \r (1) The role of quantitative evidence in scientific reasoning,\r (2) Ability to articulate (verbally and in writing) the fundamental principles of statistical reasoning in relation to the role of quantitative evidence,\r (3) Basic concepts and tools of statistics with special reference to the concept of spurious relationship and confounding bias, and\r (4) Statistical literacy (ability to interpret the statistical results commonly reported in the mass media and applied social research, to recognize and avoid some common misuse of statistics).", "syllabus": "1. Introduction: The research process, Concepts and measurements, Descriptive and inferential statistics, Data structure\r 2. Using SPSS\r 3. Descriptive statistics\r 4. Inferential statistics\r 5. Sample/group comparison\r 6. Bivariate analysis\r 7. Multivariate analysis", "required_readings": "Healey, J.F. 2009. Statistics: A Tool for Social Research 8th edition. Belmont, CA: Wadsworth Cengage Learning.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (2879)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["Wong Foo Yuan Bldg LT4"], "instructors": ["Professor TING Kwok Fai"]}}}, "assessments": {"Essays": "0", "Essay test or exam": "0", "Others": "0", "Presentation": "0", "Short answer test or exam": "0"}}, {"code": "5601", "title": "Theoretical Perspectives in Sociology", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in MA Sociology", "description": "The aim of this course is to familiarize the students with the theoretical traditions and development of the field of Sociology. Three focal areas will be covered to obtain a condensed overview of the major theoretical perspectives involved: 1) the contemporary relevance and revisions of the core Sociological traditions; 2) significant theoretical controversies and issues; 3) current attempts towards frameworks of theoretical integration.", "outcome": "After going through this course, the students are expected to achieve the following goals, namely \r 1)attain a condensed bird’s eye view of the trajectory and identity of the discipline of Sociology; 2)comprehend the fundamental theoretical perspectives based upon which new research questions and agenda can be formulated;  3)assimilate the insights of distinguished sociologists as a rich source for intellectual cultivation and personal growth.", "syllabus": "1. Scientific Sociology\r 2. Interpretive Sociology\r 3.Conflict Sociology\r 4. Functional Sociology\r 5. Postmodern Sociology\r 6.Critical Sociology", "required_readings": "Coser, Lewis, Masters of Sociological Thought 2nd edition (HBJ Press);  Ritzer, George, Sociological Theory 6th edition (McGraw-Hill); and \r Zeitlin, Irving, Ideology and Development of Sociological Theory 7th edition (Prentice Hall)", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (2638)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [5], "locations": ["Ho Tim Building B6"], "instructors": ["Professor CHAN Hoi Man"]}}}, "assessments": {"Essays": "0", "Essay test or exam": "0", "Others": "0", "Short answer test or exam": "0"}}, {"code": "5631", "title": "Contemporary Chinese Society", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in MA Sociology and MSSc General Education", "description": "The course will discuss the impetus of institutional change in contemporary China (1949 -) and its impacts on social and political lives of Chinese people. Key social science concepts such asideology, socialism, marketization, patron-clientelism, social control, civil society, industrialization, urbanization, class formation, social inequality, gender, family and special terms such as guanxi,danwei, hukou, floating population, three-represents, harmonious society, China's dream. etc. will be introduced.", "outcome": "1. Students should be able to understand the social science perspective used in this course to comprehend the main aspects of social change in contemporary China. They should be familiar with the key concepts and theories adopted from sociology and other social science disciplines in the analysis.2. Students are expected to grasp the basic knowledge about China's major institutions such as socialist market economy, party-state politics, stratification and family etc.3. Besides general knowledge, students are encouraged to focus on a special topic through their writing assignment such as the dilemmas between economic development and social equality, democracy and developmental state, traditional culture and modernization etc.", "syllabus": "1/ A concise history of contemporary China2/ Marxism, Maoism and ideology3/ Ideological struggles and economic foundations4/ Political economy of rural life5/ Political economy of urban life6/ Labor and class formation  7/ Environmental governance and resistance8/ Gender, marriage and family9/ Civil Society and state-society relations10/ Modernization and China’s future11/ China and the world", "required_readings": "陳健民、鍾華編【艱難的轉型: 現代化與中國社會】(香港:  香港中文大學出版社，2016)裴宜理、塞爾登編 【中國社會: 變革、衝突與抗爭】(香港: 香港中文大學出版社, 2014)", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (3684)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Sino Building LT2"], "instructors": ["Professor CHAN King Chi"]}}}, "assessments": {"Essays": "0", "Essay test or exam": "0", "Others": "0", "Presentation": "0", "Short answer test or exam": "0"}}, {"code": "5633", "title": "Globalization: Challenges and Responses", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in MA Sociology", "description": "Globalization has emerged as one of the most talked about concepts in the contemporary world. This course takes globalization as the master trend leading to profound changes in social life everywhere and will examine its multi-faceted manifestations in economic, political and cultural dimensions. Guided by the sociology of development, this course will seek to develop a broad interdisciplinary approach to the academic debates over globalization. Particular attention will also be paid to the challenges that globalization poses on human development and the responses that the global community has fashioned to tackle these challenges.", "outcome": "1.To understand the complex and multi-dimensional nature of globalization from sociological and multi-disciplinary approaches. 2.To comprehend the major academic debates arising from the process of globalization and locate current issues in the context of these debates. 3.To reflect on the impact of globalization on human development as well as the responses of the global community. 4.To master the skills in conducting analytical research on globalization issues. 5.To relate academic and community debates on globalization to our everyday life and formulate individual and collective strategies in responding to globalization and its impacts.", "syllabus": "1.  What is Globalization?   a.Nature of globalization: when, what and how.   b.Globalization and the Sociology of Development   c.What are the Debates About? Opposing views on globalization.2.  Political, Social and Economic Dimensions of Globalization3.  Individual and Collective Responses to Globalization", "required_readings": "Friedman, Thomas L. 1999. The Lexus and the Olive Tree.  Publisher New York: Farrar, Straus & Giroux.Held, David et al.  1999.  Global transformations : Politics, Economics and Culture  Stanford: Stanford University Press.Held, David and Anthony McGrew.  2002.  Globalization/anti-globalization Cambridge, U.K. : Polity.Legrain, Philippe.  2002.  Open World: The Truth about Globalisation   London: Abacus.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (1445)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["Sino Building 239"], "instructors": ["Dr. LEE King Wa"]}}}, "assessments": {"Essays": "0", "Essay test or exam": "0", "Others": "0", "Presentation": "0", "Short answer test or exam": "0"}}, {"code": "5635", "title": "Social Problems and Inequalities", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in MA Sociology", "description": "Seemingly citizens of the modern society live with increasing affluence and liberty. Yet lurking behind prosperity and development is the widening of regional and social inequalities, the persistence of social exclusion and discrimination, the emergence of new forms of crime and deviance, and the escalation of violence intertwined with advanced technology and fundamentalism. Using insights froma variety of sociological theories, including the Foucaultian, Marxist, Feminist, and Postmodern perspectives, this course engages students to the sociological debates about the meanings, patterns, causes, and consequences of these issues, and their impact on the sense of being and identity.", "outcome": "After completing the course, the students should be able to:\r 1. Capture an overview and the role of sociological theories in understanding social problems and inequalities, sort out and compare their underlying theoretical assumptions and fundamental interrelationships, and show how sociological theories reflect the historical context of the times and cultures in which they were developed; 2. Deepen their appreciation of the significance of sociological analyses for reflection of the diversity of values, interests, and positions in terms of social problems and inequalities; 3. Identify and critically evaluate certain commonly-held views regarding social problems and inequalities, and present alternative and even opposing hypotheses on them; and\r 4. Apply sociological perspectives to the analysis of real life instances of social problems and resulting inequalities.", "syllabus": "1. Overview of sociological models on social problems and inequalities\r 2. Social construction of social problems and inequalities \r 3. Social class and social problems\r 4. Social exclusion and labeling\r 5. Social disorganization and community level analysis\r 6. Gender gap in violence: Normative versus constructionist feminist paradigms\r 7. Postmodernism and normalization of deviance\r 8. Marxist and poststructuralist approaches to power analysis\r 9. Global and social inequalities: World hunger and terrorism", "required_readings": "Benson, R. and A.C. Saguy. 2005. “Constructing social problems in an age of globalization: A French-American comparison.” American Sociological Review 70: 233-259.\r  Buttel F.H. 2000. “Ending hunger in developing countries.” Contemporary Sociology 29:13-27. \r  Giddens, A. 1991. “Introduction” and “The contours of high modernity”. Pp.1-34 in Modernity and Self-Identity: Self and Society in the Late Modern Age. Stanford, California: Stanford University Press.\r  Goffman, E. 1986. Stigma: Notes on the Management of Spoiled Identity. New York: Simon & Schuster, Inc. \r  Goodwin, J. 2006. “A theory of categorical terrorism.” Social Forces 84: 2027-2046.\r  Marlatt, G.A. and K. Witkiewitz. 2010. “Update on harm-reduction policy and intervention research.” Annual Review of Clinical Psychology 6: 591-606.\r  Parker, H., L. Williams and J. Aldridge. 2002. “The normalization of ‘sensible’ recreational drug use: Further evidence from the North West England longitudinal study.” Sociology 36: 941-964.\r  Sampson, R.J. and W.B. Groves. 1989. “Community structure and crime: Testing social disorganization theory.” American Journal of Sociology 94: 774-802.\r  Schwartz, J., D.J. Steffensmeier and B. Feldmeyer. 2009. “Assessing trends in women’s violence via data triangulation: Arrests, convictions, incarcerations, and victims’ reports.” Social Problems 56: 494-525.\r  Rubington, E. and M.S. Weinberg. eds. 2011. “Critical perspective” Chapter 7 in The Study of Social Problems: Seven Perspectives. 7th ed. New York: Oxford University Press.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (3155)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [1], "locations": ["Sino Building LT2"], "instructors": ["Professor CHEUNG Wai Ting"]}}}, "assessments": {"Essays": "0", "Essay test or exam": "0", "Others": "0", "Presentation": "0", "Short answer test or exam": "0"}}, {"code": "5636", "title": "Issues in Education and Society", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in MA Sociology", "description": "This course examines the relationship between education institution and the society. It offers a sociological perspective on social processes and outcomes of schooling. Topics such as major sociological theories on education, and its implications on schooling processes and education institution, effects of education on societal level (the function of allocation and selection of education, credential system etc.) as well as the individual level (such as social stratification and socialization) are covered in the course. Empirical studies in Hong Kong and China will be adopted as illustration of theoretical analysis and application. Upon the completion of the course, students are expected to have basic understanding of sociology of education, and the ability to reflect on the meaning and significance of schools and schooling experiences in a sociological way.", "outcome": "Upon the completion of the course, students are expected\r 1. to have a basic understanding of general theories of sociology of education; 2. to be able to reflect on the meaning and significance of schools and schooling experiences in a sociological way; 3. to relate their own experience to the concepts and theories learnt in the course.", "syllabus": "1. What is Sociology of Education\r 2. Major Sociological Theories on Education\r 3. Social Stratification and Education: Effects of Education on Individual Level\r 4. Education as Social Certification: Effects of Education on Societal Level\r 5. Education Reform in Knowledge Society\r 6. Education and Reform in Dispute", "required_readings": "Ballantine, J. H., & Hammack, F. M. (2017). Sociology of education: A unique perspective for understanding schools. In J. H. Ballentine, F. M. Hammack, & Stuber, J. M. (Eds.), The sociology of education: A systematic analysis (8th ed., pp. 3-44). Upper Saddle River, NJ: Pearson.\r  Ballantine, J. H. & Spade, J. Z. (2015). Understanding education through sociological theory. In J. H. Ballantine, & J. H. Spade (Eds.), Schools and society: A sociological approach to education (5th ed., pp.18-34). Thousand Oaks, California: SAGE.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (2032)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [5], "locations": ["Sino Building LT2"], "instructors": ["Dr. HO Ching Wai"]}}}, "assessments": {"Essays": "0", "Essay test or exam": "0", "Others": "0", "Presentation": "0"}}, {"code": "5637", "title": "Special Topic in Sociology I", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in MA Sociology", "description": "Contents and requirements of this course depend on expertise of the instructor. The objective is to strengthen students' knowledge in a sub-field of sociology. Discussion will focus on current theoretical debates, research issues, and methodological approaches.Topic: Please refer to the Department for details.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5638", "title": "Special Topic in Sociology II", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in MA Sociology", "description": "Contents and requirements of this course depend on expertise of the instructor. The objective is to strengthen students' knowledge in a sub-field of sociology. Discussion will focus on current theoretical debates, research issues, and methodological approaches.Topic: Please refer to the Department for details.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5639", "title": "Special Topic in Sociology III", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in MA Sociology", "description": "Contents and requirements of this course depend on expertise of the instructor. The objective is to strengthen students' knowledge in a sub-field of sociology. Discussion will focus on current theoretical debates, research issues, and methodological approaches.Topic: Please refer to the Department for details.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5640", "title": "Special Topic in Sociology IV", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in MA Sociology", "description": "Contents and requirements of this course depend on expertise of the instructor. The objective is to strengthen students' knowledge in a sub-field of sociology. Discussion will focus on current theoretical debates, research issues, and methodological approaches.Topic: Please refer to the Department for details.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5641", "title": "Health and Society", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in MA Sociology", "description": "Health is a fundamental aspect of human existence and medicine is arguably the crown jewel of modern science. We all want good health, effective treatments of illness and affordable health care. Yet present-day health care is the flashpoint of many controversies: about the reliability of medical knowledge; and about inequalities in health and longevity. This course dissects these issues from a sociological perspective. We ask questions such as: What counts as illness? How do people understand illness? How does illness affect people’s life? Who gets ill and why? What is the role of medical technology in fostering health? Why do doctors and patients have trouble communicating?This course surveys major approaches and areas in the sociological study of health, illness and medicine. The central idea is that we cannot understand the topics of health, illness and medicine simply by looking at the biological phenomena and medical knowledge, but instead, we must also consider a variety of social, political, economic, and cultural forces.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5642", "title": "The Making of Modern Japan", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in MA Sociology.", "description": "This course analyzes and delineates the sociohistroical invention and construction of seemingly distinctive \"Japanese\" institutions and cultural values shaped by various global forces in the historical process. Specifically, it attempts to depict a dynamic picture of how modern and contemporary Japan from the Meiji to the Heisei (1868-2018) period tried to respond to the idea of \"modernity\" and the \"Western.\" Through a guided tour of Japan's experiences of the modern, the course shows both the enlightenment and despair brought by a series of political, social and cultural struggles for one to assert itself as a legitimate nation-state as seen from the eyes of others.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5643", "title": "Doing Class in Everyday Life", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For MA in Sociology students", "description": "Although some theorists claim that ‘class is dead’ and thus fails to explain contemporary society, our daily life is still influenced by class factors, not only in terms of resource allocation but also in the ways we conduct our social life. In this course, we will explore how class shapes our lifestyles, housing, association patterns, life chances, education strategies, parent-child interaction, subjective identification and even political orientation. We do not simply take class as objective structural positions; we also perceive class as crucial social boundaries and distinctions that have to be practiced, performed and reproduced in various social fields. Such a perspective will help us to discover and reflect how our social life is ‘classed’.", "outcome": "1. To understand different forms and sources of social inequalities;  2. To become familiarized with major sociological theories in class analysis\r 3. To reflect critically how our everyday life is influenced by class factors;  4. To be able to analyze social inequalities and class phenomena in the Chinese societies (such as Mainland China and Hong Kong)", "syllabus": "1. Introduction\r 2. The Classical Approaches: Marx vs. Weber\r 3. The Contemporary Approaches: John Goldthorpe, E. O. Wright and Pierre Bourdieu\r 4. Social Mobility\r 5. Social Networks and Social Capital\r 6. Poverty\r 7. Class Identification and Political Action\r 8. Conclusion", "required_readings": "1. Scott, John. 2002. “Social Class and Stratification in Late Modernity.” Acta Sociologica 45(1): 23-35.\r 2. Breen, Richard. 2005. “Foundations of a Neo-Weberian Class Analysis.” Pp. 31-50 in Approaches to Class Analysis, edited by Erik Olin Wright. New York: Cambridge University Press.\r 3. Wright, Erik Olin. 2005. “Foundations of a Neo-Marxist Class Analysis.” Pp. 4-30 in Approaches to Class Analysis, edited by Erik Olin Wright. New York: Cambridge University Press.\r 4. Weininger, Elliot. 2005. “Foundations of Pierre Bourdieu’s Class Analysis.” Pp. 82-118 in Approaches to Class Analysis, edited by Erik Olin Wright. New York: Cambridge University Press.\r 5. Scott, John. 2001. “If Class is Dead, Why won’t it Lie Down?” Pp. 127-46 in Inclusions and Exclusions in European Societies, edited by Alison Woodhead and Martin Kohli. London: Routledge.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (1618)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Esther Lee Bldg LT2"], "instructors": ["Dr. OR Tsz Ming"]}}}, "assessments": {"Essays": "0", "Essay test or exam": "0", "Others": "0", "Short answer test or exam": "0"}}, {"code": "5644", "title": "Thesis Project", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For MA in Sociology students", "description": "This thesis project course provides students a hands-on opportunity to complete an individual research on a topic of interest under the instructor’s supervision. Students will be able to gain the firsthand experience in developing a research project and to consolidate their knowledge and skills in research methods. Through classroom trainings and individual consultations, the instructor will provide appropriate guidance to students during each stage of the research process and thesis writing.", "outcome": "Upon completing this course, students will have acquired in-depth knowledge on the topic relating to the current theoretical controversies, research issues, and methodological approaches in sociology. The specific course objectives include:(1) To broaden the knowledge in a chosen field of study(2) To analyze and integrate research literature in the field(3) To apply the sociological perspective to the research project(4) To strengthen research methods skills (5) To complete a research report in an appropriate format", "syllabus": "There will be weekly trainings for various stages of research and thesis writing, including but not limited to the following: 1 Formulating research questions2 Literature review3 Conceptualization4 Research design and timeline5 Data and method6 Data analysis7 Thesis writing: structuring, drafting and revisingIn addition, the instructor will be available for individual consultations.", "required_readings": "A list of readings will be worked out by the Supervisor according to the choice of subject/field.", "recommended_readings": "A list of readings will be worked out by the Supervisor according to the choice of subject/field.", "terms": {"2020-21 Term 2": {"AJ01-PRJ (1324)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [5], "locations": ["TBA"], "instructors": ["Staff"]}, "BJ01-PRJ (1321)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [5], "locations": ["TBA"], "instructors": ["Staff"]}, "CJ01-PRJ (1325)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [5], "locations": ["TBA"], "instructors": ["Staff"]}, "DJ01-PRJ (1322)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [5], "locations": ["TBA"], "instructors": ["Staff"]}, "EJ01-PRJ (1326)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [5], "locations": ["TBA"], "instructors": ["Staff"]}, "FJ01-PRJ (1328)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [5], "locations": ["TBA"], "instructors": ["Staff"]}, "GJ01-PRJ (1329)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [5], "locations": ["TBA"], "instructors": ["Staff"]}, "HJ01-PRJ (1323)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [5], "locations": ["TBA"], "instructors": ["Staff"]}, "IJ01-PRJ (1327)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [5], "locations": ["TBA"], "instructors": ["Staff"]}, "JJ01-PRJ (1330)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [5], "locations": ["TBA"], "instructors": ["Staff"]}}}}, {"code": "5645", "title": "Crime and Criminal Justice", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For MA in Sociology students", "description": "The course explores relevant issues in the current conflicting society, particularly in the case of Hong Kong. Using relevant sociological theories and perspectives, students will be engaged in studying prevalent forms of criminal behavior and associated social issues, which have been brought about by rapid social changes.Topics under discussion include the relationship between social development, social forces and crime, ranging from the traditional crime, such as drug abuse, to sophisticated commercial crime and internet crime, such as ‘distributed denial of service attack’, and transnational crime such as money laundering.Social perception, responses and different approaches in the preventive strategies will also be reviewed.", "outcome": "After completing the course, the students should: 1. Have acquired a better knowledge on how criminological theories can help them to understand crime and social issues. 2. Have gained a deeper understanding of the social forces affecting crime and social justice in Hong Kong. 3. Be able to analyze crime and social justice issues theoretically and methodologically 4. Be able to apply sociological perspectives and insights to review, assess and construct measures against crime.", "syllabus": "1. Introduction - An overview of criminological theories, integrative and theoretical implications of crime 2. Study of Crime  3. Different Types of Crime  4. New social perspectives towards crime 5. Crime and Criminal Justice", "required_readings": "Burke, R.H. 2009. An Introduction to Criminological Theory (3rd edition). Devon: Willan Publishing.  Hagan, F.E. 2011. Introduction to Criminology, Theories, Methods and Criminal Behavior. London: SAGE Publications, Inc.  Newburn, T. 2013. Criminology. 2nd Edition. New York: Routledge.  Understanding Criminal Justice in Hong Kong, 2nd edition, edited by Chui W.H. and Lo T.W., Oxon: Routledge.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (1331)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [1], "locations": ["Yasumoto Int'l Acad Park LT5"], "instructors": ["Dr. MOK Wai Yin"]}}}, "assessments": {"Essays": "40", "Essay test or exam": "50", "Others": "10"}}, {"code": "5646", "title": "Organizational Design and Behavior", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For MA in Sociology students", "description": "This course introduces the concepts and theories for understanding the fundamental aspects of organizational design and behavior. A number of issues at the macro level, including organizational structure, external environment, corporate culture, organizational effectiveness will be considered. Major organizational processes, such as power and control, conflict, decision-making, innovation and change will be discussed. At the individual and group level, important topics like job attitudes, motivation, performance, and teamwork will also be covered.", "outcome": "By the end of the course, students are expected to:  1. grasp the major theoretical perspectives in organization studies 2. be familiar with current research in organizational theory and behavior  3. develop critical thinking and conceptual skills to analyze various organizational phenomena  4. be able to apply theories and models to workplace situations", "syllabus": "Part A: Organizational System and Design  - Organizational Structure  - External Environment  - Corporate Culture and Values  - Organizational Effectiveness   Part B: Organizational Processes - Power, Control and Conflict  - Decision-making and Politics  - Innovation and Change    Part C: Organizational Behavior  - Job Attitudes  - Motivation and Performance - Teamwork  - Positive and Counterproductive behavior", "required_readings": "Daft, R. L. 2016. Understanding the Theory and Design of Organizations. 12th Edition. South-Western Cengage Learning.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (9077)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [6], "locations": ["Lee Shau Kee Building LT1"], "instructors": ["Professor NGO Hang Yue"]}}}, "assessments": {"Essays": "40", "Essay test or exam": "50", "Others": "10"}}, {"code": "6001", "title": "Advanced Theory", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in MPhil-PhD Sociology", "description": "This course is primarily intended to give graduate students a detailed introduction to some foundational theoretical questions and positions in sociology. It is centered on the writings of Max Weber, Emile Durkheim, and Karl Marx, supplemented by other (and more recent) theoretical work. The readings and seminar discussions will cover three mains sets of issues: 1) the relationship between the individual and society; 2) the special challenges and problems confronting a science of society; and 3) theoretical accounts of key modern social structures. Secondarily, students will through a series of exercises leading up to a final paper gain practice in the essential skill of “reading and writing with theories.”The course grade will be based on a term paper, which will be assigned a letter grade according to following rubric:The “significant progress” mentioned in the rubric will be judged in reference to the writing exercises completed during the second half of the course but which will not be graded separately.", "outcome": "1. to critically engage with different classical positions on how to conceptualize the connection between individuals and social relations or institutions\r 2. to confront the basic problems of what it means to have a science of society, and how this relates back to social life\r 3. to introduce students to the classic, and some more contemporary, interpretations of large-scale social transformations that characterize “modern” society\r 4. through a series of exercises leading up to a term paper, to train students in the essential skill of “reading and writing with theories”", "syllabus": "", "required_readings": "Bourdieu, Pierre. 1985. “The Social Space and the Genesis of Groups.” Theory and Society 14(6):723–744.\r Bourdieu, Pierre. 1990. The Logic of Practice. Stanford, California: Stanford University Press.\r Bourdieu, Pierre. 1998. Practical Reason: On the Theory of Action. Cambridge: Polity Press.\r Chibber, Vivek. 2017. “Rescuing Class from the Cultural Turn.” Catalyst 1(1):26–55.\r Delphy, Christine. 1993. “Rethinking Sex and Gender.” Women’s Studies International Forum 16(1):1–9.\r Durkheim, Emile. 1982. The Rules of Sociological Method. New York: Free Press.\r Durkheim, Emile. 1984. The Division of Labour in Society. London, Basingstoke: Macmillan.\r Durkheim, Emile. 1995. The Elementary Forms of Religious Life. New York, New York, N.Y. ; London: Free Press, The Free Press.\r Ferguson, Susan. 2016. “Intersectionality and Social-Reproduction Feminisms.” Historical Materialism 24(2):38–60.\r Goffman, Erving. 1959. The Presentation of Self in Everyday Life. Garden City, N.Y.: Doubleday.\r Mann, Michael. 1984. “The Autonomous Power of the State: Its Origins, Mechanisms, and Results.” European Journal of Sociology 25(2):185–213.\r Marx, Karl and Friedrich Engels. 1978. The Marx-Engels Reader. edited by R. C. Tucker. New York: Norton.\r Mills, C. Wright. 1959. The Sociological Imagination. New York: Oxford University Press.\r Tilly, Charles. 1985. “War Making and State Making as Organized Crime.” Pp. 170–91 in Bringing the State Back In, edited by P. Evans, D. Rueschemeyer, and T. Skocpol. Cambridge: Cambridge University Press.\r Walby, Sylvia. 1989. “Theorising Patriarchy.” Sociology 23(2):213–34.\r Weber, Max. 1958. From Max Weber: Essays in Sociology. edited by C. W. Mills and H. H. Gerth. New York: Oxford University Press.\r Weber, Max. 1978. Economy and Society. edited by G. Roth and C. Wittich. Berkeley: University of California Press.\r Weber, Max. 1949. “‘Objectivity’ in Social Science and Social Policy.” Pp. 50–112 in The Methodology of the Social Sciences, edited by E. A. Shils and H. A. Finch. Glencoe, Ill.: The Free Press.\r Weber, Max. 2001. The Protestant Ethic and the Spirit of Capitalism. New York: Routledge.\r West, Candace and Don H. Zimmerman. 1987. “Doing Gender.” Gender & Society 1(2):125–51.\r Wright, Erik Olin. 2005. “Foundations of a Neo-Marxist Class Analysis.” in Approaches to Class Analysis, edited by E. O. Wright. Cambridge: Cambridge University Press.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (4055)": {"startTimes": ["11:30"], "endTimes": ["14:15"], "days": [1], "locations": ["Sino Building 429"], "instructors": ["Professor Mark Simon COHEN"]}}}}, {"code": "6002", "title": "Advanced Methodology", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in MPhil-PhD Sociology", "description": "This is an intensive training course on the logic of theory construction and the logic of evidence building in empirical sociology. The theoretical and evidential logics provide the foundation for the effective use of qualitative and quantitative data analysis alike. The course will provide the tools for clarifying the theoretical and evidential logics of an empirical study and introduce three families of explanatory mechanisms that are relevant to diverse subfields of sociology. Most importantly, the course will develop the competence of students in theory construction and evidence building through learning-by-doing. Much of the course will be devoted to a re-examination of many exemplary works in empirical sociology from each theoretical family. The course will not focus on any philosophical debate or technique of data analysis.", "outcome": "(1) Ability to (a) identify the logic of theory construction and the logic of evidence building of a publication in empirical sociology and (b) critically evaluate them, including the match between the theoretical logic and the evidence.\r (2) Ability to apply the theoretical and empirical logics to clearly present an original research problem and a proposal to empirically study it.\r (3) Practice in the formal presentation of empirical research results.", "syllabus": "", "required_readings": "", "recommended_readings": "Main Text for Empirical Methods\r Gary King, Robert O. Keohane, Sidney Verba. 1994. Designing Social Inquiry: Scientific Inference in Qualitative Research. Princeton University Press.\r  Advanced Reference Text for Empirical Methods\r Stephen L. Morgan, and Christopher Winship. 2007. Counterfactuals and Causal Inference: Methods and Principles for Social Research. New York: Cambridge University Press.", "terms": {"2020-21 Term 1": {"--LEC (1538)": {"startTimes": ["11:30"], "endTimes": ["14:15"], "days": [3], "locations": ["No Room Required"], "instructors": ["Professor ZHU Ling"]}}}, "assessments": {"Presentation": "30", "Participation": "20", "Short answer test or exam": "50"}}, {"code": "6003", "title": "Advanced Statistical Analysis", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in MPhil-PhD Sociology", "description": "This course will cover techniques dealing with linear and nonlinear models, including OLS regression, logistic regression and Poisson regression. The objective is to enable students to analyze different types of data. Advanced modeling techniques, such as fixed and random-effects models and event history analysis will also be briefly discussed. Students will be required to use some of these methods to perform analysis on real data.", "outcome": "Course Objectives:\r (1) To understand the logic of statistical analysis\r (2) To acquire skills on data management\r (3) To evaluate the quality of a statistical report\r (4) To perform statistical analysis", "syllabus": "", "required_readings": "", "recommended_readings": "References\r Allison, P.D. 1999. Multiple Regression: A Primer. Newbury Park, CA: Sage.\r Allison, P.D. 2009. Fixed Effects Regression Models. Los Angeles: Sage.\r Freund, R.J., Wilson, W.J., and Sa, P. 2006. Regression Analysis: Statistical Modeling of a Response Variable, 2nd edition. Burlington, MA: Academic Press.\r Kahane, L.H. 2001. Regression Basics. CA: Sage.\r Kleinbaum, D.G., Kupper, L.L., Muller, K.E., and Nizam, A. 1998. Applied Regression Analysis and Other Multivariable Methods, 3rd edition. Duxbury Press. \r Knoke, D & Bohrnstedt, G.W. 1994. Statistics for Social Data Analysis, 3rd edition. F.E. Peacock.\r MacKinnon, D.P. 2008. Introduction to Statistical Mediation Analysis. New York: Lawrence Erlbaum Associates.\r Pampel, FC. 2000. Logistic Regression: A Primer. Thousand Oaks, CA: Sage. \r Yamaguchi, K. 1991. Event History Analysis. Newbury Park, CA: Sage Publications.", "terms": {"2020-21 Term 2": {"--LEC (3670)": {"startTimes": ["11:30"], "endTimes": ["14:15"], "days": [1], "locations": ["Sino Building 429"], "instructors": ["Professor JIN Lei"]}}}, "assessments": {"Essays": "40", "Homework or assignment": "30", "Short answer test or exam": "30"}}, {"code": "6004", "title": "Advanced Qualitative Methods", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in MPhil-PhD Sociology", "description": "This course examines qualitative methods used in social science research. Since qualitative research is both an ‘analytic mentality’ and a set of practical skills, the course will focus both discussions of key methodological and empirical readings as well as on practical skills, such as case and informant selection, field experiences, interview techniques, writing field notes, and analyzing and writing qualitative data. The course is in a seminar format. Lectures will be interwoven with discussions. Students are also required to conduct a small-scale pilot qualitative research project using the skills discussed in the seminar.", "outcome": "Students in this course should study and demonstrate understanding of the following: the discipline of sociology and its role in contributing to our understanding of social order and its changes; the role of theory in sociology; the role of evidence and qualitative methods in sociology; basics concepts in sociology and their fundamental theoretical interrelations; critical thinking; further develop transferable skills beyond disciplinary requirements; development of values, such that the student will see the utility of the sociological perspective as a useful and meaningful perspective on social reality and individual biography, for reflection of value positions and life choices.", "syllabus": "", "required_readings": "Silverman, D. (2014). Interpreting Qualitative Data (Fifth ed.). London: Sage.", "recommended_readings": "Emerson, R. M., Fretz, R. I., & Shaw, L. L. (2011 [1995]). Writing Ethnographic Fieldnotes (Second ed.). Chicago, IL: University of Chicago Press. \r  Silverman, D. (2013).A Very Short, Fairly Interesting, and Reasonably Cheap Book about Qualitative Research (Second ed.). London: Sage.\r  Weiss, R. S. (1994). Learning from Strangers: The Art and Method of Qualitative Interview Studies. New York: Free Press.", "terms": {"2020-21 Term 2": {"--LEC (1579)": {"startTimes": ["11:30"], "endTimes": ["14:15"], "days": [3], "locations": ["Sino Building 429"], "instructors": ["Professor Christian W. K. GREIFFENHAGEN"]}}}, "assessments": {"Essays": "0", "Fieldwork or field study": "0", "Homework or assignment": "0", "Presentation": "0"}}, {"code": "6010", "title": "Guided Studies I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in PhD Sociology", "description": "With permission of the Supervisor, a student will pursue a subject/field in Sociology in consultation with and under the supervision of the Supervisor. The subject/field selected must be different from the student's thesis research. The content of the course will be individually determined.", "outcome": "Learning outcomes will be developed by the Supervisor according to the subject/field selected.", "syllabus": "", "required_readings": "", "recommended_readings": "A list of readings will be worked out by the Supervisor according to the choice of subject/field.", "terms": {"2020-21 Term 1": {"AF01-FLD (3490)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHAN King Chi"]}, "BF01-FLD (3452)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHEUNG Wai Ting"]}, "CF01-FLD (1610)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHOI Yuk Ping"]}, "DF01-FLD (3980)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor Mark Simon COHEN"]}, "EF01-FLD (1609)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor SHEN Wensong, \n\rProfessor TONG Yuying"]}, "FF01-FLD (1611)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor Christian W. K. GREIFFENHAGEN"]}, "GF01-FLD (3453)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor JIN Lei"]}, "HF01-FLD (3979)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor SONG Jing"]}, "IF01-FLD (1612)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor SUEN Yiu Tung"]}, "JF01-FLD (1613)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor TAM Hong Wing"]}, "KF01-FLD (1615)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Staff"]}, "LF01-FLD (3454)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor TONG Yuying"]}, "MF01-FLD (2665)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor WONG Suk Ying Veronica"]}, "NF01-FLD (2279)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor ZHONG Hua"]}, "OF01-FLD (1614)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor TAM Hong Wing"]}, "PF01-FLD (2212)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor Mark Simon COHEN, \n\rProfessor ZHONG Hua"]}, "QF01-FLD (2213)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor SONG Jing, \n\rProfessor ZHONG Hua"]}, "RF01-FLD (1616)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Staff"]}}, "2020-21 Term 2": {"AF01-FLD (3593)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN King Chi"]}, "BF01-FLD (3568)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEUNG Wai Ting"]}, "CF01-FLD (1673)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHOI Yuk Ping"]}, "DF01-FLD (4090)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Mark Simon COHEN"]}, "EF01-FLD (1674)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}, "FF01-FLD (1675)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Christian W. K. GREIFFENHAGEN"]}, "GF01-FLD (3569)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor JIN Lei"]}, "HF01-FLD (4089)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SONG Jing"]}, "IF01-FLD (1677)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SUEN Yiu Tung"]}, "JF01-FLD (1678)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor TAM Hong Wing"]}, "KF01-FLD (1676)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}, "LF01-FLD (3570)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor TONG Yuying"]}, "MF01-FLD (2712)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Suk Ying Veronica"]}, "NF01-FLD (2320)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor ZHONG Hua"]}, "OF01-FLD (1679)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor TAM Hong Wing"]}, "PF01-FLD (2233)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Mark Simon COHEN, \n\rProfessor ZHONG Hua"]}, "QF01-FLD (2234)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SONG Jing, \n\rProfessor ZHONG Hua"]}, "RF01-FLD (1680)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}}}, {"code": "6020", "title": "Guided Studies II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in PhD Sociology;Prerequisite: SOCI6010", "description": "With permission of the Supervisor, a student will pursue a subject/field in Sociology in consultation with and under the supervision of the Supervisor. The subject/field selected must be different from the student's thesis research. The content of the course will be individually determined. (Pre-requisite: SOCI6010)", "outcome": "Learning outcomes will be developed by the Supervisor according to the subject/field selected.", "syllabus": "", "required_readings": "", "recommended_readings": "A list of readings will be worked out by the Supervisor according to the choice of subject/field.", "terms": {"2020-21 Term 1": {"AF01-FLD (3524)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHAN King Chi"]}, "BF01-FLD (3456)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHEUNG Wai Ting"]}, "CF01-FLD (1618)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHOI Yuk Ping"]}, "DF01-FLD (3982)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor Mark Simon COHEN"]}, "EF01-FLD (1640)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Staff"]}, "FF01-FLD (1641)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor Christian W. K. GREIFFENHAGEN"]}, "GF01-FLD (3457)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor JIN Lei"]}, "HF01-FLD (3981)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor SONG Jing"]}, "IF01-FLD (1638)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor SUEN Yiu Tung"]}, "JF01-FLD (1639)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor TAM Hong Wing"]}, "KF01-FLD (1617)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Staff"]}, "LF01-FLD (3455)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor TONG Yuying"]}, "MF01-FLD (2666)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor WONG Suk Ying Veronica"]}, "NF01-FLD (2296)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor ZHONG Hua"]}, "OF01-FLD (1643)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor TAM Hong Wing"]}, "PF01-FLD (2215)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor Mark Simon COHEN, \n\rProfessor ZHONG Hua"]}, "QF01-FLD (2214)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor SONG Jing, \n\rProfessor ZHONG Hua"]}, "RF01-FLD (1642)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Staff"]}}, "2020-21 Term 2": {"AF01-FLD (3630)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN King Chi"]}, "BF01-FLD (3571)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEUNG Wai Ting"]}, "CF01-FLD (1697)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHOI Yuk Ping"]}, "DF01-FLD (4091)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Mark Simon COHEN"]}, "EF01-FLD (1698)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SHEN Wensong, \n\rProfessor TONG Yuying"]}, "FF01-FLD (1699)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Christian W. K. GREIFFENHAGEN"]}, "GF01-FLD (3572)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor JIN Lei"]}, "HF01-FLD (4092)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SONG Jing"]}, "IF01-FLD (1700)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SUEN Yiu Tung"]}, "JF01-FLD (1701)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor TAM Hong Wing"]}, "KF01-FLD (1702)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}, "LF01-FLD (3573)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor TONG Yuying"]}, "MF01-FLD (2713)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Suk Ying Veronica"]}, "NF01-FLD (2319)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor ZHONG Hua"]}, "OF01-FLD (1703)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor TAM Hong Wing"]}, "PF01-FLD (2256)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Mark Simon COHEN, \n\rProfessor ZHONG Hua"]}, "QF01-FLD (2255)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SONG Jing, \n\rProfessor ZHONG Hua"]}, "RF01-FLD (1704)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}}}, {"code": "8003", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in MPhil-PhD Sociology", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student’s academic progress.", "outcome": "To be worked out by Supervisor and student.", "syllabus": "To be worked out by Supervisor and student.", "required_readings": "To be worked out by Supervisor and student.", "recommended_readings": "To be worked out by Supervisor and student.", "terms": {"2020-21 Term 1": {"AM01-TMC (3566)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHAN King Chi"]}, "BM01-TMC (3686)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHEUNG Wai Ting"]}, "CM01-TMC (1428)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHOI Yuk Ping"]}, "DM01-TMC (2023)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor Mark Simon COHEN"]}, "EM01-TMC (1429)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Staff"]}, "FM01-TMC (1434)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor Christian W. K. GREIFFENHAGEN"]}, "GM01-TMC (3685)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor JIN Lei"]}, "HM01-TMC (2022)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor SONG Jing"]}, "IM01-TMC (1432)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor SUEN Yiu Tung"]}, "JM01-TMC (1433)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor TAM Hong Wing"]}, "KM01-TMC (1430)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Staff"]}, "LM01-TMC (3687)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor TONG Yuying"]}, "MM01-TMC (2667)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor WONG Suk Ying Veronica"]}, "NM01-TMC (2295)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor ZHONG Hua"]}, "OM01-TMC (1427)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor TAM Hong Wing"]}, "PM01-TMC (2075)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor Mark Simon COHEN, \n\rProfessor ZHONG Hua"]}, "QM01-TMC (2074)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor SONG Jing, \n\rProfessor ZHONG Hua"]}, "RM01-TMC (1431)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Staff"]}}, "2020-21 Term 2": {"AM01-TMC (3671)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN King Chi"]}, "BM01-TMC (3795)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEUNG Wai Ting"]}, "CM01-TMC (1479)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHOI Yuk Ping"]}, "DM01-TMC (2006)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Mark Simon COHEN"]}, "EM01-TMC (1481)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}, "FM01-TMC (1478)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Christian W. K. GREIFFENHAGEN"]}, "GM01-TMC (3796)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor JIN Lei"]}, "HM01-TMC (2005)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SONG Jing"]}, "IM01-TMC (1482)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SUEN Yiu Tung"]}, "JM01-TMC (1483)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor TAM Hong Wing"]}, "KM01-TMC (1480)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}, "LM01-TMC (3797)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor TONG Yuying"]}, "MM01-TMC (2714)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Suk Ying Veronica"]}, "NM01-TMC (2318)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor ZHONG Hua"]}, "OM01-TMC (1484)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor TAM Hong Wing"]}, "PM01-TMC (2050)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Mark Simon COHEN, \n\rProfessor ZHONG Hua"]}, "QM01-TMC (2051)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SONG Jing, \n\rProfessor ZHONG Hua"]}, "RM01-TMC (1485)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}}}, {"code": "8006", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "6.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in MPhil-PhD Sociology", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student’s academic progress.", "outcome": "To be worked out by Supervisor and student.", "syllabus": "To be worked out by Supervisor and student.", "required_readings": "To be worked out by Supervisor and student.", "recommended_readings": "To be worked out by Supervisor and student.", "terms": {"2020-21 Term 1": {"AM01-TMC (3567)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHAN King Chi"]}, "BM01-TMC (3689)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHEUNG Wai Ting"]}, "CM01-TMC (1498)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHOI Yuk Ping"]}, "DM01-TMC (2024)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor Mark Simon COHEN"]}, "EM01-TMC (1499)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor SHEN Wensong, \n\rProfessor TONG Yuying"]}, "FM01-TMC (1500)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor Christian W. K. GREIFFENHAGEN"]}, "GM01-TMC (3688)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor JIN Lei"]}, "HM01-TMC (2025)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor SONG Jing"]}, "IM01-TMC (1501)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor SUEN Yiu Tung"]}, "JM01-TMC (1502)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor TAM Hong Wing"]}, "KM01-TMC (1436)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Staff"]}, "LM01-TMC (3690)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor TONG Yuying"]}, "MM01-TMC (2663)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor WONG Suk Ying Veronica"]}, "NM01-TMC (2282)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor ZHONG Hua"]}, "OM01-TMC (1497)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor TAM Hong Wing"]}, "PM01-TMC (2076)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor Mark Simon COHEN, \n\rProfessor ZHONG Hua"]}, "QM01-TMC (2094)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor SONG Jing, \n\rProfessor ZHONG Hua"]}, "RM01-TMC (1435)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Staff"]}}, "2020-21 Term 2": {"AM01-TMC (3672)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN King Chi"]}, "BM01-TMC (3798)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEUNG Wai Ting"]}, "CM01-TMC (1546)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHOI Yuk Ping"]}, "DM01-TMC (2007)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Mark Simon COHEN"]}, "EM01-TMC (1545)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SHEN Wensong, \n\rProfessor TONG Yuying"]}, "FM01-TMC (1547)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Christian W. K. GREIFFENHAGEN"]}, "GM01-TMC (3799)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor JIN Lei"]}, "HM01-TMC (2008)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SONG Jing"]}, "IM01-TMC (1549)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SUEN Yiu Tung"]}, "JM01-TMC (1550)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor TAM Hong Wing"]}, "KM01-TMC (1551)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}, "LM01-TMC (3800)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor TONG Yuying"]}, "MM01-TMC (2710)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Suk Ying Veronica"]}, "NM01-TMC (2317)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor ZHONG Hua"]}, "OM01-TMC (1552)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor TAM Hong Wing"]}, "PM01-TMC (2070)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Mark Simon COHEN, \n\rProfessor ZHONG Hua"]}, "QM01-TMC (2069)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SONG Jing, \n\rProfessor ZHONG Hua"]}, "RM01-TMC (1548)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}}}, {"code": "8012", "title": "Thesis Research", "career": "Postgraduate - Research", "units": "12.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Div of Sociology", "requirements": "For students in MPhil-PhD Sociology", "description": "In this course, a student is required to meet with his/her supervisor regularly who provides necessary guidance and supervision to write up a thesis and monitors the student’s academic progress.", "outcome": "To be worked out by Supervisor and student.", "syllabus": "To be worked out by Supervisor and student.", "required_readings": "To be worked out by Supervisor and student.", "recommended_readings": "To be worked out by Supervisor and student.", "terms": {"2020-21 Term 1": {"AM01-TMC (3568)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHAN King Chi"]}, "BM01-TMC (3693)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHEUNG Wai Ting"]}, "CM01-TMC (1508)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHOI Yuk Ping"]}, "DM01-TMC (2027)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor Mark Simon COHEN"]}, "EM01-TMC (1509)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Staff"]}, "FM01-TMC (1507)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor Christian W. K. GREIFFENHAGEN"]}, "GM01-TMC (3692)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor JIN Lei"]}, "HM01-TMC (2026)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor SONG Jing"]}, "IM01-TMC (1505)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor SUEN Yiu Tung"]}, "JM01-TMC (1506)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor TAM Hong Wing"]}, "KM01-TMC (1504)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Staff"]}, "LM01-TMC (3691)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor TONG Yuying"]}, "MM01-TMC (2664)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor WONG Suk Ying Veronica"]}, "NM01-TMC (2281)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor ZHONG Hua"]}, "OM01-TMC (1503)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor TAM Hong Wing"]}, "PM01-TMC (2095)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor Mark Simon COHEN, \n\rProfessor ZHONG Hua"]}, "QM01-TMC (2096)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor SONG Jing, \n\rProfessor ZHONG Hua"]}, "RM01-TMC (1510)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Staff"]}}, "2020-21 Term 2": {"AM01-TMC (3673)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN King Chi"]}, "BM01-TMC (3803)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHEUNG Wai Ting"]}, "CM01-TMC (1557)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHOI Yuk Ping"]}, "DM01-TMC (2009)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Mark Simon COHEN"]}, "EM01-TMC (1585)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}, "FM01-TMC (1553)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Christian W. K. GREIFFENHAGEN"]}, "GM01-TMC (3802)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor JIN Lei"]}, "HM01-TMC (2010)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SONG Jing"]}, "IM01-TMC (1554)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SUEN Yiu Tung"]}, "JM01-TMC (1555)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor TAM Hong Wing"]}, "KM01-TMC (1586)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}, "LM01-TMC (3801)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor TONG Yuying"]}, "MM01-TMC (2711)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Suk Ying Veronica"]}, "NM01-TMC (2306)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor ZHONG Hua"]}, "OM01-TMC (1587)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor TAM Hong Wing"]}, "PM01-TMC (2071)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Mark Simon COHEN, \n\rProfessor ZHONG Hua"]}, "QM01-TMC (2072)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SONG Jing, \n\rProfessor ZHONG Hua"]}, "RM01-TMC (1556)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}}}]