[{"code": "2012", "title": "China, the US and the Global Political Economy", "career": "Undergraduate", "units": "6.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Social Science", "requirements": "", "description": "The Brown-CUHK Summer Institute 2012 is an eight-week summer programme. Theme of the programme this year is China, the US and the Global Political Economy. Students will spend 4 weeks in The Chinese University of Hong Kong (CUHK) and 4 weeks in Brown University, USA. In the first part of the programme, students will attend lectures at CUHK and a study trip to Beijing. Students will focus on the analysis of China’s changing role and impact in the global political and economic system, and examination of China’s evolving ties with other major global and regional actors. The second part of the programme will take place in the Brown University, including field trips to Washington DC and New York City. Students will learn in the context of American hegemonic dominance and try to explore the impact of the rise of China on the US-China relationship and the world economy as a whole.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2013", "title": "China and the Global Political Economy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Social Science", "requirements": "", "description": "The Brown-CUHK Summer Institute 2012 is an eight-week summer programme. Theme of the programme this year is China, the US and the Global Political Economy. Students will spend 4 weeks in The Chinese University of Hong Kong (CUHK) and 4 weeks in Brown University, USA. In the first part of the programme, students will attend lectures at CUHK and a study trip to Beijing. Students will focus on the analysis of China’s changing role and impact in the global political and economic system, and examination of China’s evolving ties with other major global and regional actors. The course “China and the Global Political Economy” covers the first part of the Brown-CUHK Summer Institute 2012 programme.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]