[{"code": "6101", "title": "Research Method in Sports Science and Physical Activity", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in Master of Education; MSc Exercise Science; MPhil Sports Sci & Phys Edu; MA\nSports Studies; MSc Sports Sci & Phy Activity and PhD Education", "description": "This course is designed as an introduction to basic research methods that are applicable to Sports Science and Physical Activity. It will enable students to acquire the necessary knowledge and skills to familiarize themselves with the topic and to conduct a research project in the discipline of Sports Science and Physical Activity. It is complementary to all advanced theoretical courses of the programme. Students will gain the competency to conduct a research project which may be submitted for publication in academic journals. E-learning platforms using the flipped classroom approach and blackboard are mandatory.", "outcome": "After taking this course, students will be able to \r • demonstrate the knowledge and understand the principles and practices of acquiring knowledge and solving problems through research; • use various research methods in examining a topic in sports and exercise science; • employ online databases for academic research; • analyze and evaluate the quality of studies published in peer-reviewed journals", "syllabus": "• Introduction to research in physical activity \r • Using the literature and developing the problem\r • Experimental and quasi-experimental research\r • Ethical issues in research and scholarship\r • Physical activity epidemiology research\r • Survey and descriptive research\r • Qualitative & Quantitative research\r • The research proposal\r • Results and discussion\r • Ways of reporting research", "required_readings": "Johnson, B., & Christensen, L. (2013). Educational research: Quantitative, qualitative, and mixed approaches (5th ed.). Thousand Oaks, CA: Sage.", "recommended_readings": "• Baumgartner T.A. & Hensley L. (2006) Conducting and Reading Research in Health and Human Performance (4th Ed.). New York: McGraw-Hill.\r • Beach, D.P. and Alvager, T.K.E. (1992) Handbook for Scientific and Technical Research. Englewood Cliffs: Prentice-Hall.\r • Bell, J. (2005) Doing Your Research Project: A Guide for First-Time Researchers in Education and Social Science (4th Ed.). Open University Press. \r • Berg, K.E. and Latin, R.W. (2008) Essentials of Modern Research Methods in Health, Physical Education and Recreation. Lippincott Williams & Wilkins. \r • Cicciarella, C.F. (1997) Research in Physical Education, Exercise Science, and Sport: An Introduction. Arizona: Gorsuch Scarisbrick.\r • DeVellis, R.F. (2011) Scale Development: Theory and Applications (2nd ed.). Thousand Oaks, CA: Sage.\r • Gratton, C., & Jones, I. (2010) Research Methods for Sport Studies. London: Routledge.\r • Greenhalgh, T. (2010) How to Read a Paper: the Basics of Evidence-based Medicine. 4th Edition. BMJ Publishing Group. \r • Gustavii, B. (2008) How to Write and Illustrate a Scientific Paper (2nd Ed.). Cambridge University Press. \r • Hyllegard, R., Mood, D.P. and Morrow, J.R. (1996) Interpreting Research in Sport and Exercise Science. St. Louis: Mosby.\r • Jadad A.R. and Enkin M. (2008) Randomized Controlled Trials. Questions, Answers, and Musings (2nd Ed.). Blackwell Publishing.\r • Neutens, J.J. and Rubinson L. (2013) Research Techniques for the Health Sciences(5th Ed.). Pearson Education. \r • Polit, D.F., Tatano B.C. and Hungler, B.P. (2006) Critiquing Research Reports. In Essentials of Nursing Research: Methods, Appraisal, and Utilization (5th ed.). Philadelphia: Lippincott.\r • Portney, L.G. and Watkins, M.P. (2009) Foundations of Clinical Research: Applications to Practice. 3rd Ed. Upper Saddle River, N.J.: Pearson/Prentice Hall.\r • Vincent, W. J., & Weir, J. P. (2012). Statistics in kinesiology (4th ed.). Champaign, IL: Human Kinetics.", "terms": {"2020-21 Term 1": {"--LEC (1595)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [2], "locations": ["Wong Foo Yuan Bldg LT4"], "instructors": ["Dr. John Timothy O'REILLY"]}}}, "assessments": {"Essays": "50", "Presentation": "20", "Short answer test or exam": "30"}}, {"code": "6102", "title": "Research Colloquia", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MSc Sports Sci & Phy Activity", "description": "This course is designed to facilitate the development of graduate students’ research interests and ideas, and to build a community of collaborative research projects. The course provides a platform for teachers and graduate students to discuss and generate ideas on issues related to a variety of sports science and physical activity research topics. Students will present an in-depth study of a research topic of their choice, discuss issues among graduate students, teachers, and with invited experts in the field of research. Class formats include research presentation, discussion, debate and problem solving on selected issues. In the Research Colloquia, students are given an opportunity to integrate their knowledge, skills and practical experience gained in the program.", "outcome": "• To apply the knowledge and theories in scientific research to critically evaluate research projects; • To present research ideas & methodology, with support of relevant literature and rationales in an effective and systematic manner; • To generate realistic and feasible research projects through collaborative resources and partnership.", "syllabus": "• Discussion on scientific approach of knowledge exploration; • Understanding and reflection of quantitative research design and interpretation; • Understanding and reflection of qualitative research design and interpretation; • Appreciation of research methodologies in other disciplines • Communication of various research problems as it related to internal and external validity, as well as reliability; • Selection of appropriate outcome measures, discussion on pros and cons, and practical consideration; • Acquire knowledge and skills in performing professional academic presentation and communication", "required_readings": "Thomas, J.R., Nelson, J.K., & Silverman, S.J. (2015) Research Methods in Physical Activity, Champaign, IL: Human Kinetics (7th edition).", "recommended_readings": "• American Psychological Association. (2009). Publication Manual of the American Psychological Association, Sixth Edition. Washington, D.C.: APA. • Armstrong, L.E., & Kraeme W.J. (2016). ACSM's Research Methods, Philadelphia: Wolters Kluwer. • Friedland, A.J., Folt, C.L. (2009). Writing Successful Science Proposals, 2nd Ed., Yale University Press • Berkun, S. (2010). The Myths of Innovation, O'Reilly Media.", "terms": {"2020-21 Term 1": {"--LEC (1340)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 305"], "instructors": ["Professor WONG Heung Sang Stephen"]}}}, "assessments": {"Others": "40", "Presentation": "60"}}, {"code": "6103", "title": "Quantitative and Qualitative Data Management & Analysis in Sports Science and Physical Activity", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in Master of Education; MSc Exercise Science; MPhil Sports Sci & Phys Edu; MA\nSports Studies; MSc Sports Sci & Phy Activity and PhD Education", "description": "The aim of this course is to equip students with the knowledge and skills to collect, input, manage, analyze, and present research data using quantitative and qualitative approaches. By providing students with key concepts and methods of a range of study designs and data analysis approaches, another important objective is to help students understand the methodological details provided in scientific publications. Common quantitative (e.g., analysis of variance, multiple regression approaches) and qualitative methods (e.g., inductive and deductive approaches) will be covered in this course. More advanced methods, such as systematic reviews and meta-analysis, will also be introduced. After completing the course, students will be able to complete data entry, cleaning/coding, select the appropriate analytical methods and conduct analyses independently. Students will also be equipped with the basic skills to present the analyzed data in different modes (e.g., scientific writing, poster presentation, and verbal presentations). Students are expected to possess basic knowledge in research methods within the field of sports science and physical activity, and basic computer skills, prior to taking this course.", "outcome": "After completing the course, students will be able to understand the basic concepts in statistics and qualitative data analysis. They will be able complete data entry, cleaning/coding, select the appropriate analytical methods and conduct analyses independently. Students will also be equipped with the basic skills to present the analyzed data in different modes (e.g., scientific writing, poster presentation, and verbal presentations).", "syllabus": "• Types of data • Importance of proper data management • Data entry and cleaning • Key concepts of quantitative data analyses • Key concepts of qualitative data analyses • Introduction to common statistical methods and techniques • Application of data analytical skills and softwares", "required_readings": "Please refer to the course outline.", "recommended_readings": "• Miles, M., Huberman, A., & Saldaña, J. (2014). Qualitative data analysis: A methods sourcebook (3rd ed.). Thousand Oaks, CA: SAGE Publications. • Verma, J. P. (2016). Sports research with analytical solution using SPSS. New Jersey: John Wiley & Sons.  • Vincent, W., & Weir, J. (2012). Statistics in kinesiology (4th ed.). Champaign, IL: Human Kinetics.", "terms": {"2020-21 Term 2": {"--LEC (1352)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [5], "locations": ["Ho Tim Building M1"], "instructors": ["Dr NG Yau Yin Johan"]}}}, "assessments": {"Essay test or exam": "50", "Homework or assignment": "40", "Presentation": "10"}}, {"code": "6201", "title": "Exercise: Physiology Benefits, Limit and Adaptation", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in Master of Education; MSc Exercise Science; MPhil Sports Sci & Phys Edu; MSc Sports Sci & Phy Activity and PhD Education", "description": "The aim of this course is to provide the students with up-to-date and research-based information for understanding the physiological aspects of exercise. This course will examine the current concepts of energy metabolism and other physiological responses to exercise and training. Emphasis will be placed on the application of such knowledge upon the improvement of exercise performance and upon the promotion of exercise. The students will be provided with hands-on experience of conducting laboratory work which examines the metabolic responses to exercise.", "outcome": "After taking this course, students will be able to: • Understand the acute physiological changes that occur during exercise. • Explain the metabolic responses involved in bioenergetics. • Discuss the relationship between exercise intensity/duration and the physiological responses. • Explain the influence of nutrition on human performance. • Demonstrate the basic laboratory techniques on experimental testing.", "syllabus": "• Introduction to physiology and human performance • Factors influencing exercise performance • Bioenergetics and metabolism • Energy metabolism and fatigue in working muscle • Ergogenic aids and exercise performance • Physiology of sedentary behavior • Sport nutrition and exercise performance • Thermoregulation and exercise performance • Limitations to maximal oxygen uptake", "required_readings": "Kenny, W. L., Wilmore, J. H. and Costill, D. L. (2015) Physiology of sport and exercise (6th Edition) Champaign, IL : Human Kinetics.", "recommended_readings": "• ACSM Health and Fitness Journal • Acta Physiologica Scandinavica • American Journal of Clinical Nutrition  • British Journal of Sports Medicine • Canadian Journal of Applied Physiology • European Journal of Applied Physiology • European Journal of Sport Science • Exercise and Sports Science Reviews • International Journal of Sports Medicine • International Journal of Sports Nutrition and Exercise Metabolism • Journal of Applied Physiology  • Journal of Science and Medicine in Sport • Journal of Sports Science • Journal of Physiology  • Medicine and Science in Sports and Exercise • Physician and Sportsmedicine  • Scandinavian Journal of Medicine and Science in Sports • Sports Medicine • ACSM | The American College of Sports Medicine  • www.acsm.org/ • Australian Institute of Sport • http://www.ais.org.au/physiology/index.asp • The Gatorade Sports Science Institute • http://www.gssiweb.org/en • The Nestlé Nutrition Institute • http://www.nestlenutrition-institute.org/Pages/default.aspx • Sport Performance & Science Reports • https://sportperfsci.com/", "terms": {"2020-21 Term 1": {"--LEC (1118)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [4], "locations": ["Lee Shau Kee Building LT2"], "instructors": ["Dr. John Timothy O'REILLY, \n\rProfessor WONG Heung Sang Stephen"]}}}, "assessments": {"Lab reports": "20", "Others": "10", "Presentation": "20", "Short answer test or exam": "50"}}, {"code": "6202", "title": "Sports Nutrition for Health and Performance", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in Master of Education; MSc Exercise Science; MPhil Sports Sci & Phys Edu; MA\nSports Studies; MSc Sports Sci & Phy Activity and PhD Education", "description": "The aim of this course is to provide students with a sound understanding of the basic principles of human nutrition, and to build on this to cover in greater depth issues relating to the interactions between nutrition and exercise. The course will cover both the role of nutrition and exercise in a healthy lifestyle and nutrition for sports performance. Contents will include factors influencing sports performance, food intake and energy balance during rest, exercise and recovery; influence of nutrients on exercise performance; fluid balance and performance; protein nutrition and strength; and nutritional supplements. Practical work will be used to illustrate the topics covered in lectures, and written practical reports will be required.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6203", "title": "Health Related Physical Activity", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Early Childhood Education; Master of Education; MSc Exercise Science; MPhil Sports Sci & Phys Edu; MA Sports Studies; MSc Sports Sci & Phy Activity and PhD Education", "description": "This course is intended to provide students with knowledge on health benefits of physical activity/inactivity from a behavioral epidemiological perspective. Students’ learning experience will be oriented on original research and significant authority reports. In addition, students will be enlightened in relation to assessment of lifestyle physical activity as well as the multilevel influencing factors of physical activity behaviors not only in a global but also in a local perspective. The practical part of this course enables students to get acquainted with the widely applied objective physical activity measurement monitors in the field. By applying the knowledge, students will be able to understand the significance and difficulties of promoting physical activity in our daily lives.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6204", "title": "Advances in Physical Fitness Assessment: Theory and Practice", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in Master of Education; MSc Exercise Science; MPhil Sports Sci & Phys Edu; MA\nSports Studies; MSc Sports Sci & Phy Activity and PhD Education", "description": "Keeping physically active and fit has been proven to be an effective strategy for improving one's quality of life, as well as preventing and treating chronic diseases. Physical fitness assessment is an indispensable part of an athletes training regimen. Hence, periodical assessment and evaluation of one's physical fitness level, becomes a fundamental part in maintaining and evaluating one's health. Knowledge, skill and the ability to conduct advanced fitness testing are essential requirements for most sports science research. This course is designed to enhance students' understanding of current trends in physical fitness evaluation, as well as to ascertain the skills and abilities needed to conduct advanced fitness testing. Subject matter related to theories, rationales, laboratory skills, and measurement techniques in current health and fitness evaluation will be discussed. This course is particularly useful for postgraduate students, as it will provide the fundamental and advanced knowledge and competency needed for their future health-related research projects. Lectures, group discussion, and laboratory experience are all expected.", "outcome": "After taking this course, students will be able to --  • identify major disciplines and elements of physical fitness tests; • stratify exercise participants into risk categories; • perform pre-exercise screening and preparation procedures; • perform physical fitness tests in a safe and skillful manner; • compute metabolic demands such as exercise intensity, energy expenditure, and VO2max from various forms of exercise; • critically evaluate the effectiveness of fitness tests in terms of validity, reliability, objectively, and practicality; • modify fitness test protocols in order to cater the needs of different populations.", "syllabus": "• Association between physical activity, fitness, and health; • Pre-exercise screening and risk stratification; • Objectives and procedures of conducting health-related fitness tests; • Test selection concern: validity, reliability, objectivity; practicality; • Exercise testing for assessing cardiovascular fitness; • Testing using treadmills, cycle ergometer, bench stepping; • Laboratory and field testing protocols; • Calculation of metabolic demands in terms of HR, VO2, and energy expenditures; • Use and interpretation of electrocardiogram (EKG); • Tests for assessing body composition; • Tests for assessing muscular fitness; • Test for assessing flexibility; • Fitness tests for various populations – children, elderly, disciplinary officers; • Modification of fitness tests.", "required_readings": "• American College of Sports Medicine. (2017). ACSM's Guidelines for Exercise Testing and Prescription (10th ed.). Baltimore, MD: Baltimore, MD: Wolter Kluwers / Lippincott Williams & Wilkins. • Heyward. V.H. (2010). Advanced Fitness Assessment and Exercise Prescription (6th ed.). Champaign, IL: Human Kinetics.", "recommended_readings": "• 許世全 (2014). 實用體適能測試與評估。香港：陳湘記。 • Heyward. V.H. (2010). Advanced Fitness Assessment and Exercise Prescription (6th ed.). Champaign, IL: Human Kinetics. • American College of Sports Medicine. (2015). ACSM's Health-related Physical Fitness Assessment Manual. (5th ed.). Baltimore, MD: Wolter Kluwers / Lippincott Williams & Wilkins", "terms": {"2020-21 Term 2": {"--LEC (1798)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [4], "locations": ["Y.C. Liang Hall 103"], "instructors": ["Professor HUI Sai Chuen"]}}}, "assessments": {"Essay test or exam": "40", "Others": "10", "Short answer test or exam": "50"}}, {"code": "6205", "title": "Structural Biomechanics and Sports Injury", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in Master of Education; MSc Exercise Science; MPhil Sports Sci & Phys Edu; MSc Sports Sci & Phy Activity and PhD Education", "description": "This course examines the structure and function of the human body with a particular emphasis being provided on the aetiology of various common sporting injuries. Mechanical properties of connective tissue and muscle will be reviewed with a focus on: (1) tissue adaptation with physical activity and exercise, and (2) tissue failure in response to improper acute or chronic mechanical loading during sporting endeavors. Approaches that are used to examine the mechanisms of various sporting injuries will be discussed.", "outcome": "At the completion of this course, students will be able to: • Identify the structure and function of the human body • Understand the mechanical properties of human biological tissue • Understand how tissues adapt to loading • Understand the pathophysiology of injury • Understand the mechanism of selected common sports injuries.", "syllabus": "• Structure of the human body • Mechanical behaviour of biological tissues • Tissue adaptation and pathophysiology of injury • Mechanisms of acute sporting injuries", "required_readings": "Please refer to the course outline.", "recommended_readings": "Please refer to the course outline.", "terms": {"2020-21 Term 2": {"--LEC (1353)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [3], "locations": ["Pending"], "instructors": ["Professor YANG Yijian"]}}}, "assessments": {"Examination": "40", "Presentation": "15", "Project": "45"}}, {"code": "6206", "title": "Biomechanics of Sports and Physical Activity", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in Master of Education; MSc Exercise Science; MPhil Sports Sci & Phys Edu; MA\nSports Studies; MSc Sports Sci & Phy Activity and PhD Education", "description": "This course provides an overview of the key biomechanical concepts that are important for improving physical functioning and sports performance. A background of common quantitative biomechanical measurement techniques (motion analysis, electromyography, force plates, and other measurement devices) is provided so that students can understand background concepts and also read the related literature with confidence.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6207", "title": "Sports Injury and Rehabilitation", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in Master of Education; MSc Exercise Science; MPhil Sports Sci & Phys Edu; MA\nSports Studies; MSc Sports Sci & Phy Activity and PhD Education", "description": "This course aims to help students acquire knowledge of sports injury and rehabilitation; as well as basic practical skills in assessing, managing and preventing common musculoskeletal injuries associated with sports and exercise participation.", "outcome": "Upon completion of this course, students will be able to:\r • Describe mechanisms of common musculoskeletal injuries associated with sports and exercise participation; • Manage sports injury incidents timely and appropriately; • Describe and apply the evidence-based physical examination for common sports injuries; • Describe and apply the conventional and routine rehabilitative procedures in managing common sports injuries; • Distinguish the difference of medical intervention and conservative rehabilitation for common sports injuries; • Critically inquire different types of therapeutic treatments, protective equipment, products and aids in relation to sports injury prevention and rehabilitation.", "syllabus": "• Introduction of human musculoskeletal system: anatomical structure (skeletal system, joint classification, muscular system and surface marking) and biomechanics (anatomical position, anatomical planes & axes, joint movement, classification of levers, muscle contraction and movement analysis)\r • Introduction to sports injury: incidence & prevalence, classification and aetiology of common sports injury, intrinsic vs extrinsic risk factor, prevention of sports injury and 3 stages of body reaction after sports injury\r • Assessment and management of acute/chronic sports injuries: definition of acute & chronic sports injury, difference between signs & symptoms, “SOAP” principle\r • Physical modalities of sports medicine: hot and cold, ultrasound, electrical stimulation, diathermy, low level laser therapy, magnetic field, anodyne therapy and extracorporeal shock wave therapy\r • Assessing and managing upper limb injuries: shoulder fracture, anterior shoulder dislocation, anterior shoulder pain, shoulder impingement, lateral epicondylitis, medial epicondylitis, carpal tunnel syndrome and De Quervain’s disease\r • Assessing and managing lower limb injuries: knee injury (ACL sprain, meniscus tear), ankle injury (lateral ligament sprain, muscle strain, tendon strain) and plantar fasciitis\r • Assessing and managing back injuries: muscle and ligament strain, intervertebral disc protrusion (PID), intervertebral disc degeneration, spondylosis, spondylolisthesis, radiculopathy and myelopathy\r • Introduction to sports massage & taping demonstration: mechanical, physiological and psychological effect of sports massage, different massage technique, lubricant benefit, elastic vs inelastic bandage taping application", "required_readings": "Brukner, P. and Khan, K. (2017). Brukner & Khan's Clinical Sports Medicine Injuries Vol I, 5th edition. Sydney, McGraw-Hill.", "recommended_readings": "Comfort, P. & Abrahamson, E. (2010). Sports Rehabilitation and Injury Prevention. Oxford, Wiley-Blackwell.", "terms": {"2020-21 Term 1": {"--LEC (1758)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Mr LO King Yuen"]}}}, "assessments": {"Essay test or exam": "40", "Homework or assignment": "30", "Project": "30"}}, {"code": "6208", "title": "Exercise Prescription for General and Special Populations", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in Master of Education; MSc Exercise Science; MPhil Sports Sci & Phys Edu; MSc Sports Sci & Phy Activity and PhD Education", "description": "Effective exercise prescriptions are an essential part of improving one's physical fitness and overall health. However, in order to provide an effective exercise program, exercise prescriptions must be individualized and specific to the participant's unique health conditions. As chronic illnesses, such as coronary heart disease, diabetes, hypertension, obesity, and lower-back disorder, become increasingly prevalent in modern urban settings, exercise prescriptions for the general population should be modified in order to cater to the specific medical indications of specific populations. Given that a regular exercise training program is recognized as good preventative medicine for chronic diseases, this course is designed to introduce information about specialized exercise prescription to meet the needs of general citizens and people with particular medical conditions. Students will be expected to become familiar with exercise prescriptions for general healthy populations and to use this knowledge to design exercise programs for targeted populations with specific chronic diseases.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6209", "title": "Coaching Science", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MPhil Sports Sci & Phys Edu; MSc Sports Sci & Phy Activity and PhD Education", "description": "This course includes the principles and theories on fitness training for health and sports performance and the teaching will use an integrated approach. Emphasis will be placed on the understanding of the fitness components, training and its teaching with the up-to-date science and technologies. In addition, the learning regimes together with the planning and implementation of the appropriate fitness programmes.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6301", "title": "Sports, Pedagogy, and Technology", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Early Childhood Education; Master of Education; MPhil Sports Sci & Phys Edu; MA Sports Studies; MSc Sports Sci & Phy Activity and PhD Education", "description": "The implementation of digital solutions in physical education embraces the basic fundamentals present in various aspects of modern education reform. This undertaking entails using technology to empower students and restructuring the learning process to enhance student engagement. Wearable technology, such as bracelets, adds a visual element to physical activities, thereby providing students with a digital representation of their activity levels. Furthermore, access to online resources enables physical educators to substantially expand what constitutes physical education. Numerous online instructional materials are available for different types of sports and physical activities that can be implemented in class, thereby providing students with a break from the norm. However, digital solutions go beyond merely enhancing the levels of student engagement and altering the curriculum by facilitating the extension of the educators’ influence outside the gymnasium and into the classroom. This course aims to explore and conduct experiment on the benefits and limitations of using technology as a pedagogical tool to conduct sports classes and physical activity sessions in contemporary society.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6302", "title": "Theories and Applications of Motor Learning", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Early Childhood Education; Master of Education; MSc Exercise Science; MPhil Sports Sci & Phys Edu; MSc Sports Sci & Phy Activity and PhD Education", "description": "The course aims to introduce the principles of motor skill learning and how these principles apply in the areas of sports science and physical activity. Emphasis will be placed on the essential concepts in the acquisition of motor skills using a developmental approach. The course will address the overall questions of how people learn motor skills.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6303", "title": "Contemporary Issues in Psychology of Sports and Physical Activity", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in Master of Education; MSc Exercise Science; MPhil Sports Sci & Phys Edu; MA\nSports Studies; MSc Sports Sci & Phy Activity and PhD Education", "description": "This course is designed to cover current topics and issues relevant to psychology of sports and physical activity. Topics include personality, motivation, stress and anxiety, eating disorders, overtraining, aggression, and psychological skills training. Based on key issues, students will learn how to apply theoretical principles and research findings in the sport and physical activity contexts.", "outcome": "Upon the completion of this course, students will be able to: • understand the relationship between personality and behavior in sport and exercise; • explore motivation and individual differences in sport and game behavior; • investigate the major sources of stress and anxiety and how they affect performance; • identify factors that predispose individuals to eating disorders;  • discuss different models and causes of overtraining and burnout; • examine the aggression-performance relationship; and • develop a physical relaxation training program.", "syllabus": "• Basic concepts of psychology of sports and physical activity • Personality • Motivation • Stress and anxiety • Exercise addiction and eating disorders • Aggression • Overtraining and burnout • Psychological skills training", "required_readings": "Weinberg, R. S., & Gould, D. (2015). Foundations of sport and exercise psychology. Champaign, IL: Human Kinetics.", "recommended_readings": "• Gill, D. L., & Williams, L., & Reifsteck, E. (2017). Psychological dynamics of sport and exercise. Champaign, IL: Human Kinetics. • Moran, A. P. (2012). Sport and exercise psychology: A critical introduction. New York: Psychological Press.  • Raab, M., Wylleman, P., Seiler, R., Elbe, A-M., & Hatzigeorgiadis, A. (2016). Sport and exercise psychology research: From theory to practice. San Diego, CA: Academic Press.", "terms": {"2020-21 Term 2": {"--LEC (1799)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [1], "locations": ["Lee Shau Kee Building LT5"], "instructors": ["Professor SIT Hui Ping"]}}}, "assessments": {"Essays": "40", "Project": "35", "Selected response test or exam": "25"}}, {"code": "6304", "title": "Socio-Cultural Issues in Physical Activity", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in Master of Education; MPhil Sports Sci & Phys Edu; MA Sports Studies; MSc Sports Sci & Phy Activity and PhD Education", "description": "This course is designed to examine a number of key areas on how social and cultural influence on physical activity and its related issues. A range of sociological perspectives is utilized in which students can critically examine contemporary concepts of physical activity, physical literacy, sport, exercise and physical education. These areas are chosen to highlight the role, function and meaning which physical activity play in society.", "outcome": "• By the end of the course, all students will be able to demonstrate an understanding of a range of sociological perspectives in physical activity. • All students will develop skill in the application of sociological perspectives of physical activity that will be encountered when they assume future professional roles in related fields. • Write a research paper that critically reflects the major issues facing physical activity in the region or globally today. • Think critically, discuss and construct possible solutions to problems in the field", "syllabus": "• Introduction to the course and the topics to be examined. • Qualitative Research Method and Action Research • Physical Education & Exercise is Medicine – Historical Perspective • PE Teachers' Professional Lives • Exploring School PE in Hong Kong - from Belief to Culture • Ethnography and Phenomenology • Physical Literacy Epidemics • Body Awareness, Hiding Techniques and other concerns • Professional Development and Learning Community", "required_readings": "Please refer to the course outline.", "recommended_readings": "Electronic Journal: • International Review for Sociology of Sport • Sociology of Sport Journal • Qualitative Research in Sport, Exercise and Health • Journal of Sport & Social Issues  Book: • Bergsgard, N. A., Houlihan, B., Mangset, P., Nodland, S. I., Rommetvedt, H. (eds.). (2007). Sport Policy: A Comparative Analysis of Stability and Change. Burlington: Elsevier. • Bloyce, D. and Smith, A. (2010). Sport Policy and Development: An Introduction. Oxon and New York: Routledge.  • Coakley, J. and Dunning, E. (eds.) (2002). Handbook of Sports Studies. London, Thousand Oaks and New Delhi: SAGE Publications. • Coalter, F. (2007). A wider social role for Sport: Who’s keeping the score? London and New York: Routledge. • Critcher, C., Bramham, P., Tomlinson, A. (eds.) (1995). Sociology of Leisure: A reader. London and New York: E & FN Spon. • Giardina, M.D. and Donnelly, M.K. (eds.) (2008) Youth Cultures and Sport: Identity, Power, and Politics. Oxon and New York: Routledge.  • Giulianotti, R. (2005). Sport: A Critical Sociology. Cambridge: Polity Press. • Grant, J. and Maguire, J. (1994). Sport and leisure in social thought. London: Routledge. • Houlihan, B. (1997). Sport, Policy and Politics: A comparative Analysis. London: Routledge. • Jarvie, G. (2012). Sport, Culture and Society (2nd Edition). Oxon and New York: Routledge. • Laker, A. (eds.) (2002). The Sociology of Sport and Physical Education: An Introductory reader. Oxon: Routledge.  • Maguire, J. and Young, K. (2002). Theory, Sport and Society. Amsterdam and New York: JAI  • Nixon II, H. L. and Frey, J. H. (1996). A Sociology of Sport. Belmont: Wadsworth Publishing. • Stebbins, R. A. (2001). New directions in the theory and research of serious leisure. New York: Edwin Mellen Press • Sugden, J. and Tomlinson, A. (2002). Power games: a critical sociology of sport. London and New York: Routledge. • Tomlinson, A. (1999). The game's up: essays in the cultural analysis of sport, leisure and popular culture. Burlington: Ashgate Publishing Limited.", "terms": {"2020-21 Term 1": {"--LEC (1341)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [1], "locations": ["Wu Ho Man Yuen Bldg 505"], "instructors": ["Professor SUM Kim Wai Raymond"]}}}, "assessments": {"Essay test or exam": "30", "Presentation": "20", "Project": "50"}}, {"code": "6305", "title": "Sociological Issues in PE", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in Master of Education; MPhil Sports Sci & Phys Edu; MSc Sports Sci & Phy Activity and PhD Education", "description": "The aim of this advanced course is to examine the theoretical and practical issues surrounding school physical education from a sociological perspective. The objectives are to increase the depth of understanding of what is meant by a critical sociology of physical education and to familiarize the student with the sociology of physical education literature. In addition, the course will critically examine physical education practices in Hong Kong.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6306", "title": "Sport Development and Delivery", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in Master of Education; MPhil Sports Sci & Phys Edu; MA Sports Studies; MSc Sports Sci & Phy Activity and PhD Education", "description": "The course begins by defining sport and other forms of physical activity and discussing the relationship between sport and society, both past and present. The course then examines the difference between sports management and sports development and, in more detail, the scope, purpose, principles and framework of sports development. The course then looks at various sports delivery systems and, in detail, the process of strategic planning for sports development. Strategic planning and sports development models are evaluated during the course. The strategic and developmental plans of selected organizations in the public and private sectors will be discussed.", "outcome": "The module aims to introduce students to the concepts of sports development, sports delivery and strategic planning for sports development; and to provide an overview of the relevant framework and techniques that can be used to analyse contemporary sports development and management issues and critically appraise sports development plans and strategies.  By the end of the course students will be able to: • Understand the scope, purpose, principles and framework of sports development; • Have an understanding of sports delivery systems in Hong Kong and overseas;  • Employ strategic and development planning frameworks and techniques in analyzing and addressing the development needs of sports organizations; • Be able to critically appraise different models of strategic planning and sports development.", "syllabus": "• Structure & Development of Sport • Sociology of Sport & Politics • Physical Activity in the Community • Community Sport Development & Operations Management • Employability in Sport Development • Research Methods for Sport Development • Project Management in Sport Development • Marketing Communications • Adapted Outdoor Adventure • Principles & Practice of Physical Activity & Public Health • Strategic Management of Sport Development • Sport Development in Practice", "required_readings": "Please refer to the course outline.", "recommended_readings": "• Boddy, D. (2011) Management: An Introduction. 5th Ed. Financial times Prentice Hall. • Collins, M. & Lyle, J. (2006) Examining Sports Development. Routledge. Edition, Routledge. • Girginov, V. (2011) Management of Sports Development. Taylor & Francis Publishers. • Hannagan, T. & Bennett, R. (2008) Management: Concepts & Practices. 5th Edition Financial times Prentice Hall. • Hoye, R., Smith, A., Westerbeek, H., Stewart, B. & Nicholson, M. (2006) Sport Management Principles and Applications. Elsevier Publishers. • Hunger, J.D. & Wheelen, T.L. (2010) Concepts in Strategic Management and Business Policy: Achieving Sustainability. 12th edition. Pearson/prentice Hall. • Hunger, J.D. & Wheelen, T.L. (2011) Essentials of Strategic Management. 5th Edition Pearson/Prentice Hall. • Hylton, K. & Bramham, P. (2008) Sports Development: Policy, Process and Practice. 2nd • Johnson, G., Scholes, K. & Whittington, R. (2010) Exploring Corporate Strategy – Texts and Cases. 9th Ed. Essex: Financial Times Prentice Hall. • Lussier, R. N. & Kimball, D. C. (2009) Applied Sport Management Skills. Human Kinetics. • Lyle, J. (1999) Planning to Change: Development Planning for National Governing Bodies of Sport. University of Northumbria. • Lynch, R. (2006) Corporate Strategy. 4th Ed. Financial Times Prentice Hall. • Lynch, R. (2009) Strategic Management. 5th Ed. Financial Times Prentice Hall. • Mintzberg, H. (2003) The Strategy Process; concepts, contexts and cases. 4th edition, Financial Times Prentice Hall. • Mintzberg, H., Lampel, J. & Ahlstrand, B. W. (2009) Strategy Safari: the complete guide through the wilds of strategic management. 2nd edition, Financial Times Prentice Hall. • Slack, T. & Parent, M.M. (2006) Understanding Sport Organisations The Application of Organization Theory. 2nd Edition. Human Kinetics.", "terms": {"2020-21 Term 2": {"--LEC (1801)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [2], "locations": ["Lee Shau Kee Building LT5"], "instructors": ["Dr. John Timothy O'REILLY"]}}}, "assessments": {"Essay test or exam": "20", "Homework or assignment": "50", "Presentation": "30"}}, {"code": "6307", "title": "Sponsorship and Marketing of Sport Events and Performance", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in Master of Education; MPhil Sports Sci & Phys Edu; MA Sports Studies; MSc Sports Sci & Phy Activity and PhD Education", "description": "This course aims to help students to acquire knowledge of the basic concepts in sport marketing and sport sponsorship and the skills required in drawing up marketing plans and strategies in organizing sports events and sponsorship deals. Topics including the special nature of sport marketing, marketing management in sport, customer relationship management, sports pricing strategies, sport event as a product, customer’s and sport organization’s buying behaviour, sport market research and marketing information systems, sport sponsorship packages, public relations and promotion, ambush marketing and legal aspects in sport sponsorships will be covered. Other than lectures, students are requested to conduct case studies in sport marketing and to draw up a sport event marketing plan to earn hands-on experience.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6308", "title": "Information Technology in Sports Science and Physical Activity", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MPhil Sports Sci & Phys Edu; MSc Sports Sci & Phy Activity and PhD Education", "description": "With the rapid development of global economies and technology, modern information technology has been entering the field of sports and physical activity. At present, within international and domestic sports organizations and management structures, supporting athletes training through the use of sports specific equipment, research and development facilities, sports information networks and sports utility software applications have become commonplace and indispensable. This course will examine the professional needs of practitioners involved in using digital technologies and their applications within the sport, exercise and health contexts. A key element of this course will be to develop a deeper understanding of recent emerging technologies that can aid with improving health from clinical devices to active lifestyle aids, how they are developed, how they can be used and how to utilise them in research and practice. Maximising the usage of IT for the advancements of various disciplines within the Sports Science sector will be involved in this course, investigating issues such as Motion Analysis of Human Movement, Sports Biomechanics and the use of Big Data metrics in assessing performance, both during competition and in training. The use of biomedical software in monitoring every movement in an athlete’s or individual’s kinetic chain - their muscles and joints, so as to fine-tune technique for performance/health/safety enhancement will also be examined.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6309", "title": "Professional Attachment", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MSc Sports Sci & Phy Activity", "description": "The course of Professional Attachment is designed to exposure students to their professional role by completing hours of field experience and a specialized project in the actual setting of sports science industry and physical activity. Such experience is important for clarifying and broadening career goals. Through practical attachment students would be provided opportunity to apply what the students learned from the programme into a real industry setting; to extend and deepen the knowledge gained from the programme; to conduct critical analysis, synthesis, and evaluation of knowledge; and to develop skills and values that acquired both in the classroom and the practicum. The essence of the course is to put theory into practice. Due to the nature of application students are required to complete at least 12 credits of course work. Students enrolled in the attachment will continue their other course works in the regular terms, and could simultaneously engage in practical attachment at any time during the course of the MSc study, with mutual agreement between the course supervisor and the field tutor. Opportunity and selection of the interested industry can be initiated by the students and/or recommended by the course supervisor. Students should engage in not less than 100 hours in field placement to be agreed upon by your supervisor and field tutor. During the attachment period students are required to conduct a specialize projects and submit a project report at the end for grading purpose. Performance observation report from field tutor is also an integral part of the course assessment. Students must have obtained written approval from the Programme Director at least one term in advance before being accepted to the course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6701", "title": "Guided Studies", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MSc Sports Sci & Phy Activity", "description": "The purpose of this course is to allow the students to pursue advanced guided individual study in selected areas of Sports Science and Physical Activity. It will provide the opportunity for students to review the literature of their fields of interest and to prepare for the writing of their Project proposals. Examples are topics within the areas of exercise promotion, health related fitness, psycho-social application in sports and physical activity, physical activity measurement and evaluation, surveillance, sports training and coaching, administration, physical education as well as health and wellness education, etc. A student is expected to read according to a reading list prescribed or approved by the supervisors and to confer regularly with the supervisor. Assessment is based on the completion of reading and course requirements.", "outcome": "After taking this course, students will be able to:  • demonstrate the knowledge and understand the principles and practices of acquiring knowledge and solving problems through guided research; • critically analyze the quality of published studies; • design a research study in a chosen area.", "syllabus": "A variety of teaching methods will be used to facilitate students to better understand relevant theories and achieve the learn outcomes. Students are required to search the literature in the selected topic and analyze the findings of previous studies. They are also required to report to the supervisor about their study process face-to-face at different time points during the whole courses. A final report is required to assess the learning outcome.", "required_readings": "Please refer to the course outline.", "recommended_readings": "• ACSM Health and Fitness Journal  • American Journal of Clinical Nutrition • British Journal of Nutrition • Exercise and Sports Science Reviews • European Journal of Applied Physiology • International Journal of Sports Nutrition and Exercise Metabolism  • International Journal of Sports Medicine • Journal of Applied Physiology • Journal of Science and Medicine in Sport • Journal of Sports Sciences • Medicine and Science in Sports and Exercise  • Scandinavian Journal of Medicine and Science in Sports • Sports Medicine", "terms": {"2020-21 Term 1": {"AJ01-PRJ (2893)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor HA Sau Ching Amy"]}, "BJ01-PRJ (1342)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor YANG Yijian"]}, "CJ01-PRJ (1761)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor HUI Sai Chuen"]}, "DJ01-PRJ (1343)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Heung Sang Stephen"]}, "EJ01-PRJ (1760)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SIT Hui Ping"]}, "FJ01-PRJ (1344)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SUM Kim Wai Raymond"]}}, "2020-21 Term 2": {"AJ01-PRJ (2939)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor HA Sau Ching Amy"]}, "BJ01-PRJ (1355)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor YANG Yijian"]}, "CJ01-PRJ (1803)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor HUI Sai Chuen"]}, "DJ01-PRJ (1354)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Heung Sang Stephen"]}, "EJ01-PRJ (1802)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SIT Hui Ping"]}, "FJ01-PRJ (1356)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SUM Kim Wai Raymond"]}}}, "assessments": {"Essays": "70", "Presentation": "30"}}, {"code": "6900", "title": "Research Project", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MSc Sports Sci & Phy Activity", "description": "The Research Project aims to develop the student's ability to conduct independent research in the area of Sports Science and Physical Activity. It represents a step beyond the tutor directed Research Colloquia and Guided Study conducted in previous course. The Project will be expected to be an original research within the student's area of interest. Any relevant topic may be the subject of research, subject only to the agreement of the course committee, the availability of the necessary facilities, and the identification of a suitable supervisor. The Project must address a clearly identified problem and show evidence of familiarity with relevant literature, an appropriate experimental design and methodology, and a satisfactory interpretation of the results. At the conclusion of this course, students should be able to: 1) plan a research project; 2) conduct research in a professional and ethical manner; 3) present research effectively in written form; and 4) demonstrate in-depth knowledge of a relevant area. (Part-time students who obtain an overall GPA of 3.0 or above in their first year of attendance are eligible to take the course).", "outcome": "Following the completion of this course, the students will be able to: • apply the knowledge and method to the investigation of a specific area within the field of exercise and sports science; • draw upon and apply their knowledge of research methods in exercise science to integrate and further develop aspects of their taught programme;  • identify an issue to which solutions and/or recommendations can be addressed; and produce a written report which sets out clearly the aims, context, content and outcome of the exercise; • integrate the skills and knowledge which have been taught in the degree programme with specific application to a topic to produce a well-argued report.", "syllabus": "Student will meet with the supervisor 3-4 times during the research period to discuss his/her research project and progress of his/her work. In addition, further discussion and communication will be conducting through emails and/or other electronic means. Students are also welcomed to make appointments with the supervisor whenever necessary.", "required_readings": "Please refer to the course outline.", "recommended_readings": "• Baumgartner T.A. & Hensley L.D. (2006) Conducting and Reading Research in Health and Human Performance (4th ed.). Boston: McGraw-Hill. • Bell, J. (2014). Doing Your Research Project: A guide for first-time researchers. McGraw-Hill Education (UK). • Berg, K.E. and Latin, R.W. (2008) Essentials of Modern Research Methods in Health, Physical Education and Recreation (3rd ed.). Lippincott Williams & Wilkins.  • Gratton, C., & Jones, I. (2010) Research Methods for Sport Studies (2nd ed.). London: Routledge. • Tanaka, H., & Seals, D. R. (2000) Manuscript Peer Review: A Helpful Checklist for Students and Novice Referees. Advances in Physiology Education, 23: 52–58.", "terms": {"2020-21 Term 2": {"AJ01-PRJ (2940)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor HA Sau Ching Amy"]}, "BJ01-PRJ (1357)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor YANG Yijian"]}, "CJ01-PRJ (1804)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor HUI Sai Chuen"]}, "DJ01-PRJ (1373)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Heung Sang Stephen"]}, "EJ01-PRJ (1817)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SIT Hui Ping"]}, "FJ01-PRJ (1374)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SUM Kim Wai Raymond"]}}}, "assessments": {"Essays": "80", "Participation": "20"}}]