[{"code": "5001", "title": "Planning for Sustainable Tourism Development", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSSc Sustainable Tourism", "description": "The course introduces the scope, nature and trends of tourism as well as the concept of sustainability and its application to the strategic planning for tourism. Tourism as a contemporary leisure experience is examined along with economic, political and social ramifications and implications for the future. Selected tourism resources and impacts of the activity on the host countries, both developed and developing, and environments will be discussed, followed by an examination of the principles of good practice in tourism. The strategic planning processes for sustainable tourism development will also be addressed and illustrated by a variety of local and international case studies.", "outcome": "-Understanding tourism as a complex form of development that is linked to the economy, culture and environment; -Realizing that tourism contains both promises (e.g., better quality life and heritage protection) and pitfalls; -Employing sustainable tourism as a tool of social and economic development and a method of protecting our cultural and natural heritage; and -Understanding the concept of sustainability and its application to the strategic planning for tourism.", "syllabus": "-Understanding tourism in a globalizing world-Sustainability and tourism planning-Multi-dimensional impacts of tourism -Tourism geographies in Macau: casino, world heritage and resort hotel-Hong Kong as Asia’s world city: a premier tourist destination?-Cross-border Tourism: Experiences from Asia-Pacific Cities-Planning and development of the Hong Kong UNESCO Global Geopark-Climate change and tourism-Tourism planning in China and the West -Principles of good practice in sustainable tourism", "required_readings": "Recommended Readings * Required readings (Additional references may be given after each lecture.) (A) Tourism in a globalizing world Antonescu, A., & Stock, M. (2014). Reconstructing the globalization of tourism: A geo-historical perspective. Annals of Tourism Research, 45, 77-88.Cohen, E. (2012). Globalization, global crises and tourism. Tourism Recreation Research, 37(2), 103-111.*Dwyer, L. (2015). Globalization of tourism: Drives and outcomes. Tourism Recreation Research, 40(3), 326-339.*Lu, J., & Nepal, S. K. (2009). Sustainable tourism research: An analysis of papers published in the Journal of Sustainable Tourism, Journal of Sustainable Tourism, 17(1), 5-16.*Macbeth, J. (2005). Towards an ethics platform for tourism. Annals of Tourism Research, 32(4), 962-984.*Milne, S., & Ateljevic I. (2001). Tourism, economic development and the global-local nexus: Theory embracing complexity. Tourism Geographies, 3(4), 369-393.Munar, A. M. (2007). Rethinking globalization theory in tourism. Tourism, Culture & Communication, 7, 99-115.Reisinger, Y. (2008). Globalization, tourism and culture. International tourism: Cultures and behavior. Oxford, The United Kingdom: Butterworth-Heinemann. (Chapter 1)Teo, P., & Li, L. H. (2003). Global and local interactions in tourism. Annals of Tourism Research, 30(2), 387-306. Walton, J. K. (2009). Prospects in tourism theory: Evolution, state of play and future developments. Tourism Management, 30, 783-793.  (B) Tourism planning and sustainability principles of good practice in sustainable tourism*Beerli, A., & Martín, J. (2004). Factors influencing destination image. Annals of Tourism Research, 31(3), 657-681.Brunet S., Bauer J., Lacy T. D and Tshering, K. (2001) Tourism Development in Bhutan: Tensions between Tradition and Modernity, Journal of Sustainable Tourism, 9:3, 243-263.*Butler, R.W. (1999). Sustainable tourism: A state-of-the-art review, Tourism Geographies, 1(1): 7-25. Costa, C. (2001). An emerging tourism planning paradigm? A comparative analysis between town and tourism planning, International Journal of Tourism Research, 3:425-441. Choi Hwan Suk Chris and Sirakaya Ercan (2006). Sustainability indicators for managing community tourism, Tourism Management, 27(6): 1274-1289.Department of the Environment and Heritage (2004). Steps to Sustainable Tourism. Australian Government Forsyth, T. (1996). Sustainable Tourism: moving from theory to practice. World Wildlife Fund/Tourism Concern. *Dorji, T. (2001). Sustainability of Tourism in Bhutan. Journal of Bhutan Studies, 3 (1).Echtner C.M., & Ritchie, J.R.B. (1991). The meaning and measurement of destination image. The Journal of Tourism Studies 2(2), 2-12Gunn, C.A. et al. (2002). Tourism Planning, 4th   edition. Routledge, London. *Heiko Schmid (2006) Economy of Fascination: Dubai and Las Vegas as Examples of Themed Urban Landscapes, Erdkunde, Bd. 60, H. 4 (Oct. - Dec., 2006), pp. 346-361.*Inskeep, E. (1991). Tourism Planning: an integrated and sustainable development approach. New York: Van Nostrand Reinhold. *Lew, A. Alan (2014) Scale, change and resilience in community tourism planning, Tourism Geographies, 16:1, 14-22, DOI: 10.1080/14616688.2013.864325.Mehmet, A. and Kashif, H. (2005). Sustainable tourism development: a case study of North Cyprus, International Journal of Contemporary Hospitality Management, 17 (3):272-280. *Ruhanen, L. (2010). Where’s the strategy in tourism strategic planning? Implications for sustainable tourism destination planning, Journal of Travel and Tourism Research, Spring/Fall 2010, 58-76. *Stephen J. Page. (2009). Section I Understanding Tourist Transport: Concepts and Methods for Analysis, Transport and Tourism: Global Perspectives (pp.1-136). Harlow: Prentice Hall. Timur, S. and Getz, D. (2009). Sustainable tourism development: How do destination stakeholders perceive sustainable urban tourism? Sustainable Development, 17: 220-232. United Nations Environment Programme and World Tourism Organization (2005). Making Tourism More Sustainable. A Guide for Policy Makers. UNEP. World Commission on Environment and Development (1987). Our Common Future. Oxford University Press, Oxford, 400 pp.  (C) Multi-dimensional impacts of tourismAhn, B. Y., Lee, B. K., & Shafer C. S. (2002). Operationalizing sustainability in regional tourism planning: An application of the limits of acceptable change framework. Tourism Management, 23(1), 1-15.Boley, B. B., McGehee, N. G., & Hammett, A. L. T. (2017). Importance-performance analysis (IPA) of sustainable tourism initiatives: The resident perspective. Tourism Management, 58, 66-77.*Deery, M., Leo, J., & Liz, F. (2012).  Rethinking social impacts of tourism research: A new research agenda. Tourism Management, 33(1), 64-73.Goodwin, H. (2017). The challenge of overtourism. Responsible Tourism Partnership Working Paper 4. Retrieve from http://haroldgoodwin.info/pubs/RTP'WP4Overtourism01'2017.pdf*Hardin, G. (1968). The tragedy of the commons. Science, 162, 1243-1248. Ma, M., & Hassink, R. (2013). An evolutionary perspective on tourism area development. Annals of Tourism Research, 41, 89-109.Newsome, D., Moore, S. A., & Dowling, R. K. (2013). Natural area tourism: Ecology, impacts and management. Bristol; Buffalo, NY: Channel View Publications. (Chapter 3)Sörensson, A., & von Friedrichs, Y. (2013). An importance-performance analysis of sustainable tourism: A comparison between international and national tourists. Journal of Destination Marketing & Management, 2, 14-21. *Zhong, L., Deng, J., Song, Z., & Ding, P. (2011). Research on environmental impacts of tourism in China: Progress and prospect. Journal of Environmental Management, 92(11), 2972-2983. (D) Tourism geographies in Macau*Balsas J.L. Carlos (2013), Gaming anyone? A comparative study of recent urban development trends in Las Vegas and Macau, Cities, 31: 298-307.Du Cros, Hilary (2009). Emerging Issues for Cultural Tourism in Macau, Journal of Current Chinese Affairs, 38, 1, 73-99.Institute for Tourism Studies (2009). Develop Macau as a Sustainable Tourism Destination in terms of Hotel Industry. Research proposal submitted to DSEC for the Macau’s university research project competition. *Lo, Man-U (2011). Can the Historic Center of Macao be a Popular Tourist Attraction? Examining the Market Appeal from Tour Marketers' Perspective, Journal of Quality Assurance in Hospitality and Tourism, 12:1, 58-72 Wan, P. & Pinheiro, F.V. (2014) Macau's Tourism Planning Approach and Its Shortcomings: A Case Study, International Journal of Hospitality & Tourism Administration, 15:1, 78-102, DOI: 10.1080/15256480.2014.872901Wan, P., & Pinheiro, F. V. (2011). The development of the gaming industry and its impact on land use. Gaming, governance and public policy in Macao. Hong Kong University Press, Hong Kong, 19-35.Wu, Shou-Tsung  and Chen, Yeong-Shyang (2015) The social, economic, and environmental impacts of casino gambling on the residents of Macau and Singapore, Tourism Management, 48: 285-298.林美珍、鄭向敏。2006。「澳門休閒娛樂旅遊形象的塑造與推廣」，《澳門研究》，第33期，頁130-37。 林發欽。2007。「澳門城市旅遊形象重塑芻議--從重建公眾心中的澳門世界遺產形象做起」《城市文化形象的塑造》，澳門基金會出版，頁45-52。 (E) Hong Kong as Asia’s world city: a premier tourist destination?Cheung, S. (1999). The meanings of a heritage trail in Hong Kong, Annals of Tourism Research 26(3): 570-88. *Choi, W. Kimburley (2010): Constructing a decolonized world city for consumption: discourses on Hong Kong Disneyland and their implications. Social Semiotics, 20(5): 573-592 Law, R. and Cheung, S. (2010) The Perceived Destination Image of Hong Kong as Revealed in the Travel Blogs of Mainland Chinese Tourists, International Journal of Hospitality & Tourism Administration, Volume 11, Issue 4, pp 307-23.Li, Y.P. and Lo, L.B. (2005). Opportunities and constraints of heritage tourism in Hong Kong changing cultural landscape, Tourism and Hospitality Research, 5(4): 322-345. Planning Department (2001) Tourism Planning. Working paper No. 2. HK 2030 Study. Rhodri, T. and Huw, T. (2005). Understanding Tourism Policy-Making in Urban Areas, with Particular Reference to Small Firms, Tourism Geographies, 7(2): 121-137. Scott, N. and Cooper, C. (2010). Innovation for sustainable urban tourism: Some thoughts on best practice, Rio De Janeiro, 44(5): 1171-1190. Selby, M. (2004). Consuming the City: Conceptualizing and Researching Urban Tourist Knowledge, Tourism Geographies, 6(2): 186-207. *Wan Yim King Penny (2013). A comparison of the governance of tourism planning in the two Special Administrative Regions (SARs) of China – Hong Kong and Macao, Tourism Management, 36: 164-177. *Wang Donggen (2004). Tourist Behaviour and Repeat Visitation to Hong Kong, Tourism Geographies, 6 (1): 99-118,   (F) Cross-border tourismChan, C.K. Roger and Yao, Shimou (2010). New trends in urban and regional governance in the Pearl River Delta region. Asian Geographer, 27(1-2): 127-143*Chang, T. C. (2004) “Tourism in a ‘Borderless’ World:  The Singapore Experience”, Asia Pacific Issues, No. 73, pp. 1-8*Chang, T.C. (1997).  From “Instant Asia” TO “Multi-faceted Jewel”: Urban Imaging Strategies and Tourism Development in Singapore, Urban Geography, 18(6): 542-562.*Nadalutti Elisabetta (2015) The rise of trans-border regions in Southeast Asia: behind the dynamics of informal and formal integration processes in the ‘Indonesia–Malaysia–Singapore’ growth triangle, The Pacific Review, 28 (4): 607-630.劉少和; 桂拉旦。2008。「環城地理梯度背景下的旅游休閑業空間布局結構分析——以粵港澳為例」，《社會科學家》，第133期，頁95-99。 萬方秋、唐左、甘巧林、馮淑玲。2008。「珠海與港澳區域旅游合作的對策研究」，《經濟問題探索》，第6期，頁109-16。 肖光明。2009。「珠江三角洲旅遊空間結構分析與優化研究」，《資源開發與市場》，第25期，頁692-696。 (G) Tourism planning in China and the West *Buckley, R., Cater, C., Zhong, L., & Chen, T. (2008). Shengtai Luyou: Cross-cultural comparison in ecotourism. Annals of Tourism Research, 35(4), 945-968.*Buckley, R. (2018). Tourism and Natural World Heritage: A complicated relationship. Journal of Tourism Research, 57(5), 563-578.Gough, S., Scott, W., & Stables, A. (2000). Beyond O’Riordan: Balancing anthropocentrism and ecocentrism. International Research in Geographical and Environmental Education, 9(1), 36-47. *Lai, K., Li, Y. P., & Feng, X. G. (2006). Gap between tourism planning and implementation: A case of China, Tourism Management, 27, 1171-1180. Mihalic, T. (2016). Sustainable-responsible tourism discourse – Towards ‘responsustable’ tourism. Journal of Cleaner Production, 111, 461-470.Shafer, C. S., & Inglis, G. J. (2000). Influence of social, biophysical, and managerial conditions on tourism experiences within the Great Barrier Reef World Heritage Area. Environmental Management, 26, 73-87. *Wang, D., & Ap, J. (2013). Factors affecting tourism policy implementation: A conceptual framework and a case study in China. Tourism Management, 36, 221-233.Yang, L., & Wall, G. (2008). The evolution and status of tourism planning in Xishuangbanna, Yunnan, China. Tourism and Hospitality Planning and Development, 5, 165-182.  (H) Climate change and tourism*Hein, L., Metzger, M. J., & Moreno, A. (2009). Potential impacts of climate change on tourism; a case study for Spain. Current Opinion in Environmental Sustainability, 1, 170-178.Hoogendoorn, G., & Fitchett, J. M. (2018). Perspectives on second homes, climate change and tourism in South Africa. African Journal of Hospitality, Tourism and Leisure, 7(2), 1-18. Simpson, M. C., Gossling, S., Scott, D., Hall, C. M., & Gladin, E. (2008). Climate change adaptation and mitigation in the tourism sector: Frameworks, tools and practices. Paris, France: UNEP, University of Oxford, UNWTO, WMO.*UNWTO/UNEP (2008).  Climate change and tourism – Responding to global challenges. Madrid, Spain: UNWTO/UNEP. *World Tourism Organization (UNWTO). (2008). Climate change and tourism – Responding to global challenges. Retrieved from http://sdt.unwto.org/sites/all/files/docpdf/climate2008.pdf   ", "recommended_readings": "Please refer to the list above.", "terms": {"2020-21 Term 1": {"--LEC (2078)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. LEE Wai Ying Joanna, \n\rProfessor CHAN Chung Shing"], "meetingDates": ["8/9", "15/9", "22/9", "29/9", "6/10", "13/10", "20/10", "27/10", "3/11", "10/11", "17/11", "24/11", "1/12", "8/12"]}}, "2021-22 Term 1": {"--LEC (1843)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Ho Tim Building B6"], "instructors": ["Dr. LEE Wai Ying Joanna, \n\rProfessor CHAN Chung Shing"], "meetingDates": ["7/9", "14/9", "21/9", "28/9", "5/10", "12/10", "19/10", "26/10", "2/11", "9/11", "16/11", "23/11", "30/11", "7/12"]}}}, "assessments": {"Essays": "30", "Examination": "50", "Fieldwork or field study": "10", "Report": "10"}}, {"code": "5002", "title": "Cultural and Heritage Tourism", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSSc Sustainable Tourism", "description": "This course analyses the nature and importance of cultural heritage as capital for tourism. Introductory lectures identify various types of heritage (tangible and intangible) and provide an understanding of the concept, scope and evolution of cultural-heritage tourism. Issues of cultural and artistic authenticity, identity production and marketing, and commodification of both tourists and the toured will further be examined. Case studies from Hong Kong and other parts of the world will be studied to identify specific socio-economic and cultural costs and benefits associated with this kind of tourism. The course will also explore approaches and policies of cultural heritage management and conservation to enable sustainable tourism development, with particular emphasis on the cases of Hong Kong and the Pearl River Delta.", "outcome": "-To analyze the nature and importance of cultural heritage as resources for tourism; -To examine the concept, evolution and key planning and management of cultural heritage and tourism -To Help students develop critical thinking on the planning and management of cultural heritage and tourism", "syllabus": "-Human evolution and culture development-Cultural heritage and tourism-Planning, Governance and Management of Cultural and Heritage Tourism-Cultural heritage of the Hakka people: What has Tulou tourism to offer in China?-Hakka cultural heritage in Hong Kong: Continuous decline or revitalization?-Fung shui forests and heritage trees: their cultural values and beyond in a warming world-British Legacy and Other Foreign Cultural Influence in Hong Kong-Collective Memories and Cultural Tourism-Outstanding universal values, authenticity and integrity of cultural heritage", "required_readings": "Reading materials * Required readings   Additional reading materials may be given after each lecture. Human evolution and culture development*Anonymous. The real first farmers: How agriculture was a global invention. New Scientist, Issue 3045, 28 October 2015.Appenzeller, T. (2012). Eastern Odyssey. Nature, 485:24-26.*Bobe, R., Behrensmeyer, A.K. (2004). The expansion of grassland ecosystem in Africa in relation to mammalian evolution and the origin of the genus Homo. Paleogeography, Paleaeoclimatology, Paleoecology, 207:399-420. Brooks PJ, Enoch M-A, Goldman D, Li T-K, Yokoyama A (2009). The Alcohol Flushing Response: An Unrecognized Risk Factor for Esophageal Cancer from Alcohol Consumption. PLoS Med, 6(3): e1000050. doi:10.1371/journal.pmed.1000050Chan, E.K.F. et al (2019). Human origins in a southern African palaeo-wetland and first migrations. < https://doi.org/10.1038/s41586-019-1714-1>.*Curry, A. (2013). The Milk Revolution. Nature, 500:20–22.*Callaway, E. (2011). Ancient DNA reveals secrets of human history. Nature, 476:136-137.*Edwards, E.J., Osborne, C.P., Stromberg, C.A.E., Smith, S.A., C4 Grasses Consortium (2010). The origins of C4 grasslands: Integrating Evolutionary and Ecosystem Science. Science, 328:587-591.*Gani, R., Gani, N.D.S. (2008). Tectonic Hypotheses of Human Evolution.  <http://www.geotimes.org/jan08/article.html?id=feature_evolution.html> *Julia Galway-Witham and Chris Stringer (2018). How did Homo sapiens evolve? Science, 360 (ISSUE 6395): 1296-1298.Niemitz, C. (2010). The evolution of the upright posture and gait – a review and a new synthesis. Naturwissenschaften, 97:241-263.*Owen, R.B. et al. (2018). Progressive aridification in East Africa over the last half million years and implications for human evolution. < www.pnas.org/cgi/doi/10.1073/pnas.1801357115>Pontzer, H. et al. (2016). Metabolic acceleration and the evolution of human brain size and life history. Nature, 533, doi:10.1038/nature17654. *Schlebusch, C.M. et al., (2017). Southern African ancient genomes estimate modern human divergence to 350,000 to 260,000 years ago. Science 10.1126/science.aao6266 (2017).Smithsonian National Museum of natural History. What does it mean to be human? <http://humanorigins.si.edu/human-characteristics/change>  Wood, B. (2014). Fifty years after Homo habilis. Nature, 508:31-33. Cultural heritage and tourism IAhmad, Y. (2006). The scope and definitions of heritage: From tangible to intangible. International Journal of Heritage Studies, 12(3), pp. 292-300.*Aplin, G. (2002). Heritage: Identification, Conservation and Management. Melbourne, Oxford: Oxford University Press. Chapter 1 “The Nature of Heritage”, pp. 1-30. Arizpe, L. (2004). Intangible cultural heritage, diversity and coherence. Museum International, 56(1-2):130-136.Bouchenaki, Mounir (2003). The interdependency of the tangible and intangible cultural heritage. In: 14th ICOMOS General Assembly and International Symposium: ‘Place, memory, meaning: preserving intangible values in monuments and sites’, 27 – 31 Oct 2003, Victoria Falls, Zimbabwe.Graham, B., Ashworth, G. Tunbridge, J. (2000). A Geography of Heritage: Power, Culture and Economy. London: Oxford University Press. *Greg, R. (2010) Tourism Development Trajectories – From Culture to Creativity, Tourism and Management Studies, No. 6, pp. 9-15.*Ken Taylor & Jane Lennon (2011) Cultural landscapes: a bridge between culture and nature?, International Journal of Heritage Studies, 17:6, 537-554,Kurin, R. (2004). Safeguarding intangible cultural heritage in the 2003 UNESCO convention: A critical appraisal. Museum International, 56(1-2):66-77.  United Nations Education, Scientific and Cultural Organization (2004). International Conference Globalization and Intangible Cultural Heritage: Opportunities, Threats and Challenges. (http://unesdoc.unesco.org/images/0014/001400/140090E.pdf). *Teather, E.K. and Chow, C.S. (2003). Identity and place: the testament of designated heritage in Hong Kong. International Journal of Heritage Studies, 9(2), pp. 93-115. Cultural heritage and tourism IIChan Yuk Wah & Vivian P. Y. Lee (2016): Postcolonial cultural governance: a study of heritage management in post-1997 Hong Kong, International Journal of Heritage Studies.Chang, T.C., Milne, S., Fallon, D. and Pohlmann, C. (1996). Urban heritage tourism: the global-local nexus. Annals of Tourism Research, 23 (2):284-305. *Drost, A. (1996). Developing sustainable tourism for world heritage sites. Annals of Tourism Research, 23 (2):479-492. *Smith, M. (2003). Issues in Cultural Tourism Studies. London and New York: Routledge. Zhang, B., Wu, H., Xiao, F. and Mo, S. (2004). Protecting the national parks and the world heritage sites in China: challenge and strategy.  Geographical Sciences, 14 (supplement):87-90. 4  Outstanding Universal Value, Authenticity and Integrity of Cultural Heritage*Alberts, H.C. and Hazen, H.D. (2010).  Maintaining authenticity and integrity at cultural world heritage sites. The Geographical Review, 100:56-73.Anonymous. The Venice Charter. *Jokilehto,  J. (2006a). Considerations on authenticity and integrity in world heritage context. City & Time, 2 (1): 1.[online] URL:http://www.ct.ceci-br.org*Jokilehto,  J. (2006b). World Heritage: Defining the outstanding universal value. City & Time, 2 (2): 1. [online] URL:http://www.ct.ceci-br.org*Stovel, H. (2007), Effective use of authenticity and integrity as world heritage qualifying conditions. City & Time,  2 (3): 3. [online]URL: http://www.ct.ceci-br.orgUNESCO (2007). The Nara Document on Authenticity < http://whc.unesco.org/events/gt-zimbabwe/nara.htm (2 of 4)07/11/2007 15:09:21>*Zhu, Yujie (2012). Performing heritage: Rethinking authenticity in tourism.  Annals of Tourism Research, 39 (3): 1495–1513. Planning, Governance and Management of Cultural and Heritage TourismBarber, L. (2014) (Re)Making Heritage Policy in Hong Kong: A Relational Politics of Global Knowledge and Local Innovation, Urban Studies, Vol. 51, No. 6, pp. 1179-1195Chan, S. (2018) Heritagizing the Chaozhou Hungry Ghosts Festival in Hong Kong. In Christina Maags, Marina Svensson (eds), Chinese Heritage in the Making: Experiences, Negotiations and Contestations. Amsterdam University Press. Ch. 6. *Chan Y. W. & Lee P. Y. Vivian (2016): Postcolonial cultural governance: a study of heritage management in post-1997 Hong Kong, International Journal of Heritage Studies, DOI: 10.1080/13527258.2016.1269238.*du Cros, H. and Lee, Y.S. (2007). Cultural Heritage Management in China: Preserving the Cities of the Pearl River Delta. London ; New York : Routledge, chapter 1.Dallen, J. (eds.) (2007). The Political Nature of Cultural Heritage and Tourism. Aldershot, England: Ashgate. McKercher, B., du Cros, H. (2002). Cultural Tourism: The Partnership between Tourism and Cultural Heritage Management. New York: Haworth Hospitality Press. *Tracey L.‐D. Lu (2009) Heritage Conservation in Post‐colonial Hong Kong, International Journal of Heritage Studies, 15(2-3): 258-272.廖迪生, 盧惠玲編; 鄧聖時輯 (2007) 。《風水與文物: 香港新界屏山鄧氏稔灣祖墓搬遷事件文獻彙編》，香港 : 香港科技大學華南研究中心。 Cultural Heritage of the Hakka People : What has tulou tourism to offer in China?* Li, M., Wu, B., Cai, L. (2008). Tourism development of World Heritage Sites in China: A geographic perspective. Tourism Management, 29:308-319. 王麗 (2004) 。客家土樓及其文化。三明高等專科學校學報，21(3): 78-81。羅香林(1965) 。 《 客家史料匯篇 》 ，香港中國學社。黃漢民 (2003)。《福建土樓—中國傳統民居的瑰寶》，三聯書店。*鍾文典 (2007) 。 《江西客家》 。廣西師範大學出版社，頁65-98 。*李婷婷，駱培聰 (2009)。福建永定土樓居民旅游感知與態度研究。世界地理研究，18(2): 135-145。*林愛平 (2009) 。社區參與角度下的福建土樓旅游開發。閩江學院學報，30(6): 88-91。 Hakka Cultural Heritage in Hong Kong: Continuous decline or Revitalization? Yip, J.K.L., Ngar, Y.N., Yip, J., Liu, E.K.Y. and Lai, P.C.C. (2004). Venturing Fung Shui Woods (風水林). Friends of the Country Parks, AFCD & Cosmos Books Ltd., Hong Kong, 115 pp. *朱石年、張新林 (2007) 。客家人對香港經濟的影響。載劉義章 《香港客家》，第二版， 廣西師範大學出版社, 頁205-229。*蕭國健 (2006) 。 《 香港古代史》， 中華書局， 頁75-89、105-117 *劉鎮發 (2005) 。香港客家人的源流 。載劉義章 《 香港客家》， 廣西師範大學出版社, 頁 38-52。鍾文典 (2007) 。 江西客家姓氏與宗族社會。 載《 江西客家》， 廣西師範大學出版社， 頁65-98。 Fung Shui Forests and Heritage Trees: their Cultural Values and beyond in a warming world Jones, O. and Cloke, P. (2002). Tree cultures: the place of trees and trees in their place, New York: Berg. Thaiutsa, B. et al. (2008). Urban green space, street tree and heritage large tree assessment in Bangkok, Thailand. Urban Forestry & Urban Greening, 7:219-229. Thrower, L.B. (1975). Floristics of the fung shui woods. In: Thrower, L.B. (Ed.), The Vegetation of Hong Kong. Royal Asiatic Society, Hong Kong, pp.57-63. * Webb, R. (1994). Earth god and village shrines in the New Territories of Hong Kong,  J. Hong Kong Branch Royal Asiatic Society, 34:183-191. Yip, J.Y., Corlett, R.T. and Dudgeon, D. (2004). A fine-scale gap analysis of the existing protected area system in Hong Kong, China. Biodiversity and Conservation, 13: 943–957. *鍾文典 (2007) 。 江西客家風水文化及其傳播與影響。 載《 江西客家》， 廣西師範大學出版社， 頁122-147。房學嘉(1994) 。民間宗教信仰及其對客家民性的影響。載《客家源流探奧》，廣東高等教育出版社，頁185-205。*劉沛林 (1998) 。 《古村落：和諧的人聚空間》， 上海三聯書店， 頁140-175。饒玖才 (1999) 。《 香港方物古今 》 ， 天地圖書有限公司， 頁143-148。British Legacy and Other Foreign Cultural Influence in Hong Kong * 丁新豹，《香港歷史散步》，香港商務印書館, 2008年。* Graham, B., Ashworth, G. Tunbridge, J. (2000). A Geography of Heritage: Power, Culture and Economy. London: Oxford University Press. Cheung, S.C.H. (1999).The meanings of a heritage trail in Hong Kong. Annals of Tourism Research, 26(3): 570-88.  Collective Memories and Cultural Tourism*Chang (2005) “Place, memory and identity: Imagining ‘New Asia’”, Asia Pacific Viewpoint, 46 (3), pp. 247-253.*Chang, T.C. and Huang, S. (2005).  Recreating place, replacing memory: Creative destruction at the Singapore River.  Asia Pacific Viewpoint, 46(3):267-80. *Chang, T.C. and Lim, S. Y. (2004) Geographical Imaginations of 'New Asia-Singapore”, Geografiska Annaler. Series B, Human Geography, Vol. 86, No. 3, pp. 165-185*Cheung, S. C.H. (2003). Remembering through space: the politics of heritage in Hong Kong. International Journal of Heritage Studies , 9(1): 7-26. Gerarad, H. (2007) Art and Culture: Hong Kong or the Creation of a Collective Memory, China Perspectives, No. 2 (70), pp. 79-86Yeoh, B. (2005). The global cultural city? Spatial imagineering and politics in the (multi) cultural marketplaces of South-east Asia. Urban Studies, 42(5): 945-58. ", "recommended_readings": "Please refer to the list above.", "terms": {"2020-21 Term 2": {"--LEC (4118)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["William M W Mong Eng Bldg 407"], "instructors": ["Dr. LEE Wai Ying Joanna, \n\rProfessor CHAU Kwai Cheong"], "meetingDates": ["14/1", "21/1", "28/1", "4/2"]}}, "2021-22 Term 2": {"--LEC (3135)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["Wong Foo Yuan Bldg LT4"], "instructors": ["Dr. LEE Wai Ying Joanna, \n\rProfessor CHAU Kwai Cheong"], "meetingDates": ["13/1", "20/1", "27/1"]}}}, "assessments": {"Essays": "20", "Examination": "40", "Presentation": "10", "Report": "30"}}, {"code": "5003", "title": "Tourism Policy and Development", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSSc Sustainable Tourism", "description": "This course is intended to expose students to the understanding of basic concepts, trends, philosophy and challenges of ecotourism. It will investigate and seek to understand policy implications of ecotourism development. While ecotourism is the fastest growing sector of the world's tourism industry, it is still not well understood. Where ecotourism is being conceived and practiced, there is often a dearth of knowledge in ecotourism policy aspects. The course will draw on examples of various tourism policy initiatives with approaches concerning the environment, local community, tourists, businesses and those affected by this type of tourism.", "outcome": "-Understand the basic conceptual framework for ecotourism and the overall tourism industry in the context of policy and decision-making; -Acquire knowledge of how policies and institutions influence the operation and management of ecotourism destinations and activities; -Develop an understanding and skills necessary for researching and interpreting relevant policy and planning of natural and man-made resources for tourism -Enhance students problem solving capability using an integrative approach and critical thinking", "syllabus": "• Introduction to Tourism Policy and Development • Major Trends and challenges in Tourism Policy • The Concept of Development in Tourism• The Tourism Challenges and Opportunities• Tourism for Biodiversity and Conservation • Governance for (Sustainable) Tourism • Institutional Arrangements and Governance for Sustainable Tourism Policy • Ecotourism as an Alternative Tourism: Philosophy and Context of Ecotourism • Ecotourism in China: Opportunities, Constraints and Research • Policy Implications for Protected Areas • Policy Implications: A Case Study of the Mekong River Discovery Trail • Policy Management and Business in Sustainable Tourism ", "required_readings": "Relevant Texts in the University Library (some will be provided in pdf on the Blackboard) Berry, S. and A. Ladkin (1997). \"Sustainable tourism: a regional perspective.\" Tourism Management 19(7): 433-440. Butler, R. W. (1999). \"Sustainable tourism: a state-of-the-art review.\" Tourism Geographies 1(1): 7-25. Cater, E., Lowman, G. (eds.) 1994. Ecotourism: A Sustainable Option? John Wiley & Sons.Choi, H. C. and E. Sirakaya (2006). \"Sustainability indicators for managing community tourism\". Tourism Management 27(6): 1274-1289. Cook, Roy A., Yale, Laura J., & Marqua, Joseph J. (2009). Tourism: The Business of Travel. Prentice Hall. (Chapter 1). Diamantis, D. (1999). The Concept of Ecotourism: Evolution and Trends. Current Issues in Tourism. Vol. 2, No. 2&3, 93 – 122. Dinica,V. (2009). Governance for Sustainable Tourism: A Comparison of International and Dutch Visions. Journal of Sustainable Tourism, 19(5),583 — 603. Elwood. L. S, and Y. S. Choi (2005). Forging nature-based tourism policy issues: A case study in Pennsylvania. Tourism Management, 27 619 – 628. Erkuş-Öztürk, H. and A. Eraydin (2010). \"Environmental governance for sustainable tourism development: Collaborative networks and organisation building in the Antalya tourism region.\" Tourism Management 31(1): 114-124. #Fennel, D. A. and Ross, K. D. (2003). Ecotourism Policy and Planning. CABI Publishing. Wallingford, UK. #Fennell, D.A. (2002). Ecotourism Programme Planning. CABI Publishing. Wallingford. #Fennell, D.A. 2008. Ecotourism. Third Edition Routledge, London. Fleischer, D.I. (2009). Conservation and Ecotourism in Brazil and Mexico: The Development Impact. International Policy Centre for Inclusive Growth. One Pager. Garrod, B. and A. Fyall (1998). \"Beyond the rhetoric of sustainable tourism?\" Tourism Management 19(3): 199-212 Garrod, B. and Wilson, J. C. (Eds.). (2003). Marine Ecotourism: Issues and Experiences. Channel View Publications. Goymen, K. (2000). Tourism and Governance in Turkey. Annals of Tourism Research, 27( 4), 1025-1048. #Gunn, C. A. and Turgut Var. (2002). Tourism Planning. 4th Edition. Routledge, London. #Hall, C.M and S.J. Page, 2006. The Geography of Tourism and Recreation: Environment, Place and Space. Routledge. Hilal, E,O., & Ayda, E. (2009). Environmental Governance for Sustainable Tourism Development: Collaborative Networks and Organisation Building in the Antalya Tourism Region. Tourism Management, 1-12. #Inskeep, Edward, 1991. Tourism Planning: An Integrated and Sustainable Development Approach. Van Nostrand Reinhold. Marafa, L .M.( 2004). Understanding Sustainable Tourism. The Voice of Travel Industry Council of Hong Kong, 2004 No.3. McCool, S. F and Moisey, R. N. (Eds). (2001). Tourism, Recreation and Sustainability: Linking Culture and the Environment. CABI Publishing. Wallingford.Meng, X, M., Siriwardana,M., & Pham,T. (2013). A CGE Assessment of Singapore’s tourism Policies. Tourism Management,34,25-36. #Newsome, D., S. A. Moore, and R. K. Dowling. 2002. Natural Area Tourism: Ecology, Impacts and Management. Channel View Publications. Saarinen, J. (2006). Traditions of Sustainability in Tourism Studies. Annals of Tourism Research, Vol. 33, No. 4, pp. 1121 – 1140. Stephen Williams, 2000. Tourism Geography, Routledge. #Swarbrooke, J. (1999). Sustainable Tourism management. CABI Publishing. Wallingford. Tosun, C. (2001). \"Challenges of sustainable tourism development in the developing world: the case of Turkey.\" Tourism Management 22(3): 289-303. Wall, G., (1997). Is Ecotourism Sustainable? Environnemental Management. Vol. 21, No. 4, pp. 483-491. Wang, D., & Ap, John. (2013). Factors Affecting Tourism Policy Implementation: A conceptual Framework and A Case Study in China. Tourism Management, 36,221-233. Wang, Y., & Bramwell, B. (2012). Heritage Protection and Tourism Development Priorities in Hangzhou, China: A Political Economy and Governance Perspective. Tourism Management,33, 988-998. #Weaver, D. B. (ed.) (2001). The Encyclopedia of Ecotourism. CABI Publishing. Wallingford, UK. Zhang, H,Q., Chong,K., & Ap, John. (1999). An Analysis of Tourism Policy Development in Modern China. Tourism Management, 20,471-485.", "recommended_readings": "Please refer to the list above.", "terms": {"2020-21 Term 1": {"--LEC (4013)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor Lawal Mohammed MARAFA, \n\rProfessor Trevor Harvey Boyd SOFIELD"], "meetingDates": ["10/9", "17/9", "24/9"]}}, "2021-22 Term 1": {"--LEC (3105)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["Esther Lee Bldg LT2"], "instructors": ["Professor Lawal Mohammed MARAFA, \n\rProfessor Trevor Harvey Boyd SOFIELD"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10"]}}}, "assessments": {"Classwork": "20", "Essays": "10", "Examination": "40", "Fieldwork or field study": "10", "Others": "20"}}, {"code": "5004", "title": "Nature-based Tourism", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSSc Sustainable Tourism", "description": "Nature-based tourism definitely is one of the most popular tourism forms in the world. It refers to a number of tourist activities associated with the natural environment. In this course, some of the concepts and related issues, such as distinctions between nature-based tourism and other forms of tourism, benefits and challenges of nature-based tourism, management of natural and ecological resources, park design and management, interpretation, sustainability, participation of local communities and nature based tourism products, will be explored. In order to enhance the learning experience, an interactive teaching mode will be adopted in the lectures so that the instructors can guide students to analyze the cases and issues through queries and answers. Furthermore, field trips will also be organized in which students can articulate what they learn from the class teaching. This course attempts to provide students with a comprehensive introduction to nature-based tourism, with the following specific objectives: - To examine the key concepts, theories and techniques in the management of natural and ecological resources;  - To analyze the importance of natural and ecological resources for development of nature based tourism; and - To help students develop critical thinking on the planning and management of natural environment and nature based tourism.", "outcome": "-Understand the concepts of biodiversity and geodiversity -Develop an appreciation of the natural environment and landscapes of Hong Kong -Understand the principles of conservation and management of biodiversity and geodiversity -Improve generic skills such as critical thinking, presentation and writing skills", "syllabus": " Introduction to Tourism, ecotourism, sustainable tourism Nature-based tourism in Hong Kong  for nature-based tourism Planning and management of protected areas  Tourism resource assessment Recreation impact and management Challenges of nature-based tourism Developing nature-based tourism products Nature-based tourism, local community and sustainable development Development of nature-based tourism in a destination  ", "required_readings": "● IntroductionNeto, Frederico. (2003). A New Approach to Sustainable Tourism Development:Moving Beyond Environmental Protection.(http://www.un.org/esa/desa/papers/2003/esa03dp29.pdf)United Nations Environment Programme. (2012). Sustainable Tourism: Definition.Division of Technology, Industry, and Economics.(http://www.unep.fr/scp/tourism/sustain/)The International Ecotourism Society. (2012). What is ecotourism?.(http://www.ecotourism.org/what-is-ecotourism) ● Nature-based Tourism in Hong KongNg, C.N. & Y.Li (2000) Eco-tourism in Hong Kong: its potentials and limitations. Paperpresented at the Cuarta Feria Ecoturistica y de Produccion 15 – 23 Julio, 2000, SantoDomingo, D.N., Republica Dominicana. (http:// www.kiskeyaalternative.org/publica/diversos/hong-kong.htm)Mak, W. (2011) An Assessment on the Opportunities to develop Ecotourism in HongKong. paper presented in IFLA APR Congress - Hospitality: The Interaction with Land,19-21 January 2011, Bangkok, Thailand.(http://tar.thailis.or.th/bitstream/123456789/435/1/OR025.pdf) ● Natural resources for nature-based tourismCheng, H.M. (2011) Hong Kong Headline Indicators for Biodiversity & Conservation.Civic Exchange. (http://www.civic-exchange.org/wp/wpcontent/uploads/2011/10/111006bioindicators_en.pdf)Hong Kong Fact Sheets - Country Parks and Conservation.(http://www.gov.hk/en/about/abouthk/factsheets/docs/country_parks.pdf )Ng, S.L., J.F. Li, S.M. Fang & Y.C.Y. Ng (2011) Geodiversity and Geoconservation inHong Kong. Asian Geographer 27(1-2): 1-11. ● Planning and management of protected areasDowling, R & D. Newsome (2010) From Global Geotourism Perspectives. Chapter 13:Hong Kong Geopark: uncovering the geology of a metropolis. Goodfellow: Oxford.Eagles, P.F.J., McCool, S. F. and Haynes, C.D.A. 2002. Sustainable Tourism inProtected Areas: Guidelines for Planning and Management. IUCN Bland, Switzerlandand Cambridge, UK.Secretariat of the Convention on Biological Diversity (2004) Guidelines on Biodiversityand Tourism Development. Secretariat of the Convention on Biological Diversity,Montreal. (http://www.cbd.int/doc/publications/tou-gdl-en.pdf) ● Recreation impact and managementNg, S.L., Y.F. Leung, S.Y. Cheung, W. Fang (2018) Land degradation effects initiatedby trail running events in an urban protected area of Hong Kong. Land Degradation andDevelopment 29(3):422–432.Tynon, J.F., & E. Gomez (2012) Interpersonal and Social Values Conflict AmongCoastal Recreation Activity Groups in Hawaii. Journal of Leisure Research 44:4: 531. ● Challenges of nature-based tourismAnderson, D.H.; R.G. Nickerson, T.V. Stein, & M.E. Lee (2000). Planning to ProvideCommunity and Visitor Benefits. In: Gartner, W.C. and Lime, D.W. (Eds.) Trends inOutdoor Recreation, Leisure, and Tourism. Pp. 197-211. Wallingford, UK: CABIPublishing.Sebele, L. (2010) Community-based tourism ventures, benefits and challenges: KhamaRhino Sanctuary Trust, Central District, Botswana. Tourism Management 31 136–146. ● Developing nature-based tourism productsChan, C.S. & L.M. Marafa (2014) Rebranding Hong Kong “Green”: the potential forconnecting city branding with green resources. International journal of TourismSciences 14(1):93-117.Gartner, W.C. (2014) Brand equity in a tourism destination. Place, Branding and PublicDiplomacy 10(2):108-116. ● Nature-based tourism, local community and sustainable developmentNg, S.L. (2014) Hong Kong Geopark: a paradigm of urban sustainable tourism. AsianGeographer 31(1):83-96.Scheyvens, R. 1999. Ecotourism and the empowerment of local communities. TourismManagement, 20: 245- 249.United Nations World Tourism Organization. (2012). Definition. SustainableDevelopment of Tourism. (http://sdt.unwto.org/en/content/about-us-5)Wood, M. E. (2002). Ecotourism principles, practices & policies for sustainability.Paris, France; United Nations Environment Programme, Division of Technology,Industry and Economics.(http://www.uneptie.org/pc/tourism/documents/ecotourism/part-one.pdf;http://www.uneptie.org/pc/tourism/documents/ecotourism/part-two.pdf)", "recommended_readings": "Please refer to the list above.", "terms": {"2020-21 Term 1": {"--LEC (1492)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor NG Sai Leung"], "meetingDates": ["9/9", "16/9", "23/9", "30/9", "7/10", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11", "2/12", "9/12"]}}, "2021-22 Term 1": {"--LEC (2959)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["Esther Lee Bldg LT4"], "instructors": ["Professor NG Sai Leung"], "meetingDates": ["8/9", "15/9"]}}}, "assessments": {"Essays": "25", "Examination": "45", "Project": "25", "Participation": "5"}}, {"code": "5005", "title": "Resource and Environmental Management for Tourism", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSSc Sustainable Tourism", "description": "The course will cover the aspects of resource impacts of visitor activities to sites, seek to understand resource management practices at destinations and study and propose visitor management and education programs relevant to sustainable tourism. To fully understand global issues of protected areas, comparative issues on major planning and management aspects; and undertake impact assessment and monitoring.", "outcome": "-To understand basic concepts of nature resources management and tourism impacts -To identify the relevant literature in resources and environmental management -To be able to formulate management objectives and apply management frameworks for different ecotourism resources -To be able to assess, evaluate and monitor ecotourism impact management strategies and tactics -Enhancing student's skills in problem solving and effective communicatioin on ecotourism and resources management", "syllabus": "-Resource management: a case study of Hong Kong  -Governance, policy and planning  -Impacts of ecotourism and natural resources management  -Environmental management  -Marine conservation and tourism management  -Visitor management frameworks  -Impact Assessment and monitoring of ecotourism  -The role of NGOs in resources management and conservation  -Management Strategies and Techniques", "required_readings": "Prof. Wong’s Part1          Eagles, Paul F. J.; Stephen F. McCool; Christopher D. Haynes (2002), Sustainable Tourism in Parks and Protected Areas Guidelines for Planning and Management, Best Practice Protected Area Guidelines Series No. 8. IUCN and Cardiff University, Thanet Press, UK. (soft copy available)2.         IUCN, (2002), “Tourism and Protected Areas”, Parks, Vol. 12 No.1, IUCN, WCPA, Gland, Switzerland.3.         Leung, Yu-fai, et.al. (2019), Tourism and visitor management in protected areas Guidelines for sustainability, IUCN, Gland, Switzerland. (soft copy available)4.         Lockwood, Michael; Graeme L. Worboys, and Ashish Kothari (ed.), (2009), Managing Protected Areas A Global Guide, Earthscan, London.5.         Trzyna. T. (ed.) (2005), The Urban Imperative – Urban Outreach Strategies for Protected Area Agencies, IUCN, California Institute of Public Affairs, Sacramento. (soft copy available)6.         Trzyna. T. (ed.) (2014),  Urban Protected Areas  – Profiles and Best Practice Guidelines. IUCN/ WCPA. Gland, Switzerland. (soft copy available)   Prof. Chau’s Part Christine R. Rollinson. Surplus and stress control autumn timing. Science 27 Nov 2020:370, (6520): 1030-1031. Daniel Scott, C. Michael Hall, Stefan Gössling.  Global tourism vulnerability to climate change. Annals of Tourism Research, Volume 77, July 2019, Pages 49-61. Deborah Zani , Thomas W. Crowther , Lidong Mo , Susanne S. Renner , Constantin M. Zohner. Increased growing-season productivity drives earlier autumn leaf senescence in temperate trees. Science, Nov 27 2020: 370(6520):1066-1071. Fisichelli NA, Schuurman GW, Monahan WB, Ziesler PS (2015). Protected area tourism in a changing climate: will visitation at US national parks warm up or overheat? PLOS ONE 10(6): e0128226. DOI: 10.1371/journal.pone.0128226 Manfred Lenzen, Ya-Yen Sun, Futu Faturay , Yuan-Peng Ting, Arne Geschke  and Arunima Malik. The carbon footprint of global tourism. Clim. Change 8, 522–528 (2018). Manfred Lenzen, Ya-Yen Sun, Futu Faturay , Yuan-Peng Ting, Arne Geschke  and Arunima Malik. The carbon footprint of global tourism. Clim. Change 8, 522–528 (2018). Rosner, H. (2015). The bug that’s eating the woods. National Geographic, April 2015, pp.96-115.  李祝舜 , 叶新才. “国民休闲计划” 下的森林旅游开发模式研究 ---- 以泉州市为例. 林业 经 济 问 , 2010年 2月: 65-69, 78. ", "recommended_readings": "Please refer to the list above.", "terms": {"2020-21 Term 2": {"--LEC (3665)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["William M W Mong Eng Bldg 407"], "instructors": ["Professor CHAU Kwai Cheong, \n\rProfessor WONG Fook Yee"], "meetingDates": ["13/1", "20/1", "27/1", "3/2", "10/2"]}}, "2021-22 Term 2": {"--LEC (3136)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["Esther Lee Bldg LT2"], "instructors": ["Professor CHAU Kwai Cheong, \n\rProfessor WONG Fook Yee"], "meetingDates": ["12/1", "19/1", "26/1"]}}}, "assessments": {"Essays": "50", "Participation": "15", "Report": "35"}}, {"code": "5006", "title": "Ecotourism Practicum and Management", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSSc Sustainable Tourism", "description": "This course is designed to provide students the opportunity to apply basic knowledge learnt in the real world. It will help students develop environmentally friendly outdoor skills by developing concepts and techniques of communication and interpretation. The course will seek to equip students with skills to plan, develop and manage ecotourism sites and enterprises. A series of workshops, seminars and field trips and fieldwork will compliment the lectures.", "outcome": "-Collate and organize relevant (site) data for prudent ecotourism resource management; -Use various research methods common in the field of experiential education, resource conservation and community participation and overall sustainable tourism; -Apply the acquired knowledge to manage individual sites for ecotourism; -Develop skills for analytical and critical writing on relevant issues", "syllabus": " Communicating Resource Management for ecotourism and Sustainable Tourism Interpretation in (Eco) tourism Product Development (Sustainable) Tourism Models and strategies Marketing and innovation in sustainable tourism Business development and entrepreneurship Hong Kong Coastal environment: (Hydrodynamics and coastal environment)  Tourism Clusters and Sustainability Community based Tourism Strategic Leadership in the Tourism Industry", "required_readings": "Relevant references will be provided when necessary.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (4124)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [1], "locations": ["William M W Mong Eng Bldg 407"], "instructors": ["Professor Lawal Mohammed MARAFA"], "meetingDates": ["11/1", "18/1", "25/1", "1/2", "8/2"]}}, "2021-22 Term 2": {"--LEC (3926)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [1], "locations": ["Esther Lee Bldg LT4"], "instructors": ["Professor Lawal Mohammed MARAFA"], "meetingDates": ["10/1", "17/1", "24/1"]}}}, "assessments": {"Examination": "30", "Fieldwork or field study": "20", "Presentation": "25", "Project": "25"}}, {"code": "5007", "title": "Urban Tourism", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSSc Sustainable Tourism", "description": "Tourism in cities and their urban areas is an important and complicated phenomenon. Various forms of tourist activities contribute to the operations, structures and interactions within and between cities, as well as the stakeholders therein. This course is designed to allow students to investigate, study and understand the context of urban tourism. With increasing challenges caused by globalization, urbanization, tourist arrival, and the demand of additional infrastructure and resources, tourism will have to assume a new dimension in the urban context.This course attempts to explain the inter-relationships between tourism and urban environment by identifying the nature of the tourism industry in the urban areas. The course examines topical issues related to the process of development of urban tourism, its varied forms of activities, and the relevant contemporary issues relating to the management and marketing of urban destinations. By completing the course, students will be able to understand, apply and challenge concepts, theories and knowledge in urban tourism. Students will also be able to describe and assess the importance of geographical characteristics in tourism decision-making processes in the urban area.", "outcome": "•Explain the inter-relationship between tourism and the urban environment •Identify and examine the nature of the tourist industry in the urban area •Understand, apply and challenge urban theories used to understand tourism •Describe and assess the importance of geographical characteristics in the tourism decision-making processes in the urban area", "syllabus": " Urban tourism: An introduction The evolution of urban tourism: An urban context Demand and motivations of urban tourism  Urban tourism: A strategy for urban changes Soundscape and urban tourism  Pilgrimage and religious tourism  Urban tourism product development  Place marketing and branding  Urban tourism: Conclusion, implications and debates(Subject to specific order and arrangements each year)", "required_readings": "References (Books) Selby, M. (2004). Understanding urban tourism: Image, culture and experience. London; New York: I.B. Tauris. Spirou, C. (2011). Urban tourism and urban change: Cities in a global economy. New York: Routledge. References (Journal articles and other sources)  Ashworth, G., & Page, S. J. (2011). Urban tourism research: Recent progress and current paradoxes. Tourism Management, 32(1), 1-15.  Edwards, D., Griffin, T., & Hayllar, B. (2008). Urban tourism research: Developing an agenda. Annals of Tourism Research, 35(4), 1032-1052. Hinch, T. D. (1996). Urban tourism: Perspectives on sustainability. Journal of Sustainable Tourism, 4(2), 95-110. Pasquinelli, C. (2015). Urban tourism(s): Is there a case for a paradigm shift? GSSI Cities Working papers #14/2015. Centre for Advanced Studies, Gran Sasso Science Institute. United Nations World Tourism Organization (UNWTO). (2018). ‘Overtourism’? – Understanding and managing urban tourism growth beyond perceptions, executive summary. Retrieved from https://www.e-unwto.org/doi/book/10.18111/9789284420070 United Nations World Tourism Organization (UNWTO)/World Tourism Cities Federation (WTCF). (2018). City tourism performance research. Retrieved from https://www.e-unwto.org/doi/pdf/10.18111/9789284419616 References in the individual weeks Cook, R. A., Hsu, C. H. C. Hsu, & Marqua, J. J. (2014). Tourism: The business of hospitality and travel (5th ed.). Boston: Pearson. (Chapter 10) Jafari, J., & Ritchie, J. R. B. (1981). Toward a framework for tourism education: Problems and prospects. Annals of Tourism Research, 8(1), 13-34.  Pearce, D. G. (2001). An integrative framework for urban tourism research. Annals of Tourism Research, 28(4), 926-946.  Battilani, P., & Fauri, F. (2009). The rise of a service-based economy and its transformation: Seaside tourism and the case of Rimini. Journal of Tourism History, 1(1), 27-48.  Law, C. M. (2002). Urban tourism: The visitor economy and the growth of large cities. London: Continuum. (Chapter 3) London, D. (2013). Progress and authenticity: Urban renewal, urban tourism, and the meaning(s) of mid-twentieth-century New York. Journal of Tourism History, 5(2), 172-184.  Law, C. M. (2002). Urban tourism: The visitor economy and the growth of large cities. London: Continuum. (Chapter 2) Ormond, M. (2014). Medical tourism. In A. A. Lew, C. M. Hall, & A. M. Williams (Eds.), The Wiley Blackwell companion to tourism (pp. 426-434). Chichester, West Sussex; Malden, MA: Wiley Blackwell. Pearce, P. L. (2014). Tourism motivations and decision making. In A. A. Lew, C. M. Hall, & A. M. Williams (Eds.), The Wiley Blackwell companion to tourism (pp. 45-54). Chichester, West Sussex; Malden, MA: Wiley Blackwell. Hall, C. M. (2015). The coming perfect storm: Medical tourism as a biosecurity issue. In N. Lunt, D. Horsfall, & J. Hanefeld (Eds.), Handbook on medical tourism and patient mobility (pp. 193–204). Cheltenham, UK: Edward Elgar Publishing. Avraham, E. (2004). Media strategies for improving an unfavourable city image. Cities, 21(6), 471-479. doi: http://dx.doi.org/10.1016/j.cities.2004.08.005 Holcomb, B. (1994). City make-overs: Marketing the post-industrial city. In: J. R. Gold & S. V. Ward (Eds.), Place promotion: The use of publicity and marketing to sell towns and regions (pp. 115-131). Chichester, England; New York: Wiley. Law, C. M. (2000). Regenerating the city centre through leisure and tourism. Built Environment, 26(2), 117-129. Law, C. M. (2002). Urban tourism: The visitor economy and the growth of large cities. London: Continuum. (Chapter 4) Agapito, D., Valle, P., & Mendes, J. (2014). The sensory dimension of tourist experience: Capturing meaningful sensory-informed themes in South Portugal. Tourism Management, 42, 224-237. Dzhambov, A. M., & Dimitrova, D. D. (2015). Green spaces and environmental noise perception. Urban Forestry & Urban Greening, 14, 1000-1008.  Gustafsson, C. (2015). Sonic branding: A consumer-oriented literature review. Journal of Brand Management, 22(1), 20-37. Pan, S., & Ryan, C. (2009). Tourism sense-making: The role of the senses and travel journalism. Journal of Travel & Tourism Marketing, 26, 625-639.  Ambrósio, V. (2011). Sacred pilgrimage and tourism as secular pilgrimage. In R. Raj & N. D. Morpeth (Eds.), Religious tourism and pilgrimage festivals management: An international perspective (pp. 78-88). Wallingford, Oxfordshire; Cambridge, MA: CABI Pub. Blackwell, R. (2011). Motivations for religious tourism, pilgrimage, festivals and events. In R. Raj & N. D. Morpeth (Eds.), Religious tourism and pilgrimage festivals management: An international perspective (pp. 35-47). Wallingford, Oxfordshire; Cambridge, MA: CABI Pub. Chattopadhyay, M. (2006). Religion and tourism – Perspectives. In M. Chattopadhyay (Ed.), Religious tourism: An introduction (pp. 3-15). Agartala, India: ICFAI University Press. Ngulani, T., & Shackleton, C. M. (2021). Use of public urban green spaces for spiritual services in Bulawayo, Zimbabwe. Urban Forestry & Urban Greening, 38, 97-104. Rashid, A. (2018). Religious tourism – A review of the literature. Journal of Hospitality and Tourism Insights, 1(2), 150-167. Sarathy, V. P. (2006). Religious tourism: An overview. In M. Chattopadhyay (Ed.), Religious tourism: An introduction (pp. 16-36). Agartala, India: ICFAI University Press. Stausberg, M. (2014). Religion and spirituality in tourism. In A. A. Lew, C. M. Hall, & A. M. Williams (Eds.), The Wiley Blackwell companion to tourism (pp. 349-360). Chichester, West Sussex; Malden, MA: Wiley Blackwell. Zhang, M., Huang, L., Wang, J-H., Liu, J., Jie, Y-G., & Lai, X. (2011). Religious tourism and cultural pilgrimage: A Chinese perspective. In R. Raj & N. D. Morpeth (Eds.), Religious tourism and pilgrimage festivals management: An international perspective (pp. 98-112). Wallingford, Oxfordshire; Cambridge, MA: CABI Pub. Ashworth, G. J., & Voogd, H. (1994). Marketing and place promotion. In J. R. Gold & S. V. Ward (Eds.), Place promotion: The use of publicity and marketing to sell towns and regions (pp. 39-52). Chichester, England; New York: Wiley. Bramwell, B. (1998). User satisfaction and product development in urban tourism. Tourism Management, 19(1), 35-47. doi:10.1016/S0261-5177(97)00091-5 Hayllar, B., Griffin, T., & Edwards, D. (Eds.). (2008). City spaces, tourist places: Urban tourism precincts. Jordan Hill, Oxford: Butterworth-Heinemann/Elsevier. (Chapter 3) Kislali, H., Kavaratzis, M., & Saren, M. (2021). Destination image formation: Towards a holistic approach. International Journal of Tourism Research, 22(2), 266-276. McNeill, D. (2008). The hotel and the city. Progress in Human Geography, 32(3), 383-398. doi:10.1177/0309132508089096 Morrison, A. M. (2013). Marketing and managing tourism destinations. Abingdon, Oxon; New York: Routledge, 2013. (Chapter 5) Anholt, S. (2010). Definitions of place branding – Working towards a resolution. Place Branding and Public Diplomacy, 6(1), pp.1-10. Ashworth, G., & Kavaratzis, M. (2010) (Eds.), Towards effective place branding management: Branding European cities and regions. Cheltenham, UK; Northampton, MA: Edward Elgar. (Chapter 2) Chan, C. S., & Marafa, L. M. (2013). A review of place branding methodologies in the new millennium. Place Branding and Public Diplomacy, 9(4), 236-253. Dinnie, K. (2011). (Ed.), City branding: Theory and cases. Houndmills, Basingstoke, Hampshire and New York: Palgrave Macmillan. (Chapters 1-2) Florek, M., Herezniak, M., & Augustyn, A. (2019). You can’t govern if you don’t measure: Experts’ insights into place branding effectiveness assessment. Journal of Place Management and Development, 12(4), 545-565. Govers, R., & Go, F. (2009). Place branding: Global, virtual and physical identities, constructed, imagined and experienced. Basingstoke: Palgrave Macmillan. (Chapters 1-3) Govers, R. (2013). Why place branding is not about logos and slogans. Place Branding and Public Diplomacy, 9(2), 71-75. Green, A., Grace, D., & Perkins, H. (2016). City branding research and practice: An integrative review. Journal of Brand Management, 23(3), 252-272. Lucarelli, A. (2018). Co-branding public place brands: Towards an alternative approach to place branding. Place Branding and Public Diplomacy, 14(4), 260–271. Zenker, S., & Martin, N. (2011). Measuring success in place marketing and branding. Place Branding and Public Diplomacy, 7(1), 32-41. Chang, T. C., & Huang, S. (2014). Urban tourism and the experience economy. In A. A. Lew, C. M. Hall, & A. M. Williams (Eds.), The Wiley Blackwell companion to tourism (pp. 220-229). Chichester, West Sussex; Malden, MA: Wiley Blackwell. Law, C. M. (2002). Urban tourism: The visitor economy and the growth of large cities. London: Continuum. (Chapter 9) Richards, G. (2014). Creativity and tourism in the city. Current Issues in Tourism, 17(2), 119-144. Richards, G., & Wilson, J. (2006). Developing creativity in tourist experience: A solution to the serial reproduction of culture? Tourism Management, 27, 1209-1223. Rogerson, C. M. (2006). Creative industries and urban tourism: South African perspectives. Urban Forum, 17(2), 149-166.(Additional references will be provided when necessary.)", "recommended_readings": "Please refer to the list above.", "terms": {"2020-21 Term 2": {"--LEC (1582)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Y.C. Liang Hall 104"], "instructors": ["Professor CHAN Chung Shing"], "meetingDates": ["12/1", "19/1", "26/1", "2/2", "9/2"]}}, "2021-22 Term 2": {"--LEC (3033)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Esther Lee Bldg LT3"], "instructors": ["Professor CHAN Chung Shing"], "meetingDates": ["11/1", "18/1", "25/1"]}}}, "assessments": {"Examination": "40", "Project": "40", "Report": "20"}}, {"code": "5008", "title": "Overseas Field Studies", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSSc Sustainable Tourism", "description": "The importance of field studies for tourism students is immeasurable. It forms a major complimentary aspect of the programme and is designed to give the students an opportunity to understand the real-world situation. The aim of the course is to enable students to take part in field studies away from Hong Kong where they will get involved a “local” field project that gives a stimulating, realistic and practical experience that will add value to the educational experience. The field studies programme will be undertaken in a local environment that will allow the students to take active part, identify and put theories into practice by collecting data, analyzing and interpreting the information for strategic planning and location analysis of the tourism industry.While this will provide the opportunity for individual development of the students, it will also provide an opportunity for students to work as a team in project management and problem-solving. Students are required to participate in all activities throughout the field studies, do presentations and submit reports on completion.", "outcome": "- Enhance student’s participation in experiential learning in a different environment - Acquire knowledge in the practical aspect of the industry - Integrate theoretical knowledge and apply possible solutions in real world situations - Have a global perspective in understand the tourism industry", "syllabus": " Pre-trip introduction and briefing sessions Discussion and sharing sessions during the field trip Visits to selected sites Onsite individual and group-based fieldwork Academic visits or exchange activities Post-trip presentation(Subject to specific order and arrangements each year)", "required_readings": " Specific references will be provided before each trip.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (1583)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor CHAN Chung Shing"], "meetingDates": ["11/01/2021 - 19/04/2021"]}}, "2021-22 Term 2": {"--LEC (3034)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor CHAN Chung Shing"], "meetingDates": ["10/01/2022 - 18/04/2022"]}}}, "assessments": {"Essays": "20", "Presentation": "20", "Participation": "20", "Report": "40"}}, {"code": "5012", "title": "Dissertation", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "Independent StudyLecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSSc Sustainable Tourism", "description": "Students are required to carry out independent studies of selected topics in sustainable tourism under staff supervision. Evaluation will be based on project presentations and written reports.", "outcome": "- Advance students' own knowledge and understanding of Sustainable Tourism through self-paced independent learning - Demonstrate a systematic understanding and a critical awareness of current trends in sustainable tourism - Demonstrate ability to select, design and implement an appropriate piece of research - Demonstrate self-direction and originality in developing problem-solving skills and applying them in a structured research situation", "syllabus": " Library workshops Dissertation writing workshops Group meetings by individual supervisors (e.g. progress report, final presentation, etc.) Individual consultation meetings arranged by supervisors and students(Subject to specific order and arrangements each year)", "required_readings": " American Psychological Association (APA). (2010) (or newer edition). Publication manual of the American Psychological Association (6th ed.). Washington, DC: Author. Calabrese, R. L. (2012). Getting it right: The essential elements of a dissertation. Lanham, Md.: Rowman & Littlefield Education. Cassell, C., & Symon, G. (Eds.) (2004). Essential guide to qualitative methods in organizational research. London, The United Kingdom: SAGE Publications. Cooley, L., & Lewkowicz, J. (2003). Dissertation writing in practice: Turning ideas into text. Hong Kong: Hong Kong University Press. Hart, C. (2005). Doing your masters dissertation: Realizing your potential as a social scientist. London; Thousand Oaks, Calif.: SAGE. Murray, N., & Beglar, D. (2009). Inside track: Writing dissertations and theses. Harlow, England; New York: Pearson Longman. Wong, P. T. P. (2002). How to write a research proposal. Retrieved from: http://www.meaning.ca/articles/writing_research_proposal_may02.htm(Additional references will be provided when necessary.)", "recommended_readings": "Please refer to the list above.", "terms": {"2020-21 Summer Session": {"-I01-IND (1043)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Dr. LEE Wai Ying Joanna, \n\rProfessor CHAN Chung Shing, \n\rProfessor CHAU Kwai Cheong, \n\rProfessor Lawal Mohammed MARAFA, \n\rProfessor NG Sai Leung, \n\rProfessor SHEN Jianfa, \n\rProfessor WONG Fook Yee"], "meetingDates": ["17/05/2021 - 28/06/2021"]}}, "2021-22 Summer Session": {"-I01-IND (1110)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Dr. LEE Wai Ying Joanna, \n\rProfessor CHAN Chung Shing, \n\rProfessor CHAU Kwai Cheong, \n\rProfessor Lawal Mohammed MARAFA, \n\rProfessor NG Sai Leung, \n\rProfessor SHEN Jianfa, \n\rProfessor WONG Fook Yee"], "meetingDates": ["16/05/2022 - 27/06/2022"]}}}, "assessments": {"Others": "5", "Presentation": "10", "Participation": "5", "Report": "80"}}]