[{"code": "5001", "title": "Planning for Sustainable Tourism Development", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSSc Sustainable Tourism", "description": "The course introduces the scope, nature and trends of tourism as well as the concept of sustainability and its application to the strategic planning for tourism. Tourism as a contemporary leisure experience is examined along with economic, political and social ramifications and implications for the future. Selected tourism resources and impacts of the activity on the host countries, both developed and developing, and environments will be discussed, followed by an examination of the principles of good practice in tourism. The strategic planning processes for sustainable tourism development will also be addressed and illustrated by a variety of local and international case studies.", "outcome": "-Understanding tourism as a complex form of development that is linked to the economy, culture and environment; -Realizing that tourism contains both promises (e.g., better quality life and heritage protection) and pitfalls; -Employing sustainable tourism as a tool of social and economic development and a method of protecting our cultural and natural heritage; and\r -Understanding the concept of sustainability and its application to the strategic planning for tourism.", "syllabus": "-Understanding tourism in a globalizing world\r -Sustainability and tourism planning\r -Economic, social and environmental impacts of tourism\r -Tourism planning in Hong Kong and the Pearl River Delta\r -Tourism planning in Macau\r -World Heritage Tourism in China: Problems and Prospects\r -Comparative tourism planning between China and the West\r -Principles of good practice in sustainable tourism", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (2078)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. LEE Wai Ying Joanna, \n\rProfessor CHAN Chung Shing"]}}}}, {"code": "5002", "title": "Cultural and Heritage Tourism", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSSc Sustainable Tourism", "description": "This course analyses the nature and importance of cultural heritage as capital for tourism. Introductory lectures identify various types of heritage (tangible and intangible) and provide an understanding of the concept, scope and evolution of cultural-heritage tourism. Issues of cultural and artistic authenticity, identity production and marketing, and commodification of both tourists and the toured will further be examined. Case studies from Hong Kong and other parts of the world will be studied to identify specific socio-economic and cultural costs and benefits associated with this kind of tourism. The course will also explore approaches and policies of cultural heritage management and conservation to enable sustainable tourism development, with particular emphasis on the cases of Hong Kong and the Pearl River Delta.", "outcome": "-To analyze the nature and importance of cultural heritage as resources for tourism; -To examine the concept, evolution and key planning and management of cultural heritage and tourism\r -To Help students develop critical thinking on the planning and management of cultural heritage and tourism", "syllabus": "-Defining Heritage\r -Cultural Heritage as a Tourism Resources\r -Intangible Cultural Heritage\r -Lunar New Year Holiday\r -Planning, Governance and Management of Cultural Heritage\r -British Legacy and Other Forein Cultural Influence in Hong Kong\r -Collective Memories: from East to West\r -China's Cultural Heritage-A case study of Tulou in Fukien province\r -Hakka cultural heritage in Hong Kong\r -Heritage trees-their cultural values and beyond", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (4118)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["William M W Mong Eng Bldg 407"], "instructors": ["Dr. LEE Wai Ying Joanna, \n\rProfessor CHAU Kwai Cheong"]}}}}, {"code": "5003", "title": "Tourism Policy and Development", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSSc Sustainable Tourism", "description": "This course is intended to expose students to the understanding of basic concepts, trends, philosophy and challenges of ecotourism. It will investigate and seek to understand policy implications of ecotourism development. While ecotourism is the fastest growing sector of the world's tourism industry, it is still not well understood. Where ecotourism is being conceived and practiced, there is often a dearth of knowledge in ecotourism policy aspects. The course will draw on examples of various tourism policy initiatives with approaches concerning the environment, local community, tourists, businesses and those affected by this type of tourism.", "outcome": "-Understand the basic conceptual framework for ecotourism and the overall tourism industry in the context of policy and decision-making; -Acquire knowledge of how policies and institutions influence the operation and management of ecotourism destinations and activities; -Develop an understanding and skills necessary for researching and interpreting relevant policy and planning of natural and man-made resources for tourism\r -Enhance students problem solving capability using an integrative approach and critical thinking", "syllabus": "-Introduction to Ecotourism and its Sustainability\r -Basic Concepts, Definitions and Trends in Tourism Industry related to Policy\r -The Concept of Tourism and Ecotourism Policy\r -Ecotourism for Biodiversity and Conservation: Policy Implications\r -Ecotourism as an Alternative Tourism: Philosophy and context of ecotourism\r -Institutional Arrangements for Ecotourism Policy\r -Governance for Ecotourism and Sustainable Tourism\r -Ecotourism at Destinations: Opportunities, constraints and Research (case studies/HK etc.) \r -Class Forum (Video)\r -Planning for Ecotourism \r -Management and Business in Ecotourism and Sustainable Tourism\r -Student Presentation", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (4013)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor Lawal Mohammed MARAFA, \n\rProfessor Trevor Harvey Boyd SOFIELD"]}}}}, {"code": "5004", "title": "Nature-based Tourism", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSSc Sustainable Tourism", "description": "Nature-based tourism definitely is one of the most popular tourism forms in the world. It refers to a number of tourist activities associated with the natural environment. In this course, some of the concepts and related issues, such as distinctions between nature-based tourism and other forms of tourism, benefits and challenges of nature-based tourism, management of natural and ecological resources, park design and management, interpretation, sustainability, participation of local communities and nature based tourism products, will be explored. In order to enhance the learning experience, an interactive teaching mode will be adopted in the lectures so that the instructors can guide students to analyze the cases and issues through queries and answers. Furthermore, field trips will also be organized in which students can articulate what they learn from the class teaching. This course attempts to provide students with a comprehensive introduction to nature-based tourism, with the following specific objectives: - To examine the key concepts, theories and techniques in the management of natural and ecological resources;  - To analyze the importance of natural and ecological resources for development of nature based tourism; and - To help students develop critical thinking on the planning and management of natural environment and nature based tourism.", "outcome": "-Understand the concepts of biodiversity and geodiversity\r -Develop an appreciation of the natural environment and landscapes of Hong Kong\r -Understand the principles of conservation and management of biodiversity and geodiversity\r -Improve generic skills such as critical thinking, presentation and writing skills", "syllabus": "-Man-land relationship, environmental movement; -Endogenetic and exogenetic processes, erosion cycle; -Mineralology, gemology; -Lithology, rock cycle; -Continental drift, sea floor spreading, hotspot; -Elastic rebound, volcanology, human response; -Geological time, evolution, environmental change; -Geodiversity, geoconservation, natyre conservation; -Hong Kong geopark, geotourism development, sustainable tourism", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (1492)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor NG Sai Leung"]}}}}, {"code": "5005", "title": "Resource and Environmental Management for Tourism", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSSc Sustainable Tourism", "description": "The course will cover the aspects of resource impacts of visitor activities to sites, seek to understand resource management practices at destinations and study and propose visitor management and education programs relevant to sustainable tourism. To fully understand global issues of protected areas, comparative issues on major planning and management aspects; and undertake impact assessment and monitoring.", "outcome": "-To understand basic concepts of nature resources management and tourism impacts\r -To identify the relevant literature in resources and environmental management\r -To be able to formulate management objectives and apply management frameworks for different ecotourism resources\r -To be able to assess, evaluate and monitor ecotourism impact management strategies and tactics\r -Enhancing student's skills in problem solving and effective communicatioin on ecotourism and resources management", "syllabus": "-Resource management: a case study of Hong Kong\r -Governance, policy and planning\r -Impacts of ecotourism and natural resources management\r -Environmental management\r -Marine conservation and tourism management\r -Visitor management frameworks\r -Impact Assessment and monitoring of ecotourism\r -The role of NGOs in resources management and conservation\r -Mnagement Strategies and Techniques", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (3665)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["William M W Mong Eng Bldg 407"], "instructors": ["Professor CHAU Kwai Cheong, \n\rProfessor WONG Fook Yee"]}}}}, {"code": "5006", "title": "Ecotourism Practicum and Management", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSSc Sustainable Tourism", "description": "This course is designed to provide students the opportunity to apply basic knowledge learnt in the real world. It will help students develop environmentally friendly outdoor skills by developing concepts and techniques of communication and interpretation. The course will seek to equip students with skills to plan, develop and manage ecotourism sites and enterprises. A series of workshops, seminars and field trips and fieldwork will compliment the lectures.", "outcome": "-Collate and organize relevant (site) data for prudent ecotourism resource management; -Use various research methods common in the field of experiential education, resource conservation and community participation and overall sustainable tourism; -Apply the acquired knowledge to manage individual sites for ecotourism; -Develop skills for analytical and critical writing on relevant issues", "syllabus": "-Development of communication skills in Resource management \r -Tourism Clusters and sustainability\r -Community-based (Eco) tourism\r -Business plans for sustainable tourism development\r -HK Coastal environment\r -Interpretation in Ecotourism\r -Design and Organizing an Ecotour\r -Ecotour Guiding principles", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (4124)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [1], "locations": ["William M W Mong Eng Bldg 407"], "instructors": ["Professor Lawal Mohammed MARAFA"]}}}}, {"code": "5007", "title": "Urban Tourism", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSSc Sustainable Tourism", "description": "Tourism in cities and their urban areas is an important and complicated phenomenon. Various forms of tourist activities contribute to the operations, structures and interactions within and between cities, as well as the stakeholders therein. This course is designed to allow students to investigate, study and understand the context of urban tourism. With increasing challenges caused by globalization, urbanization, tourist arrival, and the demand of additional infrastructure and resources, tourism will have to assume a new dimension in the urban context.This course attempts to explain the inter-relationships between tourism and urban environment by identifying the nature of the tourism industry in the urban areas. The course examines topical issues related to the process of development of urban tourism, its varied forms of activities, and the relevant contemporary issues relating to the management and marketing of urban destinations. By completing the course, students will be able to understand, apply and challenge concepts, theories and knowledge in urban tourism. Students will also be able to describe and assess the importance of geographical characteristics in tourism decision-making processes in the urban area.", "outcome": "•Explain the inter-relationship between tourism and the urban environment\r •Identify and examine the nature of the tourist industry in the urban area\r •Understand, apply and challenge urban theories used to understand tourism\r •Describe and assess the importance of geographical characteristics in the tourism decision-making processes in the urban area", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (1582)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Y.C. Liang Hall 104"], "instructors": ["Professor CHAN Chung Shing"]}}}}, {"code": "5008", "title": "Overseas Field Studies", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSSc Sustainable Tourism", "description": "The importance of field studies for tourism students is immeasurable. It forms a major complimentary aspect of the programme and is designed to give the students an opportunity to understand the real-world situation. The aim of the course is to enable students to take part in field studies away from Hong Kong where they will get involved a “local” field project that gives a stimulating, realistic and practical experience that will add value to the educational experience. The field studies programme will be undertaken in a local environment that will allow the students to take active part, identify and put theories into practice by collecting data, analyzing and interpreting the information for strategic planning and location analysis of the tourism industry.While this will provide the opportunity for individual development of the students, it will also provide an opportunity for students to work as a team in project management and problem-solving. Students are required to participate in all activities throughout the field studies, do presentations and submit reports on completion.", "outcome": "- Enhance student’s participation in experiential learning in a different environment\r - Acquire knowledge in the practical aspect of the industry\r - Integrate theoretical knowledge and apply possible solutions in real world situations\r - Have a global perspective in understand the tourism industry", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (1583)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor CHAN Chung Shing"]}}}}, {"code": "5012", "title": "Dissertation", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "Independent StudyLecture", "campus": "Main Campus", "academic_group": "Div of Geo & Resource Mgt", "requirements": "For students in MSSc Sustainable Tourism", "description": "Students are required to carry out independent studies of selected topics in sustainable tourism under staff supervision. Evaluation will be based on project presentations and written reports.", "outcome": "- Advance students' own knowledge and understanding of Sustainable Tourism through self-paced independent learning\r - Demonstrate a systematic understanding and a critical awareness of current trends in sustainable tourism\r - Demonstrate ability to select, design and implement an appropriate piece of research\r - Demonstrate self-direction and originality in developing problem-solving skills and applying them in a structured research situation", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Summer Session": {"-I01-IND (1043)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Dr. LEE Wai Ying Joanna, \n\rProfessor CHAN Chung Shing, \n\rProfessor CHAU Kwai Cheong, \n\rProfessor Lawal Mohammed MARAFA, \n\rProfessor NG Sai Leung, \n\rProfessor SHEN Jianfa, \n\rProfessor WONG Fook Yee"]}}}}]