[{"code": "5001", "title": "Pure Land Buddhism", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Buddhist Studies", "description": "The course explores the history, doctrines, thoughts, and literature of Pure Land Buddhism in China. It includes the historical development of the Pure Land tradition in medieval China with an analysis of major figures and their interactions with Chinese cultural tradition. Readings will include both the primary and secondary sources.", "outcome": "Knowledge Outcomes:\r Upon completing this module successfully, students should be able to \r (1) demonstrate an in-depth understanding of the historical development, doctrines and practices of Chan/Zen school of Buddhism in China\r (2) engage in a critical analysis of Chan/Zen Buddhism by the methods of the humanities and social sciences\r  Skill Outcomes\r Upon completing this module successfully, students should be able to\r (1) develop their analytical and problem solving ability, critical intelligence and appreciative thinking as well as key research skills and to prepare for advanced studies in religion.\r (2) develop their social and interpersonal skills and ability to work collaboratively in a team.\r  Attitude Outcomes\r Upon completing this module successfully, students should be able to\r (1) recognize the contested and provisional nature of knowledge and understanding.\r (2) develop tolerance of diverse positions and have respect for other’s view\r (3) develop sensitivity to ultimate concern and religious dimension of human life", "syllabus": "1. Introduction: Origin of Chanting the Buddha’s name (nianfo) and its development\r 2. Different types of Pure Land (Jingtu or Shkhavati)\r 3. Dharmakara法藏比丘and his 48 vows\r 4. The issue of ‘Other Power’ and ‘Self Power’\r 5. Attaining the Pure Land at death bed\r 6. The three main sutras of Pure Land Buddhism\r 7. Historical Personages: Huiyuan慧遠 (334-416) and Tanluan曇鸞 (476-542), \r 8. Historical Personages: Daochuo道綽 (562-645) and Shantao善導 (613-681)\r 9. Pure Land Buddhism today", "required_readings": "Longer Pure Land Sutra, Shorter Pure Land Sutra, Meditation Sutra (Sutra on the Contemplation of the Buddha of Infinite Life)\r 《無量壽經》、《觀無量壽佛經》、《阿彌陀經》淨土三經等。 楊白衣〈淨土的淵源及其演變〉《華崗佛學學報》8(1985 . 10): 77 -193\r 釋聖嚴〈淨土思想之考察〉《華崗佛學學報》6(1983.7):5-48", "recommended_readings": "Ama, Michihiro. Immigrants to the Pure Land: The Modernization, Acculturation, and Globalization of Shin Buddhism, 1898-1941. Honolulu: University of Hawai’i Press, 2011.\r Amstutz, Galen. Interpreting Amida: History and Orientalism in the Study of Pure Land Buddhism. Albany: State University of New York Press, 1997.\r Blum, Mark L. The Origins and Development of Pure Land Buddhism: A Study and Translation of Gyonen's凝然Jodo Homon Genrusho. New York: Oxford University Press, 2002.\r Gomez, Luis O., The Land of Bliss: The Paradise of the Buddha of measureless Light. Honolulu: University of Hawai'i Press, 1996.\r Halkias, Georgios. Luminous Bliss: A Religious History of Pure Land Literature in Tibet. Honolulu: University of Hawai’i Press, 2013.\r Jones, Charles B. “Foundations of Ethics and Practice in Chinese Pure Land Buddhism” in Journal of Buddhist Ethics 10(2003):2-20.\r Mochizuki, Shinko, Leo M Pruden trans. “Pure Land Buddhism in China: A doctrinal History” in Journal of the Institute of Buddhist Studies 2 Fall (2000): 91-103.\r Payne, Richard K. and Tanaka, Kenneth K. ed. Approaching the Land of Bliss: Religious Praxis in the Cult of Amitābha. Honolulu: University of Hawai’i Press, 2004.\r Payne, Richard K. Path of No Path: Contemporary Studies in Pure Land Buddhism Honoring Roger Corless. Berkeley, CA :Institute of Buddhist Studies and Numata Center for Buddhist Translation and Research, 2009.\r Ratnaguna & Śraddhāpa. Great Faith, Great Wisdom: practice and awakening in the Pure Land sūtras of Mahāyāna Buddhism. Cambridge: Windhorse Publications, 2016.\r Sharf, Robert. \"On Pure Land Buddhism and Ch'an/Pure Land Syncretism in Medieval China,\" T'oung Pao 88, no. 4-5 (June, 2003): 282-331\r Shih, Heng-ching, The Syncretism of Chan and Pure Land Buddhism. New York, San Francisco, Peter Lang Publishing Inc., 1992.\r Strauch, Ingo. “More Missing Pieces of Early Pure Land Buddhism: New Evidence for Aksobhya and Abhirati in an Early Mahayana Sutra from Gandhara” in Eastern Buddhist 41(1):23-66 · January 2010\r Stuart Chandler. Establishing a Pure Land on Earth: The Foguang Buddhist Perspective on Modernization and Globalization. University of Hawaii Press in 2004.\r Tanaka, Kenneth K., The Dawn of Chinese Pure Land Buddhist Doctrine. Albany: SUNY Press, 1990.\r 木村泰賢〈現實與淨土〉，收於張曼濤主編《淨土宗概論》《現代佛教學術叢刊》第64册，台北：大乘文化出版社，1979年，頁279－281。\r 印順法師〈淨土新論〉，收於《淨土與禪》（《妙雲集》下編之四），臺北：正聞出版社，1992（修訂一版）。\r 江燦輝《人間淨土的追尋——中國近世佛教思想研究》台北：稻香出版社，1989年。\r 區結成 《慧遠》台北：東大圖書公司，1987 年。\r 張曼濤主編《淨土典籍研究》《現代佛教學術叢刊》六八，台北 : 大乘文化出版社，1979年\r 張曼濤主編《淨土宗概論》《現代佛教學術叢刊》六四 ，台北：大乘文化出版社，1976年\r 張曼濤主編《淨土思想論集》 (一)、 (二)《現代佛教學術叢刊》六六 、六七，台北 : 大乘文化出版社，1978-1979年。\r 張澄基《淨土今說》台北：慧炬出版社，1992年。\r 望月信亨著、釋印海譯 《中國淨土教理史》台北市 : 慧日講堂, 1974年。\r 望月信亨著、釋印海譯《淨土教起源及其開展》台北：財團法人嚴寬祐文教基金會，2004年。\r 陳揚炯《中國淨土宗通史》江蘇：古籍出版社，2000年。\r 陳劍煌《行腳走過淨土法門：曇鷥、道綽與善導開展彌陀淨土教門之軌轍》台北：商周出版／城邦文化事業有限公司，2009年。\r 陳劍煌《圓通證道：印光的淨土啟化》台北：東大出版社，2002年。\r 溫金柯《繼往與開新——從現代禪到淨土思想》台北：淨宗出版社，2005年。\r 廖閱鵬《淨土三系之研究》高雄：佛光出版社，1989年\r 藤田宏達等著、釋印海譯《淨土教思想論》台北：財團法人嚴寬祐文教基金會，2004年。\r 藤吉慈海〈印順法師的《淨土新論》──現代中國淨土教的一個剖面〉，溫金柯譯，收於印順編《法海微波》，台北：正聞出版社，1986年。\r 釋修禪《台灣淨土六十年》台中：圓淨出版社，2003年。\r 釋根通主編《中國淨土宗研究》北京：宗教文化出版社，2008年。\r 釋聖嚴〈明末中國的淨土教人物及其思想〉《華崗佛學學報》8(1985. 10 ): 1-76\r 釋聖嚴《人間淨土》台北：法鼓文化事業股份有限公司，1997年。\r 釋聖嚴著 關世謙譯《明末中國佛教之研究》台北：學生書局，1988年 。", "terms": {"2020-21 Term 2": {"--LEC (1859)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [3], "locations": ["Yasumoto Int'l Acad Park 201"], "instructors": ["Professor CHEN Chien Huang"]}}}, "assessments": {"Attendance": "10", "Essays": "80", "Participation": "10"}}, {"code": "5002", "title": "Chan Buddhism", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Buddhist Studies", "description": "The course explores the history, doctrines, thoughts, and literature of Chan Buddhism in China. It includes a study of the historical development of the Chan tradition in medieval China with an analysis of major figures such as Huineng, his Platform Sūtra and its interactions with Chinese cultural tradition. This course also helps students familiarize themselves with how Chan is studied by leading scholars in the field of Buddhist studies. The course will explore how Chan teachings and practices can contribute to various cultural activities and the seeking of meaning of life in modern society.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5003", "title": "Tiantai Buddhism", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Buddhist Studies", "description": "The course explores the history, doctrines, thoughts, and literature of Tiantai Buddhism in China. It includes a study of the historical development of the Tiantai tradition in medieval China with an analysis of major figures and their interactions with Chinese cultural tradition. Readings will include both primary and secondary sources.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5004", "title": "Special Topics in Chinese Buddhist Studies", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Buddhist Studies", "description": "Special topics courses are developed to cover emerging issues facing Buddhism today or specialized content in Buddhist Studies not represented in the main curriculum. It addresses a current or timely topic, that are in a pilot phase before being offered on an ongoing basis or that are known to be one time offerings. Topics covered can vary from term to term. Students should consult the Graduate division on the content of the course on offer.", "outcome": "1) Knowledge\r To enable students to obtain a broad knowledge of Buddhist Studies as a discipline and a more specialized knowledge in a particular sub-field of concentration.\r 2) Skills\r To help the students develop research skills in Buddhist Studies, including their competence in academic writing and presentation in order to prepare them for further academic research in Buddhist Studies.\r 3) Attitude \r To develop a reflective and empathetic attitude in understanding Buddhism.", "syllabus": "To be given in due course", "required_readings": "To be given in due course", "recommended_readings": "To be given in due course", "terms": {"2020-21 Term 1": {"--LEC (1855)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor Douglas Matthew GILDOW"]}}}, "assessments": {"Attendance": "10", "Essays": "80", "Participation": "10"}}, {"code": "5005", "title": "The Thoughts and History of Humanistic Buddhism", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA in Buddhist Studies", "description": "Humanistic Buddhism has become one of the mainstreams of Buddhist tradition in modern world. This course is to study the development of Humanistic Buddhism, including its history, thoughts, and practices. It is divided into three closely related parts. We will first investigate the basic doctrines of traditional Buddhism in relation to the arising of humanistic Buddhism. We then examine the history of humanistic Buddhism in the early Republic era (1912-1949). The social, political, religious, as well as economic background in which Humanistic Buddhism arose will be discussed with an emphasis on the interaction between Buddhist institutions and society. The teaching and practice of some pioneers of Humanistic Buddhism, such as Ven. Taixu will be studied. Finally, we will explore the contemporary developments of humanistic Buddhism in general, and Foguan Shan Buddhism in particular.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5006", "title": "Dunhuang Buddhist Iconography", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA in Buddhist Studies.", "description": "The renowned Dunhuangologist Ji Xianlin (1911-2009) once pointed out: “There are only four cultural systems in the world which have been recognized as having a long history, a vast geographical span, a selfcontained cultural system as well as far-reaching impacts – China, India, Greece and Islam; the fifth one does not exist. There is only one place where all four of these cultural systems converge – the region of Dunhuang and Xinjiang in China, and no more.”The murals and statues in Dunhuang Grottoes are well preserved through different dynasties, and have aesthetic style sourced from different cultures. Dunhuang is very rich in many aspects, namely: art and culture, history and archaeology. However, the most precious out of so many valuable cultural relics is the Buddhist iconography and with the Buddhist teaching and philosophy within. This course is specially designed to offer an inspiring and in-depth introduction of Buddhist teaching and philosophy through Dunhuang Buddhist iconography. The historical and cultural background, the related aesthetic and archaeology aspects will also be introduced.Its coverage includes areas such as the essence of the teaching in Buddhism: Dependent Origination, Cause & Effect, the Noble Eightfold Path (Middle Path), the idea of ‘non-self’, karma theory, nirvāna etc.; the Concept of Pure Land, the cult of Guanyin and Maitreya in China, and also the history of the spread and inheritance of Buddhist iconography from 4th to 14th centuries in China.The course is intended for individuals who are interested in the Buddhist studies and want to study Buddhism and its practice as a means for spiritual development in a comprehensive way. It is also for participants who interested to study Buddhist teachings through Dunhuang Buddhist iconography and adding a new dimension to their spirituality and apply the Buddhist teaching into their daily lives, move along from suffering towards sustainable happiness.", "outcome": "Upon completion of this course, students should be able to:\r 1. Increase the understanding of Dunhuang Buddhist iconography correctly, strengthen the ability to appreciate Dunhuang Buddhist iconography; 2. Increase the understanding of Buddhist doctrine correctly, apply Buddhist teaching into daily life, and strengthen the ability of problem solving; 3. Strengthen the skill of individual & group learning, writing and presentation.", "syllabus": "1. 邁向成佛的絲路\r • 緣起敦煌 ── 概述敦煌石窟的歷史、地理和發現 • The history and geography of Dunhuang, the route of Buddhist art from India to China, the overall contents of Dunhuang Iconography.\r 2. 一輪明月映飛天\r • 人神薈萃 ── 文化交融的聖殿：概述敦煌壁畫、彩塑、文獻及發展 • Introduce the essential of cross-cultural relics in Dunhuang, mural, statues and maniscript, and the Dunhuang studies.\r 3. 本生故事說因果\r • 如是因果 ── 本生故事說因果：概述敦煌壁畫中的本生故事及佛教的觀 • Introduce the Buddhist concept of Cause and effect by going through the early mural painting in Dunhuang.\r 4. 觀音觀相觀自在\r • 人間菩薩 ── 觀音的人間度化：概述敦煌壁畫中的觀音經變，介紹觀音菩薩人間度化的內容及文化， 介紹敦煌石窟3, 45窟等壁畫內容\r • Introduce Avalokiteśvara/Guanyin Bodhisattva, and the related teaching through Dunhuang cave 3 & 45.\r 5. 最後成佛的地藏\r • 地藏菩薩 ──透過介紹敦煌壁畫中地藏菩薩像，講述地藏菩薩及相關經典內容 • Introduce Kṣitigarbha Bodhisattva, and the related teaching through Dunhuang mural and sutras.\r 6. 普賢菩薩十大願\r • 普賢大願 ──透過介紹敦煌榆林第3窟壁畫中普賢變，講述地藏菩薩及相關經典內容\r • Introduce Samantabhadra Bodhisattva, and the related teaching through Dunhuang mural in Yulin Cave 3.\r 7. 文殊師利法王子\r • 菩薩之首 ──透過介紹敦煌榆林第3窟及莫高窟61窟壁畫中文殊變，講述文殊菩薩及相關經典內容\r • Introduce Mañjuśrī Bodhisattva, and the related teaching through Dunhuang mural in Yulin Cave 3 and Mogao Cave 61.\r • 菩薩之首 8. 藥師琉璃光如來\r • 藥師如來 ──透過介紹敦煌莫高窟第220窟北壁壁畫中藥師經變，講述藥師如來及相關經典內容\r • Introduce Bhaiṣajyaguru Buddha, and the related teaching through Dunhuang mural Cave 220.\r 9. 無量光佛的淨土\r • 彌陀淨土 ── 美妙的西方淨土：透過介紹敦煌莫高窟第220窟南壁壁畫中西方淨土變，講述彌陀淨土及相關經典內容\r • Introduce Amitabha Budhha, and the related teaching through Dunhuang mural Cave 220.\r 10. 龍華三會願相逢 \r • 彌勒淨土 ── 莊嚴的彌勒淨土：介紹敦煌壁畫中的彌勒淨土世界 • Introduce Maitreya Budhha, and the related teaching through Dunhuang mural in Yulin Cave 25 and statue in Mogao Cave 275.\r 11. 釋迦最後的示現\r • 終極目標 ── 佛迦牟尼的涅槃：介紹敦煌石窟148、158窟涅槃塑像，及概述佛教涅槃的概念\r • Introduce the iconography in Dunhuang Cave 148 & 158, and the Buddhist concept of Nirvāṇa.\r 12. 千年一覺敦煌夢\r • 別有洞天 ── 藏經洞與無盡藏：概述敦煌洞窟的形制、種類與功能 • Introduce the Library Cave of Dunhuang, the treasure of the cultural relics and the related Buddhist teaching.\r 13. 參訪寺院及壁畫\r • 參訪寺院 ── 參訪慈山寺中的三幅敦煌壁畫數碼印刷本，說明及分析壁畫內容 • Visiting the three digital prints of Dunhuang murals in Tse Shan Monastery, to explain and analyze the content in the murals.\r 14. 課程發表及評論\r • 課程綜回顧、學生發表、導師評論文章及發表。 • Comprehensive review of the course, student presentation, tutor review and comment on the papers and presentation.", "required_readings": "佛學 Buddhist Studies\r 1) Rahula, Walpola. (1962). What the Buddha taught. New York: Grove Press. \r 羅睺羅化普樂著, 顧法嚴譯 《佛陀的啓示》(香港：中華佛教圖書館，1987)。\r 2) Keown, Damien. (2005). Buddhist ethics: A very short introduction. Oxford University Press.\r 3) 方立天 (1986). 《佛教哲學》北京：中國人民大學出版社。\r  敦煌學 Dunhuang Studies\r 1) 淨因、鄧偉雄 (2005)，《敦煌心靈之旅》，香港：商務印書館。\r 2) 趙聲良 (2001)，《敦煌藝術十講》，上海古籍出版社。\r 3) 饒宗頤 (2015)，《敦煌學》，北京：中國人民大學出版社。", "recommended_readings": "1) Frances Wood, The Silk Road: Two Thousand Years in the Heart of Asia (Berkeley and LA: University of California Press, 2003) \r 2) Rhie, Marylin Martin. Early Buddhist Art of China and Central Asia, vols. 1-3, Leiden: Brill, 1999.\r 4) Mair Victor H. (1983). Dunhuang popular narratives, Cambridge University Press.\r 3) Susan Whitfield and Frances Wood, Dunhuang and Turfan: contents and conservation of ancient documents from Central Asia, London: British Library, 1996.\r 5) Whitfield, Roderick & Farrer, Anne, Caves of the Thousand Buddhas: Chinese Art from the Silk Route, New York: George Braziller.\r 4) Wong, Dorothy C., Chinese Steles: pre-Buddhist and Buddhist use of a symbolic form, Honolulu: University of Hawai‘i Press, 2004.\r 5) Zürcher, E. (Erik), The Buddhist conquest of China: the spread and adaptation of Buddhism in early medieval China, Leiden: Brill, 2007.\r 6) 文物出版社 (1987)，《中國石窟．敦煌莫高窟》，北京：文物出版社。\r 7) 向達 (1933)，《唐代長安與西域文明》，北京：哈佛燕京社。\r 8) 玄奘、辯機著，季羡林校 (2000)，《大唐西域記》，北京：中華書店。\r 9) 沙武田 (2016)，《榆林窟25窟：敦煌圖像中的唐蕃關係》，北京：商務印書館。\r 10) 季羡林 (1982)，《中印文化關係史論叢》，北京：三聯書店。\r 11) 法顯 (1984)，《佛國記》，臺北：臺灣商務印書館。\r 12) 衍空 (2010)，《正覺的道路：智者的足跡和開導》。香港：佛教青年協會。\r 13) 星雲 (1955)，《釋迦牟尼佛傳》，台灣：佛光文化。http://www.masterhsingyun.org/article/chapter.jsp\r 14) 聖嚴 (1989)，《學佛群疑》，香港：佛教慈慧服務中心。\r 15) 《敦煌石窟全集》1－26卷，香港：商務印書館。\r 16) 敦煌研究院 (2010)，《敦煌》，北京：商務印書館。", "terms": {"2020-21 Term 1": {"--LEC (1339)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. LOK Wai Ying"]}}}, "assessments": {"Attendance": "15", "Essays": "60", "Presentation": "25"}}, {"code": "5007", "title": "Chinese Buddhist Art", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA in Buddhist Studies.", "description": "This course surveys the historical development of Buddhist visual and material culture in pre-modern China from a trans-Asiatic perspective. Major topics include (1) characteristics of Buddhist image-making practice in China, especially vis-à-vis that of the Indian subcontinent, (2) the growth of Buddhist sculpture as a dominant artistic genre, (3) the inroads of foreign iconography and styles and their impact on China, (4) the emergence of Buddhist ritual architecture, including Sinicized cave temples and pagodas, (5) the issues of regional and period styles, and (6) the socio-political contexts of artistic production. The course will incorporate recent archaeological discoveries from the last six decades.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5008", "title": "Buddhism and Contemporary Society", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA in Buddhist Studies", "description": "In its long history of more than 2500 years, Buddhism has spread to most parts of the world, and its doctrines and practices have also undergone tremendous changes. This course is designed to study Buddhism within the framework of its developments in contemporary society. It explores a variety of topics, discussing Buddhist attitudes to and connections with modern society with respect to ecology, psychology, feminism, etc. In each of these topics, we will examine how Buddhism has fitted itself and been reinvented to make it meaningful and useful in serving people today. It is hoped that through comparative and critical analysis, students will be able to get familiar with Buddhist ideas and thoughts concerning social issues in diverse contemporary contexts.", "outcome": "1. To understand Buddhist attitude to and connections with contemporary society in various historical settings and contemporary contexts. \r 2. To examine in what ways Buddhism transforms contemporary society and culture, and vice versa.\r 3. To engage in a critical analysis of how Buddhism has accommodated itself with the modernization movements, and been reinvented to make it meaningful and useful to people nowadays. \r 4. To relate students’ personal growth and everyday life to Buddhist teachings so as to cultivate a constructive outlook on self-understanding and interpersonal relationship.", "syllabus": "1. Engaged Buddhism and Humanistic Buddhism\r 2. Buddhist attitude towards violence and non-violence\r 3. Buddhist view on gender and homosexuality\r 4. Buddhist diet and vegetarianism\r 5. Thanatology and death education in Buddhism\r 6. Caste system and Buddhism\r 7. Buddhist social ethics\r 8. Right mindfulness\r 9. Buddhist attitude towards consumerism and environmental protection\r 10. Buddhist attitude towards suicide and euthanasia\r 11. Buddhism in Hong Kong \r 12. Buddhism and artificial intelligence", "required_readings": "Bhikkhu Bodhi, “What does mindfulness really mean? A canonical perspective,” Contemporary Buddhism, Vol. 12, No. 1 (2011), 19-39.\r De Silva, Padmasiri, Environmental philosophy and ethics in Buddhism. New York: St. Martin's Press, 1998.\r Findly, Ellison Banks, ed., Women's Buddhism, Buddhism's women: tradition, revision. Boston: Wisdom Publications, 2000.\r Harvey, Peter, An Introduction to Buddhist Ethics. New York: Cambridge University Press, 2009.\r Keown, Damien, Buddhism and Bioethics. London: Macmillan, 1995.\r Krishan, Y. “Buddhism and Caste System,” East and West, 1 June 1998, Vol.48 (1/2), pp.41-55.\r Phelps, Norm, The great compassion: Buddhism and animal rights. New York: Lantern Books, 2004.\r Promta, Somparn; Einar Himma, Kenneth, “Artificial intelligence in Buddhist perspective,” Journal of Information, Communication and Ethics in Society, 27 June 2008, Vol.6 (2), pp.172-187.\r Queen, Christopher S., “Introduction: The Shapes and Sources of Engaged Buddhism,” in Christopher S. Queen & Sallie B. King, eds., Engaged Buddhism: Buddhist Liberation Movements in Asia. New York: State University of New York Press, 1996.\r Reynolds, Frank E., “Death as Threat, Death as Achievement: Buddhist Perspectives with Particular References to the Theravada,” in Hiroshi Obayahsi, ed., Death and After Life: Perspectives of World Religions. (Princeton, 1992): Chapter 11.\r 鄧家宙：《香港佛教史》。香港：中華書局，2015。\r 學愚：《佛教、暴力與民族主義：抗日戰爭時期的中國佛教》。香港：香港中文大學出版社，2011。", "recommended_readings": "Cabezón, José Ignacio, ed., Buddhism, sexuality, and gender. Albany, NY: State University of New York Press, 1992. \r Chakravarti, Uma. The social dimensions of early Buddhism. New Delhi: Munshiram Manoharlal, 1996. \r De Silva, Padmasiri, An introduction to Buddhist psychology. London: Macmillan, 1991. \r De Silva, Padmasiri, “Suicide and Emotional Ambivalence: An Early Buddhist Perspective,” in Frank J. Hoffman and Deegalle Mahinda, eds., Pali Buddhism. London: Curzon Press, 1996, 117-132. \r Kalupahana, David J., Ethics in early Buddhism. Honolulu: University of Hawaii Press, 1995.\r Keown, Damien, Buddhism and Bioethics. London: Macmillan, 1995. \r Keown, Damien, Charles S. Prebish and Wayne R. Husted., eds., Buddhism and human rights. Richmond, Surrey: Curzon, 1998. \r Keown, Damien, ed., Contemporary Buddhist ethics. Richmond, Surrey: Curzon, 2000.\r Kraft, Kenneth, ed., Inner peace, World peace: essays on Buddhism and nonviolence. Albany: State University of New York Press, 1992. \r Narada, The Buddha and His Teaching. Sri Lanka: Kandy, Buddhist Publication Society, 1988, BPS Online Edition, 2006. \r Pandey, K.C., ed., Ecological Perspectives in Buddhism. New Delhi: Readworthy Pub., 2008. \r Saddhatissa, H. Buddhist ethics: the path to Nirvāna. London: Wisdom Pubns, 1987.\r Shaw, Sarah, Introduction to Buddhist Meditation. London and New York: Routledge,\r  2009.  \r Thich Nhat Hanh, Anger: wisdom for cooling the flames. New York: Riverhead\r  Books, 2001. \r 理查‧培恩(Richard K. Payne)主編，梁永安譯：《多少才算夠？：佛教經濟學救地球》，頁191-205，新北市新店區：立緒文化，2012。\r 盧蕙馨：〈大體捐贈：死亡的超越與聖化〉，盧蕙馨著：《人情化大愛：多面向的   慈濟共同體》(台北：南天書局，2011)，頁265-344。", "terms": {"2020-21 Term 2": {"--LEC (1911)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [5], "locations": ["Esther Lee Bldg 203"], "instructors": ["Dr. SIK Fa Ren"]}}}, "assessments": {"Essays": "70", "Presentation": "30"}}, {"code": "5009", "title": "Special Topics in Buddhism and Society", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA Buddhist studies", "description": "Special topics courses are developed to cover emerging issues facing Buddhism today or specialized content on Buddhism and society not represented in the main curriculum. It addresses a current or timely topic, that are in a pilot phase before being offered on an ongoing basis or that are known to be one time offerings. Topics covered can vary from term to term. Students should consult the Graduate division on the content of the course on offer.", "outcome": "1) Knowledge\r To enable students to obtain a broad knowledge of Buddhist Studies as a discipline and a more specialized knowledge in a particular sub-field of concentration.\r 2) Skills\r To help the students develop research skills in Buddhist Studies, including their competence in academic writing and presentation in order to prepare them for further academic research in Buddhist Studies.\r 3) Attitude \r To develop a reflective and empathetic attitude in understanding Buddhism.", "syllabus": "To be given in due course", "required_readings": "To be given in due course", "recommended_readings": "To be given in due course", "terms": {"2020-21 Term 2": {"--LEC (2566)": {"startTimes": ["9:30"], "endTimes": ["16:00"], "days": [6], "locations": ["Esther Lee Bldg 401"], "instructors": ["Professor CHEN Kai Yu"]}}}, "assessments": {"Attendance": "10", "Essays": "80", "Participation": "10"}}, {"code": "5010", "title": "Basic Pāli", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA in Buddhist Studies", "description": "This is an introductory course designed for those with no previous knowledge of the language of Pāli. The purpose of this course is to equip students with a basic understanding of Pāli so that they could read the Pāli primary source with a dictionary. It also enables them to understand Buddhist Sūtras compiled in Pāli. Course contents include: Pāli phonetics, parts of speech, different nouns and their declension, different verbs and their conjugation, participles and their function, absolutives, sandhi, syntax and classification of sentences.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5011", "title": "Basic Sanskrit", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For studens in MA Buddhist Studies", "description": "This is an introductory course designed for those with no previous knowledge of the language of Sanskrit. The purpose of the course is to equip students with a basic understanding of Sanskrit so that they could read the Sanskrit primary source with a dictionary. It also enables them to understand Buddhist Sūtras compiled in Sanskrit. Course contents include: Sanskrit phonetics, parts of speech, different nouns and their declension, different verbs and their conjugation, participles and their function, absolutives, sandhi, syntax and classification of sentences.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5012", "title": "Graduation Paper", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Independent Study", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For students in MA in Buddhist Studies.", "description": "This capstone course provides integrative learning experiences that build on knowledge from student’s previous courses. It will be taken by students in their final year who will carry out independent research on a topic approved by the program and supervised by a teacher. Through writing a final paper, this course enables students to synthesize and integrate skills and knowledge acquired throughout the curriculum of the MA in Buddhist Studies.", "outcome": "1. Knowledge\r To be able to engage in a critical analysis of religions by the methods of the humanities and social sciences including textual and historical analysis, philosophical and hermeneutical studies, and social and cultural analysis.\r 2. Skill\r Ability to gather, organize, deploy, synthesize and evaluate different types of evidence and information.\r Ability to employ a variety of methods of study in analyzing materials (philosophical, historical, hermeneutical, empirical and ethnographical etc.)\r 3. Attitude\r Independent learning and Life-long pursuit of knowledge.", "syllabus": "Independent Studies", "required_readings": "吳汝鈞《佛教的概念與方法》新北市：臺灣商務印書館股份有限公司，1988年。", "recommended_readings": "The Chicago manual of style. Chicago: The University of Chicago Press, c2010. 16th ed.", "terms": {"2020-21 Term 2": {"-I01-IND (2851)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [1], "locations": ["Esther Lee Bldg 403"], "instructors": ["Professor TAM Wai Lun"]}}}}, {"code": "5013", "title": "Theory and Method in Buddhist Studies", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Religious Studies", "requirements": "For studens in MA in Buddhist Studies", "description": "This course introduces students to the history and the main disciplinary approaches and methods in the academic study of Buddhism. It integrates the exploration of different approaches, theories, methods, concepts and issues in the study of Buddhism with the acquisition of graduate skills. These skills include, for example, critical thinking and writing, effective use of library, electronic and other information sources in the study of Buddhism. Students will get acquainted with key concepts in the study of Buddhism. Through carrying out small research assignments and literature research, students will design their own research questions and become familiar with the research cycle.", "outcome": "Upon completing this module successfully, students should be able to \r (1) demonstrate an in-depth understanding of the historical development, theory and method in the Buddhiat studies.\r (2) have acquired a foundational knowledge and understanding of selected approaches, methods, theories and concepts in the Study of Buddhism.\r (3) be able to find and use books, journals, journal articles, websites and other sources of information relevant to religious topics including those studied in this course\r (4) develop their analytical and problem solving ability, critical intelligence and appreciative thinking as well as key research skills and to prepare for advanced studies in Buddhist Studies.\r (5) enhance their ability to employ a variety of methods of study in analyzing materials (philosophical, historical, hermeneutical, bibliography and ethnographical etc.)\r (6) help the students develop research skills in Buddhist Studies, including their competence in academic writing and presentation in order to prepare them for further academic research in Buddhist Studies.\r (7) recognize the contested and provisional nature of knowledge and understanding.\r (8) develop a reflective and empathetic attitude in understanding Buddhism.\r (9) develop sensitivity to ultimate concern and religious dimension of human life", "syllabus": "1. 佛學研究方法的界說、多元研究方法的認知、各種資訊及資料庫、釐清、課題、反思、批判思考。\r 2. 佛典成立史及認識如何建立漢傳佛教文獻典籍系統。\r 3. 網路佛學資源及佛學電子資料庫的運用（含英語世界佛學研究網站之介紹）\r 4. 佛學工具書之介紹及使用。\r 5. 學術論文之撰寫體例格式，以及習作。\r 6. 佛教研究方法（思想史研究法、詮釋學研究法、文獻學研究法、歷史學研究法、田野調查與質化研究法）與確立研究主題。", "required_readings": "1. 上田義文著、陳一標譯：〈有關佛教學的方法論〉，《大乘佛教思想》，台北：東大圖書公司，2002年，頁47-62\r 2. 吳汝鈞：《佛教的概念與方法》，台北：臺灣商務印書館股份有限公司，1988年。\r 3. 吳汝鈞：《佛學研究方法論》，台北：臺灣學生書局，1996年增訂版。\r 4. 蔡耀明：《佛教的研究方法與學術資訊》，臺北：法鼓文化事業股份有限公司，2006年。\r 5. 黎志添：《宗教研究與詮釋學：宗教學建立的思考》，香港：中文大學出版社，2003年，\r 6. 藍吉富：《佛教史料學》，台北：東大圖書公司，1997年。\r 7. Lopez, Donald S., Jr., ed. Buddhist Hermenutics (《佛教詮釋學》)，Honolulu: University of Hawai‘i Press, 1988.", "recommended_readings": "1. 中尾良信等編：《大藏經全解說大事典》，東京：雄山閣出版，1998年。\r 2. 中村元著、釋見憨、陳信憲譯：《原始佛教：其思想與生活》，嘉義：香光書鄉出版社，1995年。\r 3. 方廣錩：《佛教大藏經史：八~十世紀》，北京：中國社會科學出版社，1991年。\r 4. 水野弘元（Kogen Mizuno）著、劉欣如譯：《佛典成立史》，臺北：東大圖書公司，1996年11月。\r 5. 水野弘元等編：《佛典解題事典》，東京：春秋社，1977年第二版。\r 6. 各種工具書：《中華佛教百科全書》、《印順呂澂佛學辭典》、《佛教相關博碩士論文提要》、《佛教哲學大辭典》、《望月佛教大辭典》、《梵和大辭典》、《世界宗教大事典》、《佛書解說大辭典》、《佛教語大辭典》、《大藏經全書解說大事典》、《大正藏辭典》。\r 7. 朱文光，〈佛學研究方法學理路之探索〉，《中華佛學研究》第7期（2003年），頁333-359。\r 8. 朱文光：《佛學研究方法論：以近現代漢語佛學研究為中心》，嘉義：中正大學中國文學系博士論文，2002年。\r 9. 朱浤源（主編）：《撰寫博碩士論文實戰手冊》（台北：正中書局，1999年）。\r 10. 吳汝鈞編著：《佛教思想大辭典》，台北：臺灣商務印書館，1992年。\r 11. 杜正民：〈如來藏學研究小史：如來藏學書目簡介與導讀（上~下），《佛教圖書館館訊》第10/11期（1997年9月），頁32-52；第12期（1997年12月），頁37-63。\r 12. 杜正民：〈當代如來藏學的開展與問題〉，《佛學研究中心學報》第3期（1998年），頁243-280。\r 13. 周中一：《佛學研究》，台北：東大圖書公司，1988年。\r 14. 周慶華：〈後佛教世紀〉，《正觀》第18期（2001年9月），頁43-77。\r 15. 周慶華：〈當代佛教義理詮釋的走向及其問題〉，《佛學新視野》，台北：東大圖書公司，1997年），頁91-107。\r 16. 林慶彰、劉春銀，《讀書報告寫作指引》〈第十章‧撰寫小論文的方法〉，（台北：萬卷樓圖書，2001年，頁209-225。\r 17. 林慶彰：《學術論文寫作指引》，台北：萬卷樓圖書，1996年。\r 18. 林鎮國：〈中國大陸四十年來佛學研究與詮釋評述〉，《國立政治大學哲學學報》第3期（1996年），頁175-197。\r 19. 林鎮國：〈多音與介入：北美的佛學論述〉，收錄於《空性與現代性：從京都學派、新儒家到多音的佛教詮釋學》，台北：立緒文化事業，1999年，頁159-180.\r 20. 林鎮國：〈當代歐美佛學研究方法之省察〉，《中國佛教文化研究所‧佛學研究》第7期（1998年），頁402-409。\r 21. 紀贇：〈漢文佛教文獻學的現狀與未來〉，網址：http://yifertw.blogspot.tw/2013/04/bcs_21.html。\r 22. 張瓊夫：〈高效能的佛典研究資料管理模式〉，《中華佛學研究》第4期（2000年），頁261-305.\r 23. 郭朝順：〈佛教哲學的基本形態與論述方法〉，《正觀》第16期（2001年3月），頁3-28.\r 24. 陳士強：《佛典精解》，上海：上海古籍出版社，1992年。\r 25. 陳友民：〈中文佛教工具書簡介（一）：辭典〉，《佛教圖書館館訊》第1期（1995年3月），頁14-19。\r 26. 陳友民：〈中文佛教工具書簡介（三）：傳記資料〉，《佛教圖書館館訊》第3期（1995年9月），頁42-45.\r 27. 陳友民：中文佛教工具書簡介（二）：佛教年表〉，《佛教圖書館館訊》第2期（1995年6月），頁33-35。\r 28. 陳兵、鄧子美：〈佛學研究的成果與方法〉，《二十世紀中國佛教》，北京：民族出版社，2000年，頁434-465。\r 29. 傅偉勳，〈關於佛教研究的方法論與迫切課題〉，《從創造的詮釋學到大乘佛學》，台北：東大出版公司，1990年，頁325-349。\r 30. 勝崎裕彥等編：《大乘經典解說事典》，東京：北辰堂，1997年。\r 31. 馮曉庭：〈古代典籍的檢索與利用〉，《學術資料的檢索與利用》，林慶彰主編，台北：萬卷樓圖書公司，2003年，頁1-12.\r 32. 黃啟江：〈從佛教研究法談佛教史研究書目資料庫之建立〉，《現代佛教學會通訊》第12期（2002年3月），頁63-76.\r 33. 楊卓（編）：《佛學次第統編》，台北：佛教出版社，1981年。\r 34. 劉述先：《全球倫理與宗教對話》，台北：立緒文化事業，2001年。\r 35. 樓宇烈。《宗教研究方法講記》，北京：北京大學出版社，2013年。\r 36. 蔡彥仁：〈中國宗教研究：定義、範疇與方法學芻議〉，《新史學》第5卷第4期（1994年12月），頁125-139。\r 37. 蔡彥仁：〈全方位的宗教研究：宗教現象學〉，《香光莊嚴》第48期（1996年12月），頁6-14。\r 38. 蔡彥仁：〈宗教——心靈的體驗：宗教心理學〉，《香光莊嚴》第48期（1996年12月），頁16-27。\r 39. 蔡彥仁：〈宗教地球村的夢想：宗教對話〉，《香光莊嚴》第48期（1996年12月），頁28-39。\r 40. 蔡彥仁：〈為中國宗教學催生：中國宗教研究〉，《香光莊嚴》第48期（1996年12月），頁40-51。\r 41. 蔡彥仁：〈晚近歐美宗教研究方法學評介〉，《東方宗教研究》第1期（1987年），頁265-289。\r 42. 蔡耀明：〈「研究方法」課程的規劃理念〉，《法光》第163期（2003年4月），35-64。\r 43. 蔡耀明：〈用以檢視佛學學術化的一面鏡子〉，《法光》第148期（2002年1月），5-14。\r 44. 蔡耀明：〈佛教研究的進展程序在操作步驟的釐定〉，《正觀》第25期（2003年6月），頁201-209。\r 45. 蔡耀明：〈迎向專業的佛教研究〉，《哲學雜誌》第32期（2000年5月），頁114-126.\r 46. 鄭金德：《現代佛學原理》（台北：東大圖書，1986年）。\r 47. 頁159-178.\r 48. 黎志添：《宗教研究與詮釋學：宗教學建立的思考》，〈第三章‧宗教詮釋學：宗教經典的詮釋方法——一個中西宗教文化的比較觀點〉，香港：中文大學出版社，2003年，頁37-71.\r 49. 黎志添：《宗教研究與詮釋學：宗教學建立的思考》，〈第四章‧宗教研究與詮釋社會科學〉，香港：中文大學出版社，2003年，頁73-90.\r 50. 蕭振邦：〈佛學研究一般方法論〉，《正觀》第24期（2003年3月），頁91-137。\r 51. 蕭開元：〈現有文史資料庫的檢索與利用〉，林慶彰主編：《學術資料的檢索與利用》，台北：萬卷樓圖書，2003年，頁65-74.\r 52. 藍吉富：〈當代中國人的佛教研究趨勢〉，《當代中國人的佛教研究》，台北：商鼎出版公司，1993年12月，頁1-24。\r 53. 釋見篤，〈佛教參考工具書介紹（上、下）〉，《佛教圖書館館訊》第9期（1997年3月），頁15-17：第10/11期（1997年9月），頁20-31.\r 54. 釋慈怡編：《佛光大辭典》，台北：佛光文化出版事業，1988年。\r 55. 龔雋：〈作為思想史的禪學寫作－以漢語語境禪學研究為中心的方法論考察〉，《佛學研究中心學報》第5期（2000年），頁79-112.\r 56. Charles Johnson, Turning the Wheel: Essays on Buddhism and Writing, Scribner, 2003.\r 57. Charles S. Prebish, Martin Baumann (eds.), Westward Dharma: Buddhism Beyond Asia, Berkeley: University of California Press, 2002.\r 58. Damien Keown, A Dictionary of Buddhism, Oxford: Oxford University Press, 2003.\r 59. Erik Zurcher, “A New Look at the Earliest Chinese Buddhist Texts,” From Benares to Beijing: Essays on Buddhism and Chinese Religion in Honour of Prof. Jan Yun-hua, edited by Koichi Shinohara and Gregory Schopen, Oakville: Mosaic Press, 1991, pp. 277-304.\r 60. Frederick J. Streng, 金澤譯：〈論客觀研究宗教當中的不同的比較的概念之內涵〉，《世界宗教資料》第51期（1993年3月），頁5-10。\r 61. Jacques Waardenburg著、根瑟‧馬庫斯譯：《宗教學入門》（Religionen und Religion: Systematische Einfuhrung in die Religionswissenschaft），〈第四章‧從相關情境研究宗教〉，台北：東大圖書公司，2003年，頁135-190。\r 62. Jacques Waardenburg著、根瑟‧馬庫斯譯：《宗教學入門》（Religionen und Religion: Systematische Einfuhrung in die Religionswissenschaft），〈第二章‧歷史研究〉，台北：東大圖書公司，2003年，頁61-97。\r 63. John C. Maraldo, \"A Review of Some Approaches to Hermeneutics and Historicity in the Study of Buddhism,\" 《大谷大學真宗綜合研究所‧研究所紀要》第3號（1985年），頁1-26.\r 64. Jose Ignacio Cabezon, “Comparison as a Principle of Knowledge and its Application to the Translation of Buddhist Texts,” Buddhist Translations: Problems and Perspectives, edited by Lama Doboom Tulku, New Delhi: Manohar Publishers, 1995, pp. 59-74.\r 65. Richard Hughes Seager, Buddhism in America, New York: Columbia UniversityPress, 2000.", "terms": {"2020-21 Term 1": {"--LEC (1876)": {"startTimes": ["19:00"], "endTimes": ["21:30"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor CHEN Chien Huang"]}}}, "assessments": {"Attendance": "5", "Essays": "70", "Presentation": "20", "Participation": "5"}}]