[{"code": "3160", "title": "Children’s Play in Early Childhood Education", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLecture", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course aims to introduce the history, nature, theories and practices of play in early childhood curriculum. It covers the following topics: Values of play for cognitive and social emotional developments; promoting children’s creative expression in art, music and drama through play; fostering playful learning through formal and informal, indoor and outdoor activities; play and technology; teachers’ and students’ perspectives on play; planning and arranging the creative environment and materials for play; designing play-based curriculum, and assessing play.\r", "outcome": "Upon completion of the course, students will be able to: \r 1. Grasp the distinctive features of different kinds and types of play:\r 2. Understand the values of play in developing children holistically; 3. Promote play through staging playful environment; 4. Design play-based curriculum; and\r 5. Assessing children’s learning in and through play.", "syllabus": "The course will cover the following topics:\r 1. history and nature of play; 2. theories and practices of play; 3. values of play for cognitive and social emotional development; 4. play and creative expression in art and music; 5. drama and play; 6. indoor and outdoor play; 7. play and technology\r 8. teachers’ role in play; 9. play environment and resources; 10. designing play-based curriculum; and\r 11. assessing play and children’s development.\r  本科的課程內容包括： 1. 遊戲的歷史和性質；\r 2. 遊戲的理論和實踐；\r 3. 遊戲對認知和社會情緒發展的價值；\r 4. 遊戲與藝術和音樂的創意表達；\r 5. 戲劇和遊戲；\r 6. 戶內和戶外的遊戲；\r 7. 遊戲與科技；\r 8. 教師在遊戲中的角色；\r 9. 遊戲的環境和資源；\r 10. 遊戲為本的課程設計；及\r 11. 遊戲中幼兒發展的評估。", "required_readings": "1. Ahn, J., & Filipenko, M. (2007). Narrative, imaginary play, art, and self: Intersecting worlds. Early Childhood Education Journal, 34(4), 279-289.\r 2. Bodrova, E., Germeroth, C., & Jeong, D. J. (2013). Play and self-regulation: Lessons from Vygotsky. American Journal of Play, 6(1), 111-123.\r 3. Bredekamp, S. (2004). Play and school readiness. In E. F. Zigler, D. G. Singler, & S. J. Bishop-Josef (Eds.), Children’s play: The roots of reading (pp. 159-174). Washington, D.C.: ZERO to Three.\r 4. Chmelynski, C. (2006). Play teachers what testing can’t touch: Humanity. School Board News, 26(8), 10-13.\r 5. Ciampa, C., Farr, J., & Kaplan, K. (2000). Improving social competencies through the use of cooperative learning and conflict resolution. (ERIC Document Reproduction Service No. PS 028 778).\r 6. Curriculum Development Council. (2017). Kindergarten education curriculum guide. Hong Kong: Hong Kong Government.\r 7. Dejonckheere, P. J. N., de Wit, N., van de Keere, K., & Vervaet, S. (2016). Exploring the classroom: Teaching science in early childhood. European Journal of Educational Research, 5(3), 149-164. \r 8. Dennis, L. R., & Stockball, N. (2015). Using play to build the social competence of young children with language delays: Practical guidelines for teachers. Early Childhood Education Journal, 43, 1-7.\r 9. Doris, B., & Darrel, D. (2011). Influences of technology-related playful activity and thought on moral development. American Journal of Play, 4(1), 80-99. \r 10. Duncan, P. A. (2015). Pigs, planes, and play-doh: Children’s perspectives on play as revealed through their drawings. American Journal of Play, 8(1), 50-73.\r 11. Eberle, S. G. (2014). The elements of play: Toward a philosophy and a definition of play. Journal of Play, 6(2), 214-233.\r 12. Edwards, S. (2011). Environmentalising early childhood education curriculum through pedagogies of play. Australasian Journal of Early Childhood, 36(1), 51-59.\r 13. Escobedo, T. H. (1996). Play at the art table: A study of children’s play behaviors while drawing. (ERIC Document Reproduction Service No. PS 024 669).\r 14. Fung, C. K. H., & Cheng, D. P. W. (2012). Consensus or dissensus? Stakeholders’ views on the role of play in learning. Early Years: An International Journal of Research and Development, 32(1), 17-33.\r 15. Guyton, G. (2011). Using toys to support infant-toddler learning and development. Young Children, 66(5), 50-56.\r 16. Henricks, T. S. (2014). Play as self-realization: Toward a general theory of play. American Journal of Play, 6(2), 190-213.\r 17. Hyvonen, P. T. (2011). Play in the school context? The perspectives of Finnish teachers. Australian Journal of Teacher Education, 36(8), 65-83.\r 18. Lee, S. (2012). Toddlers as mathematicians? Australasian Journal of Early Childhood, 37(1), 30-37.\r 19. Lestari, I., & Ratnaningsih, T. (2016). The effects of modified games on the development of gross motor skill in preschoolers. International Journal of Evaluation and Research in Education, 5(3), 216-220. \r 20. Li, J., Hestenes, L. L., & Wang, Y. C. (2016). Links between preschool children’s social skills and observed pretend play in outdoor childcare environments. Early Childhood Education Journal, 44, 61-68.\r 21. Lillemyr, O. F., & Sobstad, F. (2011). A multicultural perspective on play and learning in primary school. International Journal of Early Childhood, 43, 43-65.\r 22. Little, H., & Sweller, N. (2015). Affordance for risk-taking and physically activity in Australian early childhood education settings. Early Childhood Education Journal, 43(4), 337-345.\r 23. Liu, M., Karp, G. G., & Davis, D. (2010). Teaching learning-related social skills in kindergarten physical education. Journal of Physical Education, Recreation & Dance, 81(6), 38-44.\r 24. Logue, M. E., & Detour, A. (2011). “You be the bad guy”: A new role for teachers in supporting children’s dramatic play. Early Childhood Research and Practice, 13(1), 1-16.\r 25. Madray, A., & Catalano, A. (2010). The curriculum material center’s vital link to play and learning: What’s the connection? Educational Libraries, 33(2), 11-17.\r 26. Martin, J. F. (2007). Children’s attitudes toward superheroes as a potential indicator of their moral understanding. Journal of Moral Education, 36(2), 239-250.\r 27. Massey, S. L. (2013). From the reading rug to the play center: Enhancing vocabulary and comprehensive language skills by connecting storybook reading and guided play. Early Childhood Education Journal, 41(2), 125-131.\r 28. Mathematics Education Research Group of Australasia. (2010). Playing with mathematics: Play in early childhood as a context for mathematical learning. Paper presented at the Annual Meeting of the Mathematics Education Research Group of Australasia (33rd, Freemantle, Western Australia, July 307, 2010).\r 29. Miller, E., & Almon, J. (2009). Crisis in the kindergarten: Why children need to play in school? (ERIC Document Reproduction Service No. ED 504 839)\r 30. Milne, I. (2010). A sense of wonder, arising from aesthetic experiences, should be the starting point for inquiry in primary science. Science Education International, 21(2), 102-115.\r 31. National Association for the Education of Young Children (NAEYC). (2009). Developmentally appropriate practice in early childhood programs serving children from birth through age 8. Washington, D.C.: NAEYC.\r 32. Nelson, L. J., Hart, C. H., & Evans, C. A. (2008). Solitary-functional play and solitary-pretend play” Another look at the construct of solitary-active behavior using playground observations. Social Development, 17(4), 812-831.\r 33. Niland, A. (2009). The power of musical play: The value of play-based, child-centered curriculum in early childhood music education. General Music Today, 23(1), 17-21.\r 34. Nor Puteh, S., & Ali, A. (2013). Preschool teachers’ perceptions towards the use of play-based approach in language and literacy development for preschool. Malaysian Journal of Learning and Instruction, 10, 79-98.\r 35. Nwokah, E., Hsu, H., & Gulker, H. (2013). The use of play materials in early intervention: The dilemma of poverty. American Journal of Play, 5(2), 187-218.\r 36. Odom, S., McConnell, S., Ostrosky, M., Peterson, C., Skellenger, A., Spicuzza, R., Chandler, L. K., & McEvoy, M. A. (1997). Play time/social time: Organizing your classroom to build interaction skills. (ERIC Document Reproduction Service No. EC 305 924). \r 37. Ortlieb, E. T. (2010). The pursuit of play within the curriculum. Journal of Instructional Psychology, 37(3), 241-246.\r 38. Platz, D., & Arellano, J. (2011). Time tested early childhood theories and practices. Education, 132(1), 54-63.\r 39. Pyle, A., & Bigelow, A. (2015). Play in kindergarten: An interview and observational study in three Canadian classrooms. Early Childhood Education Journal, 43, 385-393.\r 40. Reynolds, E., & Kidd, E. (2011). Play, language and social skills of children attending a play-based curriculum school and a traditionally structured classroom curriculum school in low socioeconomic areas. Australasian Journal of Early Childhood, 36(4), 120-130.\r 41. Riethmuller, A., McKeen, K., Okely, A. D., Bell, C., & de Silva Sanigorski, A. (2009). Developing an active play resource for a range of Australian early childhood settings: Formative findings and recommendations. Australasian Journal of Early Childhood, 34(1), 43-52.\r 42. Riley, M. T. (1991). Environments that make a difference. (ERIC Document Reproduction Service No. PS 020 639)\r 43. Sackes, M. (2015). Kindergartners’ mental models of the day and night cycle: Implications for instructional practices in early childhood classrooms. Educational Sciences: Theory and Practice, 15(4), 997-1006.\r 44. Samuelsson, I. P., & Carlsson, M. A. (2008). The playing learning child: Towards a pedagogy of early childhood. Scandinavian Journal of Educational Research, 52(6), 623-641.\r 45. Saracho, O. N. (2001). Teachers’ perceptions of their roles in promoting literacy in the context of play in a Spanish-speaking kindergarten. International Journal of Early Childhood, 33(2), 18-31.\r 46. Scales, B., Perry, J., & Tracy, R. (2012). Creating a classroom of inquiry at the University of California at Berkeley: The Harold E. Jones child study center. Early Education and Development, 23(2), 165-180.\r 47. Shuffelton, A. B. (2012). Rousseau’s imaginary friend: Childhood, play, and suspicion of the imagination in Emile. Educational Theory, 62(3), 305-321.\r 48. Stanton-Chapman, T. L. (2015). Promoting positive peer interactions in the preschool classroom: The role and the responsibility of the teacher in supporting children’s sociodramatic play. Early Childhood Education Journal, 43, 99-107.\r 49. Strickland, E. (2004a). Physical development: Taking time for physical play. Early Childhood Today, 19(1), 10-11.\r 50. Strickland, E. (2004b). Physical development: Exploring physical development through dramatic play. Early Childhood Today, 19(3), 9-10.\r 51. Sumsion, J., Grieshaber, S., McArdle, F., & Shield, P. (2014). The ‘state of play’ in Australia: Early childhood educators and play-based learning. Australasian Journal of Early Childhood, 39(3), 4-13.\r 52. Szekely, I. (2014). Creating meaningful art museum experiences for young children: Discussions with future art teachers. Art Education, 67(4), 34-39.\r 53. Szekely, I. (2015). Playground innovations and art teaching. Art Education, 68(1), 37-42.\r 54. Theodotou, E. (2015). “Can we play again with Picasso Miss?” The effects of the arts in children’s involvement during literacy activities in the early years settings: A case study in the Greek context. (ERIC Document Reproduction Service No. ED 561 904)\r 55. Upright, R. L. (2002). To tell a tale: The use of moral dilemmas to increase empathy in the elementary school child. Early Childhood Education Journal, 30(1), 15-20.\r 56. Van Oers, B. (2003). Learning resources in the context of play: Promoting effective learning in early childhood. European Early Childhood Education Research Journal, 11(1), 7-26.\r 57. Vartuli, S. A., & Rohs, J. (2008). Selecting curriculum content that stimulates thought. Early Childhood Education Journal, 35, 393-396.\r 58. Wainman, B., Boulton-Lewis, G., Walker, S., Brownlee, J., Cobb, C., Whiteford, C., & Johnsson, E. (2012). Young children’s beliefs about including others in their play: Social and moral reasoning about inclusion and exclusion. Australasian Journal of Early Childhood, 37(3), 137-146.\r 59. Wong, S. M., Wang, A., & Cheng, D. (2011). A play-based curriculum: Hong Kong children’s perception of play and non-play. International Journal of Learning, 17(10), 165-180.\r 60. Youngquist, J., & Pataray-Ching, J. (2004). Revisiting “play”: Analyzing and articulating acts of inquiry. Early Childhood Education Journal, 31(3), 171-178.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (8343)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr. CHAN To"]}}}, "assessments": {"Essay test or exam": "30", "Homework or assignment": "40", "Presentation": "30"}}, {"code": "4120", "title": "Language and Literacy Development in Young Children", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLectureProject", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course is an introduction to the theories of language and literacy development in young children. The stages of language development in early childhood will be covered. The course examines literacy from contemporary perspectives and how young children develop literacy through participating in a range of activities in their family, school and community. Participants will be encouraged to examine critically current practices in literacy education in local settings. They will also explore a range of resources and strategies to support and facilitate literacy learning opportunities for young children.\r", "outcome": "At the end of the course, students are expected to:\r 1. compare and contrast different theories of language and literacy development in young children; 2. describe the stages of language development in young children; 3. explain how young children develop language through engagement with other people and their surroundings; and\r 4. critique current local practices in developing young children’s language and literacy ability.", "syllabus": "1. Child Development： language learning and Communication\r 2. Early childhood language education in Hong Kong (school, government and society)\r 3. Theories of Language Development \r 4. Early childhood language development：getting ready to talk\r 5. Early childhood language development：getting ready to write\r 6. Curriculum design and assessment\r 7. Teaching methods and classroom activities design \r 8. Creative Picture Book Teaching \r 9. The Implementation of Whole Language Education", "required_readings": "1. Freeman, D.L. (2000). Techniques and Principles in Language Teaching (2nd ed). UK: Oxford Press. \r 2. Laura E. Berk. (2013). Child Development (Ninth Edition). USA. Pearson Education, Inc.\r 3. Mckay, S.L., & Hornberger, N. H. (1996). Sociolinguistics and Language Teaching. New York. Cambridge University Press.\r 4. Richards, J. C., & Rodgers, T. S.,(2001) Approaches and Methods in Language Teaching (2nded.). UK: Camberidge University Press.\r 5. Kail, R. V. (2016). Children and Their Development. (7th ed.) . Pearson Press.\r 6. Virginia, Y. & Stephen, M. (2007). The Bilingual Child: Early Development and Language Contact. UK, Cambridge.\r 7. Moyles, J., Georgeson, J., Payler, J. (2011). Beginning Teaching in Early Years and Primary Education.(4th ed ). New York. Open University Press.\r 8. Wells, G. (1986). The meaning maker: Children learning language and using language to learn. Portsmouth, NH: Heinemann.\r 9. Yule, G. (2010). The Study of Language (4th ed.) New York. Cambridge University Press.\r   1. 岑运强（2012）。《语言学概论》，第三版。北京：中国人民大学出版社。 \r 2. 代天善（2011）。《語言天賦論》。北京：中國人民大學出版社。 \r 3. 郭靜晃、陳正乾譯（1999），Spodek, B. & Saracho, Olivia N. 著。《幼兒教育》，Right from the start: teaching children ages three to eight。台北：揚智文化事業股份有限公司。\r 4. 黃瑞琴（1997）。《幼兒園讀寫萌發課程》（2015年二版一刷）。台北：五南圖書出版股份有限公司。\r 5. 簡楚瑛主編，簡楚瑛等著（1999）。《幼教課程模式：理論取向與實務經驗（第二版）》，2013年二版十四刷。台北：心理出版社。\r 6. 簡楚瑛編審，簡楚瑛等翻譯，Jeanne M. Machado 著（2010）。《幼兒語文教材教法》，Early Childhood Experiences in Language Arts: Early Literacy, 8e.。台北：心理出版社。\r 7. 李麗梅（2008）。《不一樣的孩子：認識及培育學習差異兒童》。香港：香港中文大學出版社。\r 8. 廖鳳瑞、陳姿蘭編譯（2002），Meisels, Samuel. J著。《幼兒表現評量：作品取樣系統》。台北：心理出版社。\r 9. 林德揚（2009）。《幼兒語文教材教法》，初版二刷。台北：心理出版社。\r 10. 羅雅芬等譯（2006），Edwards, C & Gandini, L 著。《兒童的一百種語言》，The hundred languages of children: The Reggio Emilia approach-Advamced reflections. 南京：南京師範大學出版社。\r 11. 裴文斌、戴衛平（2012）。《語言學——語言、語法、語義》。北京：科學出版社。 \r 12. 锜寶香（2009）。《兒童語言與溝通發展》，2015年初版四刷。台北：心理出版社。\r 13. 王珮玲（1995）。《幼兒發展評量與輔導》（第五版）。2016五版三刷。台北：心理出版社。\r 14. 石定栩（2006）。《港式中文兩面睇》。香港: 星島出版有限公司。\r 15. 吳信鳳、沈紅玫譯（2002），Tabors, Patton O. 著。《一個孩子，兩種語言：幼兒雙語教學手冊》，One Child, Two Languages: A Guide for Preschool Educators of Children learning English asa Second Language .台北：心理出版社。\r 16. 葉嘉青（2008）。《幼兒文學：零歲到八歲餓孩子與繪本》，2012年初版三刷。台北：心理出版社。\r 17. 曾進興譯（2006），Cattell, R（1999）著。《兒童語言發展》，Children’s language: consensus and controversy。台北：心理出版社。\r 18. 鄭瑞菁等譯（2013）。Gullo, Domminic, F. 著，《幼教評量與評鑒：從幼兒教育中探討》，understanding assessment andevaluation in early childhood education.台北：華藤文化股份有限公司。", "recommended_readings": "1. Assink, E. M. H. (1994). Literacy acquisition and social context. New York & London: Harvester Wheatsheaf. \r 2. Baron, N. S., Schrank, L. W. (1997). Stage Fright Productions & Learning Seed Company. Children learning language. Lake Zurich, IL: Learning Seed. \r 3. Bochner, S., & Jones, J. (2003). Child language development: Learning to talk (2nd ed.). London: Whurr Publishers Ltd. \r 4. Clay, M. M. (2001). Change over time in children's literacy development. Portsmouth, NH: Heinemann. \r 5. Dignam, J., Bright, C., & Concept Media (2001). Human development. Birth to 2 1/2 years. Irvine, Calif.: Concept Media. \r 6. Fletcher, P., & Hong Kong Standing Committee on Language Education and Research (2000). Cantonese pre-school language development: A guide. Hong Kong: Standing Committee on Language Education and Research SCOLAR. \r 7. Garton, A., & Pratt, C. (1989). Learning to be literate: The development of spoken and written language. Oxford: Blackwell. \r 8. Garton, A., & Pratt, C. (1998). Learning to be literate: The development of spoken and written language (2nd ed.). Oxford, UK; Malden, Mass.: Blackwell. \r 9. Gee, J. P. (2004). Situated language and learning: A critique of traditional schooling. New York: Routledge. \r 10. Glazer, S. M., & Burke, E. M. (1994). An integrated approach to early literacy: Literature to language. Boston: Allyn and Bacon. \r 11. Goodman, Y. M., & International Reading Association. (1990). How children construct literacy: Piagetian perspectives. Newark, Del.: International Reading Association. \r 12. Hicks, D. (1996). Discourse, learning, and schooling. Cambridge England; New York: Cambridge University Press. \r 13. Hoyle, S. M., & Adger, C. T. (1998). Kids talk: Strategic language use in later childhood. New York: Oxford University Press. \r 14. Kenner, C. (2004). Becoming biliterate: Young children learning different writing systems. Stoke on Trent, UK: Trentham Books. \r 15. Lehr, F., & Osborn, J. (1994). Reading, language, and literacy: Instruction for the twenty-first century. Hillsdale, N.J.: L. Erlbaum Associates. \r 16. MacWhinney, B. (2000). The CHILDES project: Tools for analyzing talk (3rd ed.). Mahwah, N.J.: Lawrence Erlbaum. \r 17. Martens, P. (1996). I already know how to read: A child's view of literacy. Portsmouth, NH: Heinemann. \r 18. McBride-Chang, C. (2004). Children's literacy development. London: Arnold; New York: Distributed in the USA by Oxford University Press. \r 19. McGee, L. M., & Richgels, D. J. (2003). Designing early literacy program: Strategies for at-risk preschool and kindergarten children. New York: Guilford Press. \r 20. Mercer, N., & Open University. (1988). Language and literacy from an educational perspective: A reader. Milton Keynes, England: Open University Press. \r 21. O'Connor, R. E., Notari-Syverson, A., & Vadasy, P. F. (1998). Ladders to literacy: A kindergarten activity book. Baltimore, Md: P.H. Brookes Pub.\r 22. Petrick Steward, E. (1995). Beginning writers in the zone of proximal development. Hillsdale, N.J.: Lawrence Erlbaum Associates. \r 23. Piper, T., & Piper, T. (1998). Language and learning: The home and school years (2nd ed.). Upper Saddle River, N. J.: Merrill. \r 24. Reitsma, P., & Verhoeven, L. T. (1998). Problems and interventions in literacy development. Dordrecht; Boston: Kluwer Academic Publishers. \r 25. Schieffelin, B. B., & Gilmore, P. (1986). The acquisition of literacy: Ethnographic perspectives. Norwood,N. J.: Ablex Pub. Corp. \r 26. Sedgwick, F. (1999). Thinking about literacy: Young children and their language. London; New York: Routledge. \r 27. Smith, F. (1988). Joining the literacy club: Further essays into education. Portsmouth, N.H.; London: Heinemann. \r 28. Wells, C. G. (1986). The meaning makers: Children learning language and using language to learn. Portsmouth, N.H.: Heinemann. \r 29. Whitehead, M. R., & Whitehead, M. R. (2002). Developing language and literacy with young children (2nd ed.). London: Chapman. \r 30. 謝錫金 (編著) (2006)。《香港幼兒口語發展》。香港：香港大學出版社。", "terms": {"2020-21 Term 2": {"--LEC (6664)": {"startTimes": ["12:30"], "endTimes": ["15:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. KOU Zhihui"]}}}, "assessments": {"Others": "50", "Presentation": "30", "Participation": "20"}}, {"code": "4140", "title": "Mathematics, Science, and Tech Experiences in Early Childhood", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLectureOthersProject", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course aims to help participants understand how young children learn mathematics and science by actively constructing knowledge and making connections between new knowledge and prior knowledge. Participants will be provided with opportunities to consolidate their understandings of foundational concepts in mathematics, science and technology. They will also explore various ways to develop appropriate learning activities to foster young children’s development. This will include active exploration and manipulation of concrete materials and technological visualizations.This course will study teaching methods and key sequences for developing young children’s concepts and knowledge in the following: number, space, measurement, chance and data, patterns, body structure and functions, living and nonliving things, plants and animals, energy, water and gas, and simple toys. Participants will be able to master the skills to help young children acquire simple specific skills, such as observing and recording changes, making predictions and assumptions, and classifying objects.\r", "outcome": "At the end of the course, participants will:\r 1. demonstrate an awareness and understanding of concepts in mathematics, science and technology appropriate to the early childhood years; and\r 2. plan and prepare learning activities and experiences that enhance the development of young children in mathematics, science and technology.\r 3. Distinguish major theoretical perspectives, characteristics, and practices about learning process of science, math and technology \r 4. Appraise impacts of technology development on child learning", "syllabus": "• Concept development in math and science\r • Basics of Science, Engineering and Technology\r • Prekindergarten and Kindergarten Concepts and Skills\r • Early Geometry, Parts and Wholes, and applications of fundamental concepts to science and engineering\r • Ordering, measurement, and data collection and analysis\r • Transitioning from Preschool to Kindergarten to Primary \r • Mathematics concepts for primary grades\r • HKECE curriculum in Science and Mathematics\r • Investigations in primary science \r • Case study of Kindergarten Science teaching and learning activity\r • Integrating the curriculum", "required_readings": "Charlesworth, R., & Leali, S. A. (2012). Using problem solving to assess young children’s mathematics knowledge. Early childhood education journal, 39(6), 373‐382.\r Petersen, L. A., & McNeil, N. M. (2013). Effects of perceptually rich manipulatives on preschoolers' counting performance: Established knowledge counts. Child development, 84(3), 1020‐1033.\r McGuire, P., Kinzie, M. B., & Berch, D. B. (2012). Developing number sense in pre‐k with five‐frames. Early Childhood Education Journal, 40(4), 213‐222.\r Piccolo, D., & Test, J. (2010). Preschoolers' thinking during block play. Teaching Children Mathematics, 17(5), 310‐316. Retrieved from http://www.jstor.org/stable/41199662\r Dubon, L. P., & Shafer, K. G. (2010). Storyboards for meaningful patterns. teaching children mathematics, 16(6), 325‐329.\r Eisenhauer, M. J., & Feikes, D. (2009). Dolls, Blocks, and Puzzles: Playing with Mathematical Understandings. Young Children, 64(3), 18‐24.\r Cwikla, J. (2014). Can kindergartners do fractions?. Teaching Children Mathematics, 20(6), 354‐364. Eisenhardt, S., Fisher, M. H., Thomas, J., Schack, E. O., Tassell, J., & Yoder, M. (2014). Is it Counting, or Is it\r Adding?. Teaching Children Mathematics, 20(8), 498‐507.\r Fessakis, G., Gouli, E., & Mavroudi, E. (2013). Problem solving by 5–6 years old kindergarten children in a computer programming environment: A case study. Computers & Education, 63, 87‐97.\r Kidd, J. K., Pasnak, R., Gadzichowski, K. M., Gallington, D. A., McKnight, P., Boyer, C. E., & Carlson, A. (2014).\r Instructing first‐grade children on patterning improves reading and mathematics. Early Education & Development, 25(1), 134‐151.\r Piasta, S. B., Pelatti, C. Y., & Miller, H. L. (2014). Mathematics and science learning opportunities in preschool classrooms. Early education and development, 25(4), 445‐468.\r Crismond, D., Soobyiah, M., & Cain, R. (2013). Taking Engineering Design Out for a Spin. Science and Children, 50(5), 52.\r High, V., & VanHorn, L. (2012). Soil Science in the Digital Age. Science and Children, 50(3), 36.\r Tank, K., Pettis, C., Moore, T., & Fehr, A. (2013). HAMSTERS, PICTURE BOOKS, AND ENGINEERING\r DESIGN. Science and Children, 50(9), 59.\r Bledsoe, K. (2012). STEM day in the park. Science and Children, 49(6), 65‐69. Retrieved from http://easyaccess.lib.cuhk.edu.hk/login?url=https://search.proquest.com/docview/938068381?accountid= 10371\r Wolfgang, C. H., Stannard, L. L., & Jones, I. (2001). Block play performance among preschoolers as a predictor of later school achievement in mathematics. Journal of Research in Childhood Education, 15(2), 173‐180.\r Broaders, S. C., Cook, S. W., Mitchell, Z., & Goldin‐Meadow, S. (2007). Making children gesture brings out implicit knowledge and leads to learning. Journal of Experimental Psychology: General, 136(4), 539.\r Sinclair, N., & Heyd‐Metzuyanim, E. (2014). Learning number with TouchCounts: The role of emotions and the body in mathematical communication. Technology, Knowledge and Learning, 19(1‐2), 81‐99.", "recommended_readings": "1. Charlesworth, R., & Leali, S. A. (2012). Using problem solving to assess young children’s mathematics knowledge. Early childhood education journal, 39(6), 373-382.\r 2. Petersen, L. A., & McNeil, N. M. (2013). Effects of perceptually rich manipulatives on preschoolers' counting performance: Established knowledge counts. Child development, 84(3), 1020-1033.\r 3. McGuire, P., Kinzie, M. B., & Berch, D. B. (2012). Developing number sense in pre-k with five-frames. Early Childhood Education Journal, 40(4), 213-222.\r 4. Piccolo, D., & Test, J. (2010). Preschoolers' thinking during block play. Teaching Children Mathematics, 17(5), 310-316. Retrieved from http://www.jstor.org/stable/41199662\r 5. Dubon, L. P., & Shafer, K. G. (2010). Storyboards for meaningful patterns. teaching children mathematics, 16(6), 325-329.\r 6. Eisenhauer, M. J., & Feikes, D. (2009). Dolls, Blocks, and Puzzles: Playing with Mathematical Understandings. Young Children, 64(3), 18-24.\r 7. Cwikla, J. (2014). Can kindergartners do fractions?. Teaching Children Mathematics, 20(6), 354-364.\r 8. Eisenhardt, S., Fisher, M. H., Thomas, J., Schack, E. O., Tassell, J., & Yoder, M. (2014). Is it Counting, or Is it Adding?. Teaching Children Mathematics, 20(8), 498-507.\r 9. Fessakis, G., Gouli, E., & Mavroudi, E. (2013). Problem solving by 5–6 years old kindergarten children in a computer programming environment: A case study. Computers & Education, 63, 87-97.\r 10. Kidd, J. K., Pasnak, R., Gadzichowski, K. M., Gallington, D. A., McKnight, P., Boyer, C. E., & Carlson, A. (2014). Instructing first-grade children on patterning improves reading and mathematics. Early Education & Development, 25(1), 134-151.\r 11. Piasta, S. B., Pelatti, C. Y., & Miller, H. L. (2014). Mathematics and science learning opportunities in preschool classrooms. Early education and development, 25(4), 445-468.\r 12. Crismond, D., Soobyiah, M., & Cain, R. (2013). Taking Engineering Design Out for a Spin. Science and Children, 50(5), 52.\r 13. High, V., & VanHorn, L. (2012). Soil Science in the Digital Age. Science and Children, 50(3), 36.\r 14. Tank, K., Pettis, C., Moore, T., & Fehr, A. (2013). HAMSTERS, PICTURE BOOKS, AND ENGINEERING DESIGN. Science and Children, 50(9), 59.\r 15. Bledsoe, K. (2012). STEM day in the park. Science and Children, 49(6), 65-69. Retrieved from http://easyaccess.lib.cuhk.edu.hk/login?url=https://search.proquest.com/docview/938068381?accountid=10371\r 16. Wolfgang, C. H., Stannard, L. L., & Jones, I. (2001). Block play performance among preschoolers as a predictor of later school achievement in mathematics. Journal of Research in Childhood Education, 15(2), 173-180.\r 17. Broaders, S. C., Cook, S. W., Mitchell, Z., & Goldin-Meadow, S. (2007). Making children gesture brings out implicit knowledge and leads to learning. Journal of Experimental Psychology: General, 136(4), 539.\r 18. Sinclair, N., & Heyd-Metzuyanim, E. (2014). Learning number with TouchCounts: The role of emotions and the body in mathematical communication. Technology, Knowledge and Learning, 19(1-2), 81-99.", "terms": {"2020-21 Term 2": {"--LEC (8781)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr. CHAN To"]}}}, "assessments": {"Others": "50", "Presentation": "30", "Participation": "20"}}, {"code": "4150", "title": "Children’s Literature", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "DiscussionIndependent StudyLectureSeminarInteractive TutorialWorkshop", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "In accordance with the age characteristics of readers, children’s literature is generally differentiated into early childhood literature, middle childhood literature and youth literature. With special reference to early childhood literature, this course aims at enlightening participants in the following aspects: 1) the application of theories of language acquisition and reading processes; 2) the nature and educational potentials of children’s literature; and 3) the appreciation and creation of children’s literature. By joining this course, participants can acquire a deeper understanding of young children’s language and literature, on the basis of which early childhood education would be facilitated.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4210", "title": "Leadership and Management in Early Childhood Settings", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLectureOthers", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course provides an introduction to various leadership and management theories for early childhood education practitioners. The application of these theories and knowledge in early childhood education institutions will be illustrated at three different levels: social, school and individual. First, topics on rationale of accountability and quality assurance mechanism, data driven school improvement and matters in preparation for school self-evaluation and external review will be examined. Second, the implementation of school-based management such as resource management, professional development of teachers and team building will be discussed. Third, teacher professionalism and ways to equip early childhood practitioners with sufficient knowledge in order to fulfill their respective roles as school leaders or teacher leaders will be discussed. The course provides participants with conceptual knowledge in leadership and school management that serves as the basis of sustainable development of early childhood education institutions.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4220", "title": "Home-School-Community Collaboration for School Development", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLectureProject", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "Home-school-community collaboration provides essential resources that teachers can call upon for school improvement. The course aims to help teachers develop the competencies necessary for working with families and communities in order to enhance student learning and school effectiveness. Special emphasis is placed upon better understanding of the dynamics of parent-teacher relationships and the policies and practices of home-school-community collaboration within current educational reforms. Case studies, guest speakers, role play, debate, action plans, and discussion of required readings are woven throughout the sessions in order to prepare teachers to: (i) understand parents' roles in their children's education; (ii) enhance home-school-community communication; (iii) improve parental involvement in school activities; and (iv) build trusting relationships with parents through their community.\r", "outcome": "After the course, students will be able to: \r 1. acquired understanding of parents’ role in children education; 2. develop awareness of ways to enhance home school communication;  3. improve parental involvement in school activities and school governance; and (4) \r 4. acquired practical strategies in building trust relationship with parents and mobilizing community resources.", "syllabus": "1. Overview of Home School Community (HSC) Collaboration in local and international context\r 2. Theoretical Review of HSC collaboration \r 3. Understanding the Constraints and Possibilities of Parents of Different Background\r 4. Comprehensive Model of HSC collaboration and Its’ impact on Student Learning\r 5. Innovative ideas on HSC Collaboration\r 6. Effect of HSC Collaboration on student learning\r 7. Communicating and Volunteering\r 8. Decision Making and Participation in PTA\r 9. Collaborating with the community \r 10. Strategic Plan for HSC collaboration", "required_readings": "Please refer to course outline", "recommended_readings": "1.Overview of Home-community-school collaboration:\r Brown (1990) The Third Wave: Education and the Ideology of Parentocracy British Journal of Sociology of Education, 11: 65-85.\r Ho, S. C. (2003). Students’ Self-esteem in an Asian education system: Contribution of parental involvement and parental investment. The School Community Journal 13 (1): 65-84.\r *何瑞珠 (2010) 〈家庭學校與社區協作：從理念、研究到實踐〉香港中文大學 中大出版社. 第 1 章\r 沈雪明 (1995) 香港的家庭與學校合作模式及進展路向 《香港中文大學教育學 報》 卷 5 期，頁 1-16\r  2. Theoretical Review of Family-community-school collaboration:\r Coleman, J.S. (1988) Social capital in the creation of human capital. American Journal of Sociology 94 (supplement) : S95-S120.\r Epstein, J. (1989) On parents and schools: A conversation with Joyce Epstein Educational Leadership. October: 24-27.\r Lareau, A. (1987) Social-class differences in family-school relationships: The importance of cultural capital.\r *何瑞珠 (2010) 〈家庭學校與社區協作：從理念、研究到實踐〉香港中文大學中大出版社. 第 2 章\r   3. Understanding the Constraints and Possibilities of Parents of Different Background:\r Lareau, A (1994). Parent Involvement in Schooling: A Dissenting View. In Fagnano,\r C. L. and Werber, B. Z. Ed. School, family and community interaction: A View from the firing lines.\r Ho, Sui Chu (2009). Educational Leadership for Parental Involvement in an Asian Context: Insights from Bourdieu’s Theory of Practice. The School Community Journal. 19(2) 101 – 122.\r *何瑞珠 (2010) 〈家庭學校與社區協作：從理念、研究到實踐〉香港中文大學中大出版社. 第 3 章\r *何瑞珠 (2010) 〈家庭學校與社區協作：從理念、研究到實踐〉香港中文大學 中大出版社. 第 8 章\r  4. Comprehensive Model of Home-community-school collaboration and Its’ impact on Student Learning:\r Ho, S. C., & Willms, J. D. (1996). The effect of parental involvement on the achievement of eighth grade students. Sociology of Education, 69(2), 126-141.\r Epstein, J. (2009) A comprehensive framework for school, family, and community partnerships. In Esptein, J. Coates, L. Salinas, K.C. Sanders, M.G. and Simon, B.S. Eds. School, Family and Community Partnerships: Your Handbook for Action. Third edition Chapter 1: pp 7-56. California: Corwin Press, Inc., Sage Publications Ltd.\r Pang I Wah (2004). School family community partnership in Hong Kong.\r Educational Research for Policy and Practice 3: 109–125\r *何瑞珠 (2010) 〈家庭學校與社區協作：從理念、研究到實踐〉香港中文大學 中大出版社. 第 6章\r  5. Innovative ideas on HSC:\r Duncan et al 2009. A Model of Mindful Parenting: Implications for Parent–Child Relationships and Prevention Research. Clin Child Fam Psychol Rev 12: 255-270\r Hang, T N & Weare, K (2017). Happy teachers change the world: A guide for cultivating mindfulness in education. Berkeley, CA: Parallax Press. “Letter to a Young teacher” pg. xvii to xxv\r Epstein, J. (2011). School, Family, And Community Partnerships: Preparing educators and improving schools. Boulder, CO : Westview Press. Chapter 6.3\r *何瑞珠 (2010) 〈家庭學校與社區協作：從理念、研究到實踐〉香港中文大學中大出版社. 第 7 章\r   6. Effect of HSC on student learning:\r Ho S. C. (2005). The contribution of family involvement and investment on students’ literacy performance: A comparative study of the US and three Asian societies, Hiatt-Michael, D. B. (Ed) Promising Practices for Family Involvement in Schooling across the Continents. Chapter 11. Information Age\r Publishing.pp181-205.\r Ho, S. C. (2007) Home School Collaboration in Macau: Taking Stock and Looking for the Future. Educational Research Journal 22 (2): 47-68\r *Ho, S, C, & Kwong W. M. (2013) Parental Involvement on Children’s Education, Springer Briefs in Education. Springer: Singapore. Chapter 5 - Effects of Parental Involvement and Investment on Student Learning\r *何瑞珠 (2010) 〈家庭學校與社區協作：從理念、研究到實踐〉香港中文大學中大出版社. 第 5 章\r  7. Communicating and Volunteering:\r Berger, E.H. & Cortez, M.R. (2015). Parents as partners in education: families and schools working together (9th edition). Boston : Pearson. Chapter 6\r Berger, E.H. & Cortez, M.R. (2015). Parents as partners in education: families and schools working together (9th edition). Boston : Pearson. Chapter 8\r Esptein, J. Coates, L. Salinas, K.C. Sanders, M.G. and Simon, B.S. (2009) Eds.\r School, Family and Community Partnerships: Your Handbook for Action. Third Edition Chapter 2: pp57-83. California: Corwin Press, Inc., Sage Publications Ltd.\r Winston, P.J., Brotherson, M.J., & Summers, J.A. (2008). Learning from the field of early intervention about partnering with families. In M. Cornish, Promising practices for partnering with families in the early years (pp. 21-40). Charlotte, NC : Information Age Publishing Inc. CC (LC225.P763 2008)\r  8. Decision Making and Participation in PTA:\r Ho, S. C. (2007). Empowerment of parents in educational decentralization policy: Perspective from principals, teachers and parents. The International Journal of Interdisciplinary Social Sciences Volume 2\r Berger, E.H. & Cortez, M.R. (2015). Parents as partners in education: families and schools working together (9th edition). Boston : Pearson. Chapter 5\r Ng S W(2007). The Chronological Development of Parent Empowerment. Asia Pacific Education Review 8 (3), 487-499\r 吳迅榮 (2006). 家校協作的微型政治：權力！工具！夥伴！{教育研究學報>，Vol. 21, No. 1, Summer 2006\r   9. Collaborating with the community:\r Berger, E.H. & Cortez, M.R. (2015). Parents as partners in education: families and schools working together (9th edition). Boston : Pearson. Chapter 12\r Sanders, M.S. (2001). The role of “community” in comprehensive school, family, and\r community partnership Programs\r 何瑞珠、 姜培芝、 楊鎮偉 及 李文浩. 「商界 ─ 學校」協作：裝備香港弱勢 學生升學就業技能. 《教育學報》 第43卷 第1期, 頁153-177. 香港特別行政區: 中文大學出版社、香港教育研究所\r *何瑞珠 (2010) 〈家庭學校與社區協作：從理念、研究到實踐〉香港中文大學 中大出版社. 第10章\r  10. Home-school-community-school collaboration and learning diversity:\r 許令嫻 區美蘭 (2004). 特殊需要的學生在學校的適應: 兩個小學個案的啟示.\r Retrieved from: www.acei-hkm.org.hk/Publication/FF-24%20Hui%20Au.pdf Poon-McBrayer, K. F. (2004) To integrate or not to integrate: Systemic dilemmas in\r Hong Kong. The Journal of Special Education vol. 37 (4): 249–256\r Sanders, M.S. (2000). Creating Successful School-basaed Partnership Porgrams with Families of Special Needs Students. The School Community Journal 10(2): 37-56\r  11. Home-school-community-school collaboration and gifted students:\r Chan, D. (2005). Family Environment and Talent Development of Chinese Gifted Students in Hong Kong. Gifted Child Quarterly 49 (3) : 211-221.Coleman, J.S. (1988) Social capital in the creation of human capital. American Journal of Sociology 94 (supplement) : S95-S120.\r Sigurdardóttir, A.K. (2010) School–university partnership in teacher education for inclusive education. Journal of Research in Special Educational Needs, · Volume 10 · Number s1 · 2010 149–156.\r  12. Strategic Plan for Home-community-school collaboration:\r Epstein, J., Sanders, M., Simon, B., Salinas, K., Jansorn, N. & Voorhis, F. (2009).\r School, family, and community partnerships: your handbook for action. Thousand Oaks, Ca.: Corwin Press. Chapter 3\r Epstein, J., Sanders, M., Simon, B., Salinas, K., Jansorn, N. & Voorhis, F. (2009).\r School, family, and community partnerships: your handbook for action. Thousand Oaks, Ca.: Corwin Press. Chapter 9\r Pang I Wah 2011. Home school cooperation in the changing context – An ecological approach Asian Pacific Education Researcher 20:1, 1-16\r *何瑞珠 (2010) 〈家庭學校與社區協作：從理念、研究到實踐〉香港中文大學中大出版社. 第 9 章\r  Concluding Remark:\r 何瑞珠 (2010) 。《家庭學校與社區協作：從理念、研究到實踐》。香港中文大學中大出版社。\r Ho, S, C, & Kwong W. M. (2013) Parental Involvement on Children’s Education, Springer Briefs in Education. Springer: Singapore. 162 pages Book DOI 10.1007/978-981-4021-99-9", "terms": {"2020-21 Term 2": {"--LEC (6909)": {"startTimes": ["13:30"], "endTimes": ["16:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Mr. CHIK Pun Shing Babie"]}}}, "assessments": {"Essays": "60", "Presentation": "30", "Participation": "10"}}, {"code": "4310", "title": "Aesthetic Experience and Creative Expressions in Early Childhood", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureOthersProject", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course introduces to students the nature of aesthetic experience and its significant role in the early years of human development. The interrelated development of empathetic understanding, imagination, and creativity through the arts will be discussed. Focus will be given to the design of activities that facilitate young children's appreciation and creative expressions of different forms of arts. These forms encompass visual arts (e.g. drawings, paintings, handicraft, sculpture, photography), language arts (e.g. picture books, poems, fairy tales), expressive arts (e.g. music, dance, drama), and the integrated arts. All the above forms could be actualized in various kinds of play, which serve as an ideal form for creative expressions. With the view to uncovering the dynamics of creativity development, we shall pay attention to the processes of symbolic mediation (internalization and externalization processes inclusive). Recognizing that creativity is the essence of human existence, deliberations will be given to facilitate creative expressions of a young child in the context of kindergartens, home, and community.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4320", "title": "Introduction to Educational Research", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLectureOthersInteractive Tutorial", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course will introduce to the students the basic constructs of educational research and prepare them for carrying out a project of field inquiry into early childhood education, which is required by the program. The purposes and processes of various types of educational research, such as ethnographical research, survey research, experimental research, ex post factor research, action research, and etc. will be illustrated with examples of educational studies. The primary statistical tools will be demonstrated to help the participants understand how the tools can be appropriately applied to educational research. In learning and understanding the various aspects of educational research, the participants will be provided with the opportunity to experience how to generate and shape a research question and how to choose a research method to approach to the question.Students’ competence is assessed by their performance in writing coherently and fluently a proposal for a potential research project, demonstrating sound ideas of identifying a research question, selecting appropriate research designs to address the question, and presenting clear understanding of the requirements for each component of a research project. Specific learning outcomes (as shown below) and assessment criteria are aligned with each individual task.\r", "outcome": "A. Acquire a knowledge base about the basic concepts of educational research.\r B. Understand the purposes, characteristics, and limitations of the different research methods in educational research.\r C. Apply the concepts to critically read educational research reports.\r D. Develop a proposal for small-scale independent research.", "syllabus": "-Philosophical worldviews and research approaches: Quantitative, qualitative, mixed-methods\r -Review of the literature\r -Quantitative research designs: surveys, correlational studies, causal comparative studies, experimental studies\r - Qualitative research designs: ethnographic studies,\r case studies\r -Action research\r -Ethics\r -Methods for data collection: observations, interviews, questionnaires\r -Sampling of participants\r -Introduction to data analysis\r -Writing a proposal", "required_readings": "For reference only, please refer to the course outline of respective teacher for details.\r  Mukherji, P., & Albon, D. (2015). Research methods in early childhood: An introductory guide. Thousand Oaks, CA: Sage Publications.", "recommended_readings": "For reference only, please refer to the course outline of respective teacher for details.\r  Babione, C. (2015). Practitioner teacher inquiry and\r  research. San Francisco, CA: Jossey-Bass.\r Burton, N., Brundrett, M., & Jones, M. (2014). Doing your education research project (2nd ed.). Thousand Oaks, CA: Sage Publications.\r Castle, K. (2012). Early childhood teacher research: From questions to results. NY: Routledge.\r Frankel, J. R. (2015). How to design and evaluate research in education (9th edition). Boston, MA: McGraw-Hill.\r Hatch, A. (Ed.) (2007). Early childhood qualitative research. NY: Routledge. \r Jarvis, P. (2012). Research in the early years: A step-by-step guide. NY: Pearson.\r Mertins, D. M. (2015). Research and evaluation in education and psychology: Integrating diversity with quantitative, qualitative, and mixed methods (4th ed.). Thousand Oaks, CA: Sage Publications.\r Nabors, L. A. (2013). Research methods for children. NY: Nova Publishers.\r Naughton, G. M., Rolfe, S. A., & Siraj-Blatchford, I. (2010). Doing early childhood research: International perspectives on theory & practice (2nd edition). England: Open University Press.\r Riddall-Leech, S. (2008). How to observe children. UK: Heinemann\r Roberts-Holmes, G. (2014). Doing your early years research project: A step-by-step guide (3rd ed. ). Thousand Oaks, CA: Sage Publications.\r Ruth, R. (2015). Practical statistics for educators. NY: Rowman & Littlefield.\r Walker, R., & Solvason, C. (2014). Success with your early years research project. Thousand Oaks, CA: Sage Publications.\r 王文宇 (2011) 。＂研究方法入門教程＂。北京市：高等教育出版社。\r 王堅紅 (2005) 。＂學前兒童發展與教育科學研究方法＂。北京：人民教育出版社。\r 卓挺業 (2012) 。＂教育科學研究方法”。中國：南海出版公司。\r 郭生玉 (2014) 。＂心理與教高研究法：量化、質性與混合研究方法＂。新北市：精華總經銷。`\r 徐振邦、梁文蓁、吳曉青、陳儒晰 (譯) (2010) 。最新教育研究法。\r  Related Online Journal:\r 1) Early Child Development & Care\r 2) Early Childhood Education Journal\r 3) Early Childhood Research Quarterly\r 4) Early Childhood Today\r 5) Journal of Early Childhood Literacy\r 6) Journal of Early Childhood Research\r 7) Teaching Young Children\r 8) Topics in Early Childhood Special Education\r 9) Young Children\r 10) 心理發展與教育\r 11) 心理學報\r 12) 心理與行為研究\r 13) 教育學報", "terms": {"2020-21 Term 2": {"--LEC (5839)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Miss NG Ka Yee"]}}}, "assessments": {"Presentation": "15", "Project": "85"}}, {"code": "4330", "title": "Personal Growth of Teachers", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "DiscussionLectureOthers", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course aims to promote among students an interest and readiness for taking charge of their personal development. It draws attention to the significance of psychological and physical wellness, and a number of selected areas related to personal growth. It also provides an opportunity for students to expand their self-awareness, and identify factors relating to their professional and personal development.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4340", "title": "Supporting Preschool Children with Special Educational Needs", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLectureProjectVisit", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course aims to provide students with theoretical foundations in selected areas of special needs, and to help them to understand possible learning difficulties that preschool children with these special needs would encounter. Selected areas of special needs include: (i) autism spectrum disorder; (ii) emotional and behavioral disorders; (iii) specific language impairment; (iv) physical disabilities; and (v) intellectual disabilities. For each kind of special need, students will learn its characteristics, causes, and provision of special education in Hong Kong. Besides, this course will also prepare students for developing essential intervention strategies and techniques to help children with learning difficulties. Students will also work in small groups, under the supervision of the instructor, to conduct case studies in order to strengthen their knowledge of the learning difficulties of selected groups of children.\r", "outcome": "At the end of the course, students should be able to:\r 1. To acquire basic principles of identification and knowledge in educating children with various types of special-needs children in early childhood\r 2. To gain an understanding of provision of preschool special education in Hong Kong\r 3. To begin to critically evaluate current issues related to the education of preschool students with special educational needs\r 4. To develop relevant intervention strategies to facilitate student development and enhance development and learning in early childhood", "syllabus": "- Basic Concepts\r - Early Identification and Early Intervention\r - Children with Intellectual and Developmental Disabilities\r - Children with Reading Disabilities: Basic Concepts and Identification, Intervention Strategies\r - Children with Autism Spectrum Disorder: Basic Concepts and Identification\r - Children with Autism Spectrum Disorder: Intervention Strategies\r - Children with Social-Emotional and Behavioral Challenges\r - Children with Specific Language Disorder \r - Children with Physical Impairment and Motor Difficulties \r - How to design, implement and review, Individual Education Plan for children with SEN\r - How to deliver Group Training for children with SEN", "required_readings": "(to be provided by teacher concerned)", "recommended_readings": "1. Baron-Cohen, S. (2008). Autism and Asperger Syndrome. Oxford University Press.\r 2. Cook, E.G., Klein, M.D., & Tessier, A. (2012). Adapting early childhood curricula for children with special needs (7th ed.). Upper Saddle River, NJ: Pearson Merrill Prentice Hall.\r 3. Croke, M. (2012). Using playful practice to communicate with special children. New York, Routledge.\r 4. Eileen, A.K., & Cowdrey, G. (2015). The exceptional child: Inclusion in early childhood education. Stamford, CT: Cengage Learning.\r 5. Frith, U. (1991). Autism and Asperger syndrome. United Kingdom: Cambridge University Press.\r 6. Groark, C.J. (2011). Early childhood intervention: Shaping the future with special needs and their families. Santa Barbara: Praeger.\r 7. Hallahan, D., Kauffman, J., Pullen, P.C. (2014). Exceptional learners: An introduction to Special Education (Thirteenth Edition). Boston: Pearson.\r 8. Hirschland, D. (2015). When young children need help: Understanding and addressing emotional, behavioral and developmental challenges. St Paul, MN: Redleaf Press.\r 9. Howard, V.F. (2014). Young children with special needs: a foundation for educators, families, and service providers. Boston: Pearson.\r 10. Newman, S. (2008). Small steps forward: Using games and activities to help your preschool children with special needs. London: Jessica Kingsley Publishers.\r 11. Roffery, S., & Parry, J. (2014). Special needs in the early years: Supporting collaboration, communication and coordination (3rd ed.). United Kingdom: Routledge.\r 12. 王燕華 (2011)。《幼兒園如何接纳特殊需要兒童： 融合教育工作經驗篇》。北京市：北京大學出版社。\r 13. 李震梅 (2008)。《不一樣的孩子 ─ 認識及培養學習差異兒童》。香港：中文大學出版社。\r 14. 何華國 (2004)。《特殊兒童心理與教育》（四版）。台北：五南出版社。\r 15. 林瑞芳 (編) (2004)。《教育心理學實用手冊》。香港：香港心理學會敎育心理學部。\r 16. 林寶貴策劃主；林寶貴、沈慶盈、陳明聰、王淑娟、 王欣宜、蔣明珊、吳亭芳、簡明建、黃志雄、廖華芳、邱滿艷 (2013)。《特殊教育理論與實務》（第四版）。台北：心理出版社。\r 17. 陳錦鴻 (2014)。《我和兒子的每一步》。香港：世界出版社。\r 18. 黎程正家 (2003)。《不一樣的學習秘訣：有特殊需要學生之家校合作策略》。香港：宏利兒童學習潛能發展中心。\r 19. 劉學融 (譯) (2010)。《從遊戲中學習：學前融合教育實務的妙點子》。台北：心理出版社。\r 20. 盧明、魏淑華、翁巧玲 (譯) (2008)。《學前融合教育課程建構模式》。台北：心理出版社。\r 21. 藍瑋琛 編著 (2010)。《自閉症學生教學策略》。臺北市立教育大學特殊教育中心。", "terms": {"2020-21 Term 1": {"--LEC (5552)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor IP Lai Fan Renee, \n\rProfessor SIU Fung Ying Angela"]}}}, "assessments": {"Essays": "50", "Others": "20", "Presentation": "30"}}, {"code": "4350", "title": "Assessment for the Development and Learning of Young Children", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ExerciseLectureProject", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course provides students a basic understanding of the assessment principles and methods for teachers of young children from three to eight years of age. The foci of the courses are: 1) the basic concepts of educational and psychological assessment; 2) the purposes and processes of a variety of assessment methods currently used to assess and understand learning and development of young children; and 3) challenges in assessing young children from psychological, educational, and cultural perspectives. Students are expected to improve their educational practice by acquiring a working knowledge of appropriate assessment and gaining an understanding of the methods of observation, interview, standardized testing, and alternative assessment approaches for young children.\r", "outcome": "At the end of the course, students should be able to demonstrates:\r 1. the understanding of the purposes, characteristics, and limitations of different kinds of assessments for young children, and the principles and ethics of appropriate assessment; 2. become familiar with a variety of formal and informal assessment methods, including interviewing, observation, standardized testing, and alternative assessment; 3. develop knowledge of a repertoire of effective assessment methods that can be used to continuously monitor children’s progress in different areas of learning and development; and\r 4. acquire a working knowledge of basic measurement concepts, including reliability, validity, norm-referenced, criterion-referenced, and standardization.", "syllabus": "- Orientation and Basic Concepts \r - How Infant and young children should be assessed \r - How Standardize Testing are used, Designed and Select \r - Using and Reporting Standardize Test Results\r - Classroom Assessment and Documentation\r - Observation\r - Checklist Rating Scales and rubrics\r - Teacher-designed Assessment Strategies\r - Portfolio Assessment\r - Performance-based Assessment Strategies\r - Communication with caregiver", "required_readings": "(to be provided by teacher concerned)", "recommended_readings": "1. Alasuutari, M. (2014). Assessment and documentation in early childhood education. New York: Routledge.\r 2. Bassard, R., & Boehm, A.E. (2007). Preschool assessment: principles and practices. New York: Guilford Press.\r 3. Billman, J., & Sheman, J. A. (2003). Observation and participation in early childhood settings. Boston, Allyn & Bacon (Chp. 2: Methods for recording observation of young children’s behavior, pp.13-40).\r 4. Brodie, K. (2013). Observation, assessment and planning in the early years: Bringing it all together. United Kingdom: Open University Press.\r 5. Crows, N. (2013). Teaching early years: Curriculum, pedagogy and assessment. Crows Nest,: Allen & Unwin.\r 6. Deb, C., & Carter, M. (2013). The art of awareness: How observation can transform your teaching. Minnesota.:Redleaf Press.\r 7. Dubiel, J. (2014). Effective assessment in early years foundation stage. London: SAGE.\r 8. Esther, G. (2015). Psychological assessment of culturally and linguistically diverse children and adolescents. New York: Springer.\r 9. Fiore, B. (2012). Assessment of young children: A collaborative approach. New York: Routledge.\r 10. McLachlan, C. (2013). Children’s learning and development: Contemporary assessment in the early years. Victoria: Palgrave Macmillian.\r 11. Meisels, S. J. (1999). Assessing readiness. In R. C. Pianta, & M. J. Cox (Eds.),\r The transition to kindergarten (pp.39-66). Baltimore: Paul Brookes.\r 12. Meisels, S. J., & Atkins-Burnett, S. (2005). Developmental screening in early childhood: A guide (5th ed.). Washington, DC: Association for the Education of Young Children.\r 13. Meisels, S. J., Atkins-Burnett, S. (2006). Evaluating early childhood assessments: A differential analysis. In K. McCartney & D. Phillips (Eds.), Blackwell handbook of early childhood development (pp.533-549). Malden, MA: Blackwell.\r 14. Neisworth, J. T., & Bagnato, S. J. (2004). The mismeasure of young children: The authentic assessment alternative. Infants and Young Children, 17, 198-212.\r 15. NICHD Early Child Care Research Network (2004). Multiple pathways to early academic achievement. Harvard Educational Review, 74(1), 1-29.\r 16. NICHD Early Child Care Research Network (2005). A new guide for evaluating child care quality. In The NICHD Early Child Care Research Network (Ed.), Child care and child development (pp.78-90). New York: The Guilford Press.\r 17. Oberdorf, C. (2012). Using formative assessment to drive mathematics instruction in grades preK-2. Larchmont, NY: Eye on Education.\r 18. Popham, W. J. (2014). Classroom assessment: What teachers need to know. Boston: Pearson.\r 19. Rathvon, N. (2004). Early reading assessment: A practitioner’s handbook. New York: Guildford Press.\r 20. Rhodes, R. L., Ochoa, S. H., & Ortiz, S. O. (2005). Assessing culturally and linguistically diverse students: A practical guide. New York: Guilford Press (Ch 7: The interview process: Practical guidelines, pp.103-123).\r 21. Sattler, J. M. (2001). Assessment of children: Cognitive applications (4th ed.). San Diego, CA: Jerome M. Sattler, Publisher.\r 22. Sattler, J. M. (2001). Assessment of children: Behavioral and clinical applications\r (4th ed.). San Diego, CA: Jerome M. Sattler, Publisher.\r 23. Smith, M. W., & Dickinson, D. K. with Sangeorge, A., & Anastasopoulos, L. (2008). User’s guide to the early language and literacy classroom observation toolkit. Baltimore, MD: Paul Brooks.\r 24. Wortham, S.C. (2016). Assessment in early childhood education. Upper Saddle River, NJ: Pearson.\r 25. Zaslow, M. (2011). Quality measurement in early childhood settings. Baltimore, Md.: P.H. Brookes Pub Co.\r 26. 陳潔琦、朱莉．維恩思、瑪拉．克瑞克維斯基 (2005)。《多元智能的理論與 實踐：讓每個兒童在自己強項上發展》。北京：北京師範大學出版社。\r 27. 黄艾珍、容燕文 (2012)。《課程本位的幼兒發展評估模式：理論與實踐》。北 京：教育科學出版社。\r 28. 霍力岩 (2005)。《學前教育評價》。北京：北京師範大學出版社。\r 29. 鄭瑞菁 (譯) (2006)。《幼教評量與評鑑：從幼兒教育中探討》。台北：華騰 文化。", "terms": {"2020-21 Term 2": {"--LEC (8264)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. LAM Wing Chi"]}}}, "assessments": {"Others": "20", "Presentation": "30", "Project": "50"}}, {"code": "4360", "title": "Advanced Study of Early Childhood Development", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkDiscussionExerciseLectureOthersProjectInteractive Tutorial", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course is designed to enhance students’ knowledge in child development and to facilitate their ability to apply the knowledge to early childhood education settings. Topics to be covered include: (1) major domains in child development, developmental milestones, and atypical development; (2) major theories in child development and their implications for practices in education settings; and (3) current issues and research in the field of early childhood education.\r", "outcome": "Upon completion of the course, students are expected to be able to:\r  1. describe the major domains in child development, developmental milestones, and atypical development; 2. understand the different theoretical perspectives on early childhood development,\r 3. appreciate the contemporary ecology within which children develop and interact with others, \r 4. apply developmentally appropriate teaching materials and resources to create supportive and enriching / challenging learning environment.", "syllabus": "Topics to be covered include: history and the evolution of early childhood development; physical, cognitive, socioemotional and gender development of children; the ecology of development, current issues in early childhood development etc. \r (Please refer to the course outline of the respective teachers for details.)", "required_readings": "It would depend on individual instructors to assign any required readings.", "recommended_readings": "Akhtar, S. (2011). The electrified mind: Development, psychopathology, and treatment in the era of cell phones and the internet. Lanham, MD: Jason Aronson. \r  Appleby, K. (2011). Playing and learning ways of being in action. In N. Canning (Ed.), Play and Practice in the early years. London: Sage.\r  Berger, K. S. (2014). The developing person through the life span (9th ed.). New York: Worth Publishers.\r  Berk, L. E. (2013). Child development. Boston: Pearson.\r  Berns, R. M. (2013). Child, family, school, community: Socializing and support (International edition, 9th ed.). CA: Wadsworth, Cengage Learning. \r  Bleach, M. J. (2010). Parental involvement in primary education in Ireland. Dublin: Liffey Press.\r  Boyd, D., & Bee, H. (2015). Lifespan development (7th ed.). Boston: Pearson.\r  Bronfenbrenner, U., & Ceci, S. J. (1994). Nature-nurture reconceptualized in developmental perspective: A bioecological model. Psychological Review, 101(4), 568-586. \r  Bullard, J. (2014). Creating environments for learning: Birth to age eight (2nd ed.). Boston: Pearson.\r  Carew, T. J., & Magsamen, S. H. (2010). Neuroscience and education: An ideal partnership for producing evidence-based solutions to guide 21st century learning. Neuron, 67(5, 9), 665-688.\r  Castelli, D. M., Centeio, E. E., Hwang, J., Barcelona, J. M., Glowacki, E. M., Calvert, H. G., & Nicksic, H. M. (2014). The history of physical activity and academic performance research: Informing the future. Monographs of the Society for Research in Child Development, 79, 119-148.\r  Conkbayir, M., & Pascal, C. (2014). Early childhood theories and contemporary issues: An introduction. London: Bloomsbury. \r  DeFrates-Densch, N. (2008). Case studies in child and adolescent development for teachers. Boston, Mass: McGraw-Hill Higher Education.\r  Dubinsky, J. M., Roehrig, G., & Verma, S. (2013). Infusing neuroscience into teacher professional development. Educational Research, 42(6), 317-329.\r  Gordon, A. M., & Browne, K. W. (2016). Beginning essentials in early childhood education (3rd ed.). Boston, MA: Cengage Learning.\r  Kassem, D., Murphy, L., & Taylor, E. (Eds.). (2010). Key issues in childhood and youth studies. NY: Routledge.\r  Levin, D. E. (2013). Beyond remote-controlled childhood: Teaching young children in the media age. Washington, DC: National Association for the Education \r of Young Children. \r  Macintyre, C. (2015). Understanding children’s development in the early years:Questions practitioners frequently ask (2nd ed.). New York: Routledge.\r  Maholmes, V., & Lomonaco, C. G. (Eds.). (2010). Applied research in child and adolescent development: A practical guide. New York: Psychology Press.\r  National Center for Health Statistics. (2011, Update). Prevalence of overweight among children and adolescents: United States. Hyattsville, MD: U. S. Department of Health and Human Services, Centers for Disease Control and Prevention.\r  Papalia, D. E., Feldman, R. D., & Martorell, G. (2014). Experience human development (13th ed.). Boston, MA: McGraw-Hill.\r  Penn, H. (2014). Understanding early childhood: Issues and controversies (3rd ed.).\r  London: Open University Press.\r  Reed, M., & Walker, R. (Eds.). (2015). A critical companion to early childhood.\r London: Sage.\r  Reutzel, D. (2013). Handbook of research-based practice in early childhood.\r New York: Guilford.\r  Saracho, O. N. (2014). Contemporary perspectives on research in theory of mind in early childhood education. Charlotte, NC: Information Age Publishing.\r  Schnoor, O. (2012). Early childhood studies as vocal studies: Examining the social practices of “giving voice to children’s voices” in a crèche. Childhood, 20, 458.\r  Scully, P. A., Barbour, C., & Roberts-King, H. (2015). Families, schools and communities: Building partnerships for education (6th ed.). Boston: Pearson.\r  Siegler, R., DeLoache, J., Eisenberg, N., & Saffran, J. (2014). How children develop\r (4th ed.). New York: Worth Publishers.\r  Trivette, C. M., Dunst, C. J., & Hamby, D. W. (2010). Influences of family-systems intervention practices on parent-child interactions and child development.\r Topics in Early Childhood Special Education, 30(1), 3-19.\r  Woolfolk, A., & Perry, N. E. (2012). Child and adolescent development. Upper Saddle River, N.J.: Pearson.\r  (The above list is for reference only. It would depend on individual instructors to recommend any other books / articles.)", "terms": {"2020-21 Term 1": {"--LEC (7231)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Hui Yeung Shing Bldg G05"], "instructors": ["Ms. LAU Siu Lin"]}}}, "assessments": {"Essay test or exam": "40", "Others": "20", "Presentation": "30", "Participation": "10"}}, {"code": "4370", "title": "Counselling Young Children", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "DiscussionExerciseLectureOthers", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course introduces basic counselling skills for working with preschool children in response to a variety of developmental and/or adjustment issues. Topics to be covered include: ways to build rapport with young children, use of toys, drama, art, music and other creative techniques to work with children with various abilities. Throughout the course, students are expected to gain better understanding of children's feelings and needs, and become more aware of the ways to respond to children. Such an understanding will enable students to facilitate the development of positive emotional relationship and improve behaviors of children, which ultimately allow more learning to take place. The roles of family and school in working with young children will be emphasized.\r", "outcome": "By the end of the course, students are expected to:\r i. Acquire better knowledge in understanding social-emotional needs of children\r ii. Apply basic counseling skills in building better teacher-student relationship that can enhance children’s overall development\r iii. Gain ideas on the use of different techniques such as play, music, art, and stories to help children explore emotions\r iv. Relate better to parents and be able to work collaboratively with them to enhance the development of children\r v. Appreciate the therapeutic powers of play in counseling children\r  (Individual course teachers may update the learning outcome as and whenever necessary)", "syllabus": "- Developmental issues in early childhood\r - Building positive teacher-child relationship\r - The counseling process and basic counseling skills\r - Using play therapy skills and expressive arts strategies to work with children\r - Working with parents and professionals\r - Building resiliency", "required_readings": "(to be provided by teacher concerned)", "recommended_readings": "Kottler, J.A., & Kottler, E. (2015). Counseling skills for teachers. Calif.: Skyhorse Publishing. (林秀玲 (譯) (2011) 。《教師諮商技巧》。台北：心理出版社。) LB1027.5 .K66312 王孟心、王世芬 譯 (2008) 。《建立遊戲治療關係實用手冊》。台北：五南出版社。\r 吳淑芳、姜鵬珠、蔡金涼。(2014) 。《兒童輔導實務》。台北：洪葉文化。\r  Additional articles/book chapters covering relevant topics will be introduced in class\r   Other references:\r  Butler, S., Guterman, J.T., & Rudes, J. (2009). Using puppets with children in narrative therapy to externalize the problem. Journal of Mental Health Counseling, 31, 225-233.\r  Chen, I.J., & Liu, C.C. (2010). Using drawing as intervention with children for in-service preschool teachers. Journal of College Teaching and Learning, 7(4), 1-8.\r  Danahy, L. (2014). Mindfulness for Teachers. Teaching Young Children, 8, 16-18.\r  Dewes, A.A., & Schaefer, C.E. (2010). School-based play therapy. New Jersey: John Wiley\r & Sons.\r  Fees, B.S., Kaff, M., Holmberg, T., Teagarden, J., & Delreal, D. (2014). Children’s responses to a social story song in three inclusive preschool classrooms: A pilot study. Music Therapy Perspectives, 32, 71-77.\r  Greer, B.D., Neidert, P.L, Dozier, C.L, Payne, S.W., Zonneveld, K.L M (2014). Functional analysis and treatment of problem behavior in early education classrooms. Journal of Applied Behavior Analysis, 46, 289-95.\r  Landreth, G.L. (2012). Play therapy: The art of the relationship (3rd ed.). New York, NY: Routledge/Taylor & Francis Group.\r  Lemberger-Truelove, M.E., et al. (2018). Self-regulatory growth effects for young children participating in a combined social and emotional learning and mindfulness-based intervention. Journal of Counseling and Development, 96, 289-302.\r  Leung, C.H. (2015). Enhancing social competence and the child-teacher relationship using a child-centered play training model in Hong Kong preschools. International Journal of Early Childhood, 47, 135-152.\r  Leyden, R., & Shale, E. (2012). What teachers need to know about social and emotional development. Camberwell, Vic.: ACER Press.\r  Post, P.B. (2014). Involving parents in child-centered play therapy. Counseling Today (Aug 25, 2014). American Counseling Association.\r  Ray, D., Blanco, R., Sullivan, J., & Holliman, R.P. (2009). An exploratory study of child centered play therapy with aggressive children. International journal of play therapy, 18, 162-175.\r  Razza, R.A., Bergen-Cico, D.B., & Raymond, K. (2015). Enhancing Preschoolers’\r Self-Regulation Via Mindful Yoga. Journal of Child and Family Studies, 24, 372-385.\r  Robinson, J., & Roxanne G. (2008). Play therapy techniques with very young at-risk children in child care settings. In C.E. Schaefer, C.E (Ed). Play Therapy for very young children. New York: Jason Aronson.\r  Sage, S.M., Adcock, S.S., & Dixon, A.L. (2012). Why humanistic teacher education still matters. Action in Teacher Education, 34, 204-220.\r   Sciaraffa, M.A., Zeanah, P.D., & Zeanah, C.H. (2017). Understanding and promoting resilience in the context of adverse childhood experiences. Early Childhood Education Journal, 46, 343-353.\r  Siu, A.F.Y. (2014). A qualitative exploration of filial therapy for enhancing teacher-student relationships. Journal of Asia Pacific Counseling, 4, 15-30.\r  Siu. A.F.Y. (2014). Effectiveness of a Group Theraplay Program on Enhancing Social Skills among Children with Developmental Disabilities. International Journal of Play Therapy, 23, 187-203.\r  Stone, S., Stark, M. (2013). Structured play therapy groups for preschoolers: facilitating the emergence of social competence. International Journal of Group Psychotherapy, 63, 25-50.\r  Strain, P.S. & Bovey, E.H. (2015). Promoting peer relations for young children with autism spectrum disorder: the LEAP preschool experience. In S. Madrid, D.E. Fernie, & R. Kantor (Eds.). Reframing the emotional worlds of the early childhood classroom.\r New York: Routledge.\r  Stulmaker, H. (2013). Counseling-based teacher interventions: Defining, exploring and differentiating. International Journal of Play Therapy, 22, 1-12.\r  Tekin, G., Sezer, O. (2010). Applicability of play therapy in Turkish early childhood education system: today and future. Procedia- Social and Behavioral Sciences, 5, 50-54.\r  Tiano, J. (2010). Teacher-child interaction therapy for preschool classrooms. In C.B. McNeil,\r & T.L. Hembree-Kigin (Eds.), Parent-child interaction therapy (2nd ed., pp.385-392). New York, NY: Springer.\r  Trice-Black, S., Bailey, C., & Riechel, M. (2013). Play therapy in school counseling.\r Professional School Counseling, 16, 303-312.\r  Wright, C., Diener, M.L., Kemp, J.L. (2013). Storytelling dramas as a community building activity in an early childhood classroom. Early Childhood Education Journal, 41, 197-210.\r  Zand, E.K., & Nekah, S.M.A. (2015). An investigation into the effect of group play therapy on aggression reduction in male preschool students. International Journal of Educational Investigations, 2, 78-87.\r  許智傑、謝政廷 譯 (2007) 。《來畫圖吧! 》。台北：心理出版社 鄭如安 著 (2010) 。《學校遊戲治療實務》。 台北：五南出版社 林瑞堂 譯 (2002) 。《兒童故事治療》。台北：張老師文化。\r 王文秀、田秀蘭、廖鳳池 (2011) 。《兒童輔導原理》。台北：心理出版社。\r 陳意文 (2013) 。《遇見孩子生命的曙光：兒童青少年的焦點解決諮商》。台北： 張老師文化。\r 王敬仁 譯 (2016) 。《阿德勒的幼兒教養課－－培養孩子面對挑戰的勇氣》。台北： 遠流出版社。", "terms": {"2020-21 Term 1": {"--LEC (5306)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor SIU Fung Ying Angela"]}}}, "assessments": {"Essays": "60", "Others": "40"}}, {"code": "4410", "title": "Fundamental Movement Skill and Rhythmic Activity for Young Children", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLecturePracticumVisit", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course is to develop knowledge and understanding of the learning, teaching and assessing process in relation to fundamental movement skills (FMS). Students will be introduced to both theoretical and applied aspects of movement education for young children. There will be a focus on planning and implementing purposeful activities which will promote FMS and cater for individual differences in the early years. Students will also be trained to observe and assess young children movement abilities using the key components of the movement patterns associated with individual FMS. Through participation, students will build a range of FMS and rhythmic activities to be taught in early childhood settings.\r", "outcome": "After taking this course, students will be able to:\r 1. Understand child physical, cognitive and affective development and underpinning theories of motor skill learning and development in young children.\r 2. Understand FMS and movement concepts, and describe how they interact with one another to promote acquisition of FMS and physical literacy in children.\r 3. Demonstrate application of understanding of movement concepts and the skill components for teaching and assessment of young children’s proficiency in a variety of FMS.\r 4. Plan and deliver developmentally appropriate FMS and rhythmic activities in a critical and innovative approach to support physical, cognitive and affective development of young children.\r 5. Identify /diagnose the problems, and develop creative and innovative solutions to the problems of motor skill acquisition among young children.\r 6. Demonstrate application of professional ethics and values in planning and delivering developmentally appropriate FMS and rhythmic activities.", "syllabus": "1. Gross Motor Skill Development in the Early Years\r 2. Overview of Physical Literacy and Fundamental Movement Skills\r 3. Importance and Benefits of Fundamental Movement Skills Proficiency in Young Children\r 4. Strategies for Fundamental Movement Skills Development in Young Children\r 5. Learning about Fundamental Movement Skills and their Components\r 6. Understanding Movement Concepts through Structured Play and Games\r 7. Practical FMS and Rhythmic Activities for Classroom Application\r 8. Observation and Assessment Tools for the Early Years\r 9. Integration Movement Opportunities in Early Childhood Curriculum\r 10. Developmentally Appropriate Movement Practice for Young Children: Design and Presentation \r 11. Research and Trend of Motor Skill Development in Young Children", "required_readings": "1. Rae, P. (2013). Experiences in movement & music: Birth to age 8 (5th ed.). Belmont, California: Wadsworth Cengage Learning.", "recommended_readings": "1. Abels, K. W., & Bridges, J. M. (2010). In Bridges J. M. (Ed.), Teaching movement education: foundations for active lifestyles. Champaign, IL: Human Kinetics.\r 2. Davies, M. (2003). Movement and Dance in early childhood (2nd ed.). London: Paul Chapman Publishing.\r 3. Edwards, L. (2015). Music and movement: A way of life for the young child. Boston, MA: Pearson Education.\r 4. Gallahue, D. L., Ozmun, J., & Goodway, J. D. (2012). In Goodway J. (Ed.), Understanding Motor development: Infants, children, adolescents, adults. New York: McGraw-Hill.\r 5. George, G. (2013). In Holt/Hale S. A., Parker M. (Eds.), Children moving: A reflective approach to teaching physical education. New York: McGraw-Hill.\r 6. Hafner, M. L. (2019). The joy of movement: Lesson plans and large-motor activities for preschoolers. St Paul, MN: Redleaf Press.\r 7. Haibach, P. S., Reid, G., & Collier, D. H. (2011). Motor learning and development. Champaign, IL: Human Kinetics.\r 8. Haywood, K. M., & Getchell, N. (2014). Life span motor development. (6th ed.). Champaign, IL: Human Kinetics.\r 9. Kovar, S. K., Combs, C. A., Campbellm K. Napper-Owen, G., & Worrell, V. J. (2012). Elementary classroom teachers as movement educators. (4th ed.). New York: McGraw-Hill.\r 10. Newman, J., & Feinberg, M. P. (2015). Move to learn: Integrating movement into the early childhood classroom. Lewisville, NC: Gryphon House, Inc.\r 11. Tomporowski, P., McCullick, B., & Pesce, C. (2015) Enhancing children's cognition with physical activity games. Champaign, IL: Human Kinetics.", "terms": {"2020-21 Term 2": {"--LEC (7453)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 303"], "instructors": ["Dr. CHAN Hoi Sze Cecilia, \n\rDr. CHAN Ka Wai"]}}}, "assessments": {"Essay test or exam": "30", "Others": "20", "Presentation": "30", "Report": "20"}}, {"code": "4510", "title": "Values Education in Early Childhood Education", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "DiscussionLectureOthersInteractive Tutorial", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course aims to explicate the theoretical foundations of moral education, character education and values education as well as to illuminate their limitations and possibilities associated with the preschool and educational contexts of Hong Kong. Issues on caring, character formation, philosophy for children, moral meanings in children stories, children's thinking of selves, moral and social rules, sex education, care to environment, pedagogies for conflict resolution and moral education will be discussed. It serves to help participants reflect on their own values and on the ways they teach values.", "outcome": "At the end of the course, students are expected to:\r 1. understand the key theories and principles of moral education, character education and values education; 2. analyse selected issues related to moral education, character education and values education in the preschool and educational contexts of Hong Kong; and\r 3. reflect on their own values and the ways they teach values in preschools.", "syllabus": "價值教育的學理以及四式的價值教學法 香港價值教育的發展以及相關實踐問題 價值教育的自由派：自主式價值教學法Liberal Values Pedagogies）\r 理論：幼兒需要自由嗎？自主如何發生良好作用？ 實踐：自由派、自主式價值教學法的案例及示範 價值教育的傳統派：保守式價值教學法（Conservative Values Pedagogies）\r 理論：幼兒需要權威嗎？傳統如何發生良好作用？ 實踐：傳統式、保守式價值教學法的案例及示範 價值教育的對話派：對話式價值教學法（Dialogical Values Pedagogies）\r 理論：幼兒需要溝通嗎？對話如何發生良好作用？ 實踐：對話式價值教學法的案例及示範 價值教育的敘事派：敘事式價值教學法（Narrative Values Pedagogies）\r 理論：幼兒需要故事嗎？敘事如何發生良好作用？ 實踐：敘事式價值教學法的案例及示範 總結：報告 研習報告（一）：自由派與傳統派 研習報告（二）：對話派與敘事派", "required_readings": "Please refer to the course outline", "recommended_readings": "鄭漢文（2016）〈價值教育之從精神（心動）、經團隊（力用）、到課程（事成）：中大個案〉\r 鄭漢文（2016）〈從價值教育的兩種理論取向演繹出四式的價值教學法〉\r 唐欣怡（2016）〈香港價值教育的發展與展望〉\r Schiller (1998) The Values Books\r 鄭漢文（2016）〈…四式的價值教學法〉", "terms": {"2020-21 Term 2": {"--LEC (7428)": {"startTimes": ["13:30"], "endTimes": ["15:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Dr. KOO Wai Sze"]}}}, "assessments": {"Essays": "70", "Presentation": "30"}}, {"code": "4520", "title": "Guided Study in Issues of Child Development", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureOthersProjectSeminar", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course is an application of a student-orientated approach to teaching intended to nurture students to become independent learners, professional teachers of young children, and reflective early childhood education practitioners. Students are required to pursue an issue of child development of their choice, build their understanding of the issue, and then share their personal views of the issue.Students’ performance is assessed according to their demonstration of logical thinking and thorough analysis of various issues from different theoretical perspectives with the support of empirical evidence.\r", "outcome": "1. Learn independently;  2. Build understanding of an issue of child development; 3. Examine the issue from different perspectives \r 4. Develop reflective and communication skills.", "syllabus": "Students take the initiation to select issue topics to be explored in this course. Examples of categories of issues are as follows:\r A. Effective Caring, e.g., \r - Responsive caring and quality of adult-child relationship\r - Constructive guidance and discipline \r  B. Effective Learning, e.g.,\r - Playing and exploring\r - Learner-centered pedagogical practices\r - Use of technology and media\r - Moral and character education\r  C. Knowing Atypical Child Development, e.g.,\r - Disabilities/disorder\r - Child abuse\r  D. Professional Development, e.g.,\r - Teachers’ knowledge and beliefs\r - Early childhood teachers’ development and preparation", "required_readings": "To be assigned according to the selected topics", "recommended_readings": "Brock, A., Dodds, S., Jarvis, P., & Olusoga, Y. (2009). Perspectives on play: Learning for life. Essex, England: Pearson Education Limited.\r Conkbayir, M., Pascal, C. (2014). Early childhood \r theories and contemporary issues: An introduction. London, Great Britain: Bloomsbury.\r Cook, P. R. (Ed.) (2016). Guide to early childhood education: development-design-diversity. Newcastle upon Tyne, UK: Cambridge Scholars Publishing.\r Empson, J. M. (2015). Atypical child development in \r context (2nd ed). New York, NY: Palgrave Macmillan.\r Fields, M. V., Meritt, P. A., & Fields, D. M. (2014).\r  Constructive guidance and discipline: Birth to age eight (6th ed.). New York, NY: Pearson, Inc.\r Lesaux, N. K., & Jones, S. M. (Eds.) (2016). The leading edge of early childhood education: Linking science to policy for a new generation. Cambridge, MA: Harvard Education Press.\r McAfee, O., Leong, D. J., & Bodrova, E. (2016).\r Assessing and guiding young children’s development\r and learning (6th ed.). Upper Saddle River, NJ:\r  Pearson education Inc.\r McCartney, K., & Philips, D. (2006). Blackwell handbook of early childhood development. Oxford, UK: Blackwell Publishing.\r Moylett, H. (Ed.) (2014). Characteristics of effective \r early learning: Helping young children become learners for life. New York, NY: Open University Press.\r Roskos, K.A., & Christie, J. F. (2000). Play and literacy in early childhood: Research from multiple perspectives. Mahwah, NJ: Lawrence ErIbaum.\r Suggate, S.; & Reese, E. (Eds.) (2012). Contemporary debates in childhood education and development. New York, NY: Routledge.\r Waddell, A. T., & McBride, R. M. (Eds.) (2008). New research on early childhood education. New York, NY: Nova Science Publishers, Inc.\r  Related Online Journal:\r 1) Early Child Development & Care\r 2) Early Childhood Education Journal\r 3) Early Childhood Research Quarterly\r 4) Early Childhood Today\r 5) Infant Mental Health Journal\r 6) Journal of Basic Education\r 7) Journal of Early Childhood Literacy\r 8) Journal of Early Childhood Research\r 9) Teaching Young Children\r 10) Topics in Early Childhood Special Education\r 11) Young Children\r 12) 心理發展與教育\r 13) 心理學報\r 14) 心理科學\r 15) 心理與行為研究\r 16) 教育學報", "terms": {"2020-21 Term 2": {"--LEC (4801)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor SIU Fung Ying Angela"]}}}, "assessments": {"Essays": "40", "Presentation": "60"}}, {"code": "4530", "title": "Contemporary Issues in Early Childhood Education", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkDiscussionLecture", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course is to provide students with a venue to look into current issues and trends in early childhood education (ECE) in Hong Kong (HK). It focuses on the conceptual and methodological backgrounds of complex issues resulting from demands of the changing society on the education system in general and on ECE in particular. Topics may include (i) impact of the territory-wide education reforms and medium of instruction policies on local ECE; (ii) early literacy and bilingual education; (iii) interface between kindergarten and primary school; (iv) diverse ECE and care service and inclusive education for children; (v) quality criteria to evaluate services of ECE and care; (vi) impacts of media and IT on early childhood; (vii) impacts of advances in brain research on ECE and (viii) training and development of kindergarten teachers.", "outcome": "At the end of this course, students are expected to: \r 1. Appreciate how changes in the society as well as in our understandings of human development give rise to new interpretations of the recurring issues in ECE; 2. Understand how different perspectives on the issues have affected and shaped thoughts and practices in the local ECE context; and\r 3. Develop the sense and capacity to not only comprehend but also act on the issues.", "syllabus": "1. Children’s right in Hong Kong\r 2. Education and care services in Hong Kong\r 3. Professionalism in early childhood education\r 4. Curriculum reform in early childhood education\r 5. Free Quality Kindergarten Education Scheme\r 6. Children’s play in Hong Kong kindergartens\r 7. Early literacy in Hong Kong kindergartens\r 8. Learning diversities in kindergarten classrooms\r 9. Parental involvement in Hong Kong\r 10. Brain research on early childhood education\r 11. ICT in early childhood settings\r 12. Summary", "required_readings": "1. Fleer, M. (2017). Cultural-historical theories of child development. In S. Powell, & K. Smith (Eds.), An introduction to early childhood studies (4 ed., pp. 115-126). London: SAGE Publications Ltd.\r 2. Fleer, M. (2017). Digital Pedagogy: How Teachers Support Digital Play in the Early Years. In J. Bowen (Ed.), Digital technologies and learning in the early years (pp. 114-126). London: SAGE Publications Ltd.\r 3. Fleer, M. (2017). Play in the early years. (2nd ed.) Cambridge, United Kingdom: Cambridge University Press.\r 4. Rao, N., & Li, H. (2009). Quality Matters: Early Childhood Education Policy in Hong Kong. Early Child Development and Care, 179(3), 233–245.\r 5. Rao, N., Zhou, J., & Sun, J. (Eds.) (2017). Early childhood education in Chinese societies. Dordrecht, Netherlands: Springer.\r 6. Rushton, S. (2011). Neuroscience, Early Childhood Education and Play: We are Doing it Right! Early Childhood Education Journal, 39, 89-94.\r 7. Wong, J.M.S. & Rao, N. (2015). The evolution of early childhood education policy in Hong Kong. International Journal of Child Care and Education Policy, 9(3).\r 8. 課程發展議會（2017）。《幼稚園教育課程指引》。取自：\r https://www.edb.gov.hk/attachment/tc/curriculum-development/major-level-of-edu/preprimary/KGECG-TC-2017.pdf", "recommended_readings": "1. Apanel, D. (2013). Integrated education in contemporary Poland. Journal of the American Academy of Special Education Professionals, Spring/Summer, 58-68.\r 2. Bagnato, S. J., McLean, M., Macy, M., & Neisworth, J. T. (2011). Identifying instructional targets for early childhood via authentic assessment: Alignment of professional standards and practice-based evidence. Journal of Early Intervention, 33(4), 243-253.\r 3. Biddle, M. (2007). When opportunity knocks: Integrating language arts and the daily calendar. Reading Teacher, 60(5), 488-491.\r 4. Carroll, Wayne M. (1997). Technology and teachers’ curricular orientations. Education Horizons, 75(2), 66-72.\r 5. Chan, Y. M. E. (2004b). Legacy of British colonial early childhood education. Journal of Educational Change, 5(1), 79-89.\r 6. Cheung, D., & Ng, P. H. (2000). Science teachers' beliefs about curriculum design. Research in Science Education, 30(4), 357-375.\r 7. Colker, L. J. (2008). Twelve characteristics of effective early childhood teachers. Young Children, 63(2), 68-73.\r 8. Cukierkorn, J. R., Karnes, F. A., & Manning, S. J. (2007). Serving the preschool gifted child: “Programming and resources.” Roeper Review, 29(4), 271-276.\r 9. Cunningham, R., & others. (1992). Curriculum orientations of home economic teachers. (ERIC Document Reproduction Service No. CE 063 452)\r 10. Curriculum Development Council. (2006). Guide to the pre-primary curriculum. Hong Kong: Government Printer.\r 11. Curriculum Development Council. (2017). Guide to the kindergarten curriculum. http://www.edb.gov.hk/attachment/tc/curriculum-development/major-level-of-edu/preprimary/kgecg2017_c.pdf\r 12. Dennis, L. R., Rueter, J. A., & Simpson, C. G. (2013). Authentic assessment: Establishing a clear foundation for instructional practices. Preventing School Failure, 57(4), 189-195.\r 13. Diamond, A., & Whitington, V. (2015). Studying early brain development: Educators’ reports about their learning and its applications to early childhood policies and practices. Australasian Journal of Early Childhood, 40(3), 11-19.\r 14. Dockett, S., & Perry, B. (2001). Starting school: Effective transitions. (ERIC Document Reproduction Service No. PS 029 908)\r 15. Drake, S. (1998). Creating integrated curriculum: Proven ways to increase student learning. Thousand Oaks, California: Corwin Press, Inc. (LB1570 .D695 1998) (reserved)\r 16. Education and Manpower Bureau. (2007). Education Bureau Circular No. 1/2007: New initiatives in pre-primary education. Hong Kong: Education and Manpower Bureau.\r 17. Education and Manpower Bureau. (2016). Education Bureau Circular No. 7/2016: Free quality kindergarten education. Hong Kong: Education and Manpower Bureau.\r 18. Ennis, C. D., & Chen, A. (1993). Domain specifications and content representativeness of the revised value orientation inventory. Research Quarterly for Exercise and Sports, 64(4), 436-446.\r 19. Frey, N., & Fisher, D. (2010). Reading and the brain: What early childhood educators need to know. Early Childhood Education Journal, 38, 103-110.\r 20. Friedman, M. (1962). Capitalism and freedom. Chicago: University of Chicago Press.\r 21. Fung, C., & Lam, C. C. (2008). The Pre-primary Education Voucher Scheme of Hong Kong: A promise of quality education provision? Educational Journal, 36(1-2), 153-170.\r 22. Fung, C., & Lam, C. C. (2011). Empowering parents’ choice of schools: The rhetoric and reality of how Hong Kong kindergarten parents choose schools under the voucher scheme. Current Issue in Education, 14(1)1-46.\r 23. Giallo, R., Treyvaud, K., Matthews, J., & Kienhuis, M. (2010). Making the transition to primary school: An evaluation of a transition program for parents. Australian Journal of Educational and Developmental Psychology, 10, 1-17.\r 24. Huerta, M., & Jackson, J. (2010). Connecting literacy and science to increase achievement for English language learners. Early Childhood Education Journal, 38(3), 205-211.\r 25. Ishimine, K., & Tayler, C. (2014). Assessing quality in early childhood education and care. European Journal of Education, 49(2), 272-290.\r 26. Kaplan, S., & Hertzog, N. B. (2016). Pedagogy for early childhood gifted education. Gifted Child Today, 39(3), 134-139.\r 27. Loughran, S. (2005). Thematic teaching in action. Kappa Delta Pi Record, 41(3), 112-117.\r 28. Lam, M. S. (2014). Transition to early childhood education: parents’ use of coping strategies in dealing with children’s adjustment difficulties in Hong Kong. Australasian Journal of Early Childhood, 39(3), 111-120.\r 29. Lee, S., & Goh, G. (2012). Action research to address the transition from kindergarten to primary school: Children’s authentic learning, construction play, and pretend play. Early Childhood Research & Practice, 14(1), 1-16.\r 30. Li, H., & Fong, R. (2014). Implementing 15-year free education in Hong Kong: Dilemmas and practical solutions. Hong Kong Teachers’ Centre Journal, 13, 1-14.\r 31. Lundqvist, J., Mara, A. W., & Siljehag, E. (2015). Inclusive education, support provisions and early childhood educational pathways in the context of Sweden: A longitudinal study. International Journal of Special Education, 30(3), 3-16.\r 32. Magliaro, S. G., Lockee, B. B., & Burton, J. K. (2005). Direct instruction revisited: A key model for instructional technology. Educational Technology, Research and Development, 53(4), 41-55.\r 33. Opper, S. (1993). Kindergarten education: Cinderella of the Hong Kong education system. In A. B. M. Tsui & I. Johnson (Eds.), Education Paper 18: Teacher education and development (pp. 80-89). Hong Kong: Faculty of Education, The University of Hong Kong.\r 34. Pardhan, A. (2101). Pakistani teachers’ perceptions of kindergarten children’s learning: An exploration of understanding and practice. Frontiers of Education in China, 7(1), 33-64.\r 35. Pearson, E., & Rao, N. (2006). Early childhood education policy reform in Hong Kong: Challenges in effecting change in practices. Childhood Education, 82(6), 363-368.\r 36. Rondone, A. (2014). Student centered curriculum: Elementary school. (ERIC Document Reproduction Service No. CE 546 447)\r 37. Rushton, S., & Larkin, E. (2001). Shaping the learning environment: Connecting developmentally appropriate practices to brain research. Early Childhood Education Journal, 29(1), 25-33.\r 38. Salami, I. A. (2014). Inclusive early childhood education in Nigeria: The journey so far. Journal of the International Association of Special Education, 15(2), 118-126.\r 39. Schildkamp, K. Vanhoof, J., van Petegem, P., & Visscher, A. (2012). The use of school self-evaluation results in the Netherlands and Flanders. British Educational Research Journal, 38(1), 125-152.\r 40. Schiro, M. (1992). Educator’s perceptions of the changes in the curriculum belief system over time. Journal of Curriculum and Supervision, 7(3), 250-286.\r 41. Thao, D. P., & Boyd, W. A. (2014). Renovating early childhood education pedagogy: A case study in Vietnam. International Journal of Early Years Education, 22(2), 184-196.\r 42. Toren, Z., Maiselman, D., & Inbar, S. (2008). Curriculum integration: Art, literature and technology in pre-service kindergarten teacher training. Early Childhood Education Journal, 35(4), 327-333.\r 43. Vanhoof, J., & van Petegem, P. (2012). The process and results of school self-evaluation through the eyes of experts: A Delphi study. International Studies in Educational Administration, 40(1), 47-61.\r 44. Wasserman, L. H. (2007). The correlation between brain development, language acquisition, and cognition. Early Childhood Education Journal, 34(6), 415-418.\r 45. Wheeler, C., & Blank, J. (2011). Studying strawberry farm: Investigation and representation in a standards-based kindergarten. Early Childhood Research and Practice, 13(2), 1-25.\r 46. Wong, N. C. M., & Rao, N. (1999). Preschool education. In M. Bray & R. Koo (Eds.), Comparative perspectives on continuity and change (pp. 15-34). Hong Kong: Faculty of Education, The University of Hong Kong.\r 47. Zhbanova, K. S., Rule, A. C., & Montgomery, S. E. (2010). Defining the difference: Comparing integrated and traditional single-subject lessons. Early Childhood Education Journal, 38(4), 251-258.\r 48. 林智中、張爽（2004）。課程統整效能的研究：批判性的文獻回顧。香港：香港中文大學教育學院：香港中 文大學香港教育硏究所。(LB2806.15 .Z55 2004) (reserved)\r 49. 馮潔皓 (2014)。二十一世紀的香港幼兒教育課程改革：回顧與前瞻。《教育學報》，第七卷，第 2期，頁 95-112。", "terms": {"2020-21 Term 1": {"--LEC (4915)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Esther Lee Bldg 308"], "instructors": ["Professor LEUNG Kit Ying Suzannie"]}}}, "assessments": {"Discussion": "20", "Essays": "50", "Presentation": "30"}}, {"code": "4540", "title": "Research Project", "career": "Undergraduate", "units": "4.00", "grading": "Graded", "components": "Independent StudyProject", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "Students will work individually to pursue independent study on approved topics and areas under the supervision of teachers appointed by the Department/Faculty of Education.- coverage of the literature review leading to the research question(s)- description of how the research was done- quality of the discussion based on the findings- proper citation of references used- organization and clarity of the whole research paper- length (excluding references) within the specified limits\r", "outcome": "Upon completion of this course, students will have a hand-on experience of the process in conducting an educational research and be able to:\r 1. conduct literature review, formulate a research question, design a suitable research, collect and analyze data, summarize key research findings and discuss them cohesively, and\r 2. acquire an in-depth understanding in a selected issue on early childhood education which is significant to child development and learning.\r (Individual course teachers may update the learning outcomes as and whenever necessary)", "syllabus": "Students are expected to identify an area for research and to conceptualize a research study based on the review of literature in the selected area. Students can utilize a range of research methodologies and designs to address their research questions. The basic requirements of this project are listed below:\r 1. The research topic has to be approved by the faculty supervisor.\r 2. The research study has to be based on a body of previous and current theories and/or research literature. The research question(s) should be specified clearly.\r 3. The research report should be written in a scholarly manner, and its quality should match those that are required for individual research work for an undergraduate degree.", "required_readings": "(to be provided by teacher concerned)", "recommended_readings": "Recommended readings Aubry, C. (2000). Early childhood education research: issues in methodology and ethics.\r London: Routledge.\r Babione, C. (2015). Practitioner teacher inquiry and research. San Francisco, CA: Jossey- Bass.\r Burton, N., Brundrett, M., & Jones, M. (2014). Doing your education research project. (2nd ed.). Los Angeles, CA: SAGE.\r Castle, K. (2012). Early childhood teacher research: from question to results. New York, NY: Routledge.\r Frankel, J. R. (2015). How to design and evaluate research in education (9th edition).\r Boston, MA: McGraw-Hill.\r Goodwin, W., & Goodwin, L. D. (1996) Understanding quantitative and qualitative research in early childhood education. New York: Teacher College Press.\r McBride, B. A., & Barbour, N. E. (Eds.) (2003) Bridging the gap between theory, research and practice: the role of child developmental programs in early childhood education. London: JAI.\r Mertler, G. A., & Charles, C. (2005) Introduction to educational research (5th edition).\r Boston, Allyn & Bacon.\r Muijs, D. (2011). Doing quantitative research in education with SPSS (2nd ed.). London; Thousand Oaks: Sage Publications.\r Mukherji, P., & Albon, D. (2010). Research methods in early childhood: an introduction. Los Angeles: London: SAGE.\r Naughton, G. M., Rolfe, S. A., & Siraj-Blatchford, I. (Eds.) (2001). Doing early childhood research: International perspectives on theory and practice. Buckingham, UK: Open University Press.\r Opie, C., & Sikes, P. (2004). Doing educational research: a guide to first-time researchers.\r Thousand Oaks. CA: Sage.\r Roberts-Holmes, G. (2014). Doing your early years research project: a step-by-step guide.\r (3rd ed.). Los Angeles, London: New Delhi, Singapore: Washington, DC: SAGE.\r Saracho, O. (2015). Handbook of research methods in early childhood education and research methodologies. New York, NY: Routeledge.\r Smallbone, T., & Quinton, S. (2011). A three-stage framework for teaching literature reviews: A new approach. International Journal of Management Education, 9, 1-11.\r Walker, R. & Solvason, C. (2014). Success with your early years research project. London: SAGE.\r 王文宇 (2011)。《研究方法入門教程》。北京：高等教育出版社。\r 石中英 (譯) (2011)。《教育研究方法》。重慶： 西南師範大學出版社。 卓挺業 (2012)。《教育科学研究方法》。中國：南海出版。\r 郭生玉 (2014)。《心理與教育研究法 : 量化、質性與混合研究方法》。新北市: 精華總 經銷。\r 陳向明 （2002）。《質的硏究方法與社會科學硏究》。 北京：敎育科學出版社。 張德銳等（2000）。《教學行動研究：實務手冊與理論介紹》。台北：高等教育文化\r 事業有限公司。 ", "terms": {"2020-21 Term 2": {"-J01-PRJ (7577)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Dr. CHAN To, \n\rProfessor LEUNG Kit Ying Suzannie, \n\rProfessor SIU Fung Ying Angela"]}}}, "assessments": {"Others": "30", "Presentation": "20", "Report": "50"}}, {"code": "4550", "title": "Internship", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "OthersPracticumProjectInteractive Tutorial", "campus": "Main Campus", "academic_group": "BA(ECE) Pgm Comm", "requirements": "", "description": "This course provides opportunities for students to put knowledge and skills they learned from the program into practice via engaging in a real-life experience in the child care related/ education sector. Examples of activities for this internship include: working with individual children to facilitate their cognitive and social-emotional development, conducting programs relating to parent education, assisting in research projects, assisting in the promotion of activities in relation to children’s physical and mental health. Students will be evaluated based upon a collection of reflection papers, a group presentation and an evaluation from the on-site supervisor/course coordinator.- Evaluation from on-site supervisor/course instructor according to the criteria agreed upon (at the site visit) as well as those listed in the internship appraisal form.These include but not limited to: responsibility, work attitude, preparation for the assigned tasks, and interaction with the target group(s)- Content of the sharing in addressing professional growth and ECE-related issues in the group presentation- Organization, clarify and level of reflection in the internship report\r", "outcome": "After taking this course, students will be able to –\r i. apply knowledge and skills in child development to practical situation of the early childhood sector; ii. effectively perform duties at the internship site in a professional manner; iii. develop effective communication and problem solving skills for personal and career development; iv. reflect on personal and professional development based on the learning experience; and\r v. identify their interests in future career pursuit.", "syllabus": "Students are expected to complete an internship of around 40 hours. The placement site is arranged based on students’ preference/interests/abilities and is upon mutual agreement. As the vacancy in each site varies, it is not guaranteed that students will be allocated to their first preference. \r  Given the nature of the serving population, the number of hours per session varies. It can be ranged from 1 hour to full-day (6 hours) per visit. This internship is organized during periods when students have no institutional commitment. Special arrangement of placement period could be accepted with prior application and approval with internship course instructor. \r  Students are not allowed to take leave during the internship period once the placement and details are confirmed. In case of medical issues or any unforeseen situation, the student is expected to discuss the make-up arrangement with the course instructor at the soonest possible time.", "required_readings": "(to be provided by the teacher concerned)", "recommended_readings": "Curriculum Development Council (2017). Guide to the Pre-primary Curriculum. Hong Kong: Hong Kong Government Printer.\r  Education Department & Social Welfare Department (2001). Performance Indicators\r   (Pre-primary Institutions): Domain on Learning and Teaching. Hong Kong: Hong Kong Government Printer.\r  Education Department & Social Welfare Department (2002). Performance Indicators\r (Pre-primary Institutions): Domain on Support to Children and School Culture. Hong Kong: Hong Kong Government Printer.\r  Education Department & Social Welfare Department (2002). Performance Indicators (Pre-primary Institutions): Domain on Management and Organization. Hong Kong: Hong Kong Government Printer.\r  Education Department & Social Welfare Department. (2003). Performance indicators\r (Pre-primary institutions): Domain on children’s development (2nd ed.). Hong Kong: Hong Kong Government Printer.\r  Frederick, H., & King, M. (2014). The successful internship: personal, professional, and civic development in experiential learning. (4th ed.). Belmont, CA: Brooks/Cole.\r  Kiser, P.M. (2008). The human services internship: getting the most from your experience.\r (2nd ed.). Belmont, CA: Thomson/Brooks/Cole.\r  Social Welfare Department (2013). Family and Child Protective Services.\r  Other references will be provided based on the characteristics of the serving targets.", "terms": {"2020-21 Term 1": {"-P01-PRA (5553)": {"startTimes": ["13:30"], "endTimes": ["16:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor SIU Fung Ying Angela"]}}}, "assessments": {"Essays": "40", "Homework or assignment": "10", "Presentation": "30", "Participation": "20"}}]