[{"code": "1000", "title": "Introduction to Chinese Studies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course is an introduction to major themes in Chinese Studies that explores key questions, problems and approaches to the study of China and the Chinese world. Lectures and tutorial discussions are designed to inspire grappling with major issues, reflecting on one’s relation to what is studied, and an opening of the mind to the wide scope of possibilities inherent to this interdisciplinary major.", "outcome": "Students will have: \r • grasped the major themes, key questions, problems and approaches to Chinese Studies.\r • learned to productively debate and grapple seriously with a series of major issues in the field. \r • gained a deeper and broader understanding of what they are studying in this field and why and how to articulate their views on this in oral and written presentations.", "syllabus": "1. What is China? What is Chinese? \r 2. China in Historical Context \r 3. China as Text and Context\r 4. Being Chinese in the past and present\r 5. China in the World \r 6. Greater China and its Contemporary Representations \r 7. State and Economy in Contemporary China \r 8. Culture and Commerce in China \r 9. Challenges for China Today and in the Future\r 10. Frontiers, Margins and Grassroots China \r 11. The Sinophone and Sinocentric frameworks \r 12. Research Agendas and Career Plans and China", "required_readings": "Wm. Theodore de Bary, Sources of Chinese Tradition I & II\r  John Lagerwey, China, A Religious State\r  Wang Gung-wu, Renewal: The Chinese State and the New Global History\r  David Faure, China and Capitalism", "recommended_readings": "None", "terms": {"2020-21 Term 1": {"--LEC (6773)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor GAO Yunwen, \n\rProfessor Jan Francis KIELY, \n\rProfessor LI Chen, \n\rProfessor LING Minhua"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "20", "Presentation": "20", "Short answer test or exam": "20", "Selected response test or exam": "20"}}, {"code": "1001", "title": "Chinese Languages, Past and Present – Sound and Script", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This is an interactive course introducing the cultural history and linguistic analysis of Chinese languages. The course prepares students with a sense of the historical development of sound and scripts of Chinese, and basic knowledge about syntax, and phonetics to facilitate language learning. Topics covered in the class include: 1) historical background of the Chinese languages; 2) Dialects, Topolects, Minority Languages, and the National language; 3) historical development of Chinese characters and writing system; 4) basic Chinese syntax and phonetics. This is not a language skills course: Students will not be tested on their ability to use Mandarin.", "outcome": "1. Demonstrate a basic familiarity with classical and modern Chinese languages, and Chinese linguistics;  2. Understand the cultural and historical development of the Chinese languages;  3. Develop reading, writing, and presentation skills in a professional manner.", "syllabus": "1. Course Overview\r 2. History of the Chinese language I: Early History\r 3. History of the Chinese language II: Early Modern to Modern\r 4. History of the Chinese language III: Language Reform\r 5. Dialects and Topolects\r 6. Minority Languages in China\r 7. Promoting Putonghua in Contemporary China\r 8. The History of Chinese Script\r 9. Sinoscript beyond China\r 10. Chinese Syntax\r 11. Chinese Phonetics\r 12. Review Session", "required_readings": "1. Sun, Chaofen. Chinese: A Linguistic Introduction. Cambridge: Cambridge University Press, 2006. (abbreviated as Chinese)\r 2. Zhou, Minglang. Ed. Language Policy in the People’s Republic of China: Theory and Practice Since 1949. New York: Kluwer Academic Publishers, 2004. (abbreviated as Language Policy)\r 3. Rohsenow, John S. “Fifty Years of Script and Written Language Reform in the PRC: The Genesis of the Language Law of 2001” in Language Policy, 21-44.\r 4. Guo, Longsheng, “The Relationship between Putonghua and Chinese Dialects” in Language Policy, 45-54.\r 5. Zhou, Minglang. “Minority Language Policy in China: Equality in Theory and Inequality in Practice” in Language Policy, 71-96.\r 6. Ng, Kim Chew. “Inscribed Backs” in Slow Boat to China, 237-276.", "recommended_readings": "1. Tsu, Jing. Sound and Script in Chinese Diaspora. Cambridge: Harvard University Press, 2010.\r 2. Bachner, Andrea. Beyond Sinology: Chinese Writing and the Scripts of Culture. New York: Columbia University Press, 2014.", "terms": {"2020-21 Term 1": {"--LEC (6420)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor GAO Yunwen"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "50", "Others": "15", "Presentation": "15"}}, {"code": "1002", "title": "Chinese Languages, Past and Present – Text and Translation", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This is an introductory course to the history, theory, and practices of translation in China. The course prepares beginners of Chinese language with a sense of the historical development of translation theory and practices in China. Topics covered in the class include: 1) history of translation in China; 2) Chinese translation theories; 3) case study of important texts translated into Chinese from other languages; 4) case study of important texts translated from Chinese into other languages. This is not a translation skills course: students will not be tested on their ability to translate.", "outcome": "1. Demonstrate a basic familiarity with translation theory;  2. Understand the cultural and historical development of the translation in China;  3. Develop reading, writing, and presentation skills in a professional manner.", "syllabus": "1. Course Overview and the Task of a Translator\r 2. Historical Background\r 3. Translation and Trade in the Sixth Century\r 4. Translation and Religion in Tang China\r 5. Traditional Theories of Translation\r 6. Modern and Contemporary Theories of Translation\r 7. Theoretical Debate: Yan Fu\r 8. Theoretical Debate: Lu Xun\r 9. Theoretical Debate: on Poetry\r 10. Case I: Lin Shu\r 11. Case II: The Story of the Stone\r 12. Case III: Harry Potter", "required_readings": "1. Leo Tak-hung. Twentieth-Century Chinese Translation Theory: Modes, Issues and Debates. Amsterdam/Philadelphia: John Benjamins Publishing Company, 2004. (abbreviated as Theory) \r 2. Benjamin, Walter. “The Task of the Translator” in Illuminations, trans. Harry Zohn.\r 3. Chen, Weihong and Xiaojuan Cheng. “A Preliminary Probe into Lin Shu’s Creative Translation.” Journal of Language Teaching and Research. Vol. 6, No. 2 (March 2015): 416-422.\r 4. Suo, Xuxiang, “A Comparative Analysis of Two English Versions of Some Poems in A Dream of Red Mansions” Theory and Practice in Language Studies, Vol. 5, No. 6 (June 2015): 1179-1184.\r 5. Kung, Szu-Wen. “A sociological turn to research of Chinese translation practice: with reference to the translation production of Harry Potter” in The Routledge Handbook of Chinese Translation.\r 6. “Bridging Language Barriers in Encounters with China in Sixth-century Asia” in Interpreters, 21-42.", "recommended_readings": "1. Chan, Sin-wai, David E. Pollard. eds. An Encyclopaedia of Translation: Chinese-English, English-Chinese. Hong Kong: The Chinese University of Hong Kong Press, 1995.\r 2. Lung, Rachel. Interpreters in Early Imperial China. Amsterdam/Philadelphia: John Benjamins Publishing Company, 2011.", "terms": {"2020-21 Term 2": {"--LEC (6397)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor GAO Yunwen"]}}}, "assessments": {"Essays": "30", "Essay test or exam": "35", "Others": "15", "Presentation": "20"}}, {"code": "1100", "title": "Unofficial China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkLecture", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This English-taught, introductory course offers a survey of the Chinese culture and society as experienced at the grassroots level. The course moves beyond official accounts by exploring everyday practices and their underlying logic and meanings in China across time and space. Students will be guided to engage with both textual and non-textual materials produced by Chinese individuals and groups and form critical understanding of Chinese social norms and cultural patterns. This course adopts an interdisciplinary approach to introduce students to analytical writing from history, anthropology, literature, sociology, and political science, along with primary sources, so that they learn to think perceptively about China.", "outcome": "1. Recognize, recall and tell social institutions and cultural patterns key to Chinese societies2. Think perceptively about the multiplicities of Chinese culture and society and their lived experiences at the grassroots level3. Comprehend and contextualize some primary sources (including visual and audio-visual materials) to make informed analysis  4. Develop appreciation of the interdisciplinary approach to understand a culture and society5. Develop skills in English essay writing", "syllabus": "1. Introduction: China beyond official accounts2. Family and Kinship3. Lineage4. Religions and Rituals5. Markets and Merchants6. State and Society7. Riots and Revolutions8. Childrearing and Class9. Migration and Work 10. Desire and Disability11. Language and Identity12. China 2.0", "required_readings": "Updated reading list will be announced in class.1. Introduction: China beyond official accountsLink, E. Perry, Richard Madsen, and Paul Pickowicz, eds. 1989. Introduction of Unofficial China: Popular Culture and Thought in the People's Republic. Boulder: Westview Press.2. Family and KinshipCao, Xueqin. Excerpt from The Dream of Red Chamber.  Ebrey, Patricia B., and James L. Watson. 1986. \"Introduction.\" In Kinship Organization in Late Imperial China, 1000-1940, edited by Patricia B. Ebrey and James L. Watson, 1-15. Berkeley: University of California Press.3. LineageFamily genealogy (jiapu) examples.Faure, David. 2007. Excerpt from Emperor and Ancestor: State and Lineage in South China. Stanford, California: Stanford University Press.4. Religions and RitualsShort clips of death rituals in different parts of China.Wolf, Arthur P. 1974. \"Gods, Ghosts, and Ancestors.\" In Religion and Ritual in Chinese Society, edited by Arthur P. Wolf, 131-182. Stanford, CA: Stanford University Press.5. State and SocietyExcerpts from Zhou, Hao. 2006. Senior year. (Documentary)Elman, Benjamin A. 1991. \"Political, Social, and Cultural Reproduction via Civil Service Examinations in Late Imperial China.\" The Journal of Asian Studies no. 50 (1):7-28.6. Markets and MerchantsSkinner, G. William. 2017. Fieldnote on marketing from Rural China on the Eve of Revolution. Seattle; London: University of Washington Press.Lim, Jason. 2010. Selection from Linking an Asian Transregional Commerce in Tea: Overseas Chinese Merchants in the Fujian-Singapore Trade, 1920-1960. Leiden; Boston: Brill.7. Riots and RevolutionsCUHK Online Exhibition “The Cultural Revolution in Images: Caricature-Posters from Guangzhou 1966-1977”Laura, Pozzi. 2018. \"The Cultural Revolution in Images: Caricature Posters from Guangzhou, 1966–1977.\" Cross-Currents: East Asian History and Culture Review (27):187-207.8. Childrearing and ClassTexts from online childrearing manuals and discussion forumWoronov, T. E. 2007. \"Chinese Children, American Education: Gloablizing Child Rearing in Contemporary China.\" In Generations and Globalization: Youth, Age, and the Family in the New World Economy, edited by Jennifer Cole and Deborah Durham, 29-51. Bloomington and Indianapolis: Indiana University Press.9. Migration and Work Wu, Feiyue, and Feiyu Qin. 2014. The Verse of Us (Documentary).Pun, Ngai, and Jenny Chan. 2012. \"Global Capital, the State, and Chinese Workers: The Foxconn Experience.\" Modern China 38 (4):383-410. 10. Desire and DisabilityFan, Jian. 2017. Still Tomorrow. (Documentary)Yu, Xiuhua. 2015. Yaoyao huanghuang de renjian: A Collection of Yu Xiuhua’s Poems. Xinbei, Taiwan: INK.11. Language and Identity Jia, Zhangke. 2006. Excerpt from Still Life. (Film)Gunn, Edward M. 2006. Selection from Rendering the Regional: Local Language in Contemporary Chinese media. Honolulu: University of Hawai'i Press.12. China 2.0Jian, Yi. 2006. Super, Girls! (Documentary)Yang, Ling. 2009. \"All for love: The Corn fandom, prosumers, and the Chinese way of creating a superstar.\" International Journal of Cultural Studies 12 (5):527-543.", "recommended_readings": "An updated reading list will be distributed in class.", "terms": {"2020-21 Term 1": {"--LEC (5800)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor LING Minhua"]}, "-C01-CLW (5801)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor LING Minhua"]}}}, "assessments": {"Essay test or exam": "30", "Others": "20", "Presentation": "10", "Selected response test or exam": "40"}}, {"code": "2001", "title": "Modern Chinese History", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "The rapid transformation that China is experiencing today cannot be understood without considering the wider context of change in modern Chinese history. How have the Chinese searched for modernity in the recent past? How have changes been experienced by the Chinese people? In this course we shall explore the political, social and cultural revolutions that have shaped Chinese history since late imperial times. The emphasis of this course will be on analysis of primary sources in translation and discussion of these texts within the context of historical narrative.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2002", "title": "Chinese Culture and Society in Transformation", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This English-taught, introductory course provides a survey of Chinese culture and society. It focuses on basic social institutions and cultural norms in traditional Chinese society and their modern transformations. The readings, drawn mainly from the disciplines of history and anthropology, cover topics of family, kinship, marriage, popular religions, ethnicity, community institutions, imperial state power, and rural and urban political economies. The course draws particular attention to China’s constant modernizing efforts in the past century, especially during the socialist revolution and post-Mao reforms, as well as their bearings upon contemporary Chinese social practices and cultural patterns.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2003", "title": "China’s Political Economy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course offers an overview of the Chinese political economy. Since the policies of reform and opening up were initiated in 1978, China has been transformed from a command economy to a market-oriented system and achieved over three decades of rapid growth. This course will address both the historical processes of institutional reform and major economic issues in contemporary China. It aims to provide a roadmap for the students to have a critical view of China’s growth model and obtain an informed perspective on the challenges that the Chinese economy faces now.", "outcome": "By the end of the semester, students should: \r • understand the historical processes and features of the Chinese economic development and reforms since the 1950s;  • be familiar with the institutional framework that governs China’s economic development and transition. \r • be able to critically analyse the major economic problems in contemporary China", "syllabus": "1. Course introduction and overview\r 2. The Chinese political economy before 1949\r 3. Big bush industrialization and the command economy\r 4. Market-oriented transition\r 5. Agriculture and rural organizations\r 6. Rural industrialization: town and village enterprises\r 7. State-owned enterprise reform\r 8. Fiscal system\r 9. Banking system\r 10. Capital market\r 11. Trade and investment\r 12. China’s changing growth model", "required_readings": "Naughton, Barry (2018). The Chinese Economy: Adaptation and Growth, Cambridge: The MIT Press, Chapter 2-3, p.21-64\r  Naughton, Barry (2018). The Chinese Economy: Adaptation and Growth, Cambridge: The MIT Press, Chapter 4-5, p.65-126\r  Naughton, Barry (2018). The Chinese Economy: Adaptation and Growth, Cambridge: The MIT Press, Chapter 11-13, p.259-330\r  Naughton, Barry (2018). The Chinese Economy: Adaptation and Growth, Cambridge: The MIT Press, Chapter 14, p.333-362\r  Naughton, Barry (2018). The Chinese Economy: Adaptation and Growth, Cambridge: The MIT Press, Chapter 16, p.397-422\r  Naughton, Barry (2018). The Chinese Economy: Adaptation and Growth, Cambridge: The MIT Press, Chapter 17, p.423-450\r  Naughton, Barry (2018). The Chinese Economy: Adaptation and Growth, Cambridge: The MIT Press, Chapter 19, p.479-512\r  Naughton, Barry (2018). The Chinese Economy: Adaptation and Growth, Cambridge: The MIT Press, Chapter 20, p.513-540", "recommended_readings": "Naughton, Barry (2018). The Chinese Economy: Adaptation and Growth, Cambridge: The MIT Press, Chapter 8-10, p.185-256\r  Naughton, Barry (2018). The Chinese Economy: Adaptation and Growth, Cambridge: The MIT Press, Chapter 15, p.363-394\r  Naughton, Barry (2018). The Chinese Economy: Adaptation and Growth, Cambridge: The MIT Press, Chapter 18, p.453-478\r  Naughton, Barry (2018). The Chinese Economy: Adaptation and Growth, Cambridge: The MIT Press, Chapter 21, p.543-570", "terms": {"2020-21 Term 2": {"--LEC (8980)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor LI Chen"]}}}, "assessments": {"Essays": "30", "Essay test or exam": "30", "Others": "10", "Presentation": "30"}}, {"code": "2004", "title": "Chinese Literature in Translation", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course introduces the classical Chinese literary tradition in translation by focusing on genres including fiction, poetry, essays, and biographies in relation to three major themes and traditions: 1) the fantastic, the immortal, and the ghostly; 2) the moral, the loyal, and the outlaws; and 3) the romantic, the scholar, and the beauty. Through these themes and traditions, we analyze key issues regarding the formation of literary canon in China and how Han Chinese literati define the relationship between the Han and the non-Han, male and female, lawful subjects and outlaws in the process of literary canonization.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2100", "title": "The Cultural Revolution", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "The Chinese Cultural Revolution (1966-1976) has long been considered a watershed in Chinese history. Launched by Mao Zedong in 1966, it was a political movement that was simultaneously an attack on political enemies that Mao believed to be subverting the revolution and a call on China’s young people to make revolution. The Cultural Revolution continued until Mao’s death in 1976 and permeated all aspects of politics, society and culture. Following the recent treatment of the Cultural Revolution “as history,” this course will use primary and secondary sources to explore the many dimensions and legacies of this tumultuous period.", "outcome": "Students will: \r • come to understand the major causes, figures, events, and consequences of the CR.\r • have reflected on the Cultural Revolution experience for China as a part of its history.\r • will learn to analyse some primary source visual and written documents.", "syllabus": "1. Mao, China and the Chinese Revolution \r 2.The origins of the CR, 1956-1965\r 3. The Launching of the CR, 1966. \r 4. Power Seizures and the rise of the Radicals, 1967 \r 5. Chaos and Military Control \r 6. Sent Down Youth and Rural China \r 7. The Cultural Revolution at the Margins \r 8. Cultural Revolution Culture \r 9. Cultural Revolution China’s Place in the World \r 10. Cultural Revolution at the Margins \r 11. The End of Revolution? \r 12. CR Legacies", "required_readings": "Yang Rae, Spider Eaters: A Memoir, Berkeley, University of California Press, 1998. \r  Yan Jiaqi and Gao Gao, Turbulent Decade: A History of the Cultural Revolution, Honolulu, University of Hawaii Press, 1996. \r  Yiching Wu, The Cultural Revolution at the Margins: Chinese Socialism in Crisis, Cambridge, Harvard University Press, 2014. \r  Su Yang, Collective Killings in Rural China during the Cultural Revolution, Cambridge, Cambridge University Press, 2011. \r  Michael Schoenhals, The Cultural Revolution: Not a Dinner Party, Armonk, NY, M.E. Sharpe, 1996. \r  Barbara Mittler, A Continuous Revolution: Making Sense of Cultural Revolution Culture, Cambridge, Harvard University Press, 2013. \r  Simon Leys, The Chairman’s New Clothes; Mao and the Cultural Revolution, London, Allison and Busby, 1981. \r  Feng Jicai, Ten years of Madness: Oral Histories of the Cultural Revolution, San Francisco, China Books and Periodicals, 1996.", "recommended_readings": "Roderick MacFarquhar and Michael Schoenhals, Mao’s Last Revolution, Cambridge, Harvard University Press, 2006. \r  Alexander Cook, China’s Cultural Revolution on Trial, Cambridge, Cambridge University Press, 2016. \r  Michel Bonnin, The Lost Generation: The Rustification of China’s Educated Youth, Hong Kong, Chinese University Press, 2013.", "terms": {"2020-21 Term 2": {"--LEC (8816)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor Michel Paul Emile BONNIN"]}}}, "assessments": {"Essays": "10", "Essay test or exam": "30", "Presentation": "20", "Short answer test or exam": "20", "Selected response test or exam": "20"}}, {"code": "2101", "title": "Chinese Family and Marriage", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course examines recent transformations in Chinese family and marriage, covering issues of family structures, marriage patterns, reproduction and childrearing, sexuality and gender relations in Greater China. After an introductory discussion of key concepts and debates on Chinese family and marriage, it will move on to specific ethnographic case studies to highlight the connections between everyday practices and large-scale political and socioeconomic processes. Readings, drawn from anthropology, history, and sociology, examine the Chinese (Han and non-Han) family systems, marriage patterns and gender relations as well as their transformations during the Maoist and post-Mao eras.", "outcome": "By the end of the semester, students should:\r - be familiar with key concepts and social theories about family and marriage\r - grasp main issues of family and marriage in the Chinese context \r - improve analytical writing in English both individually and collaboratively\r - develop oral skills to present coherent and succinct analysis", "syllabus": "1. Introduction: Chinese Family in Transformation\r 2. Kinship and Lineage\r 3. Marriage, Family, and Gender I\r 4. Marriage, Family, and Gender II\r 5. Marriage, Family, and Gender III\r 6. Reproduction and Childrearing\r 7. Family and Marriage among Non-Han Groups\r 8. Love and Sexuality\r 9. Contemporary challenges I: Doing Family\r 10. Contemporary challenges II: Parenting\r 11. Contemporary challenges III: Property\r 12. Contemporary challenges IV: “Left-over Women”", "required_readings": "Introduction: Chinese Family in Transformation\r • Harrell, Stevan, and Goncalo Santos. 2017. \"Introduction.\" In Transforming Patriarchy. Chinese Families in the 21st Century, edited by Goncalo Santos and Stevan Harrell. Seattle: University of Washington Press, pp. 3-36.\r  Kinship and Lineage\r • Ebrey, P. B. and J. L. Watson, 1986. Selections in Kinship Organization in Late Imperial China, 1000-1940. Berkeley: University of California Press.\r  Marriage, Family, and Gender \r • Watson, Rubie S. 1991. “Wives, Concubines, and Maids: Servitude and Kinship in the Hong Kong Region, 1900-1940.” In Marriage and Inequality in Chinese Society, edited by Rubie S. Watson and Patricia B. Ebrey, 231-255. Berkeley: University of California Press.\r  Reproduction and Childrearing\r • Lan, Pei-Chia. 2014. \"Compressed modernity and Glocal Entanglement: The Contested Transformation of Parenting Discourses in Postwar Taiwan.\" Current Sociology Monograph (2):1-19.\r  Family and Marriage among Non-Han Groups\r • Du, Shanshan. 2000. \"'Husband and Wife Do It Together': Sex/Gender Allocation of Labor among the Qhawqhat Lahu of Lancang, China.\" American Anthropologist 102(3): 520.\r  Love and Sexuality\r • Friedman, Sara. L. 2000. \"Spoken Pleasures and Dangerous Desires: Sexuality, Marriage, and the State in Rural Southeastern China.\" East Asia: An International Quarterly 18(4): 13-39.\r  Contemporary Challenges \r • Choi, Susanne. Y. P. and Ming Luo. 2016. \"Performative Family: Homosexuality, Marriage and Intergenerational Dynamics in China.\" The British Journal of Sociology 67(2): 260-280.\r • Davis, Deborah S. 2010. \"Who Gets the House? Renegotiating Property Rights in Post-Socialist Urban China.\" Modern China 36 (5):463-492.", "recommended_readings": "• Bossen, Laurel. 2002. Chinese Women and Rural Development: Sixty Years of Change in Lu Village, Yunnan. Lanham, Md., Rowman & Littlefield Publishers.\r • Davis, Deborah. S. and Sarah Friedman, eds. Wives, Husbands, and Lovers: Marriage and Sexuality in Hong Kong, Taiwan, and Urban China. Stanford, CA, Stanford University Press.", "terms": {"2020-21 Term 2": {"--LEC (7880)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor TAM Siu Mi Maria"]}}}, "assessments": {"Essays": "15", "Essay test or exam": "35", "Others": "25", "Presentation": "25"}}, {"code": "2102", "title": "China’s Business Environment in Historical Perspective", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "China’s transition from a centrally planned company to a more market-oriented system has been a remarkable process of reform and opening up. Business in China has been accordingly transformed. This course discusses the evolution of business sector development in contemporary China during the recent decades. Using economic reforms as the overall framework, it combines institutional analyses with business histories and company-level case studies.", "outcome": "By the end of the semester, students should:\r • gain a better understanding of the overall structure and evolutionary trends of China’s business environment and reforms.\r • be familiar with the institutional arrangements underlying China’s business systems.\r • be able to critically evaluate the challenges and opportunities facing China’s business systems.", "syllabus": "Course introduction and overview\r  Week 1-3 Economic reform and the development of a corporate sector \r  Week 4-6 From state-owned enterprises to state-controlled corporations \r  Week 7-9 Banking\r  Week 10-12 Capital markets\r  Week 13 Government, business environment and the changing economic trends", "required_readings": "Wu, Jinglian (2005) Understanding and Interpreting Chinese Economic Reform, Singapore: Thomson \r  Walter, C. E. and Howie, F.J.T. (2011) Red Capitalism: the Fragile Financial Foundation of China’s Extraordinary Rise, Singapore: John Wiley & Sons. \r  Allen, F., Qian, Ju and Qian, Meijun (2008) “China’s financial system: past, present and future” in. Brandt and T. Rawski (ed.), China’s Economic Transition: Origins, Mechanism, and Consequences, Cambridge: Cambridge University Press \r  Nolan, P. (2013) Is China Buying the World? Cambridge: Polity Press. \r  Steinfeld, E. (2010) Playing Our Game: Why China’s Economic Rise Doesn’t Threaten the West, Oxford: Oxford University Press. \r  Lardy, N. (2012) Sustaining China's Economic Growth after the Global Financial Crisis, Peterson Institute", "recommended_readings": "Huang, Yasheng (2008) Capitalism with Chinese Characteristics: Entrepreneurship and the State, Cambridge: Cambridge University Press \r  Nolan, P. (2001) China and the Global Economy: National Champions, Industrial Policy and the Big Business Revolution. Houndsmill: Palgrave \r  Sutherland, D. (2003) China’s Large Enterprises and the Challenge of Late Industrialisation, London: RoutledgeCurzon. \r  Downs, E. (2011) Inside China, Inc.: China Development Bank’s Cross-Border Energy Deals,Washington D.C.: Brookings Institution\r  Walter, C. and Howie, F. (2006) Privatizing China: Inside China’s Stock Markets, Singapore: John Wiley & Sons \r  Green, S. (2003) The Development of China's Stock Market, 1984-2002: Equity Politics and Market Institutions, London: Routledge\r  Sanderson, H. and Forsythe, M. (2013) China's Super-bank: Debt, Oil and Influence – How China Development Bank is Rewriting the Rules of Finance, Singapore: John Wiley & Sons.", "terms": {"2020-21 Term 1": {"--LEC (6842)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor LI Chen"]}}}, "assessments": {"Essays": "25", "Essay test or exam": "25", "Others": "25", "Presentation": "25"}}, {"code": "2103", "title": "Popular Culture in Contemporary China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "(UGEC2434 is double-coded with CHES2103.) This rise of China as a global power has drawn critical attention from all over the world from various perspectives. This course will approach this phenomenon from the angle of popular culture. Examining contemporary Chinese popular culture in Mainland China, Hong Kong, and Taiwan, this course considers the process of globalization, cultural exchanges among China, European, America, and Africa, the cultural flows among East Asian popular culture, particularly, with Japan and Korea, as well as interactions among Sinophone communities around the world. This course takes an interdisciplinary methodology, incorporating materials in the form of literature, films, TV series, pop music, reality shows, online forums, video games, and so on, to explore how economic development, technological innovations, and political atmosphere shape the youth culture, gender dynamics, class structure and many other issues on a daily basis.\r", "outcome": " 1. Be able to understand the economic, socio-cultural, and political background of contemporary China; 2. Be able to apply theories of globalization and popular culture on issues of contemporary China; 3. Be able to analyse culture phenomena in contemporary China; 4. Develop reading, writing, and presentation skills in a professional manner.", "syllabus": " Concepts: Popular culture Sinophone culture and Chineseness Globalization / Glocalization and Consumerism Online Participatory Culture and Fandom Queer Culture Censorship Gender Relations Topics:  What are Popular Culture, Globalization, and Consumerism in China  Black Faces in New Year's Eve Gala: Sino-African Relationship in Contemporary China  Jin Yong I: Martial Arts, the Rivers and Lakes, and Cultural Nationalism  Jin Yong II: Hong Kong, the Shaw Brothers, and the Sinphone World  Han Han, Microblog, and Internet Literature in the Age of Global Youth Culture  Guo Jingming: Tiny Times, Plagiarism, and Consumerism  From Cui Jian to Jay Chou to EXO: Stardom, Sinphone Voices, and Inter-Asian Affects  From Teresa Teng to Li Yuchun: Gendered Voices, Fandom, and Participatory Culture  Qing Palace Drama, Time Travel Narratives, and Censorship  Queering the Cyberspace: Taiwan, Hong Kong, and Mainland China  Food, Documentary, and Gastronomical Tourism  Left-over Women, Marriagescape, and the Dating Scene  ", "required_readings": "    Latham, Kevin. Pop Culture China! Media, Arts, and Lifestyle. Santa Barbara: ABC-CLIO, 2007. (abbreviated as Pop Culture)    Yu, LiAnne. Consumption in China: How China's New Consumer Ideology is Shaping the Nation. Cambridge: Polity, 2014. (abbreviated as Consumer)    All other required readings and audio/visual materials should be available through Blackboard and /or be on reserve.        All readings, films, and video clips should be finished before class.   Week 1: Introduction to the Course and What are Popular Culture, Globalization, and Consumerism in China   \"Understanding Popular Culture in China\" in Pop Culture, 1-34   \"Introduction\" in Consumer.   Film: Gong Shou Dao (dir. WEN Zhang), 2017.   Week 2: Black Faces in New Year's Eve Gala: Sino-African Relationship in Contemporary China   Dickinson, Eleanor. \"Getting to Grips with Blackface -- the Challenge for Asia's Marketers.\" Mumbrella Asia. 22 Feb 2018.   Week 3: Jin Yong I: Marial Arts, the Rivers and Lakes, and Cultural Nationalism   Hamm, John Christopher. \"Canonizing the Popular: the Case of Jin Yong\" in Rojas, Carlos and Eileen Cheng-yin Chow. Rethinking Chinese Popular Culture: Cannibalizations of the Canon. London and New York: Routledge, 2009, 75-88.   Ng, Kang-chung. \"Tributes pour in for Chinese literary giant Louis Cha 'Jin Yong', the 'greatest epic writer of our time who embodied the martial arts spirit.\" South China Morning Post, 30 Oct 2018.   Week 4: Jin Yong II: Hong Kong, the Shaw Brothers, and the Sinophone World   \"Introduction: Jin Yong and Martial Arts Fiction\" in Ann Huss and LIU Jianmei eds., The Jin Yong Phenomenon: Chinese Martial Arts Fiction and Modern Chinese Literary History, Cambria Press, 2007, 1-22.   Week 5: Han Han, Microblog, and Internet Literature in the Age of Global Youth Culture   \"Linear Innovations: Han Han\" in Hockx, Michel. Internet Literature in China. New York: Columbia University Press, 2015, 93-107.   Kan, Karoline. \"Once a Voice of Young China, Han Han Stakes Out a Different Parth.\" The New York Times: Sinosphere. 20 Sept 2016.   Channel NewsAsia Interview with Han Han. 20 Sept 2011.   Week 6: Guo Jingming: Tiny Times, Plagiarism, and Consumerism   \"The Social Construction of A Myth: An Interpretation of Guo Jingming's Parable.\" Oriental Archive 78, (2010): 397-419.   King, Aventurina. \"China's Pop Fiction.\" The New York Times: Sunday Book Review. 4 May 2008.   Film: Tiny Times I (dir. GUO Jingming), 2013.   Week 7: From Cui Jian to Jay Chou to EXO: Stardom, Sinophone Voices, and Inter-Asian Affects   \"Popular Music\" in Pop Culture, 335-356.   \"Western Style, Chinese Pop: Jay Chou's Rap and Hip-Hop in China.\" Asian Music. Vol. 39, No.1 (Winter-Spring 2008): 69-80.   The Rap of China EP1.   Week 8: From Teresa Teng to Li Yuchun: Gendered Voices, Fandom, and Participatory Culture   Jones, Andrew. Chapter 1-2 in Yellow Music: Media Culture and Colonial Modernity in the Chinese Jazz Age. Durham: Duke University Press. 21-72.   \"Androgynous Beauty, Virtual Sisterhood: Stardom, Fandom, and Chinese Talent Show under Globalization.\" in Super Girls, Gangsters, Freeters, and Xenomaniacs. Eds. Susan Dewey and Karen Brison. Syracuse: Syracuse University Press. 104-124.   Week 9: Qing Palace Drama, Time Travel Narratives, and Censorship   \"Television\" in Pop Culture, 43-79.   Liu, Haining. \"What the Popularity of a Qing dynasty drama, The Story of Yanxi Palace, says about China's appetitie for feminsim.\" South China Morning Post. 19 Sept 2018. (WebLink)   Week 10: Queering the Cyberspace: Taiwan, Hong Kong, and Mainland China   Humanyun, Hira and Susannah Cullinane. \"Taiwan voters reject same-sex marriage.\" CNN. 25 Nov 2018.   Geng SONG, \"Chinese Masculinities Revisited: Male Images in Contemporary Television Drama Serials.\" Modern China 36:4 (July 2010): 404-434.   Song, Jingyi. \"Low-budget bi-love show becomes an unexpected hit.\" China Daily. 12 Jan 2016.   Week 11: Food, Documentary, and Gastronomical Tourism   \"Food\" in Handbook of Chinese Popular Culture, 35-54.   A Bite of China (舌尖上的中國 Shejian shang de Zhongguo)   Week 12: Left-over Women, Marriagescape, and the Dating Scene   \"Chinese Youth: Hot Romance and Cold Calculation\" in Restless China, 189-210.   Chen, Heather. \"Emotional advert about China's 'leftover women' goes viral.\" BBC News. 8 Apr 2016.   Clips of You Are the One (非誠勿擾 Feicheng wurao)    ", "recommended_readings": "    Rojas, Carlos and Eileen Cheng-yin Chow. Rethinking Chinese Popular Culture: Cannibalizations of the Canon. London and New York: Routledge, 2009.    Hockx, Michel. Internet Literature in China. New York: Columbia University Press, 2015.    Jenkins, Henry. Fans, Bloggers, and Gamers: Exploring Participatory Culture. New York and London: New York University Press, 2006.     ", "terms": {"2020-21 Term 1": {"--LEC (4944)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Ms. SUN Lin"]}}}, "assessments": {"Essays": "40", "Presentation": "10", "Participation": "10", "Short answer test or exam": "40"}}, {"code": "2104", "title": "Consumer Culture in Contemporary China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course offers an overview of China’s consumer culture. Since the policies of reform and opening up were initiated in 1978, China has been transformed from a command economy to a market-oriented system and achieved over three decades of rapid growth. China’s consumer culture has been transformed accordingly. This course will address both the historical processes of cultural changes and major consumer issuers in contemporary China. It aims to provide a roadmap for the students to have a critical view of China’s business culture.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2105", "title": "Modern Chinese Literature", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course explores Chinese literary tradition in the twentieth century and early twenty first century through fiction (novels, short stories, poetry, etc.) and films from Hong Kong, Taiwan, and Mainland China. Major themes we will discuss include modernity, socio-political reformation, gender relations, urban space, the environment, and individual subjectivity. Creatively engaging with Western influences and classical literary traditions, Chinese writers and filmmakers we examine showcase how the Chinese reconstructed modern literature in relation to China's nation-building process. All readings are available in English translations. No prior knowledge of Chinese is assumed.", "outcome": "1. Demonstrate a basic familiarity with modern Chinese literature and culture; 2. Critically analyze important literary texts and films in relation to their historical contexts; 3. Develop reading, writing, and presentation skills in a professional manner", "syllabus": "1. Course Overview and the Origins of Modern Chinese Literature\r 2. May Fourth Movement and Lu Xun\r 3. Iconoclasts of Modern China: Yu Dafu\r 4. New Sensationism and the Rise of Urban Centers: Shi Zhecun and Mu Shiying\r 5. Constructing the New Woman: Ding Ling\r 6. Women’s Writing and the Quotidian: Eileen Chang\r 7. The Beginning of the New Era and Root-seeking Literature\r 8. Dissident Voices: Bei Dao and Jintian Poetry\r 9. Women and the Nation\r 10. Homosexuality, Censorship, and the Nation\r 11. Magical Realism and the Nobel Prize: Mo Yan\r 12. Hong Kong and the Post-colonial Identity\r 13. Imagining the Post-human: Liu Cixin", "required_readings": "1. C. T. Hsia, “Obsession with China: The Moral Burden of Modern Chinese Literature.” A History of Modern Chinese Fiction, 533-55.\r 2. Sher-shiueh Li, “The Multiple Beginnings of Modern Chinese ‘Literature,’” in A New Literary History of Modern China, 29-34.\r 3. Lu Xun, “A Madman’s Diary,” “Preface to the First Collection of Short Stories, Call to Arms,” in Anthology, 3-16.\r 4. Chow, Rey. Primitive Passions: Visuality, Sexuality, Ethnography, and Contemporary Chinese Cinema, 4-18.\r 5. Yu Dafu, “Sinking,” in Anthology 31-55. \r 6. Kirk Dention, “The Distant Shore: Nationalism in Yu Dafu’s ‘Sinking’” 107-115.", "recommended_readings": "1. Leo Ou-fan Lee, “The Quest for Modernity, 1895-1927” in An Intellectual History of Modern China, 152-195.\r 2. Xiaobing Tang, “Lu Xun’s ‘Diary of a Madman’ and a Chinese Modernism,” 1222- 1234.\r 3. Leo Ou-fan Lee, “The Erotic, The Fantastic and the Grotesque” in Shanghai Modern, 173- 181.", "terms": {"2020-21 Term 2": {"--LEC (4807)": {"startTimes": ["8:30"], "endTimes": ["10:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor GAO Yunwen"]}, "-T01-TUT (7294)": {"startTimes": ["13:30"], "endTimes": ["14:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor GAO Yunwen"]}}}, "assessments": {"Essays": "35", "Others": "15", "Presentation": "20", "Short answer test or exam": "15", "Selected response test or exam": "15"}}, {"code": "2106", "title": "Chinese Philosophical and Religious Traditions", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "Not for students who have taken UGEA1432, CCSS3411 or CHES3104", "description": "The aim of this course is to examine four key moments of paradigm shift in Chinese value systems, in the Warring States (481-256 BC), the Period of Division (220-589 AD), the Song-Yuan (960-1368), and modern China (1850-present). The focus will be on the history of thought and religion so as to see how key values in Chinese cultural history change over time, and how distinctions between elite and popular, male and female are also vital to a balanced understanding of what it means to be Chinese through history.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2107", "title": "An Introduction to the Development of Science and Technology in China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "(UGEA2433 is double-coded with CHES2107.) Science and technology in China from antiquity to the present is surveyed through the study of selected topics in some depth. Particular emphasis is given to science and technology as a window to appreciate certain aspects of Chinese culture and history. Two important questions are explored through contrasting China with the West: the conditions for the development of modern science and the central role of science and technology in modernization.\rSpecific topics include the following: (1) history of science and technology in the West as background; (2) scientific thought and concepts of nature in ancient China; (3) traditional Chinese mathematics; (4) traditional Chinese astronomy; (5) Chinese medicine: history, philosophy, theory and practice; (6) innovation and progress in pre-modern Chinese technology; (7) early introduction of western science by missionaries and the Needham question; (8) science and technology in the Self-Strengthening Movement and the May Fourth Movement (‘Mr Science’); (9) science and technology from 1949 to the 1980s; (10) innovation and technology since the 1980s.\r", "outcome": " After taking the course, students should have gained, through an acquaintance with the history of science and technology in China, one perspective of Chinese culture and history.  Through contrasting China with the West, students should have been challenged to reflect upon the conditions for the development of science in any society, and the central role of science and technology in modernization -- including modernization as a key narrative of Chinese history from the mid-19th century to the present.", "syllabus": " Topics for each week:  Logistics, overview, background  History of science and technology in the West (1)  History of science and technology in the West (2)  Scientific thought and concepts of Nature in ancient China  Traditional Chinese mathematics  Traditional Chinese astronomy  Chinese medicine: history, philosophy, basic theory and its practice  Innovation and progress in pre-modern Chinese technology  Early introduction of Western science by missionaries; the Needham question  Science and technology in the Self-Strengthening Movement and the May Fourth movement  Science and technology from 1949 to the 1980s  Innovation and technology since the 1980s  Discussions / presentations  ", "required_readings": " Overall Ronan, Colin A. and Needham, Joseph (1978-).  The Shorter Science and Civilisation in China: an Abridgement of Joseph Needham's Original Text (Cambridge: Cambridge University Press). [UL-DS721.N392] (This 'shorter' version still runs to several volumes, and students will be pointed to specific short sections.) History of science and technology in the West Lindberg, David C. (1992). The Beginnings of Western Science (Chicago University Press). [UL-Q124.95.L55] and also available as ebook Chap. 1 (The beginnings) and 2 (the Greeks), pp.1-5 Chap. 5 (Mathematical sciences in antiquity), pp. 85-110 Chap. 8 (Islamic science), pp. 161-182 Butterfield, Herbert. (1961). The Origins of Modern Science 1300-1800 (New York: Macmillan). [UL-Q125.B97] Chap. 2 (Copernicus), pp. 17-36 Chap. 5 (Experimental method) and Chap. 6 (Bacon and Descartes), pp. 77-116 Chap. 8 (Modern history of gravitation), pp. 139-158 Scientific thought and concepts of Nature in ancient China Henderson, John B. (1984) The Development and Decline of Chinese Cosmology, (New York: Columbia University Press). [UC-B127.C68.H46] Chapter 1. 'Correlative Thought in Early China', pp.1-58 Mathematics [Students should read either one of the following two entries.] Martzloff, Jean-Claude (1997). A History of Chinese Mathematics, translated by Wilson, Stephen S. from the French original Histore des mathematiques chinoises (Springer, Berlin). Online access through CUHK Library: https://link.springer.com/content/pdf/10.1007%2F978-3-540-33783-6.pdf J. Gernet, 'Foreword'. pp. vii-viii J. Dhombres, 'Foreword', pp. ix-xii Preface, pp. xv-xvii Chap. 14. 'Techniques for numerical computation'. pp. 217-271 Ronan, Colin A. and Needham, Joseph (1978-). The Shorter Science and Civilisation in China: an Abridgement of Joseph Needham's Original Text (Cambridge: Cambridge University Press). [UL-DS721.N392] Vol. II, Chap. 1 'Mathematics'. pp. 1-66 Astronomy Shi Y. (2015). 'Ancient Chinese Astronomy -- An Overview', in Ruggles C. (eds.) Handbook of Archaeoastronomy and Ethnoastronomy (New York: Springer), pp. 2031-2042. Online version: https://link.springer.com/referenceworkentry/10.1007%2F978-1-4614-6141-8_210#citeas A brief biographical note for Shi Yunli can be found here: http://hsta.ustc.edu.cn/2010/1008/c2774a21927/page.htm Aslaksen, Helmer (1999). 'The mathematics of the Chinese calendar', preprint, National University of Singapore. Online version: http://www.math.nus.edu.sg/aslaksen/calendar/cal.pdf List of publication of Helmer Aslaksen can be found here: http://www.math.nus.edu.sg/aslaksen/helmerpub.html Chinese medicine Molony, D. and Molony, M.M.P. (1998). Complete Guide to Chinese Herbal Medicine: how to treat illness and maintain wellness with Chinese herbs (Berkeley Books). [UL-WB50.JC6.M65]. Chapters 1 to 4. Innovation and progress in pre-modern Chinese Technology Golas, Peter J. (2015). Picturing Technology in China: From Earliest Times to the Nineteenth Century (Hong Kong University Press). [CC GE-N72.T4.G65] and also online access through CUHK Library pp. 165-180. Early introduction of Western science by missionaries; the Needham question and thesis as to why modern science did not develop in China Needham, Joseph (1969). The Grand Titration: Science and Society in East and West (London: Allen & Unwin). Online access through CUHK Library] Chapter 2, 'Science and China's Influence on the World', pp. 55-122. Science and technology in the Self-Strengthening Movement and the May Fourth movement Hsu, Immanuel C.Y. (2000). The Rise of Modern China (New York: Oxford University Press). [UL:DS754.H74 2000] Chapter 11. The Dynastic Revival and the Self-strengthening Movement, pp. 259-294 Chapter 21. The Intellectual Revolution, 1917-1923, pp. 493-513 Science and technology from 1949 to the 1980s World Scientific Publishing Company (ed.) (1982). 30 Years' Review of China's Science and Technology (1949-79). [UL-T27.C5.T54] Chap. 1. Yan Jici, 'Development of the natural sciences in China over the past 30 years', pp. 1-9. Chap. 2. Wang Ganchang. 'Scaling the new heights of nuclear science and technology', pp. 10-13. Chap. 4. Huang Kun et al., 'Twenty years of the Institute of Semiconductors', pp. 24-29. Chap. 5. Wang Zhijiang and Wang Nenghe, 'China's first laser', pp. 30-32. Chap. 9. Su Buchin and Sun Laixiang, 'A survey on the development of mathematics in new China', pp. 53-63. Innovation and technology since the 1980s Tse, E. (2015). China's Disruptors: How Alibaba, Xiaomi, Tencent, and Other Companies are Changing the Rules of Business (London: Penguin) [UL-HC427.95.T738] A short summary can be downloaded from: http://www.gaofengadv.com/wp-content/uploads/2015/07/EN40Chinas-Disruptors_-How-Alibaba-Xiaomi-Tencent-and-Other-Companies-are-Changing-the-Rules-of-Business-40.pdf Liu, Y.D. (2018). 'Science and Technology in China underperforms in fundamental innovations because there is a lack of the scientific spirit', speech given at a Forum in Beijing (in Chinese). http://economy.caijing.com.cn/20180812/4499379.shtml An English translation will be provided.  ", "recommended_readings": " Elman, Benjamin (2006). A Cultural History of Modern Science in China. (Harvard University Press) [UL-Q127.C5.E46] Mullaney, Thomas S. (2017) The Chinese Typewriter: A History (MIT Press) [UL-Z49.4.C4.M85]", "terms": {"2020-21 Term 1": {"--LEC (7480)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor Kenneth YOUNG"]}}}, "assessments": {"Discussion": "25", "Essays": "50", "Short answer test or exam": "25"}}, {"code": "2108", "title": "Innovation, Catch-up and China’s Development", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course examines China’s innovation and development in the broader context of how the later-comer firms and countries catch up with the forerunning firms and countries. Catch-up phenomenon will be studied at the three levels of country, sector and firms. It will situate China’s cases in a theoretical and comparative lens. Among others, the covered topics include: historical origin of the east Asian miracle; the role of the state vs. market in economic catch-up; industrial policy; technological capability building; role of the business groups in catch-up; the causes and consequences of the economic crisis, economic reform for catchup, and transition from planned to market economies; China’s industrial and innovation policies in various sectors.", "outcome": "1) Students will get a deeper understanding on the dynamics of innovation and economic catch-up.2) Students will be trained to analyze firm-level, sector-level and country-level cases studies from a historical and comparative perspective3) Students will be trained to analyze and evaluate the performance of China’s innovation and development policies in various sectors.", "syllabus": "1. Introduction-innovation and development2. Economic catch-up3. State and national innovation system 4. Big business 5. Capability building6. Intellectual property rights7. Catch-up at the firm level: theory8. Catch-up at the firm level: case study9. Catch-up at the sector level: theory10. Catch-up at the sector level: case study11. Catch-up at the country level: theory12. Catch-up at the country level: case study", "required_readings": "1. introduction-innovation and developmentLee, Keun, and John Mathews, ““From the Washington Consensus to the BeST Consensus for World Development,” Asian-Pacific Economic Literature, May 2010.Lee, Keun, “Making a Technological Catch-up: Barriers and Opportunities,” Asian Journal of Technology Innovation, vol. 13: 2: 97-131, 2005.2. economic catch-upLee, Keun, Justin Y. Lin, and Ha-Joon Chang, \"Late Marketization vs. Late Industrialization: Convergence or Divergence in East Asia\", Asia-Pacific Economic Literature, Vol. 19, No. 1, 42-59, 2005.Lee, Keun, M. Jee, and J. Eun, \"“Assessing China’s Economic Catch-up at the Firm-Level and Beyond: Washington Consensus, East Asian Consensus and the Beijing Model,”, Industry and Innovation, (July 2011).3. state and national innovation system Nelson, Richard., National Innovation Systems: A Comparative Analysis, Oxford Univ. Press, 1993. (chs. 1 and 16). (ch 2, USA, ch 3 Japan, ch 12 Taiwan)4. big business Nolan, P. (2002) \"China and the global business revolution.\" Cambridge Journal of Economics, 26(1): 119-137Nolan, P., Zhang, J. and Liu, C. (2008) \"The global business revolution, the cascade effect, and the challenge for firms from developing countries.\" Cambridge Journal of Economics, 32(1): 29-47 (DOI: 10.1093/cje/bem016)5. business groupsLee, Keun, “Business Groups as an Organizational Device for Catch-up,” in J. Nakagawa, ed. Managing Development: Globalization, Economic Restructuring and Social Policy, Oxon: Routledge, 2006.Khanna, Tarun and Yishay Yafeh, 2007, Business Groups in Emerging Markets: Paragons or Parasites?, Journal of Economic Literature6. capability buildingConstance E. Helfat, Margaret A. Peteraf (2003), “The dynamic resource-based view: capability lifecycles.” Strategic Management Journal Volume 24, Issue 10 pp997-1010 October 2003.John Cantwell and Ed Amann (eds.), The Innovative firms in the Emerging Market Economies, pp. 223–48. New York: Oxford University Press.7. intellectual property rightsHiroyuki Odagiri, Akira Goto, Atsushi Sunami, Richard R. Nelson, eds. Intellectual Property Rights, Development, and Catch Up: An International Comparative Study , Oxford University Press, 20108. catch-up at the firm levelGuillen M., 2000. “Business Groups in Emerging Economies: A Resource-based View,　 Academy of Management Journal 43(3): pp 362-3809. catch-up at the sector levelLee, K., Malerba, F., 2016. Changes in Industrial Leadership and Catch-Up by Latecomers: Toward a Theory of Catch-up Cycle from the Selected Sectoral Studies. Research Policy.10. catch-up at the national levelRodrik, Dani, Arvind Subramanian, and Francesco Trebbi, 2002, “Institutions Rule: The Primacy of Institutions Over Geography and Integration in Economic Development”, Journal of Economic Growth 9: 131-165.11. university-industry linkagesEun, Jonghak, Keun Lee, and G. Wu, \"Explaining the \"University-run Enterprises\" in China: A New Theoretical Framework for University-Industry Relationship and its Application to China,\" Research Policy, 2006.12. industrial policyLin, J. and J. Stiglitz (eds.), 2013, New Thinking in Industrial Policy. Palgrave.Mu, Qing, and Keun Lee \"Knowledge diffusion, market segmentation and technological catch-up: The case of the telecommunication industry in China,\" Research Policy, 2005.", "recommended_readings": "None", "terms": {"2020-21 Term 2": {"--LEC (8981)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor LI Chen"]}}}, "assessments": {"Essays": "25", "Essay test or exam": "25", "Others": "25", "Presentation": "25"}}, {"code": "3000", "title": "Ethnicity and Regional Culture in China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course examines ethnicity, regional culture and regional policy in contemporary China in global context. It looks at the evolution of regional policy in China since 1949, covering the Third Front, reform and opening up and coastal development, Develop the West, and regional policies in the 2010s such as Beijing-Tianjin-Hebei and the Greater Bay Area. The course has a particular emphasis on China’s western regions, with discussion of issues relating to ethnic minorities in China, including the regions of Tibet and Xinjiang. ", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3001", "title": "Global China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "The whole world is fixated on contemporary China's global presence with its economic powers. This English-taught seminar examines, in a multi-disciplinary approach, China’s global connections not only at present but also in history. This course highlights China's multifaceted yet often unexplored engagement with the rest of the world over the past few centuries. It surveys the economic, technological, political, and sociocultural aspects of modern China’s engagements in the globalizing process. This course helps students contextualize and critically analyse China’s recent rise. ", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3002", "title": "China’s Financial Reform - problems and perspectives", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course examines the development and transformation of China’s financial system during the recent decades of market-oriented reforms and discuss its investment implications. It takes a historical and institutional perspective to analyze the key components of China’s financial system, including the reform of banking system, the development of capital markets, the rise of business groups and financial conglomerates, the evolution of exchange rate and monetary policy regime as well as the financial regulatory and governance framework. It provides students with a comprehensive and in-depth understanding of the achievement, challenges and opportunities of China’s financial reforms.", "outcome": "By the end of the semester, students should:\r • gain a better understanding of the overall structure and evolutionary trends of China’s financial development and reforms.\r • be familiar with the institutional arrangements underlying China’s financial sector.\r • be able to critically evaluate the challenges and opportunities facing China’s financial systems.", "syllabus": "1. Course introduction and overview\r 2. Global Finance and China’s Reform \r 3. Hybrid Governance in China’s Finance System\r 4. China’s Banking Reform\r 5. The Rise of Shadow Banking in China\r 6. Corporatization and Financial Conglomerates\r 7. Capital Market Reforms\r 8. Public Finance\r 9. Financial Technology\r 10. Bureaucracy and Regulatory Reform\r 11. Currency Reform and RMB Internationalization\r 12. Finance and Development", "required_readings": "Nolan, Peter (2015) “The West and China: Globalization and Competition in Financial Services”, Journal of Chinese Economic and Business Studies, 13 (2): 87-104.\r Hess, Patrick (2014) “China's Financial System: Past Reforms, Future Ambitions and Current State,” in Frank Rövekamp and Hanns Günther Hilpert (eds), Currency Cooperation in East Asia, NewYork, Springer, pp. 21-41.\r Pistor, Katharina (2012) “The Governance of China’s Finance”, in Randall Morck and Joseph Fan, Capitalizing China, University of Chicago Press, pp. 35-60.\r Wang, Yingyao (2015) “The Rise of the ‘Shareholding State’: Financialization of Economic Management in China”, Socio-Economic Review, 13 (3) 603–625\r Liao Min, Sun Tao and Zhang Jinfan (2016) China’s Financial Interlinkages and Implications for Inter-Agency Coordination, International Monetary Fund Working Paper 16/181.\r García-Herrero, Alicia (2013) “An Assessment of China’s Banking System Reform” in S. Kaji and E. Ogawa (eds.), Who Will Provide the Next Financial Model?: Asia’s Financial Muscle and Europe’s Financial Maturity, Springer: 147-175.\r Pistor, Katharina and Chenggang Xu (2005) “Governing Stock Markets in Transition Economies: Lessons from China.” American Law and Economics Review 7(1): 184-210.\r Sohn, Injoo (2015) “China’s Monetary Ambitions: RMB Internationalization in Comparative Perspective”, Korean Journal of International Studies 13 (1):181-206.", "recommended_readings": "Steinfeld, Edward (2004) “Market Visions: the Interplay of Ideas and Institutions in Chinese Financial Restructuring”, Political Studies (52): 643–663.\r Okazak, Kumiko (2017) “Banking System Reform in China: the Challenges to Improving Its Efficiency in Serving the Real Economy”, Asian Economic Policy Review 12: 303–320\r Tsai, Kellee (2015) “The Political Economy of State Capitalism and Shadow Banking in China,” Issues & Studies 51 (1): 55-97. \r Tsai, Kellee (2017) “When Shadow Banking Can be Productive: Financing Small and Medium Enterprises in China,” Journal of Development Studies 53(12): 2005-2028.\r Jin, Sheng (2016) China's Financial Holding Companies: Mixed Operation and Separate Supervision, NUS Centre for Banking & Finance Law Working Paper.\r Chen, Ding (2013) “Developing a Stock Market without Institutions—The China Puzzle.” Journal of Corporate Law Studies 13 (1): 151-184.\r Wong, C. (2013) “Reforming China’s Public Finances for Long-term Growth”, in Garnaut, R. and Song, L. (eds.). China: A New Model for Growth and Development, Canberra: Australian National University Press, pp. 199-219\r Wong, C. (2013) “Paying for Urbanization: Challenges for China’s Municipal Finance in the 21st Century”, in Bahl, R., Linn, J. and Wetzel, D. (eds.,). Metropolitan Government Finances in Developing Countries, Cambridge, MA: Lincoln Institute for Land Policy, 2013, pp. 273-308\r Mittal Sachin and Lloyd, James (2016) The Rise of FinTech in China: Redefining Financial Services. A Collaborative Report by DBS and EY, DBS Group Research, Singapore: DBS Bank.\r Lu, Lerong (2018) “How A Little Ant Challenges Giant Banks? The Rise of Alipay (Ant Financial)’s FinTech Empire and Regulatory Options” International Company and Commercial Law Review, 28(1):12-30.\r Naughton, Barry (2017) “The Regulatory Storm: A Surprising Turn in Financial Policy” China Leadership Monitor (53):1-12\r Cohen, Benjamin (2017) Renminbi Internationalization: A Conflict of Statecrafts. Chatham House Research Paper.", "terms": {"2020-21 Term 1": {"--LEC (7107)": {"startTimes": ["16:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor LI Chen"]}, "-T01-TUT (7005)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor LI Chen"]}}}, "assessments": {"Essays": "30", "Essay test or exam": "30", "Others": "20", "Presentation": "20"}}, {"code": "3003", "title": "China Under Mao", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "Almost forty years after the death of Mao, China is still coming to grips with what historians now call the Mao era, from the founding of the People’s Republic in 1949 to his death in 1976. The Mao era has had a profound impact on China’s politics, economy, society and culture; it is still being felt today. Examining both primary sources and recent scholarship on the Mao years, this course studies the waves of political movements and how they affected the lives of the Chinese people.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3004", "title": "Media China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course will examine the changes in Chinese media over the last three decades. It discusses how political, economic and social forces constrain the media and how the media, in turn, shapes society and politics. It looks at the history of the media in China, processes of commercialization and internet development, and the state of investigative journalism and online activism and the media’s relationship with civil society, as well as state propaganda and censorship. The course concludes by covering differences in the media in Hong Kong and Taiwan, and looking at the recent internationalization of China’s media.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3005", "title": "Social Issues and Problems in Contemporary China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLecture", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course examines major social problems that have emerged in contemporary China since the onset of economic reforms in the late 1970s. With a substantive focus on inequality and social class formation, the course will analyze the shifting distribution of material assets, social status, and political power in today’s China. Topics will include China’s rural-urban divide, migration and urbanization, demographic challenges, pollution and food safety, social unrest, political reform, ethnic and frontier issues, and China’s position in the global order. ", "outcome": "By the end of the semester, students should:\r - be familiar with the nature and scope of contemporary China’s main social issues and problems. \r - be able to analyze critically the causes and implications of China’s social problems \r - be able to present a well-organized well-supported analysis\r - be familiar with CUHK library sources (including Universities Service Centre) to conduct group research on a chosen topic", "syllabus": "1. Introduction: China in Transition \r 2. Making Wealth and Poverty\r 3. China’s Entrenched Rural-Urban Divide\r 4. Uneven Urbanization\r 5. Migration\r 6. Demographic Changes and Challenges\r 7. Multiethnic Margins\r 8. Corruption and Political Stability\r 9. Environmental Crisis, Developmental Cost?\r 10. Public Health Crises\r 11. Moral Vacuum, Religious Revival?\r 12. China and the World", "required_readings": "Rural-Urban Divide and Inequality\r • Davis, Deborah S., and Feng Wang. Eds. 2009. Creating Wealth and Poverty in Postsocialist China. Stanford, CA: Stanford University Press.\r  Demographic Changes and Challenges \r • Peng, Xizhe. 2011. \"China's Demographic History and Future Challenges.\" Science no. 333 (6042):581-587.\r  Multiethnic Margins\r • Barabantseva, E. V. 2009. \"Development as Localization: Ethnic Minorities in China's Official Discourse on the Western Development Project.\" Critical Asian Studies no. 41 (2):225-254. \r  Corruption and Social Conflict \r • Cai, Yongshun, and Lin Zhu (2013). \"Disciplining Local Officials in China: The Case of Conflict Management.\" The China Journal (70): 98-119.\r  Environmental Crisis, Developmental Cost?\r • Lora-Wainwright, Anna, Y. Zhang, Y. Wu, and B. Van Rooij. 2012. \"Learning to Live with Pollution: The Making of Environmental Subjects in a Chinese Industrialized Village.\" The China Journal (68):106-124. \r  Public Health Crises\r • Shao, Jing. 2006. \"Fluid Labor and Blood Money: The Economy of HIV/AIDS in Rural Central China.\" Cultural Anthropology no. 21 (4):535-569. \r  Moral Vacuum, Religious Revival?\r • Yang, Fenggang. 2005. \"Lost in the Market, Saved at McDonald's: Conversion to Christianity in Urban China.\" Journal for the Scientific Study of Religion no. 44 (4):423-441.\r  China and the World \r • Lee, Ching Kwan. 2009. \"Raw Encounters: Chinese Managers, African Workers and the Politics of Casualization in Africa's Chinese Enclaves.\" The China Quarterly no. 199:647-666.", "recommended_readings": "• Cheek, Timothy. 2007. Living with Reform China since 1989. London & New York: Zed Books.\r • Naughton, Barry. 2007. The Chinese Economy: Transitions and Growth. Cambridge, Mass.: MIT Press.\r • Osburg, John. 2013. Anxious Wealth: Money and Morality Among China's New Rich. Stanford, CA: Stanford University Press.", "terms": {"2020-21 Term 1": {"--LEC (4883)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. YANG Zhiqiang"]}}}, "assessments": {"Essays": "40", "Essay test or exam": "15", "Others": "20", "Presentation": "25"}}, {"code": "3006", "title": "China’s Strategic and Diplomatic Cultures", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course looks at the ways in which diplomacy and strategy have developed in the Chinese context. It examines key historical texts on strategy and diplomacy and major analyses of Chinese strategic culture, discusses scholarship on Chinese World Order / Tribute System, looks at some recent case studies of Chinese diplomacy including in US-China relations and around the handover of Hong Kong, and reviews contemporary work of (Chinese) scholars interested in developing Chinese approaches to strategy, international relations and world order. ", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3007", "title": "Urban China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLecture", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course examines key issues of urbanization and urbanity in light of Chinese experiences. After offering an overview of modern China’s quest for urbanization since the late imperial era, it shifts the focus to the urbanizing process in the post-reform era, covering issues of population movement and control, land policy, housing reform, urban infrastructure, inner-city poverty, public space and social life in cities. The readings, drawn from multiple disciplines, examine the socioeconomic, political and cultural factors that contribute to China’s urbanizing process and its particularities.", "outcome": "By the end of the semester, students should:\r - be familiar with the key issues of urbanization in the Chinese context \r - be familiar with key concepts and social theories of current research in urban studies \r - be able to read and understand interdisciplinary academic publications on urban China \r - develop both oral and written skills to present coherent and succinct analysis", "syllabus": "1. Introduction: Urbanization and Globalization\r 2. Understanding the Urban\r 3. Urban Development in Late-Imperial China\r 4. Modernity and China’s Urban Transformation\r 5. Urbanization in PRC\r 6. Urban Development and Land Politics\r 7. Urban Process in Global Capitalism \r 8. Short Field Trip in Hong Kong\r 9. Urban Planning and Infrastructure Building\r 10. Urban Space and Sociality\r 11. Urban Governance\r 12. Social Lives in Cities", "required_readings": "Urban Development in Late-Imperial China \r • Rowe, William T. 1989. \"City People.\" In Hankow: Conflict and Community in a Chinese City, 1796-1895. 15-63. Stanford, CA: Stanford University Press.\r  Modernity and Urban Transformation \r • Rogaski, Ruth. 2000. \"Hygienic Modernity in Tianjin.\" In Remaking the Chinese City: Modernity and National Identity, 1900-1950, edited by Joseph Esherick, 30-46. Honolulu: University of Hawaii Press.\r  Urbanization in PRC \r • Gaubatz, Piper. 1998. \"Understanding Chinese Urban Form: Contexts for Interpreting Continuity and Change.\" Built Environment 24 (4):251-270.\r  Urban Development and Land Politics\r • Hsing, You-tien. 2006. \"Land and Territorial Politics in Urban China.\" The China Quarterly (187):575-591.\r  Urban Process and Planning in Global Capitalism \r • Kipnis, Andrew. 2016. Ch3 “Recombinant Production;” Ch4 “Recombinant Planning.” From Village to City: Social Transformation in a Chinese County Seat. University of California Press. pp 66-95.\r  Short Field Trip in Hong Kong\r • Mathews, Gordon. 2011. “Place” & “People.” Ghetto at the Center of the World: Chungking Mansions, Hong Kong. Chicago: University of Chicago Press.\r  Urban Space and Sociality \r • Yan, Yunxiang. 2000. \"Of Hamburger and Social Space: Consuming McDonald's in Beijing.\" in The Consumer Revolution in Urban China, edited by Deborah Davis. Berkeley: University of California Press\r  Urban Governance \r • Tomba, Luigi. 2014. Chapter 2 “Micro-Governing the Urban Crisis”. The Government Next Door: Neighborhood Politics in Urban China. Ithaca; London, Cornell University Press. \r  Social Lives in Cities \r • Farrer, James, and Andrew David Field. 2015. Ch3 “The Fall and Rise of Social Dance,” In Shanghai Nightscapes: A Nocturnal Biography of a Global City. Chicago and London: The University of Chicago Press.", "recommended_readings": "• Skinner, G. William. 1977. The City in Late Imperial China, edited by G. William Skinner, 3-32. Stanford: Stanford University Press.\r • Esherick, Joseph, 2000. Remaking the Chinese City: Modernity and National Identity, 1900-1950. Honolulu: University of Hawaiì Press.\r • Davis, Deborah. 2000. The Consumer Revolution in Urban China. Berkeley: University of California Press\r • Read, Benjamin L. 2012. Roots of the State: Neighborhood Organization and Social Networks in Beijing and Taipei. Stanford, California: Stanford University Press.", "terms": {"2020-21 Term 2": {"--LEC (6307)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor LING Minhua"]}, "-D01-DIS (4841)": {"startTimes": ["13:30"], "endTimes": ["14:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor LING Minhua"]}}}, "assessments": {"Essays": "35", "Others": "25", "Presentation": "25", "Selected response test or exam": "15"}}, {"code": "3008", "title": "Environment and Society in China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "China’s environmental issues have raised global concerns. This English-taught, upper-level course invites students to examine from an anthropological approach the interrelations between environment and society in Greater China. After an introduction to Chinese environmental history, students will be invited to reflect upon human-nature relations in both historical and contemporary contexts. The second half of the semester engages students with case studies on issues ranging from agricultural industrialization, industrial pollution, foodways change, environmental hazard and health crisis, environmental infrastructure, to social protests and environmental NGOs, to understand environmental challenges facing local Chinese societies.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3009", "title": "Youth in China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionLecture", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This English-taught, upper-level seminar critically examines the notion of youth and its evolution as well as its social, cultural and political implications in Greater China in both historical and contemporary contexts. This seminar adopts a multi-disciplinary approach, drawing readings from anthropology, history, literature, sociology and political science. Students will be invited to use case studies to critically examine youth-related issues, ranging from familial relations, education, school-to-work transition, employment and labor experience, love and sex, political movement, social media, and different forms of youth (sub)cultures.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3010", "title": "Governing China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course introduces major political institutions and problems of governance in contemporary China. Departing from the early years of reform and their culmination in the crisis of 1989, the class investigates the Chinese leadership’s agenda of safeguarding one-party rule through reforms and adjustments in various domains. In order to gain a better understanding of China’s path of political development, particular attention will be paid to the varying degrees of success and the often-unintended consequences of these efforts. The course covers a range of topics from policy making and goals to contentious politics.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3101", "title": "China on Screen", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "Many 20th century Chinese films were concerned with issues of nationhood, identity and history. In recent years, however, while some directors have continued to focus on the nation, others have chosen to look at the present, as well as at the effects of globalization on Chinese society and culture. This course asks that students begin to understand Chinese cinema(s) as transnational, focusing in particular on films made in mainland China, Taiwan and Hong Kong. Students will be introduced to Chinese film history and criticism via an examination of selected films directed by several of Greater China’s most skilled directors. ", "outcome": "After completing this course, you should:\r • exhibit a firm, if basic, grasp of modern Chinese history and be able to discuss its relation to cinema production in Greater China\r • be familiar with some of Greater China’s most important film directors and their works\r • have a basic understanding of film language and technique\r • be able to view and write about films critically", "syllabus": "Early Chinese Cinema in the 1920s and 1930s\r The Brief Post-War Flowering of Chinese Cinema\r Cinema under Mao\r The Fourth Generation of Directors\r The Fifth Generation of Directors\r The Sixth (or Urban) Generation\r Hong Kong Martial Arts Cinema\r Hong Kong Cinema’s Golden Age of the 1980s: Crime Films\r Hong Kong Art Cinema in the 1990s: Wong Kar-wai\r Post-1997 Hong Kong Cinema\r Taiwan New Cinema: Hou Hsiao-Hsien\r Taiwan New Cinema: Edward Yang", "required_readings": "Berry, Chris. “Transnational Chinese Cinema Studies.” In The Chinese Cinema Book, edited by Song Hwee Lim and Julian Ward, 9-16.\r Chen, Leo Chanjen. “The Frustrated Architect: The Cinema of Edward Yang.” New Left Review 11 (Sep 2001): 115-28.\r Daruvala, Susan. “The Aesthetics and Moral Politics of Fei Mu’s Spring in a Small Town.” Journal of Chinese Cinemas 1, no. 3 (2007): 171-187.\r Hansen, Miriam Bratu. “Fallen Women, Rising Stars, New Horizons: Shanghai Silent Film as Vernacular Modernism.” Film Quarterly 54, no. 1 (Autumn 2000): 10-22.\r Lu, Sheldon Hsiao-peng. “National Cinema, Cultural Critique, Transnational Capital: The Films of Zhang Yimou.” In Transnational Chinese Cinemas: Identity, Nationhood, Gender, edited by Sheldon Hsiao-peng Lu, 105-36. Honolulu: U of Hawai’i P, 1997.\r Marchetti, Gina. “Two Stage Sisters: The Blossoming of a Revolutionary Aesthetic.” In Transnational Chinese Cinemas: Identity, Nationhood, Gender, edited by Sheldon Hsiao-peng Lu, 59-80. Honolulu: U of Hawai’i P, 1997.", "recommended_readings": "Abbas, Ackbar. Hong Kong: Culture and the Politics of Disappearance. Minneapolis: University of Minnesota Press, 1997. 1-15; 48-54.\r Lupke, Christopher. The Sinophone Cinema of Hou Hsiao-hsien: Culture, Style, Voice and Motion. Amherst: Cambria Press, 2016. 153-67.\r Rodriguez, Hector. “Questions of Chinese Aesthetics: Film Form and Narrative Space in the Cinema of King Hu.” Cinema Journal 38, no. 1 (Fall 1998): 73-97.\r Wang, Yanjie. “Violence, Wuxia, Migrants: Jia Zhangke’s Cinematic Discontent in A Touch of Sin.” Journal of Chinese Cinemas 9, no. 2 (2015): 159-27.", "terms": {"2020-21 Term 1": {"--LEC (5831)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor TAM King Fai"]}, "-T01-TUT (5829)": {"startTimes": ["13:30"], "endTimes": ["14:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor TAM King Fai"]}}}, "assessments": {"Essays": "90", "Others": "10"}}, {"code": "3105", "title": "Cultural History of China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "Not for students who have taken CCSS3411", "description": "This course proposes a multi-disciplinary approach to the study of Chinese cultural history conceived of as a succession of modes of rationality (philosophical, bureaucratic, and economic processes of rationalization). The focus will be on the moments of paradigm shift from one mode of rationality to another. For each of these moments, cultural facts and artifacts—thought, literature, ritual—will be examined in relationship to changing social, political, and economic systems. The specific focus of this course is on the emergence of modern China in the Song-Yuan (960-1368) and of today’s China 1850 to the present. We will see how the modern attack on religion, redefined as \"superstition\", led not only to religious reform movements but also to a society in which science and the nation became the primary value systems promoted by the state.", "outcome": "To understand the two major moments of paradigm shift that produced contemporary China. In the Song-Yuan half, to see China as a complex society in which: 1) the state and local society interact with each other in at once predictable and surprising ways; 2) each of the four religions or teachings—Confucianism, Buddhism, Daoism, and shamanism (wujiao)— plays its part in the making of Chinese society; and 3) each of the Three Teachings has its own internal divisions between elite and popular. In the 1850-present half, to see how 1) the struggle for national survival led to a frontal attack on all religions of the past in the name of science, the economy, and the nation; 2) how traditional religions adapted and revived.", "syllabus": "Topic 1 Religion and Thought in the Song, Jin, and Yuan\r Lecture 1 “Modern China”\r Lecture 2 State Religion\r Lecture 3 Local Society\r Lecture 4 Daoism in the Song and Jin\r Lecture 5 Buddhism in the Song \r Lecture 6 Confucianism in the Song (1)\r Lecture 7 Confucianism in the Song (2)\r Topic 2 Structuring Values 1850-2015\r Lecture 8 Contemporary China\r Lecture 9 Economics (and Art)\r Lecture 10 Science\r Lecture 11 The Woman Question (and Marxism)\r Lecture 12 Spirit Writing and Charity\r Lecture 13 Religions Transformed", "required_readings": "Topic 1 Religion and Thought in the Song, Jin, and Yuan\r All required readings are from Modern Chinese Religion I: Song-Liao-Jin-Yuan (960-1368 AD)\r  Modern China\r John Lagerwey, “Introduction,” Modern Chinese Religion I, pp. 1-70 \r  State Religion\r Patricia Ebrey, “Song Government Policy,” Modern Chinese Religion I, pp. 73-137\r  Local Society\r Joseph McDermott, “The Village Quartet,” Modern Chinese Religion I, pp. 169-228 \r  Daoism in the Song and Jin\r Matsumoto Kôichi, “Daoism and Popular Religion in the Song,” Modern Chinese Religion I, pp. 285-327\r  Buddhism in the Song \r Juhn Ahn, “Buddhist Self-Cultivation Practice,” Modern Chinese Religion I, pp. 1160-1186\r  Confucianism in the Song (1)\r Chang Woei Ong, “Confucian Thoughts,” Modern Chinese Religion I, pp. 1378-1432\r  Confucianism in the Song (2)\r Curie Virág, “Self-Cultivation as Praxis in Song Neo-Confucianism,” Modern Chinese Religion I, pp. 1187-1232\r  Topic 2 Structuring Values 1850-2015\r All readings are from Modern Chinese Religion II: 1865-2015\r  Contemporary China\r Goossaert, Kiely, Lagerwey, “Introduction,” Modern Chinese Religion II, pp. 1-60\r  Economics (and Art)\r David Faure, “The Introduction of Economics in China, 1850-2010,” Modern Chinese Religion II, pp. 65-88\r  Science\r Grace Shen, “Scientism in the Twentieth Century, Modern Chinese Religion II, pp. 91-137\r  The Woman Question (and Marxism)\r Xiaofei Kang, “Women and the Religious Question in Modern China, Modern Chinese Religion II, pp. 491-559\r  Spirit Writing and Charity\r Wang Chien-ch’uan, “Spirit Writing Groups in Modern China (1840-1937): Textual Production, Public Teachings, and Charity,” Modern Chinese Religion II, pp. 651-684\r  Religions Transformed\r Melissa Inouye, “Miraculous Modernity: Charismatic Traditions and Trajectories within Chinese Protestant Christianity,” Modern Chinese Religion II, pp. 884-919", "recommended_readings": "Paul Jakov Smith, “Introduction: Problematizing the Song-Yuan-Ming Transition,” in Paul Jakov Smith and Richard von Glahn, eds, The Song-Yuan-Ming Transition in Chinese History, pp. 1-34\r  Chen Guanwei & Chen Shuguo, “State Rituals,” Modern Chinese Religion I, pp. 138-66\r  Fu-shih Lin, “‘Old Customs and New Fashions’: An Examination of Features of Shamanism in Song China,” Modern Chinese Religion I, pp. 229-282\r  Pierre Marsone, “Daoism Under the Jurchen Jin Dynasty,” Modern Chinese Religion I, pp. 1111-1159\r  Daniel Stevenson, “Buddhist Ritual in the Song,” Modern Chinese Religion I, pp. 328-442 \r  Mark Halperin, “Buddhists and Southern Chinese Literati in the Mongol Era,” Modern Chinese Religion I, pp. 1433-92 \r  Michael Fuller, “Moral Intuitions and Aesthetic Judgments: The Interplay of Poetry and Daoxue in Southern Song China,” Modern Chinese Religion I, pp. 1307-77\r  Linda Walton, “Academies in the Changing Religious Landscape,” Modern Chinese Religion I, pp. 1233-1269\r  Walter Davis, “Art, Aesthetics, and Religion in Modern China,” Modern Chinese Religion II, pp. 197-257\r  Volker Scheid & Eric Karchmer, “History of Chinese Medicine, 1890-2010,” Modern Chinese Religion II, pp. 141-194\r  Arif Dirlik, “The Discourse of ‘Chinese Marxism’,” Modern Chinese Religion II, pp. 302-365\r  Angela Leung, “Charity, Medicine, and Religion: The Quest for Modernity in Canton (ca. 1870-1937),” Modern Chinese Religion II, pp. 579-612\r  André Laliberté, “Religions and Philanthropy in Chinese Societies Since 1978,” Modern Chinese Religion II, pp. 613-48\r  Sébastien Billioud, “The Hidden Tradition: Confucianism and Its Metamorphoses in Modern and Contemporary China,” Modern Chinese Religion II, pp. 767-805\r  Ji Zhe, “Buddhist Institutional Innovations,” Modern Chinese Religion II, pp. 731-766", "terms": {"2020-21 Term 1": {"--LEC (8005)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor John LAGERWEY"]}}}, "assessments": {"Essay test or exam": "70", "Presentation": "30"}}, {"code": "3200", "title": "Advanced Chinese Literature Seminar", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "The goal of this course is to give advanced students with at least a basic knowledge of Chinese literature an opportunity to read deeply on one aspect of the field. Topics may be defined by historical period, literary genre, theme, or aesthetic or theoretical issue. The course will also focus on selected authors and texts based on the theme of the course. In addition to the close reading and analysis of primary texts, students will be required to read relevant works of critical research. ", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3300", "title": "China Summer Field Trip", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "Pre-requisite: CHES1000 and at least one course from CHES2001, 2002 or 2003.", "description": "This summer field trip course, taking place in selected sites in Greater China (including mainland China, Hong Kong, or Taiwan), will guide students to learn and experience firsthand Chinese culture and society. Through this intensive week-long field trip, students will visit museums as well as various Chinese institutions, including schools, government agencies, news agents, state-owned enterprises, and private companies. In addition, guest lectures by local experts and informal exchanges with local residents in Chinese will enrich students’ learning experience.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3400", "title": "Social Enterprise Project in China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course is centered on a short-term group social-enterprise project undertaken in Greater China through which students will learn in the collaborative, experiential, and problem-solving mode. Preparatory assignments and lectures, group discussions, and written and multimedia assignments will be assigned and guided by the faculty instructor. At the same time, the course emphasizes collective student entrepreneurial initiative and leadership and developing cross-cultural communication abilities in practice with partners, mentors and project supervisors in China. Each project will be designed together with a specified host-organization in China and information on the specific nature of the project will be available at China Studies well in advance. ", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3401", "title": "Guided Fieldwork in China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "Pre-requisite: CHES1000,1001,1002 and at least one course from CHES2001,2002 or 2003.", "description": "This course offers qualified Year 3 or above students an opportunity to conduct individual fieldwork in China under an instructor’s guidance. Projects will be designed by the student in consultation with the instructor and will be assessed by various means, including research plan, progress report, and final fieldwork report or research paper. Students will conduct research in suitable sites once finishing reading relevant references and getting the itinerary approved by the instructor. Students should keep field notes on daily base and report research progress regularly to the instructor to timely feedback before completing the final report or research paper.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3402", "title": "China Experience Internship", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This internship course will make it possible for students to “learn through doing” and “learn through social experience” in a faculty-guided and assessed internship with an organization, institution, company or enterprise in which lessons can be learned about how to make the language, cultural, social and economics-based knowledge and analytical, critical thinking and presentation expression skills learned in China studies relevant to the wide range of “real world” fields outside of the university. In keeping with the educational approach of the programme, this course encourages majors to take advantage of learning “on-site” in such an internship based in Hong Kong, mainland China or Taiwan, with the course registered during the regular academic terms or in the summer school terms. Students will be expected to provide regular progress reports to their faculty adviser through a diary or online blog or video presentation, and will submit a final report assessing the organization, its engagement with Chinese society, economy, culture, and the lessons learned for practically applying area studies knowledge and skills to this field. A final oral presentation will also be given and assessed before faculty and student peers at an annual presentation of internships.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3403", "title": "Social-Cultural Immersion", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Independent Study", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This centerpiece course to the Hong Kong-based version of the “immersion” requirement sequence provides a guided and supervised project-oriented approach to navigating the cultural, linguistic, social, personal and pragmatic challenges of learning through social and linguistic immersion in a target language culture. The course will prepare and guide students in undergoing and reflecting upon three key elements of the “immersion” experience: residential immersion (with a target-language home-stay, on-campus roommate, or off-campus group housing arrangement); social immersion (with a target-language regular-weekly extracurricular group activity, for instance, in the arts, music, sport, etc.); work-study immersion (with a target-language internship, part-time job, language study project or activity, or social enterprise or service learning project). The course instructor will provide relevant readings and lectures and will lead regular discussions, and supervise and assess periodic oral, written and multimedia student reports and a final project.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3500", "title": "Chinese Studies Research Methods", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureWorkshop", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This English-taught seminar provides a survey of research methods for advanced students in Chinese Studies. It aims to prepare students for their thesis research paper by guiding them through the process of research design. Students are introduced to key qualitative and quantitative methods such as participant observation, interviewing, field-note taking, photography, textual analysis, and data analysis. This course will also discuss the moral, ethical and theoretical problems facing qualitative research as well as the particular challenges of doing research on China. ", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4001", "title": "Research on Chinese Texts I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This English-taught seminar offers a guided, intensive study of selected Chinese texts for students at an advanced or higher Chinese reading level. It aims to prepare students for advanced research especially in terms of textual analysis and close reading skills in a selected area of focus. Students will work closely with the instructor on a set of primary texts to understand the meaning of the texts, their historical contexts, their theoretical implication and cultural significance. This course will involve substantial translation work and some practicum exercises. ", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4002", "title": "Research on Chinese Texts II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "Pre-requisite: CHES4001", "description": "This English-taught seminar offers a guided, intensive study of selected Chinese texts for students at an advanced or higher Chinese reading level. It aims to prepare students for advanced research especially in terms of textual analysis and close reading skills in a selected area of focus. Students will work closely with the instructor on a set of primary texts to understand the meaning of the texts, their historical contexts, their theoretical implication and cultural significance. This course will involve substantial translation work and some practicum exercises. The course is only open to students who have already completed CHES4001. ", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4003", "title": "Research Team Lab", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ProjectWorkshop", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course offers qualified major students an opportunity to learn and develop research skills through contributing as a junior member to a Centre faculty member’s research team and its research project. Only students with proven high levels of language ability in Chinese and English and who have shown academic promise relevant to conducting research are eligible. Entrance to this course requires an invitation from a faculty member to the student to join an existing project. The instructor will offer close supervision on research ethics, methods, processes, and outcomes through thematic reading, discussion, and feedbacks on research assignments.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4004", "title": "Directed Studies Reading", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Discussion", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course is an intensive topical Ox-Bridge style tutorial conducted by a faculty member with between one and five qualified students on a specific subject matter. The faculty member will set the reading list for the term, as well as a set of discussion meetings and essays to be written on the readings. Discussion of the readings and the essays will be led by the students. This course enables students to significantly deepen their comprehension and develop critical analysis of the subject matter. ", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4005", "title": "Directed Studies Practicum", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionProject", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course is an intensive tutorial conducted by an instructor that emphasizes learning through practice. Qualified students can apply to work with a faculty instructor to conduct a small project based in Hong Kong or mainland China to apply what he or she has learned about a chosen topic. The project should be practically oriented, engaging with a particular social issue in Greater China. Students will be guided to collect primary data, conduct policy analysis, and write a policy memo to devise and implement practical measures to help address the issue.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4100", "title": "East Asian Film Genres in a Globalizing World", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "In this course the connections between different cinemas within East and between East Asia and the rest of the world will be explored from a genre perspective. The course will focus on three interrelated genres: the martial arts film, the Eastern Western and the crime film/film noir. Students will be invited to explore genre theory, trace complex webs of creative influences, and appreciate the sameness and difference that characterizes both genre films and our globalizing world. They will also have a chance to apply this new knowledge in practice, by making a short “genre film”.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4101", "title": "Chinese Legal and Justice Cultures", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course explores the historical and contemporary cultures of law and justice in China in an advanced seminar that reads together major scholarship on the subject along with primary source philosophical, religious and literary texts as well as government policy documents and legal case files. The second-half of the course is organized around case study analysis of a series of cases drawn from the classic late imperial magistrate-detective fiction, judicial archives, public protest, and sensational cases debated in the mass media. Sampling a range of secondary readings and source materials, this course explores the changing and enduring patterns and practices of law and justice in China’s past and present.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4102", "title": "China and Regional Order", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course examines China’s changing roles in and approaches towards regional and world systems, with a particular focus on China in Asia and how China might fit into the changing global order. It outlines various theoretical approaches to regional and world systems and international order found in both International Relations and International Political Economy (such as realism, liberal internationalism, constructivism and Chinese thinking on IR), to highlight differing interpretations of China’s international relations. It covers a range of current issues, including maritime disputes and the Belt and Road Initiative.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4103", "title": "Art in Contemporary China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course looks at the history and aesthetics of various arts in China (painting, calligraphy, photography, sculpture, architecture, installation, performance art, video or digital art, etc.), their role in Chinese culture, and in shaping the characteristics of Chinese art in the global context. From the Lingnan School paintings in the late Qing dynasty (1850-1911) to the question of “Chineseness” under the conditions of globalization and digitization (1989-now), we will examine major works of art and analyze primary texts as well as contemporary scholarly writings.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4104", "title": "Chinese Innovation Cultures", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course offers an overview of China’s innovation culture. Since the policies of reform and opening up were initiated in 1978, China has been transformed from a command economy to a market-oriented system and achieved over three decades of rapid growth. China’s innovation culture has been transformed accordingly. This course will address both the historical processes of cultural changes and major innovation issues in contemporary China. It aims to provide a roadmap for the students to have a critical view of China’s business and innovation culture.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4200", "title": "Special Topics in Chinese Studies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkDiscussion", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "", "description": "This course offers qualified students an opportunity to explore at an advanced level a topic determined by the course teacher with respect to student interest or timely relevance, as well as its distinctiveness from current course offerings. The course involves intensive reading and essay writing. Students are expected to meet the course teacher regularly to discuss the readings and formulate critical synthesis of different readings. The teacher will give students feedbacks on each writing assignment to help student improve English academic writing. ", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4500", "title": "Thesis Research Paper", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Centre for China Studies", "requirements": "Pre-requisite: CHES3500", "description": "This course is a writing-intensive seminar for Chinese Studies Majors in their final year of attendance only. This capstone course will give graduating seniors the opportunity to design, research, and write a research paper on a subject in Chinese Studies. Throughout the course, students will formulate a research proposal, conduct research and write a bibliographical essay, and write their final paper in multiple drafts. They will receive feedback and comments from their peers and the instructor, and revise their paper into a final draft.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5001", "title": "Perspectives on Chinese Studies", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students in MA Chinese Studies", "description": "This course introduces students to selected perspectives in the study of China, which will enable them to make sense of the different perceptions and narratives of China, both about its past and present. Students will also be able to understand and communicate with others holding one or more of these views when engaging in matters pertaining to China and its culture.", "outcome": "On completion of this course, successful students will be able to\r 1. define a topic in Chinese Studies and conduct research into that topic using appropriate skills and resources; 2. for those with knowledge of the Chinese language: acquire Chinese language sources from libraries or internet databases; 3. make constructive use of influential theoretical paradigms.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"A-LEC (4350)": {"startTimes": ["13:30"], "endTimes": ["16:15"], "days": [5], "locations": ["Humanities Building 213"], "instructors": ["Professor Kristof VAN DEN TROOST"]}, "B-LEC (3791)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Yasumoto Int'l Acad Park 505"], "instructors": ["Professor Timothy Andrew SUMMERS"]}}}}, {"code": "5002", "title": "Chinese Studies Fieldtrip", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students in MA Chinese Studies", "description": "This course aims to enable students to practice academic skills through a field visit and group projects. A six-day fieldtrip outside Hong Kong will be organized during which students will form small groups and investigate specific research topics in Chinese studies.", "outcome": "Upon completion of the course, students should have: \r 1) developed critical and evaluative skills through direct encounters with primary and secondary sources. \r 2) gained a deeper understanding of specific topics in Chinese studies.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"AF01-FLD (1380)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. CHEN Chih Ting, \n\rProfessor Kristof VAN DEN TROOST"]}}}}, {"code": "5010", "title": "Seminar on Interdisciplinary Chinese Studies I", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students in MA Chinese Studies", "description": "This seminar course will introduce students to research methods and theoretical paradigms in Chinese Studies. Students will define a topic, create a detailed project proposal with annotated bibliography, and design a research plan to be carried out in CHES5020.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5020", "title": "Seminar on Interdisciplinary Chinese Studies II", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students in MA Chinese Studies;Prerequisite: CHES5010", "description": "This seminar course requires students to engage in a substantial Chinese Studies research project the outcome of which will be presented in a public forum at the end of the semester.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5101", "title": "Selected Themes on Gender in China", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "Students in MA in Chinese Studies, MPhil in Chinese Studies and PhD in Chinese Studies", "description": "This course deals with selected topics on the study of gender in China. Details to be confirmed by the teacher concerned.", "outcome": "To gain better understanding and insight in the study of gender in China. Details to be confirmed by the teacher concerned.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (1623)": {"startTimes": ["13:30"], "endTimes": ["16:15"], "days": [2], "locations": ["Wu Ho Man Yuen Bldg 304"], "instructors": ["Ms WU Wing Shan, \n\rMs. SUN Lin"]}}}}, {"code": "5102", "title": "Selected Themes on Chinese International Relations", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "Students in MA in Chinese Studies, MPhil in Chinese Studies and PhD in Chinese Studies", "description": "This course deals with selected topics related to China’s international relations. Details to be confirmed by the teacher concerned.", "outcome": "To gain better understanding and insight in the field of China’s international relations. Details to be confirmed by the teacher concerned.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (1859)": {"startTimes": ["13:30"], "endTimes": ["16:15"], "days": [2], "locations": ["Wu Ho Man Yuen Bldg 301"], "instructors": ["Professor Severine ARSENE"]}}}}, {"code": "5103", "title": "Selected Themes on Chinese Literature", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course deals with selected topics in the field of Chinese literature. Details to be confirmed by the teacher concerned.", "outcome": "To gain better understanding and insight of Chinese Literature. Details to be determined by teacher concerned.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (3105)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Wu Ho Man Yuen Bldg 304"], "instructors": ["Professor TAM King Fai"]}}}}, {"code": "5104", "title": "Selected Themes on Chinese Literature II", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students in Division of China Studies", "description": "This course deals with selected topics in the field of Chinese Literature. Details to be confirmed by the teacher concerned.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5105", "title": "Selected Themes on Chinese History", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course deals with selected topics in the field of Chinese History. Details to be confirmed by the teacher concerned.", "outcome": "On completion of this course, successful students will be able to\r 1. define a topic in Chinese Studies and conduct research into that topic using appropriate skills and resources; 2. for those with knowledge of the Chinese language: acquire Chinese language sources from libraries or internet databases; 3. make constructive use of influential theoretical paradigms.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (1354)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor Michel Paul Emile BONNIN"]}}}}, {"code": "5106", "title": "Selected Themes on Chinese Anthropology", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students in Division of China Studies.", "description": "This course deals with selected topics in the field of Chinese Anthropology. Details to be confirmed by the teacher concerned.", "outcome": "To gain better understanding and insight in the field of Chinese Anthropology. Details to be confirmed by the teacher concerned.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (1857)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 301"], "instructors": ["Ms. SUN Lin"]}}}}, {"code": "5107", "title": "Selected Themes on Chinese Business", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students in Division of China Studies.", "description": "This course deals with selected topics in the field of Chinese Business. Details to be confirmed by the teacher concerned.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5108", "title": "Selected Themes on Chinese Politics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students in Division of China Studies.", "description": "This course deals with selected topics in the field of Chinese Politics. Details to be confirmed by the teacher concerned.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5109", "title": "Selected Themes on Chinese Religion", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course deals with selected topics in the field of Chinese Religion. Details to be confirmed by the teacher concerned.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5110", "title": "Selected Themes on Chinese Media", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students in MA Chinese Studies", "description": "This course will introduce students to essential questions related to the digital transformation of China, such as the rise of online social movements and digital contention, censorship and control, the digitization of the state and efforts to encourage indigenous technology, as well as the notion of China as a new global cyberpower. The structure of the course will help students understand the articulation between different facets of digital China: political economy, social movements, and geopolitics. A choice of readings will provide opportunities to discuss various methods used to study digital politics, from ethnographic observation and interviews to digital humanities. ", "outcome": "After completing the course, students should:\r - have a basic understanding of the landscape of Chinese digital industry and services, \r - understand the articulation of the digital with social movements and transnational trends;  - be able to discuss the different research methods one can use to study the developments of the digital from a social science perspectives.", "syllabus": "Part 1: Infrastructure policy and the creation of the Chinese digital landscape\r Sessions 2-5 \r Telecommunication policy in the 80s, 90s and 2000s \r Stages of the evolution of Internet services\r Forms of the digital divide\r The digitization of the state, from e-government to the social credit system\r  Part 2: Social media, social movements and the control of online public opinion \r Sessions 6-9\r Digital cultures\r Online nationalism\r Online social movements, citizen journalism\r Online censorship and propaganda – the Chinese model\r  Part 3: China and the global Internet\r  Sessions 10-12\r  Global Internet governance organizations and China's positions\r  Indigenous innovation vs. innovation transfer\r  Cybersecurity, cyberspying and cyberwar", "required_readings": "Part 1\r HONG, Yu. Networking China: The Digital Transformation of the Chinese Economy. University of Illinois Press. Chicago, 2017. \r SCHLAEGER, Jesper. E-Government in China: Technology, Power and Local Government Reform. Routledge, 2013.\r  Part 2\r ARSENE, Séverine. « From Self-Censorship to Social Protest ». Revue Française de Science Politique (English) 61(5) (2012): 53 74. \r HAN, Rongbin. Contesting Cyberspace in China. New York: Columbia University Press, 2018.\r ROBERTS, Margaret E. Censored: Distraction and Diversion Inside China’s Great Firewall. Princeton University Press, 2018. \r STOCKMANN, Daniela. « Toward Area-Smart Data Science: Critical Questions for Working With Big Data From China ». Policy & Internet 10, no 4 (2018): 393 414.\r  Part 3\r ARSENE, Séverine. « China, Internet Governance and the Global Public Interest ». In A New Responsible Power China?, in Ines Sieckmann et Odila Triebel (eds). Stuttgart: Institute for Foreign Cultural Relations (ifa), 2018. https://publikationen.ifa.de/en/Periodicals/ifa-Edition-Culture-and-Foreign-Policy/A-New-Responsible-Power-China.html.\r CREEMERS, Rogier. « The Pivot in Chinese Cybergovernance ». China Perspectives, no 2015/4 (2015): 5 13.", "recommended_readings": "HEROLD, David Kurt, and Peter MAROLT, eds. Online Society in China: Creating, Celebrating, and Instrumentalising the Online Carnival. Abingdon, Oxon ; New York: Routledge, 2011. \r JIANG, Min and King-Wa FU. « Chinese Social Media and Big Data: Big Data, Big Brother, Big Profit? » Policy & Internet 10, no 4 (2018): 372 92. \r LAGERKVIST, Johan. « The Techno-cadre’s Dream: Administrative Reform by Electronic Governance in China Today? » China Information 19, no 2 (1 juillet 2005): 189 216. \r MCDONALD, Tom. Social Media in Rural China. London: UCL Press, 2016.\r QIU, Jack Linchuan. Working-class network society : communication technology and the information have-less in urban China. Information revolution and global politics. Cambridge, Mass.: MIT Press, 2009.\r SCHNEIDER, Florian. China’s Digital Nationalism. Oxford: Oxford University Press, 2018.\r TSUI, Lokman. « The coming colonization of Hong Kong cyberspace: government responses to the use of new technologies by the umbrella movement ». Chinese Journal of Communication 8, no 4 (2 octobre 2015): 1 9.\r WALLIS, Cara. Technomobility in China. New York and London: New York University Press, 2013.\r YANG, Guobin. China’s Contested Internet. Copenhagen: NIAS press, 2015.", "terms": {"2020-21 Term 2": {"--LEC (1026)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Cheng Yu Tung Building 203"], "instructors": ["Professor Severine ARSENE"]}, "-T01-TUT (1796)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Severine ARSENE"]}}}, "assessments": {"Essays": "30", "Others": "20", "Presentation": "20", "Short answer test or exam": "30"}}, {"code": "5115", "title": "Chinese Business and Economy", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "For several decades China has impressed the world with its rapid and steady economic growth. At the same time, the Chinese economy faces many uncertainties and considerable risks. In order to deepen students’ understanding of Chinese business and economy, this course will address historical reforms as well as crucial economic issues in contemporary China. The first part will examine how China’s economic transformation unfolded and identify crucial forces behind its current shape. The second part will investigate the problems and challenges that China is facing and the impacts of China’s high-speed growth on the international and domestic front. Institution-focused and practice-oriented cases studies will be included in this course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5124", "title": "Housing and Urban Governance in Contemporary China", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course looks at the transformation of housing governance in urban China since the 1990s. The class will first introduce various perspectives to understand the role and importance of housing in general. It will then acquaint students with some basic policy analysis and evaluation skills. The following lectures will look at the Chinese context and investigate the structural change of China’s housing system and its impacts on urban society. By way of comparison, Hong Kong’s experience will be explored as well. Subsequently the course will cover a number of current housing policy issues in both mainland China and Hong Kong, such as development of affordable housing, real estate fever, protection of private property, and housing management. Particular attention will be paid to the interplay between changes in the housing sector and broader socio-political developments in contemporary China. Site visits will be conducted in Hong Kong and/or its neighbouring cities.", "outcome": "Upon successful completion of this course, students should be able to:\r 1) understand the historical process of housing privatisation in Mainland China since 1979; 2) grasp how transformations in the housing sector have triggered other changes in urban livelihood; 3) critically analyse current housing and urban governance issues in China.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (2802)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [1], "locations": ["Wu Ho Man Yuen Bldg 508"], "instructors": ["Dr. YEH Kuo Hao"]}}}}, {"code": "5126", "title": "China on Screen", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "Many 20th century Chinese films were mainly concerned with issues of nationhood, identity, trauma, and a national past. In recent years, however, while some directors have continued to focus on the nation, others have chosen to look at the present, as well as the effects of globalization on Chinese society, culture, and cinema production. This course asks that students begin to understand Chinese cinema(s) as transnational, a triangular composite of Mainland, Taiwan, and Hong Kong cinemas that has also been influenced by Japanese and Korean cinema. Students will be introduced to Chinese film history and criticism via an examination of thirteen films directed by several of Greater China's most skilled directors.", "outcome": "On completion of this course, successful students will be able to\r 1. define a topic in Chinese Studies and conduct research into that topic using appropriate skills and resources; 2. for those with knowledge of the Chinese language: acquire Chinese language sources from libraries or internet databases; 3. make constructive use of influential theoretical paradigms.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (3046)": {"startTimes": ["13:30", "10:30"], "endTimes": ["14:15", "12:15"], "days": [2, 4], "locations": ["Yasumoto Int'l Acad Park 505", "Lee Shau Kee Archi Bldg G03"], "instructors": ["Professor TAM King Fai", "Professor TAM King Fai"]}}}}, {"code": "5127", "title": "The Male Bond in Traditional China", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "Romance of the Three Kingdoms and The Outlaws of the Marsh, two masterpieces of classical Chinese fiction, are treasure troves of traditional Chinese values. This course will focus on the phenomenon of male bonding, an important facet of masculinity, as illustrated in these two works. Through a close study of major selections from the novels, their filmic adaptations, background materials and critical literature, students will come to understand the nature of close relationships between men in Chinese culture, observable in many social situations even today.", "outcome": "On completion of this course, successful students will be able to\r 1. define a topic in Chinese Studies and conduct research into that topic using appropriate skills and resources; 2. for those with knowledge of the Chinese language: acquire Chinese language sources from libraries or internet databases; 3. make constructive use of influential theoretical paradigms.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (3490)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [5], "locations": ["Yasumoto Int'l Acad Park LT9"], "instructors": ["Professor TAM King Fai"]}}}}, {"code": "5128", "title": "Foreign Direct Investment In China - Theories And Practices", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "", "description": "This course aims to develop students' ability to acquire and manage interdisciplinary knowledge in relation to foreign direct investment (\"FDI\") in China. The course will guide students to approach the topic from economic, historical, socio-cultural, legal and business angles. Student will be exposed to a wide spectrum of research materials that deal with FDI from the view point of a policy maker to a money-maker. Latest investment trend for private equity and venture capital, basic skills and processes for undertaking and managing direct investment in China will also be discussed.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5129", "title": "The Revival Of Confucianism In Contemporary China", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "", "description": "Since the mid-1980s China has witnessed the most sustained revival of interest in Confucianism (variously conceived as a form of culture, an ideology, and a tradition of morally normative values) of the past century. This revival has led to the proliferation of contending conceptions of the historical form and function of Confucianism, as well as proposals to rejuvenate Confucianism in order to make it a vital cultural and psycho-spiritual (jingshen) resource in the modern world. The course examines this remarkable revival of intellectual and popular interest in Confucianism in China over the past two decades.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5130", "title": "China's Regions and their Global Interactions", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course outlines the major regional differences in contemporary China, and their relations to China's global interactions,with a particular\r focus on the country's less developed western regions. It covers issues of Chinese foreign policy and international interactions, the nature of the\r economic and social transformations in the PRC over recent decades, and questions of particular relevance to western China such as levels of \rdevelopment, ethnic minorities and the sensitive regions of Tibet and Xinjiang. In conclusion, the course evaluates the future implications of the \rchanging geography of China's political economy for its global relationships.", "outcome": "Upon successful completion of this course, students are expected to:\r • be able to discuss regional differences in the PRC, in particular issues facing the western regions of China;  • understand the relevance of this regional approach to the main trends in China’s contemporary global interactions; • demonstrate an improved ability to present clear oral and written analysis of issues of political economy.", "syllabus": "1. Introduction\r 2. Historical overview of China’s global interactions\r 3. The geography of post-1949 economic and social transformations\r 4. PRC foreign policy in a changing world \r 5. Develop the West and Regional Development Policies\r 6. China’s Asian neighbours and changing trade and investment patterns\r 7. Ethnic minorities and issues of regional development\r 8. Tibet and Xinjiang\r 9. Transborder regional organizations and China’s borderlands\r 10. Yunnan province and the southwest\r 11. Global interactions: China’s western regions and rebalancing of the global economy", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (3859)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Wu Ho Man Yuen Bldg 304"], "instructors": ["Professor Timothy Andrew SUMMERS"]}}}, "assessments": {"Others": "80", "Presentation": "20"}}, {"code": "5131", "title": "East Asian Regional Governance", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course examines issues of governance and regional integration in East Asia. Since the 1990s there has been a substantial increase in the number and scope of regional institutions covering both Southeast and Northeast Asia, and between the two regions. This course looks at how these developments have taken place and why, and at the implications for East Asia and beyond. It places examination of these institutions in the context of developments in global political economy, as well as examining the role in the region of large powers such as China; the continued importance of the nation-state in East Asia is one of the themes of the course. The course begins by placing the study of contemporary East Asia in its historical context, and outlining a number of theoretical concepts which are helpful in studying issues of regional formation.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5132", "title": "Media Business: China, Hong Kong and Taiwan", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course provides an overview of the development of media business in China, Hong Kong, and Taiwan from the 1970s. Particular attention will be given to the response of media industries and media professionals to the challenges posed by commercialization, globalization, deregulation, and the new media. Students will also be exposed to the impact of differing cultural practices and regulatory regimes in China, Hong Kong, and Taiwan over the management and operation of media businesses", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5133", "title": "Trauma and Memory in 20th and 21st Century China", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course will offer an overview of modern Chinese history by way of some of the traumatic events of the past eighty years. We will focus on seven such events: the Nanjing Massacre (1937), the 228 Incident (1947), the Anti-Rightist Movement (1957), the Great Proletarian Cultural Revolution (1966-1976), the June Fourth Incident (1989), the Hong Kong Handover (1997), and the Sichuan Earthquake (2008). These events represent different types of trauma: from the mostly “centripetal” trauma of 1937 to the “centrifugal” traumas of the Cultural Revolution and June Fourth, and from the unique “anticipatory” trauma of the Hong Kong Handover to the trauma caused by a natural disaster such as the Sichuan earthquake. Students will be asked to reflect on the way traumas are remembered, and to which use historical events are put in different contexts. Central themes of the course will be history and its representation, the function of memory and trauma in the construction of (national) identity, the moral issues involved in the representation of trauma, and the importance of remembering. The selected traumatic events will be approached by way of their representation in film and literature.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5134", "title": "East Asian Film Genres in a Globalizing World", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "In this course the connections between different cinemas within East Asia and between East Asia and the rest of the world will be explored from a genre perspective. Hong Kong and Korean crime movies, Chinese swordplay and Japanese samurai films, and horror films from Japan and Thailand: all are examples of the transnational circulation of genres, involving both processes of localization and globalization. The course will focus on three interrelated genres: the martial arts film, the Eastern Western and the crime film/film noir. Students will be invited to explore Hollywood-based genre theory, trace complex webs of creative influences, and appreciate the sameness and difference that characterizes both genre films and our globalizing world. They will also have a chance to apply this new knowledge in practice, by making a short “genre film” for screening at the end of the term.", "outcome": "After completing this course, students should: \r 1) have a firm grasp of basic genre theory; 2) be familiar with the different East Asian film industries and some of their directors; 3) be able to use genre as a critical tool in analyzing and making films; 4) have a basic understanding of film language and film production.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (1293)": {"startTimes": ["18:30", "18:30"], "endTimes": ["21:15", "20:15"], "days": [5, 3], "locations": ["Wu Ho Man Yuen Bldg 508", "Y.C. Liang Hall G04"], "instructors": ["Dr. WONG King Tung", "Dr. WONG King Tung"]}}}}, {"code": "5135", "title": "State and Civil Society in Contemporary China", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course will seek to understand the implications of the transforming relations between the Chinese state and civil society on China’s political development. It will first examine the concept of civil society and discuss major issues in applying it in the Chinese context. The class will then investigate the transforming relations between the Chinese state and civil society by examining key issue areas of environmental, labour, and homeowner activism, popular protest, the online and traditional media, as well as the Chinese policy-making process. This course will also provide opportunities for students to have face-to-face exchange with leaders from various societal organizations in China.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5136", "title": "Hong Kong and Mainland China: Interaction and Integration", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course aims to provide students with a broader and deeper understanding of the increasingly intimate relationship between Hong Kong and Mainland China. The lecture topics are organized according to three dimensions of this liaison: political, economic and social. The lectures will introduce appropriate conceptual frameworks to understand this process and reflect on the meanings and practices of \"One Country Two Systems\". Students will be guided to debate relevant and contested public policies in class.", "outcome": "Upon successful completion of this course, students should be able to:\r 1. understand the critical issues in Hong Kong and Mainland China integration; 2. identify the underlying factors and mechanisms that drive the dynamic interaction between Hong Kong and Mainland China; 3. critically analyse significant social, political, economic and environmental issues in the process of Hong Kong and Mainland integration.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (2889)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [3], "locations": ["Wu Ho Man Yuen Bldg 304"], "instructors": ["Dr LEUNG Kai Chi"]}}}}, {"code": "5137", "title": "Justice and Law in Modern China", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course explores the intersections of justice, law and morality in modern and contemporary China. The first half of the course engages the history of these interrelating elements in theory and practice from late imperial times through the Maoist and Post Mao era. The second half of the course invites students to explore and debate major problems of law, legal reform and justice in contemporary China.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5138", "title": "Chinese Political and Economic Reforms since the Early 1980s", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course charts the trajectory of major political and economic policies since the late patriarch Deng Xiaoping kicked off the Era of Reform in the late 1970s. Efforts to liberalize Mao Zedong-style authoritarianism – and to introduce grassroots elections and other forms of democracy – will be examined. Also analyzed will be measures taken by the leaderships under ex-president Jiang Zemin and President Hu Jintao to introduce international norms to modernize the cadre system and the civil service. “Intra-party democracy” as well as reforms in the legal and judicial systems will be assessed. The evolution and significance of Beijing’s policies toward NGOs, dissidents, the media and the Internet will also be studied. This course also looks at reforms in the industrial, agricultural and financial sectors that have made possible China’s emergence as the world’s second largest economy. The “China model” – a mixed economy where state fiats coexist with market forces – will be analyzed. The comparative roles of state-owned enterprises, foreign direct investments and the fast-developing private sector will be examined. Also appraised will be whether Beijing is successful in turning the “world factory” into a “global innovation hub.” The course will conclude with a look at whether economic and political reforms undertaken by Beijing have satisfied the people’s aspirations – and helped render the country into a “responsible stakeholder” in the international order.", "outcome": "After taking the course, students will acquire\r - An adequate understanding of Chinese political, economic and legal institutions; - A good grasp of the major initiatives and policies behind the Era of the Reform and Open Door, which is still on-going;  - An ability to analyze specific reform policies given China’s unique national conditions as well as the country’s interactions with the global community.\r - A capacity to assess the achievements or shortcomings of reform policies in relation to the country’s basic political and economic structure.\r - An ability to make suggestions regarding how certain political or economic reform policies can be improved to suit the fast-shifting changes in the 21st century.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (1607)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor LAM Wo Lap"]}}}}, {"code": "5139", "title": "The Chinese Diaspora in a Globalizing World", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course aims at exploring the concept of diaspora in the Chinese context, as well as its evolvement and implications in a globalizing world. Students will learn about the origins of Chinese migration, identity issues concerning Chinese overseas, and the role of transnational Chinese networks in the rise of contemporary China. A mix of theoretical readings and empirical case studies will be covered, and students will be encouraged to take an active role in class discussions.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5141", "title": "US-China Relations", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course examines the relationship between a rising China and the existing superpower, the United States, a bilateral relationship that is widely acknowledged as the most important in today’s world. The course will be issue-oriented, focusing on disputes between the two countries and will look at such issues as Taiwan, human rights, international law, territorial disputes, nuclear proliferation, trade and non-trade economic issues as well as the global cooperation and competition between the United States and China.", "outcome": "After completing this course, students should:\r 1) be able to place the current US-China relationship in a larger historical and geopolitical context\r 2) be familiar with the key figures in the past and present of US-China interactions\r 3) be able to connect the US-China relationship to larger issues facing the world", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (1279)": {"startTimes": ["11:30"], "endTimes": ["14:15"], "days": [4], "locations": ["Yasumoto Int'l Acad Park 1118"], "instructors": ["Professor Stephan ORTMANN"]}}}}, {"code": "5142", "title": "Hongloumeng, or the Story of the Stone", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course introduces the classic 18th-century novel, using edited extracts from the Penguin Classics translation by David Hawkes and John Minford. The work is studied as a culminating masterpiece in the long history of Chinese vernacular fiction, with special emphasis placed on the influence of the late-Ming novel Golden Lotus as a forerunner. The plot and structure of the novel are explained in some detail. Important themes in the novel are dealt with, its encyclopedic nature allowing a broad-ranging exploration of cultural and social issues in traditional China.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5143", "title": "Comparative Politics and China", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "What are democracies and autocracies? What are the key differences between the two? How to classify regimes? How to define China’s regime type? What are the main types of electoral systems in the world? How to classify China’s electoral process? What are the crucial features of bureaucracies, legislatures and political parties? What is “traditional” political activism? What are the new “repertoires” in China? To address these questions, this course will introduce students to the theories of comparative politics, focusing in particular on the situation in China. It will provide students with analytical skills from a global perspective, followed by in-depth discussion of contemporary China. This course will be structured in four parts including States and Regimes; Institutions; Actors; and Policies. Topics involve the nation state; democracy; variety of regimes; constitutions; electoral systems, bureaucracies; legislatures; political parties; interest groups and social movements; political culture; political activism; political communication; policy making processes and so forth. Each class will start with the introduction of relevant theories, followed by a comparative analysis of China in the second half.", "outcome": "Upon successful completion of this course, students should be able to:\r  • grasp the nature of comparative politics and its methods.\r • understand the process of state formation and the classification of regime types.\r • evaluate the structure of political institutions.\r • critically analyze the role of political actors.\r • gain a comparative understanding of China’s politics.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (2977)": {"startTimes": ["18:30"], "endTimes": ["21:15"], "days": [4], "locations": ["Wu Ho Man Yuen Bldg 506"], "instructors": ["Professor WANG Shiru"]}}}}, {"code": "5144", "title": "China’s Regional Foreign Relations", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This seminar is designed as a survey of relations between China and selected Asian region states with primary focus on the post-1949 period. Initial sessions will focus on the origins and content of China’s policies toward the region. Varying assessments will be presented regarding China’s domestic and international policies, policy-making structures, and political and economic trends and capabilities. Later sessions will consider bi-lateral relations between China and major regional neighbors: Japan, Korea (both North and South), the ASEAN states, the Hong Kong SAR, and Taiwan. Region-wide themes such as human rights and religious freedom, inter-governmental and non-governmental organizations and integration, and China’s military development will be assessed within the context of China’s regional and global position.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5145", "title": "Chinese Art in the World after 1900: Aesthetics and History", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course looks at the history and aesthetics of various arts in China (painting, calligraphy, photography, sculpture, architecture, installation, performance art, video or digital art, etc.), their role in Chinese culture, and in shaping the characteristics of Chinese art in the global context. The following themes will be dealt with: the aesthetic evaluation of these arts; their unique artistic features; the roles of the artist and the spectator in the context of globalization; the transformation of Chinese art from a perspective of cross-cultural exchange; the influence of Chinese art on the West; the aesthetic valuation of expressiveness and descriptiveness in art; and the cultural correlation between art and society. Historically, the course will cover the following areas: the artistic importance of the Lingnan School paintings in the late Qing dynasty (c.1850-1911), the evolution of Western and traditional painting in China (1911-1949), the art development during the Cultural Revolution (1966-1976), the cross-cultural exchange between Chinese art and Western art (1976-1989), and the question of “Chineseness” under the conditions of globalization and digitization (1989-now). We will deal with these topics by examining major works of art and by analyzing primary texts as well as contemporary scholarly writings.", "outcome": "After completing the course, students should:\r 1) be equipped with the essential techniques to examine the artistic features of any art work; 2) have a basic understanding of Chinese art history and aesthetics since 1900;  3) be able to critically analyze various aesthetic and artistic issues in Chinese art, and to participate in relevant scholarly debates.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (1684)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Wu Ho Man Yuen Bldg 304"], "instructors": ["Dr. KWOK Yin Ning"]}}}}, {"code": "5147", "title": "Modern Chinese Literature", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course deals with selected topics in the field of modern Chinese literature. Details to be confirmed by the teacher concerned.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5148", "title": "Museum Encounters: Artistic and Cultural Interactions between China and the World", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course considers China’s connections with other places in the world through visual and material culture inside museums. We will cover the functions and roles of the earliest museum, as well as those of museums housing Chinese objects in the contemporary world. In addition to considering the display of Chinese artworks and artifacts in museums, we will also discuss the way museums are designed and positioned in their marketing strategies by making reference to their history and development. Finally, we will explore the interactions between China’s museums and those of its neighbors in Asia and the world. Topics covered in this course include terracotta in China and in Britain; Chinese trade arts in different media, such as silk, glass, porcelain and painting; visions of China in European and American museums; and contemporary Chinese art in a globalized world.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5149", "title": "China and Regional Order in Asia", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course will look at China’s changing political, economic and security relationships in Asia. It argues that these need to be understood in the context of the ongoing evolution and negotiation of Asian regional order and institutions in the aftermath of the Cold War, and that this Asian context (broadly defined) helps account for the objectives of and some apparent ambiguities and contradictions in Chinese foreign and security policy. The course will cover major theoretical approaches in International Relations and global political economy, and use these to evaluate China's relationships in Asia.", "outcome": "On completion of the course, students:\r 1) should have a strong understanding of the main issues in China’s relationships in Asia; 2) be able to discuss these issues critically using major theoretical concepts in International Relations and related disciplines.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (3413)": {"startTimes": ["14:30", "13:30"], "endTimes": ["16:15", "14:15"], "days": [1, 3], "locations": ["Leung Kau Kui Bldg 101", "Lee Shau Kee Archi Bldg G03"], "instructors": ["Professor Timothy Andrew SUMMERS", "Professor Timothy Andrew SUMMERS"]}}}}, {"code": "5150", "title": "Chinese Painting: Aesthetics and History", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course looks at the history and aesthetics of Chinese painting and its role in Chinese culture, showing that art and life often are closely intertwined with each other. The following themes will be dealt with: the aesthetic evaluation of painting; the pictorial features unique in Chinese ink painting; the roles of the artist and the spectator; the aesthetic principles of Chinese painting; the cultural hierarchy of painting, poetry and calligraphy; the aesthetic valuation of expressiveness and descriptiveness in painting; and the cultural correlation between the quality of a painting and the virtue of the painter. Historically, we will cover landscape painting since the Five Dynasties (907 to 960), the evolution of literati painting since the Song dynasty (960-1279), the evaluation of painting in the Ming dynasty (1368-1644), the eccentric culture in big cities in Qing China (1644-1911), and the cultural assimilation of European painting since the 20th century. We will deal with these topics by examining major works of painting and by analyzing primary texts as well as contemporary scholarly writings.", "outcome": "After completing the course, students should:\r 1) be equipped with the essential techniques to examine the pictorial features of any Chinese painting; 2) have a basic understanding of Chinese painting history;  3) be able to critically analyze various aesthetic and artistic issues in Chinese painting, and to participate in relevant scholarly debates.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (1560)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. KWOK Yin Ning"]}}}}, {"code": "5151", "title": "Selected Themes on Chinese Art History", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course deals with selected topics in the field of Chinese art history. Details to be confirmed by the teacher concerned.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5152", "title": "\"Ethnic Minorities\" in China: Historical Perspectives and Contemporary Issues in Anthropology", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "Students in MA in Chinese Studies, MPhil in Chinese Studies and PhD in Chinese Studies", "description": "This course explores both historical and anthropological issues relevant to China’s minority groups. The first half of the course will be devoted to the political and historical connections from the late Qing Empire to the 1980s that led to the creation and governance of the 56 “nationalities” in China. The second half of the course will address various contemporary topics on “ethnic minorities” in the field of anthropology: frontier societies’ encounters, nomadic societies in transition, commodification of “ethnic culture,” ethnic tourism, and religious revival.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5153", "title": "China and World History in the Twentieth Century", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "Students in MA in Chinese Studies, MPhil in Chinese Studies and PhD in Chinese Studies", "description": "This course aims to present the political, cultural and diplomatic connections between China and the world from the end of the nineteenth to the twentieth century. Among the subjects are: the treaty system, the two global conflicts, the development of ideologies such as fascism and communism, and the connections between China, the US, the Soviet Union and Europe. Besides discussing relevant literature about China’s international relations and its position in world history, students will be invited to analyse primary sources, such as newspaper articles, treaties, diaries, and visual sources.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5154", "title": "Politics and Economy of China, 1900s – 1990s", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "Students in MA in Chinese Studies, MPhil in Chinese Studies and PhD in Chinese Studies", "description": "This course will discuss and analyse a complex juncture between politics and economy in 20th century China. The main goal of the course is to see how economic conditions affected and influenced political choices and decisions of the late-Qing, Republican and Communist regimes that governed Chinese people throughout a turbulent century of war and revolution. The most important questions we are going to discuss during the course are as follows: what were the living conditions of Chinese people and how can we study them? How did the economic situation of the country influence policy making and international relations? What was the human, environmental, social, and cultural cost of the economic programmes of the empire, and the Nationalist and Communist Party policies?", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5155", "title": "Urban China", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "Students in MA in Chinese Studies, MPhil in Chinese Studies and PhD in Chinese Studies", "description": "This course will examine key issues of urbanization and urbanity in light of Chinese experiences. Urban development in China since the economic reform has been transformative in its scale and pace of city-building and is a range of outcomes such as rapid economic development, growing income inequality, massive population mobility, and serious institutional challenges. After offering an overview of modern China's quest for urbanization since the late imperial era, this course will focus on the massive and rapid urbanizing process in the post-reform era. Students will be exposed to diverse issues, such as migration, population control, land policy, housing reform, urban planning, spatial reconfiguration, social welfare, inner-city poverty, infrastructure and transportation, environmental protection, and public space. The readings, drawn from multiple disciplines such as economics, sociology, anthropology, history, political science, and urban studies will examine the socioeconomic, political and cultural factors that contribute to the process and its particularities in the late-socialist context. This course will also seek to draw comparative lessons from China's experience to obtain a comparative understanding of the complex socioeconomic consequences and diverse patterns of urbanizing processes across the globe.", "outcome": "By the end of the semester, students should:\r - be familiar with the key issues of urbanization in the Chinese context.\r - be familiar with key concepts and social theories of current research in urban studies.\r - be able to read and understand interdisciplinary academic publications on urban China.\r - develop both oral and written skills to present coherent and succinct analysis.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (4498)": {"startTimes": ["13:30", "14:30"], "endTimes": ["14:15", "16:15"], "days": [3, 1], "locations": ["Esther Lee Bldg 206", "Mong Man Wai Bldg 710"], "instructors": ["Professor LING Minhua", "Professor LING Minhua"]}}}}, {"code": "5156", "title": "Political Economy of China's Reform", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "Students in MA in Chinese Studies, MPhil in Chinese Studies and PhD in Chinese Studies", "description": "This course examines the key aspects of China's institutional reform and political-economic development since the 1980s. It reviews the major policy controversies on China's system transition, and presents the frontier research from the academia, policy think tanks and international institutions. Students will gain a deeper understanding of why and how China has reformed; and to what extent China's experience may be generalized as a model for other developing countries.", "outcome": "By the end of the semester, students should:\r • gain a better understanding of the processes and mechanisms of China's reform and institutional evolution since the 1970s\r • be familiar with various theoretical approaches and conceptual frameworks from the political-economic perspective to analyze China's reform\r • be able to critically evaluate the major reform policy debates in contemporary China.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (4507)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Wu Ho Man Yuen Bldg 507"], "instructors": ["Ms LAM Chi Mei, \n\rMs WU Wing Shan, \n\rProfessor LI Chen"]}}}}, {"code": "5157", "title": "China under Mao", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "Students in MA in Chinese Studies, MPhil in Chinese Studies and PhD in Chinese Studies", "description": "Almost forty years after the death of Mao, China is still coming to grips with what historians now call the Mao era, from the founding of the People's Republic in 1949 to his death in 1976. The Mao era has had a profound impact on China's politics, economy, society, and culture; it is still being felt today. Examining both primary sources and recent scholarship on the Mao years, this course studies the waves of political movements and how they affected the lives of the Chinese people.", "outcome": "By the end of the semester, students should:\r - understand the main political movements of the Mao era, and how they affected the Chinese people.\r - be able to analyze primary sources and secondary scholarship, using these texts to create arguments and support them with evidence.\r - understand how the Mao era continues to affect China today.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (4441)": {"startTimes": ["12:30", "8:30"], "endTimes": ["13:15", "10:15"], "days": [1, 4], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor Jan Francis KIELY", "Professor Jan Francis KIELY"]}}}}, {"code": "5158", "title": "Non-Traditional Security in Contemporary China", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "Students in MA in Chinese Studies, MPhil in Chinese Studies and PhD in Chinese Studies", "description": "In this course we are trying to make sense of potential threats that can lead to situations of national and human insecurity in China in the 21st century. The course begins with an introduction to the key theories and methodological approaches of the International Relations and Security Studies, before moving onto an exploration of an array of contemporary non-traditional security issues in the country. By the end of this course, you should have a more nuanced understanding of security threats in contemporary China and be able to use some of the theories in the discipline to explain why certain issues become threats and how political actors have sought to mitigate and resolve them.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5201", "title": "Independent Study Project", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Independent StudyLecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "Students are required to carry out an independent study of a selected topic in Chinese Studies under staff supervision, and to submit a report on which the evaluation is based.", "outcome": "On completion of this course, successful students will be able to\r  define a topic in Chinese Studies and conduct research into that topic using appropriate skills and resources;  for those with knowledge of the Chinese language: acquire Chinese language sources from libraries or internet databases;  make constructive use of influential theoretical paradigms.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"-I01-IND (3995)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. Judith Michele Nathalie AUDIN, \n\rMr. KIM Jin Goon, \n\rProfessor David William FAURE, \n\rProfessor GAO Yunwen, \n\rProfessor John LAGERWEY, \n\rProfessor Kristof VAN DEN TROOST, \n\rProfessor Timothy Andrew SUMMERS, \n\rProfessor YAU Ching"]}, "BI01-IND (1160)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}}}, {"code": "6001", "title": "Critical Cultural History of China: Early China", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course will propose a multi-disciplinary approach to the study of Chinese cultural history conceived of as a succession of modes of rationality (philosophical, bureaucratic, and economic processes of rationalization). The focus will be on the moments of paradigm shift from one mode of rationality to another. For each of these moments, cultural facts and artifacts—thought, literature, ritual—will be examined in relationship to changing social, political, and economic systems. This semester will cover the periods of the Warring States (481-221 BCE) and the Six Dynasties (220-589 CE). The first laid the social and cultural foundations for the emergence of the imperial mode of rationality; the second saw the Buddhist \"conquest\" of China and the emergence of a rationality defined by the opposition of the Three Teachings to shamanism, that is, of a clear contrast between elite and popular culture.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6002", "title": "Critical Cultural History of China: Modern China", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students under Division of China Studies", "description": "This course will focus on the emergence of two modern Chinas, that of the gentry and that of the people: 1) the re-emergence of Confucianism as \"this culture of ours\", eventually leading to the creation of lineage China in the 16th century; 2) the emergence of \"popular culture\", which includes a popular, increasingly state-supported pantheon of local gods, local festivals built around these gods, and popular literature (from the bianwen of the Tang to the xiaoshuo of the Ming). Particular attention will be paid to the parallel transformations of the economy and of the legal system in Ming-Qing China.", "outcome": "Students will:\r - learn a critical analytical approach to studying Chinese cultural history. \r - appreciate the development of the emergence of the cultures of the gentry , the re-emergence of Confucianism and rise of lineage society in imperial and late imperial times. \r - see how the modern attack on religion, redefined as \"superstition\", led not only to religious reform movements but also to a society in which science and the nation became the primary value systems promoted by the state.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (3357)": {"startTimes": ["8:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor John LAGERWEY"]}}}}, {"code": "6003", "title": "Chinese Literature Seminar", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students in MA Chinese Studies;For students in MPHIL Chinese Studies;For students in PHD Chinese Studies", "description": "This course explores Chinese literature for advanced students with at least a basic knowledge of Chinese literature. Topics may be defined by historical period, literary genre, theme, or aesthetic or theoretical issue. In addition to the close reading and analysis of primary texts, students will be required to read relevant works of critical research.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6004", "title": "Selected Topics in China’s Political Economy", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students in MA Chinese Studies;For students in MPHIL Chinese Studies;For students in PHD Chinese Studies", "description": "This course examines the key aspects of China’s political-economic reform since the 1980s. By discussing the research literature on selected topics in China’s transition, students will gain a deeper understanding of why and how China has reformed; and to what extent China’s experience may be generalized as a model for other developing countries.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6010", "title": "China Seminar I", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students in MPhil & PhD Chinese Studies", "description": "This course examines major interpretations and scholarly works in particular fields of Chinese Studies. Course content and format is determined by the instructor(s).", "outcome": "Students will: \r - Become familiar with the disciplinary, temporal, geographic, theoretical breadth of Chinese studies.\r - Become familiar with the particular evolution of several fields of study within Chinese studies and their recent developments and emerging questions.\r - Learn to critically analyze major research studies and evaluate their methods, theories and contributions to the field.", "syllabus": "Syllabus Themes:\r The History of Chinese Studies\r The Current State of Chinese Studies\r Studying Chinese Religion & Culture\r China as A Religious State\r Historiography & Modern Chinese History\r Theory & Method In the Study of 20th Century China\r Telling the History of Modern Chinese Fiction\r Literary Criticism & 20th Century Chinese Fiction In the Age of Theory", "required_readings": "John Lagerwey, China: A Religious State\r Kenneth Dean, Lord of the Three in One\r Edward Davis, Society and Supernatural in Song China \r C. T. Hsia, History of Modern Chinese Fiction \r David Wang, Fin-de-Siecle Splendor\r Rey Chow, Modern Chinese Literary and Cultural Studies in the Age of Theory\r Paul Cohen, Discovering History in China\r Prasenjit Duara, Rescuing History from the Nation", "recommended_readings": "John Lagerwey, Early Chinese Religion\r Max Weber, The Religion of China\r Robert Hymes, Way and Byway\r Stephen Teiser, The Ghost Festival in Medieval China\r Patrick Hannan, Chinese Fiction of the Nineteenth Century and Early Twentieth Century\r Perry Link, Mandarin Ducks and Butterflies \r Tani Barlow, Gender Politics in Modern China \r Lydia Liu, Translingual Practice\r Leo Lee, Shanghai Modern \r Joseph Levenson, Confucian China and its Modern Fate\r Paul Cohen, History in Three Keys\r Henrietta Harrison, The Making of the Republican Citizen\r John Fitzgerald, Awakening China \r Elizabeth Perry, Challenging the Mandate of Heaven", "terms": {"2020-21 Term 1": {"-S01-SEM (2693)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor LI Chen"]}}}, "assessments": {"Essays": "50", "Others": "20", "Presentation": "30"}}, {"code": "6020", "title": "China Seminar II", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students in MPhil & PhD Chinese Studies", "description": "This course examines the principles and methods of Chinese Studies research. Course content and format is determined by the instructor(s).", "outcome": "Students will:\r - Learn how to select a research topic and formulate a research question for their own research paper. \r - Learn how to identify useful sources, methods, theories for their own research paper. \r - Develop their own research project.", "syllabus": "Syllabus themes:\r Identifying a topic & field\r Formulating research question/s\r Texts/sources/data\r Analysis & interpretation\r Arguement & evidence\r Presenting your research", "required_readings": "Daniel Overmeyer, Religion in North China in the Twentieth Century\r David Wang, The Monster that is History \r Eugenia Lean, Public Passions", "recommended_readings": "Adam Chau, Religion in Contemporary China \r Stephen Feutchtwang, Popular Religion in China\r Ann Huss and Jianmei Liu, The Jin Yong Phenomenon \r Arif Dirlik, Postmodernity’s Histories\r David Faure, Emperor and Ancestor", "terms": {"2020-21 Term 2": {"-S01-SEM (2733)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor LI Chen"]}}}, "assessments": {"Essays": "80", "Others": "10", "Presentation": "10"}}, {"code": "8001", "title": "Thesis Guidance", "career": "Postgraduate - Research", "units": "3.00", "grading": "Pass/Not Pass", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of China Studies", "requirements": "For students in MPhil & PhD Chinese Studies", "description": "In this course, students will receive guidance from their thesis supervisors on regular basis in their preparation of thesis.", "outcome": "Students will:\r - advance their theoretical and methodological expertise in relation to the development of their thesis/dissertation. \r - achieve substantial progress in researching their thesis/dissertation. \r - learn to adjust and improve the structure and presentation of the thesis/dissertation.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"A-LEC (2907)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Jan Francis KIELY, \n\rProfessor LING Minhua"]}}, "2020-21 Term 2": {"B-LEC (2969)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor Jan Francis KIELY, \n\rProfessor LING Minhua"]}}}}]