[{"code": "1103", "title": "Chinese Language, Culture and Language Learning", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Yale-China Chin Lang Ctr", "requirements": "CLCE1103 is double-coded with UGED1146. ;Not for students who have taken CCSS1010, UGED1146 and UGED2760.", "description": "(UGED1146 is double-coded with CLCE1103.) \rThis is a knowledge-based course introducing Chinese language and culture. The course is designed for CUHK students (both native and non-native Chinese) who are interested in Chinese language and culture; Contents included theories and applications concerning Chinese language and culture; theories, practices and situations of teaching and learning Chinese as a second language (including Putonghua and Cantonese learning); the importance of culture in Chinese as a second language; and the language policies and its use in Hong Kong and in Mainland China.", "outcome": " Students are expected to: 1. acquire some basic knowledge about Chinese language varieties and recognize their relationship to Chinese culture. 2. be able to develop critical mind in evaluating and appreciating Chinese language and its associated cultures. 3. be able to understand major discourses about language situations and related cultural issues in Hong Kong and in Mainland China. 4. be able to discuss some foundation theories and practices in teaching and learning Chinese as a second language.  ", "syllabus": " (A) Major Topics 1. Understanding Chinese language and culture (introduce the relationship between language and culture with specific reference to Chinese language varieties) 2. Language in communication: the learning process (introduce key concepts and development of teaching and learning Chinese as a second/foreign language [CSL]; discuss basic principles in CSL) 3. Standard Chinese and varieties: a diachronic approach (discuss language policy of Mainland China; development of Mandarin Chinese in Mainland China; development of pinyin system and Chinese scripts) 4. Standard Chinese and varieties: a synchronic approach (discuss different Chinese varieties used in different parts of Mainland China as well as in different parts of the world) 5. Languages and cultures in Hong Kong (discuss language policy of Hong Kong; status of different languages in Hong Kong; sociolinguistic issues in Hong Kong) 6. Cantonese and other major dialects in China (discuss Cantonese and its relationship with other major dialects in China and in Hong Kong) 7. Learning Chinese: listening and speaking (introduce basic principles in teaching and learning Chinese focusing on teaching and learning listening and speaking skills with reference to linguistics, pragmatic and cultural aspects) 8. Learning Chinese: reading and writing (introduce basic principles in teaching and learning Chinese focusing on teaching and learning reading and writing skills with reference to linguistics, pragmatic and cultural aspects) 9. Appreciating language through culture (discuss Chinese varieties appearing in culture artifacts) 10. Appreciating culture through language (discuss culturally loaded idioms, proverbs, and stories; and drawn relationship between Chinese culture and language) 11. Wrap up and review of major concepts", "required_readings": " Required Readings on the relationship between language and culture 1. Greetings, conversations and farewells. In Encountering the Chinese. W. Hu and C. Grove. 1991. Yarmouth, Me.: Intercultural Press. P.21-33. 2. Pragmatic framework and its role in language learning: With special reference to Chinese. In Processes and Process-Orientation in Foreign Language Teaching and Learning. W. Chan et al (eds.). 2011. De Gruter Mouton. P.65-89. 3. The relationship of language and culture. In Language and Culture. C. Kramsch. 1998. Oxford: Oxford University Press. P.3-14. Required Readings on the language policy and sociolinguistic issues of Mainland China and Hong Kong 4. The modern standard language I. In Chinese. J Norman. 1988. Cambridge University Press. P.133-151. 5. Dialectal variation in North and Central China. In Chinese. J Norman. 1988. Cambridge University Press. P.181-209. 6. The use of English and Chinese Languages in Hong Kong. In Language Learning & Communication. Cheung, Yat-shing. 1984. 3(3) P.273-283. 7. One Country, Two Cultures and Three Languages: Sociolinguistic Conditions and Language Education in Hong Kong. In Teaching Language and Culture: Building Hong Kong on Education. B. Asker (ed.). 1998. Hong Kong: Addison Wesley Longman China. P.152-175. Required Readings on development and trends in teaching and learning Chinese as a second language 8. Task, listening comprehension and SLA. In Task-based Language Learning and Teaching. R. Ellis. 2009. Oxford University Press. P.37-68. 9. On the Chinese Characters. In The Creative Alphabets in the Whole World. C.Y. SIN. 2009. Korea. San Chung Pub. Co. P.1-11.   Students are expected to read all chapters listed under \"Required Readings\", which are available in pdf format on course online platform for those who are registered.", "recommended_readings": " 1. Norman, J. (1988). Chinese. Cambridge University Press. 2. Kramsch, C. (1998). Language and Culture. Oxford University Press. Students are encouraged to read other relevant chapters from books under \"Required readings\", as well those listed under \"Recommended Reading\".", "terms": {"2020-21 Term 2": {"--LEC (7862)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. LEE Siu Lun"]}}}, "assessments": {"Essays": "0", "Others": "0", "Short answer test or exam": "0"}}, {"code": "2203", "title": "Chinese Characters and Reading Chinese", "career": "Undergraduate", "units": "3.00", "grading": "PTH/CAN", "components": "Lecture", "campus": "Main Campus", "academic_group": "Yale-China Chin Lang Ctr", "requirements": "", "description": "A course designed for international students who want to learn more about Chinese characters through reading. Among the areas covered are aspects related to the origin of Chinese characters, basic structure of frequently used characters as well as stories behind the evolution and simplification of Chinese characters.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]