[{"code": "1000", "title": "Ways of Looking: Appreciation and Analysis of Art", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "Targeting at students with no previous experience in art appreciation, the course not only introduces to students some of the basic approaches and methodologies in looking, analysing visual art and other forms of visual presentation, but also studies the mechanism of viewing, issues concerning interpretation and cultural mediation. Using art, crafts and other forms of visual expression as examples, the course intends to nurture students’ aesthetic sensibility, analytical skills, as well as critical ability in the viewing of art and other visual images.", "outcome": "- Learn the basic approaches and methodologies in art appreciation; - Understand then mechanism and the impact of the presentation, mediation and interpretation of arts and other visual image; - Understand the ideological and context meaning in the viewing art and visual objects; - Develop an analytical and critical ability in viewing of art and visual objects.", "syllabus": "1. Introduction This session gives an introduction to the development of the idea of ‘art’, and the mediation mechanism developed throughout history, and looks into the personal, institutional, social and cultural mode of looking at art.  2. Looking at art: what art and whose art? The session discuss the creation of the concept of ‘art’ and its changing meaning art, as well as the political, economic and ideological context from which these concepts evolve, and how these concepts continue affect our ways of looking.  3. Ways of Seeing The session focuses on John Berger’s influential book ‘Ways of Seeing’ to introduce looking at art from a critical, ideological perspective.   4. Subject matters and its hierarchy This session studies subject matters and the genres in art, and how the categorization of art reflects the infrastructure of power. Using mainly the hierarchy built by the 19th Century French Academy as study target, it studies the social and political values behind the choices of subject matters in art making.   5. Approaches and methodologies This session studies the two fundamental ways of viewing art: formalism and historical studies. Some of the formal elements in art and the various approaches in art history analysis will be introduced.  6. Approaches and methodologies This session focuses on iconographic and psychological approaches in art viewing, with studies ranging from religious painting to contemporary icons creation, as well as studying the impacts of the development of psychology in the ways of looking at art.  7. Approaches and methodologies This session studies the contextual meaning of art, and how ideologies affect the viewing, interpretation and understanding of art, with a focus on the Marxist approach.  8. Approaches and methodologies This session studies other approaches such as semiotic, feminist, structuarlist and post-structuralist, and other approaches.  9. Case study: Van Goth’s Sunflower This session studies only one painting, Van Gogh’s ‘Sunflower’, and presents the many ways of looking at one painting as a summary of the studies of the different approaches in the last few classes.  10. Exercise: comparative studies This session is mainly an exercise of looking, in which students are presented with images that come in pair and they have to identify the similarities and differences, and articulate the rationales and ideological implication behind them.  11. Looking at popular culture The session applies the similar techniques learned for a critical viewing at popular culture in order to gain an understanding of the impacts of popular culture in the shaping our ways of looking.  12. Image marketing, consumerism and propaganda This session continues the studies of popular culture, with a focus on visual images in public media as a form of propaganda for consumption and for political purposes.   13. Review and discussion This session reviews the course and follows up with discussions on various topics relating to the course content.", "required_readings": "1. Introduction E.H.Gombrich, ‘What Arts Tells Us’, P262-272, The Uses of Images, Phaidon, London 1999  2. Looking at art: what art and whose art? Janet Wolff, ‘The Sociological Critique on Aesthetics’, Aesthetics and the Sociology of Art, MacMillan Press Ltd., London, UK, 1993  3. Ways of Seeing John Berger, Ways of Seeing, Penguin (Non-Classics)1st edition, UK 1990  4. Subject matters and its hierarchy Beth Gresh-Nesic, The Hierarchy of Genres, About.Com Art History http://arthistory.about.com/od/academic-art-academies/tp/The-Hierarchy-of-Genres-in-Academic-Art.htm  5. Approaches and methodologies Laurie Schneider Adams, ‘Formalism and Style’, P.16-35, The Methodologies of Art: An Introduction, Westview Press, Oxford, UK, 1996  6. Approaches and methodologies Laurie Schneider Adams, ‘Iconography’, P.36-57, The Methodologies of Art: An Introduction, Westview Press, Oxford, UK, 1996  7. Approaches and methodologies Laurie Schneider Adams, ‘Contextual Approach: Marxism’, P.58-78, The Methodologies of Art: An Introduction, Westview Press, Oxford, UK, 1996  8. Approaches and methodologies Laurie Schneider Adams, ‘Semiotics I: Structuralism and Post Structuralism’, P.133-161, The Methodologies of Art: An Introduction, Westview Press, Oxford, UK, 1996  9. Case study: Van Goth’s Sunflower Ian Heywood, Art’s World and the Social World’, Social Theory of Art, P.9-45, MacMillan Press, London, UK 1997  10. Exercise: comparative studies N/A  11. Looking at popular culture Richard Howells, ‘New Media’ P.220-248, Visual Culture, Polity Press, Cambridge, UK 2003  12. Image marketing, consumerism and propaganda Elliot Aronson & Anthony Prakanis, ‘Our Age of Propaganda’, P.1 – 17, Age of Propaganda, A.W.H.Freeman & Holt, USA, 2002.  13. Review and discussion N/A", "recommended_readings": "Laurie Schneider Adams, The Methodologies of Art: An Introduction, Westview Press, Oxford, UK, 1996 Elliot Aronson & Anthony Prakanis, Age of Propaganda, A.W.H.Freeman & Holt, 2002. John Berger,Ways of Seeing, Penguin (Non-Classics)1st edition, UK 1990 David Clarke, Hong Kong Art-Culture and Decolonization, Hong Kong University Press, HK 2001. Margaret Dikovitskaya, Visual Culture: The Study of the Visual after the Cultural Turn, MIT Press USA, 2006. Ernst Gombrich, The Story of Art, Phaidon Press, London, UK, 1995 Ernst Gombrich, The Use of Images, Phaidon Book, London, UK, 1999 Richard Howells, Visual Culture, Polity Press, Cambridge, UK 2003 Catherine King (edit), View of Difference: Different Views of Art’, Yale University Press, USA 1999 Grant Pooke & Graham, Teach Yourself Art History, Hodder Headline Ltd., London, UK 2003 Janet Wolff, Aesthetics and the Sociology of Art, MacMillan Press Ltd., London, UK, 1993", "terms": {"2020-21 Term 1": {"--LEC (7875)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. TING Wing Yan Vivian"]}, "-T01-TUT (7874)": {"startTimes": ["11:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. TING Wing Yan Vivian"]}, "-T02-TUT (7873)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. TING Wing Yan Vivian"]}}}, "assessments": {"Essays": "85", "Others": "15"}}, {"code": "1001", "title": "Introduction to Cultural Management", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "Cultural management is frequently perceived as a new terrain both for the acknowledgement of the role of culture in driving economic and social development, and for the dissemination of managerial thought to arrange and plan cultural entities, facilities and services. This course first aims to facilitate students’ understanding of the rising discipline of cultural management, which is embedded in the transformative understanding of culture and the on-going global movement that highlights culture-led development. Second, it introduces the managerial approach to cultural assets, initiates students’ understanding of the relationship between arts management and the market system and government policies, and imparts the preliminary knowledge for the management of the arts. Third, it displays a spectrum of major issues in cultural management, such as cultural policy, cultural organizations and institutions, venue management and event programming, heritage, conservation and cultural tourism and cultural creative industries. The breadth of the discipline as indicated allows students’exposure to the basic cultural management concepts and strategies.", "outcome": "In terms of knowledge enrichment, students are expected to achieve the understanding of the discipline of cultural management, including its objectives and values, its relationships with the transformative understanding of culture, the on-going global movement that celebrates culture-led development. Other major issues will also be covered. Students are expected to understand preliminarily the operation of art businesses and cultural organizations in connection to market values and government administrative systems. In terms of management training, students will learn practicalities such as cultural managerial principles, planning strategies and basic skills, issues, challenges and limitations specifically for the arts and cultural resources. Discussions are largely based in the local context, supplemented with overseas and Chinese cases, with an awareness of the variances across contexts.", "syllabus": "Part I. Cultural Management as a New Discipline  This part introduces the historical and disciplinary background of cultural management.   1. Understanding Culture: history and theory The first section presents an introduction to the course. As cultural management is embedded in the discourse of culture, this section explores the concept of culture and highlights the theoretical transition from the anthropological idea of culture as values and practices to the understanding of culture as a capital and resource. The emergence of the cultural economy concept will also be discussed.   2. Understanding the Discipline of Cultural Management  This section discusses the evolution of the discipline of cultural management over the past four decades, that is, from arts management, to cultural administration and management. It introduces the objectives of the discipline; the way that this discipline has been gradually accepted and subsequently widely practiced; and its closely related neighboring disciplines. It also discusses the professional role of cultural managers; their differences from artists and creative workers are highlighted.  3. Cultural Management in the Globalization of Culture-led Development This section examines the discipline of cultural management from the view of the global movement that utilizes culture as a driving force for development. It discusses a set of concepts that emerged in the recent decades, such as creative industries, creative classes, cultural planning, culture-led urban regeneration and creative cities. It provides the historical background for the evolution of these concepts, discusses the issues and challenges that they encounter and their application in various local contexts.   Part II. Managing the Arts Art management is considered a traditional realm of cultural management. This part focuses on the managerial approach to the arts. Section 4 investigates the disciplinary relationship between cultural management and traditional management, and the peculiarities of art management. Sections 5 and 6 introduce preliminarily the management of two major art sectors: performing arts and visual arts. Sections 7 and 8 are concerned with cultural management in the social environment and discuss its connections to art marketing and administration.   4. Managerial Approach to the Arts How to manage the arts? How is art management different from the traditional study of management? This section introduces the managerial approach to the arts. It explains the disciplinary relationship between cultural management and traditional management, and discusses how art management crystallizes the philosophy of both management and the arts. Art management covers four main managerial issues, namely, strategic management and planning, human resources management, finance and accounting and marketing and consumer behavior. The empirical implications of art management’s peculiarities are also discussed.   5. Introduction to Performing Arts Management  Performing arts is one of the major subjects in art management. This section introduces the concept of performing arts and its management. It discusses basic performing arts programming strategies and its relationship with theatres and other performing art venues. Some basic modes of organizing performing arts and performing art agencies are discussed.   6. Introduction to Visual Art Management  Visual art is another major subject in art management. This section introduces the concept of visual art and its management. It discusses various types of visual art spaces and agencies (e.g., museums and art galleries), introduces their similarities and differences in concepts, functions, operational modes, policies and evaluation modes.   7. Art Consumption and Art Marketing This section focuses on the concepts of art consumption and art marketing. It discusses the determinants of artistic values and the processes of creating and diffusing artistic values in the market. It covers the issues of art consumer behaviors, market prices, cultural business branding and positioning and art sponsorship, from both the consumption-and production-oriented perspectives.   8. Cultural Administrative Structure The government plays a significant role in cultural development. This section attempts to investigate government and public administration in cultural affairs, its administrative structure, patronage and state-based arts funding agencies. Some recent tendencies (e.g., corporatization of government entities in cultural affairs administration) will be examined withHong Kong as the major context for study. Cultural administrative structures in China, Taiwan and the U.S. as well as their institutional reforms will also be examined.  Part III. Major Issues in Cultural Management  This part introduces some major issues in the cultural management discipline, including cultural policies, cultural organizations and institutions, cultural venues and events programming, conservation, heritage and cultural tourism, as well as cultural and creative industries. It will introduce students to the concepts, operational principles and their management or planning strategies. Cases from various contexts will be studied.   9. Cultural Policies  This section introduces the definition of cultural policies and the process of cultural policy making. It presents a preliminary discussion regarding the way that cultural policies affect cultural development. Policy issues such as government subsidies, cultural industrialization tendency, government’s promotion of art values and cultural censorship will be addressed. Cultural policies from various contexts will be examined.  10. Cultural Organizations and Institutions This section categorizes art organizations based on their basic operational mechanisms. It models the growth of firms in the cultural field and describes the sequences and stages as well as determining factors. It also discusses the governing structure of cultural organizations (e.g., the board structure and its impact on organizational missions and strategies), cultural funding and patronage, volunteer management and management control systems. A global perspective is introduced for examining the connections between local and international cultural organizations.  11. Cultural Venues and Event Programming This section introduces the concept of cultural venues, facilities and districts as well as events planning and programming. Students will be introduced to the theoretical discussions regarding the role of cultural venues and events in cultural development and their functions in fostering local culture. It also introduces basic principles of and strategies for cultural venue planning and strategies for event programming,including cultural venue administration, public engagement, event promotion as well as public-private partnership.  12. Cultural Tourism and Heritage Management What are cultural tourism and cultural heritage? What is their significance and inter-relationship? This section defines and discusses their roles in culture-led urban regeneration. It also introduces the basic strategies for programming cultural tourism and explains the significance and methods of heritage conservation. The second half of this section introduces an integrative approach to cultural tourism and heritage management in order to develop cultural destinations, using European, American and Australian casesfor study.  13. Cultural and Creative Industries The last section will investigate the theory and practice of cultural and creative industries. It will examine the historical context in which the concepts of cultural and creative economy have arisen, its adoption as public policy from the UK and worldwide and its reception and development in Asia Pacific region. It will look at policies and strategies as proposed and developed by various countries in the region with particular emphasis on China, Japan, Korea, Taiwan and Singapore and evaluate the development in Hong Kong.", "required_readings": "Amin, Ash and Thrift, Nigel ed., 2004, Cultural Economy Reader, London: Blackwell. Byrnes, W. J., 2004, Management and the Arts, U.S.: Focal Press. Conte, D., 2007, Theatre Management, New York: Quite Specific Media Group, pp. 1-18. Florida, R., 2002, The Rise of the Creative Class, New York: Routledge. Hagoort, G., 2004, Art Management: Entrepreneurial Style, Eburon Netherlands. Howkins, John, 2001,The Creative Economy, London: Penguin. Franke, S. and Evert V., 2005, eds., Creativity and the City: How the Creative Economy Changes the City, Rotterdam: NAi Pub. Landry, C., 2006, The Art of City Making, London: Earthscan Publications Ltd. Lewis, J., 1990, Art, Culture and Enterprise: The Politics of Art and the Cultural Industries, Routledge, London. Scott, A. J., 2000, The Cultural Economy of Cities, London: Sage. Throsby, David, 2001, Economics and Culture, Cambridge, UK: CUP Press. 李明珠等編, 2005,文化建構 : 文化行政管理前輩經驗談, 台北: 國立歷史博物館 孟曉駟, 2005, 文化經濟學思維–物質與文化均衡發展分析, 北京: 人民文學出版社", "recommended_readings": "Andersson, D.E.,Andersson, Å.E.,Mellander, C., 2011, Handbook of Creative Cities, Cheltenham, UK; Northampton, MA: Edward Elgar Pub. Assassi, I., 2007, “The Programming Strategies and Relationships of Theatres: An Analysis Based on the French Experience,” International Journal of Arts Management, 9(3): 50-64.  Barker, C., 2008, Cultural Studies: Theory and Practice, London: Sage Publications. Bassett, K. 1993. “Urban cultural strategies and urban regeneration: a case study and critique.” Environment and Planning A, 25: 1773-1788. Bendixen, P., 2000, “Skills and Roles: Concepts of Modern Arts Management,” International Journal of Arts Management, 2(3): 4-13. Bereson, R., 2003, “Renaissance or Regurgitation? Arts Policy in Singapore 1957-2003,” Asia Pacific Journal of Arts and Cultural Management, 1(1): 1-14. Bernstein, S., 2007, Arts Marketing Insights: The Dynamics of Building and Retaining Performing Arts Audiences, San Francisco: John Wiley.  Bianchini, F., et. al., 1988, City Centres, City Cultures: The Role of the Arts in the Revitalization of Towns and Cities. Manchester: Manchester Free Press. -----------. 1989, “Cultural Policy and Urban Social Movements: The Response of the ‘New Left’ in Rome (1976-85) and London (1981-86).” In Bramham, P., Henry, I., Mommaas, H. and Poel, H.V.D., eds., Leisure and Urban Process, London: Routledge, pp. 18-46. Bocock, R., 1992, “The cultural transformations of modern society,” In S. Hall and B. Gieben, eds., Formations of Modernity, Milton Keynes: The Open University and Polity Press. pp. 229-274. Boyle, M. 2006. “Culture in the Rise of Tiger Economies: Scottish Expatriates in Dublin and the ‘Creative Class’ Thesis,” International Journal of Urban and Regional Research, 30(2): 403-426. Books, A. C. and Kushner, R. J., 2001, “Cultural Districts and Urban Development,” International Journal of Arts Management, 3(2): 4-15. Botti, S., 2000, “What Role for Marketing in the Arts? An Analysis of Arts Consumption and Artistic Value,” International Journal of Arts Management, 2(3): 14-17. Boyle, S., 2004, “Beethoven Inc: The Corporatisation of Australia’s Symphony Orchestras,”Asia Pacific Journal of Arts and Cultural Management, 2(2): 115-127.  Bussell, H. and Forbes, D., 2007, “Volunteer Management in Arts Organizations: A Case Study and Managerial Implications,” International Journal of Arts Management, 9(2): 16-28.  Carlo, M.D. and Dubini, P., 2010, “Integrating Heritage Management and Tourism at Italian Cultural Destinations,” International Journal of Arts Management, 12(2): 30-43. Chen, S. Y., 2008, “A Study of the Board Governance of Taiwanese Arts Organisations,” Asia Pacific Journal of Arts and Cultural Management, 5(1): 333-342. Colbert, F., 2003, “Entrepreneurship and Leadership in Marketing the Arts,”International Journal of Arts Management, 6(1): 30-39. D’Astous, A., Colbert, F. and D’Astous, E., 2006, “The Personality of Cultural Festivals: Scale Development and Applications,” International Journal of Arts Management, 8(2): 14-23. Dewey, P., 2004, “From Arts Management to Cultural Administration,” International Journal of Arts Management, 6(3): 13-22. ----------- and Rich, J.D., 2003, “Developing Arts management Skills in Transitional Democracies,” International Journal of Arts Management, 5(2): 15-28. Dickie, G., 1969, “Defining Art,” American Philosophical Quarterly, 6(3): 253-256.  Evans, G., 2005. “Measure for measure: evaluating the evidence of culture’s contribution to regeneration,” Urban Studies, 42(5/6): 959-983. Frenchman, D., 2004, Event Places in North America: City meaning and Making, in Sabate, Frenchman, Event-Places in North America: City Meaning and Making, Generaletat di Catalunya, http://places.designobserver.com/media/pdf/Event-Places_i_665.pdf Peacock, A. and Rizzo, I., 2010, The Heritage Game: Economics, Policy and Practice, Oxford: Oxford University Press.  Radbourne, J., 2002, “Social Intervention or Market Intervention? A Problem for Governments in Promoting the Value of the Arts,” International Journal of Arts Management, 5(1): 50-61.  Ruyters, D., 2005, “Asocial, Unprofitable and Autonomous: The Rise of the Postcreative Class,” in Franke, S. and Verhagen, E. eds., Creativity and the City: How the Creative Economy Changes the City, Rotterdam: Nai Pub. pp. 80-88. Hoffman, B., 2006, Art and Cultural Heritage: Law, Policy and Practice, New York: Cambridge University Press.  Hooper-Greenhill, E., 2003, “What is a Museum?” Museum and the Shaping of Knowledge, New York: Routledge Press, pp. 1-22.  Howkins, J., 2001, The Creative Economy,ePenguin (http://www.penguin.co.uk/nf/Book/BookDisplay/0,,9780141880228,00.html) Fitzgibbon, M., 2001, Managing Innovation in the Arts, London: Quorum Books. Foreman-Wernet, L. and Dervin, B., 2009, Audiences and the Arts: Communication Perspectives, Cresskill, NJ.: Hampton Press.  Gilhespy, I., 1999, “Measuring the Performance of Cultural Organizations: A Model,” International Journal of Arts Management, 2(1): 4-13. -----------. 2001, “The Evaluation of Social Objectives in Cultural Organizations,” International Journal of Arts Management, 4(1): 48-57.  Horne, D., 1988, Arts Funding and Public Culture, Institute for Cultural Policy Studies, Griffith University, Brisbane. Hui, D., 2007, Study on the Relationship between Museums and Performing Arts, and Creative Industries for the West Kowloon Cultural District Development in Hong Kong (for the Home Affairs Bureau, HKSAR Government). tp://www.hab.gov.hk/wkcd/pe/eng/doc/wkcd_creative_ind_eng_web_version.pdf -----------. 2003, Baseline Study on Hong Kong Creative Industries, commissioned by the Central Policy Unit, HKSAR Government, Centre for Cultural Policy Research, The University of Hong Kong.  Krug, K. and Weinberg, C.B., 2004, “Mission, Money, and Merit: Strategic Decision Making by Nonprofit Managers,” Nonprofit Management and Leadership, 14(3): 325-342.  Kushner, R. J. and Cohen, R., 2011, “Measuring National-level Cultural Capacity with the National Arts Index,” International Journal of Arts Management, 13(3): 20-40.  Lafortune, A., Rousseau, G. and Begin, L., 1999, “An Exploration of Management Control in the Arts and Cultural Sector,” International Journal of Arts Management,2(1): 64-76. Landry, C. and Bianchini, F., 1995, The Creative City, London: Demos.  Lecoutre, M. and Lievre, P., 1999, “The Creation and Development of Cultural Organizations: Towards a Modelling of the Process,” International Journal of Arts Management, 2(1): 22-37.  Mattelart, A., and Piemme, J., 1982, “Cultural Industries: The Origins of An Idea,” In UNESCO ed., Cultural Industries: A Challenge for the Future of Culture. Paris: UNESCO.  McNicholas, B., 2004, “Arts, Culture and Business: A Relationship Transformation, A Nascent Field,” International Journal of Arts Management, 7(1): 57-69. Radbourne, J., Johanson, K., Glow, H. and White, T., 2009, “The Audience Experience: Measuring Quality in the Performing Arts,” International Journal of Arts Management, 11(3): 16-29.  Richards, G. and Palmer, R., 2010, Eventful Cities: Cultural Management and Urban Revitalization, Oxford: Butterworth-Heinemann. Santagata, W., 2002, “Cultural Districts, Property Rights and Sustainable Economic Growth,” International Journal of Urban and Regional Research, 26(1): 9-23. Sweet, J., 2006, “UNESCO and cultural heritage practice in Australia in the 1950s: The international touring exhibition Australian Aboriginal Culture, 1948-55,” Asia Pacific Journal of Arts and Cultural Management, 4(1): 209-218. Tseng, S. M., 2004, “The Long March for an Appropriate Cultural Infrastructure for Hong Kong: Government opts for Further Consideration after a Three-year Study” Asia Pacific Journal of Arts and Cultural Management, 2(1): 99-107. Turnbridge, J.E. and Gregory J. A., 1996, Dissonant Heritage: The Management of the Past as a Resource in Conflict, Chichester: New York, NY: J. Wiley. Turbide, J and Laurin, C., 2009, “Performance Measurement in the Arts Sector: The Case of the Performing Arts,” International Journal of Arts Management, 11(2): 56-70. Turrini, A., 2006, “Measuring Audience Addition to the Arts: The Case of an Italian Theatre,” International Journal of Arts Management, 8(3): 43-53. Walton, K., 1970, “Categories of Art,” The Philosophical Review, fdfd. Yves, E. and Francois, C., 2000, “Arts Management: A New Discipline Entering the Millennium?” International Journal of Arts Management,2(2): 4-13.", "terms": {"2020-21 Term 1": {"--LEC (6032)": {"startTimes": ["12:30"], "endTimes": ["15:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor CHUNG Ming Yan Fanny"]}}}, "assessments": {"Others": "60", "Selected response test or exam": "40"}}, {"code": "1002", "title": "Cultural Theories", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "This course provides an introduction to cultural theories which aims to help students understand and conceptualize cultural dynamics. Taking a step by step approach, this course comprises three parts, which will guide students from the general concepts right through to the core thoughts of various schools of cultural theories. It will firstunfold an overall picture and introducethe basic concepts enshrined in the theories. It will then illustrate the developing process of cultural theories by tracing the critical moments and key authors. The final part will discuss a broad range of thoughts that come from Structuralism, Post-structuralism, Marxism, Psychoanalysis, Postmodernism etc., and the social contexts from which they arose. This course is designed especially for cultural management students,integrating cases and practices of cultural industry and popular art.", "outcome": "Students are expected to understand and explain the key concepts in cultural theory, the evolution of different theories and major schools of thoughts. Students will also understand the relationship between culture and society, the differentiation between high and low culture, and the interplay between cultural traditions and cultural differences and diversities. Open exploration, in-depth observation and creative application of theories will be encouraged and developed.", "syllabus": "Part I. Basic Concepts in Cultural Theory Part One provides an overview of cultural theory, introducing the discipline of cultural studies, the concept of ‘theory,’and cultural theory.Key concepts in cultural theory, such as ideology, representation, articulation, and texts and readers, will bediscussed.  1.Overview: Cultural Studies and Cultural Theory This introductory section discusses what ‘theory’ means, why we need theory, what cultural theory is and how it works. It also introduces the discipline of cultural studies as well as the definitions of culture from major theoretical perspectives.  2. Culture and Ideology Ideology is a key concept in cultural theory. This section explores the political role of culture in society and discusses the relationship between culture and ideology. It provides five definitions of ideology and shows the way in which ideology works.   3. Representation and Materialism  Much of cultural theoryis dedicated to explaining how meaning is produced symbolically in language. Two important concepts are relevant: representation explores the textual generation of meaning and the modes; materialism is concerned with why meanings are inscribed at the moment of production. This section also discusses how meaning is produced in the interplay betweentext and reader.  4. Subjectivity and Psychoanalysis The concepts of subjectivity and psychoanalysis are introduced in this section. It also introduces the Freudian self, which comprises ‘an ego,’ ‘a superego’ and ‘the unconscious.’ The relationship between these concepts and cultural theory literature is also discussed.  Part II. Evolution of Cultural Theory Part Two illustrates the developing process of cultural theory, discussing key authors and their contributions in the ‘culture and civilization’ tradition and culturalism.   5. The ‘Culture and Civilization’ Tradition Matthew Arnold inaugurates a tradition which places popular culture within the general field of culture, known as the ‘culture and civilization’ tradition. Carrying on this tradition, F.R. Leavis has shaped the understanding of mass civilization and minority culture. This section introduces the ‘culture and civilization’ tradition and its connection to popular art.  6. Culturalism I: Hoggart, Williams and Thompson Culturalism has been the most vigorous, indigenous strand within cultural studies in Britain. Hoggart, Williams and Hall exemplify the critical moments of the evolution of cultural theory. This section will introduce their works and discuss the influence of their thoughts in shaping later theories.   7. Culturalism II: Hall and Whanneland the Popular Arts Hoggart, Williams and Thompson have a major influence on the understanding of the popular arts. Stuart Hall and Paddy Whannel’s thesis, The Popular Arts, will be discussed. This section will examine the categorical difference between high and popular culture, and the characteristics of difference.   Part III. Intellectual Strands of Cultural Theory Part Three introduces major intellectual strands of cultural theories, ranging from Structuralism, Post-structuralism, Marxism, Feminism toPost-modernism.   8. Structuralism: Generating Meaning from Structure Structuralism is a theoretical method of approaching texts and practices.This section will introducethe origin, trajectory of structuralism as well as its principle of analysis. Roland Barthes’s analysis of mythology based on principles of structuralism will be discussed.   9. Post-structuralism: Meaning in Process Post-structuralists reject the idea of deriving meanings from an underlying structure. The ideas and works of Jacques Derrida and Jacques Lacan will be introduced. This section will also discuss the works by Michel Foucault and Edward Said regarding discourse and power.   10. Marxism I: Classical Marxism and Neo-Gramscian Studies  This section will begin with the introduction of a classical Marxist approach to culture, such as its famous ‘base/superstructure’ account of social and historical development, the determinations that influence the production and consumption of popular culture, and the mode of production. Itwill then proceed to discuss Antonio Gramsci and the core concept of hegemony.  11. Marxism II: The Frankfurt School and Cultural Industry The Frankfurt School has been famous for its critical theory that mixes Marxism and psychoanalysis,as well as the term of ‘cultural industry’ that it coined. This section will introduce the basic concepts of the Frankfurt School, the major representative figures and their critique of cultural industry.   12. Feminism and Gender Gender has been an important subject of study since the 1980s. Several issues will be discussed in this section, such as cultural politics and feminist psychoanalysis. Women in popular culture, e.g., films and fictions,will be adopted as cases for study.  13. Postmodernism: Relocating Value in the World of Everyday Experience The development of Postmodern theory became mature with theorization in the work of Jean-Francois Lyotard and has changed the theoretical and the cultural basis of the study of popular culture in its development. This lecture will illustrate the trajectory of postmodernism and focuses on its connection to various arts forms and popular culture.", "required_readings": "Adorno, T.W., 1991, The Culture Industry: Selected Essays on Mass Culture, London: Verso. Arnold, M., 1960, Culture and Anarchy, Cambridge: Cambridge University Press. Barthes, Roland, 1972, Mythologies, New York: Hill and Wang. Bourdieu, P., 1984, Distinction: A Critique of the Judgment of Taste, London: Routledge. Derrida, Jacques, 1978, Writing and Difference, trans. Alan Bass, Chicago: University of Chicago Press. Foucault, M., 1970, The Order of Things, London: Tavistock.  Freud, Sigmund, 1949, An Outline of Psychoanalysis, authorized translation by James Strachey, New York: W. W. Norton. Gramsci, A., 1992, Prison Notebooks, vol. 1, NY.: Columbia University Press. Hall, S. and Whannel, P., 1964, The Popular Arts, London, Hutchinson. Said, E., 1985, Orientalism, Harmondsworth: Penguin.", "recommended_readings": "Barrett, M., 1991, ‘Ideology: Critique or Description?’ in The Politics of Truth: From Marx to Foucault, Cambridge, UK: Polity Press and Blackwell Publishers, pp. 18-34.  Barrett, M., 1996, ‘Feminism and the Definition of Cultural Politics,’ Brunt, R. and Rowan, C. eds., Feminism, Culture and Politics, London: Lawrence and Wishart, pp. 37-58.  Connor, S., 1997, Postmodernist Culture: An Introduction to Theories of the Contemporary, Oxford, Oxfordshire; Cambridge, Mass: Blackwell Publishers, pp. 23-61.  Hall, S., 1977, ‘Re-thinking the Base-superstructure Metaphor,’ in Bloomfield, J. ed., Papers on Class, Hegemony and Party: the Communist University of London, London: Lawrence and Wishart, pp. 43-72.  Hall, S., 1997, ‘The Work of Representation,’ in Hall, S., ed., Representation: Cultural Representations and Signifying Practices, London: Sage, pp. 13-75. Hoare, Q., and Smith, G.N. eds., 1971, Selections from the Prison Notebooks of Antonio Gramsci, New York: International Publications, pp. 210-276.  Negus, K., 1997, ‘The Production of Culture,’ in Du Gay, Paul ed., Production of Culture/Cultures of Production, London: Sage.  Rabinow, P., ed., 1984, The Foucault Reader, New York: Pantheon, pp. 3-29; 51-75.  Smith, P., 2001, ‘The Cultural Analysis of Postmodernism and Postmodernity,’ in Cultural Theory: An Introduction, Malden, Mass.; Oxford: Blackwell, pp. 214-232. Smith, P., 2001, ‘Pychoanalytic Approaches to Culture and the Self,’ in Cultural Theory: An Introduction, Malden, Mass.; Oxford: Blackwell, pp. 202-213. Thompson, E.P., 1968, ‘Introduction,’ The Making of the English Working Class, Harmondsworth: Penguin.  Williams, R., 1965, ‘The Analysis of Culture,’ The Long Revolution, Harmondsworth: Penguin, pp. 57-88. Foster, H., 1985, Introduction to Postmodern Culture, London: Pluto.  Foucault, M., 1972, The Archaeology of Knowledge, New York: Pantheon.  Freud, S., 1977, Three Essays on Sexuality, The Pelican Freud Library, vol. 7, Harmondsworth: Penguin.  Gans, H. J., 1974, Popular Culture and High Culture: An Analysis and Evaluation of Taste, New York: Basic Books.  Hall, S., 1977, ‘Culture, the Media and the Ideological Effect,’ in J. Curran, M. Gurevitch and J. Woollacott eds., Mass Communications and Society, London: Edward Arnold.  Hall, S., 1981, ‘Encoding/Decoding’ in S. Hall, D. Hobson, A. Lowe and P. Willis eds., Culture, Media, Language, London: Hutchinson.  Hawkes, T., 1977, Structuralism and Semiotics, London: Methuen.  Horkheimer, M., 1978, ‘Art and Mass Culture,’ in P. Davison, R. Meyersogn and E. Shils, eds., Literary Taste, Culture and Mass Communication, vol. 12, Cambridge: Chadwyck Healey.  Jones, G. S., 1994, ‘Working Class Culture and Working Class Politics in London, 1870-1900: Notes on the Remaking of a Working Class,’ in J. Storey, ed., Cultural Theory and Popular Culture: A Reader, Hemel Hempstead: Harvester Wheatsheaf, pp. 76-87.  Lacan, J., 1968, ‘The mirror phase as the formative of the function of the I,’ New Left Review, no.51, pp.71-77.  Lowenthal, L., 1961, Literature, Popular Culture and Society, Palo Alto, CA: Pacific Books.  Lyotard, J. F., 1984, The Postmodern Condition: A Report on Knowledge, Manchester: Manchester University Press.  Marx, K., 1976, Preface and Introduction to A Contribution to the Critique of Political Economy, Peking: Foreign Languages Press.  McRobbie, A., 1991, Feminism and youth Culture, London: Macmillan.  Modleski, T., 1982, Loving With a Vengeance: Mass Produced Fantasies for Women, Hamden, CT: Archon Books.  Radway, J., 1987, Reading the Romance: Women, Patriarchy, and Popular Literature, London: Verso.  Ross, A., 1989, No Respect: Intellectuals and Popular Culture, London: Routeledge.  Smith, P., 2001, ‘Psychoanalytic Approaches to Culture and the Self,’ Cultural Theory: An Introduction, Oxford: Blackwell. Williams, R., 1963, Culture and Society, Harmondsworth: Penguin.", "terms": {"2020-21 Term 2": {"--LEC (6752)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Lady Shaw Bldg LT5"], "instructors": ["Professor PENG Peng"]}, "-T01-TUT (8657)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor PENG Peng"]}}}, "assessments": {"Essays": "60", "Others": "10", "Presentation": "30"}}, {"code": "1003", "title": "Cultural Policy and Development", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "The course is an introduction to the nature, functions and making of cultural policies. Making references to examples of local and international cultural polices, it studies the relationship between the making of cultural policy and the infrastructure of power, the ideological influences behind the making of cultural policy. It also studies the latest trends in cultural development and its relationship with policy-making, and the impacts on the development of arts and culture, with particular references to the local context. The course also includes a practical aspect of drafting and developing institutional policy as part of the studies in cultural management.", "outcome": "Students are expected to learn about how cultural policy is composed, its scope and structure, and the ideological components behind it within the context of the infrastructure of power, and to understand the impact of cultural policy in shaping the development of culture. The course also intends to equip students with the skills of drafting institutional cultural policy, which is essential for the development of a cultural institution.", "syllabus": "1. General introduction\r This section gives an introduction to the various definitions of cultural policies, with discussion on its impacts on cultural development and its relationship with the social and political infrastructure.\r  2. Culture and Power \r This section investigates how political, social and economic powers affect the outcome of artistic creation, both in terms of the formal artistic languages and the modes of production and mediation.\r  3. Historical Background \r This section uses examples from Europe and the United States to trace historically how various modes of governance were introduced and study the political expectations and social values hidden behind these policies.\r  4. Globalization and Cultural policy \r In the 21st Century, cultural industry is recognized as an important economic and social force. Large scale cultural projects are implemented all over the world to promote cultural tourism and creative industry. This section takes a critical look at this global trend and reviews its cultural and social impacts.\r  5. Cultural policy in Hong Kong\r This section informs students of the infrastructure for cultural development in Hong Kong, studies the history and development of the arts within the governmental structure, and traces the various stages in developing a cultural policy for Hong Kong.\r  6. Institutional Policy\r Cultural institutions usually have their own cultural policies to set their visions and objectives for their long term development. This section studies the various types of institutional policy, with an emphasis on helping students to learn to prepare an institutional policy paper.\r   7. The Ecology of Culture \r This section investigates some of the core cultural values in contemporary society, with emphasis on the Hong Kong context. It also introduces an ecological approach to cultural development, and reviews the success and failure of the existing cultural policies within the public and private sectors.\r  8. Cultural Development and Operation in China \r This section studies another model in which cultural development is strongly managed by the government. Taking Shanghai as example, students will study the process of organizing exhibitions in China and ideological thinking behind this bureaucratic system.\r  9. Language of the Bureaucrats \r In Hong Kong, the government has tremendous influence on the ways arts and cultural programmes are implemented. This section investigates how the civil servant culture and the language they apply shape the content of the policy produced, and consequently affect the course of cultural development in Hong Kong.\r Case study: Culture Heritage Commission\r  10. West Kowloon Cultural District: Mega Cultural Project\r Focusing on the development of the West Kowloon Cultural District project, this section reviews the original proposal, public responses, and the subsequent reaction of the government, with the intention to investigate the governmental modes of thinking and strategies in actualizing cultural projects.\r  11. Alternative Space and Community Action \r As a reaction against governmental dominancy in cultural development, different types of alternative cultural institutions and groups are formed. This section investigates the potential and limitation of various types of non-government run organizations. It also studies the strategies of community groups in working with and against the government in fighting for a more nurturing cultural environment.\r Case study: Hong Kong Arts Development Council, Para site Art Space\r  12. Cultural Policy and the Future of Cultural Development of Hong Kong \r This section looks into the future cultural development of Hong Kong, its relationship with China and other regions, and discussion the problems and possibilities for positive development.\r  13. Review and Discussion", "required_readings": "1.General introduction\r Michael Lynch, ‘What is Art Policy’. Arts Policy Conference.P.107-118 ADC, 1999\r T. Miller & G. Yudice, ‘Introduction: The History and Theory of Cultural Policy’. Cultural Policy. P.1-34, SAGE Publication 2002\r Preben Mortensen, ‘Standard of Taste’. Art in the Social Order. P.91-106, State University of NY Press, NY, 1997\r   2.Culture and Power \r Preben Mortensen, ‘Standard of Taste’, Art in the Social Order, P.91-106, State University of NY Press, NY, 1997\r  3.Historical Background \r ‘政府的監督’，P.61-78. 藝術與公共政策，費約翰著江靜玲譯，新知叢書，台灣2008\r  4.Globalization and Cultural policy \r Timothy Luke, ‘Made in U.S.A’, P119-136, Show of Forces’, Duke University Press, 1992.\r Mark Lawson ‘Culture is Not An Industry’ , The Guardian. 29 June 2007\r  5.Cultural policy in Hong Kong\r Terence Yuen ‘A Decade’s Long March’,P.7-25, A decade of Arts Development in Hong Kong, ADC, 2006\r  6.Institutional Policy\r ‘Culture Policy and Museum Development’ Huang Kuang-Nan, P100 -107, Cultural Policy and Museum Development, National Taiwan University, 2009\r  7.The Ecology of Culture \r Preben Mortensen, ‘Standard of Taste’, ‘Art’s World and the Social World’, P.9-29, State University of NY Press, NY, 1997,\r  8.Cultural Development and Operation in China\r 胡惠林，第一章 ‘中國文化產業發展趨勢分析’ ，文化產業發展的中國道路，人民出版社，上海2006\r  9.Language of the Bureaucrats \r 文化委員會政策建議報告書，香港特區政府民政局，2003\r  10.West Kowloon Cultural District: Mega Cultural Project\r West Kowloon Cultural District http://www.westkowloon.hk/en/home\r Vivienne Chow, ‘The M+, Politics and Hints of A Cultural Crash’, SCMP 4 May 2013\r  11.Alternative Space and Community Action \r Arlene Goldbard, ‘Understanding Community Cultural Development’, P.17-42. New Creative Community, New Village Press, CA 2006\r  12.Cultural Policy and the Future of Cultural Development of Hong Kong \r Background, P2-8, Policy Recommendation Report, Cultural and Heritage Commission, HAB, HKSAR Government, 2003\r Four Development Strategies,P.10-13, Hong Kong Unlimited – Three Year Plan 2001-2004, HKADC, HK, 2001", "recommended_readings": "Cultural Policy. T. Miller & G. Yudice, SAGE Publication 2002\r In Search of Cultural Policy ’93. HK Cultural Policy Study Group eds, Zuni Icosahedron 1993\r Critical Cultural Policy Studies: A Reader. Lewis, Justin and Toby Miller ed. Blackwell Publishing, 2003.\r Rethinking Cultural Policy. J. McGuigan, Open University Press, 2004.\r Comparing Cultural Policy: A Study of Japan & the United States, J.Zemans, Joyce, A. Kleingartner eds. Altamira Press, 1999.\r The Economics of Art and Culture, J. Heilburn & C. M. Gary, Cambridge University Press 1993\r The Democratic Muse: Visual and the Public Interest. Edward C. Banfield, Basic Books. Inc., 1984\r The Politics of Culture: Policy Perspectives for Individuals, Institutions, and Communities. G. Bradford, M. Gary, G. Wallach eds. New York Press 2000\r The States and the Visual Arts, Nicholas Pearson, Open University Press 1982\r Media, Arts, Policy, and Globalization Crane, Diane & Nobuko Kawashima, Ken’ichi Kawasaki, eds.. Routledge, 2002.\r Assorted documents on Hong Kong’s arts and cultural policy from HK Arts Development Council, Home Affairs Bureau\r Assorted internet articles and definition of terms", "terms": {"2020-21 Term 1": {"--LEC (7846)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor LEUNG Hok Bun Isaac"]}}}, "assessments": {"Essays": "35", "Essay test or exam": "50", "Others": "15"}}, {"code": "2001", "title": "Chinese Archaeology and Food Culture", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "Archaeology reveals many interesting findings about ancient social lives. Food has always been an essential category in human culture. The amount of food surplus determines the strength and social bonding of a society; and rituals are usually revolved around food preparation, presentation, and distribution. In China, a large number of archaeological sites contained remains of food, and occasionally drink. This course picks the representative sites to illustrate what food meant to a society that can be summarized in categories listed below: 1. Consumption of staple food: rice and noodles; 2. Perception of tastes: sweetness and bitterness; 3. Cooking methods: steaming and roasting; 4. Exotic food: what had been imported to China and when? 5. Drinks: tea and wine; 6. Rituals that involved food. This course is suitable for students who have interests in Archaeology but may not have prior knowledge about it. It aims to prepare them for exploring the past of China in the future, either in form of class teaching or self-learning, or both. The course gets students to apply the designs and innovations of ancient China in regards to food and the practice of cooking, dining and rituals to the present.\r", "outcome": "Upon completion of the course, students would be able to: \r 1) Identify key recent archaeological discoveries of China; 2) Analyze the functions and meanings of archaeological finds in particular contexts;  3) Acquire research techniques in reading primary data; and \r 4) Think critically about archaeological presentations, such as museum exhibitions, and relevant cultural events", "syllabus": "Part I: Discoveries of food and drinks\r  1. Introduction: Food, climate, and geography \r Natural environment determines the type of staple food in different regions. This introductory lecture explains the basics of fauna archaeology and the various devices available to identify food and drinks ingredients. \r Reading: \r Liu Li and Chen Xingcan. ‘Neolithization: sedentism and food production in the Early Neolithic (7000—5000 BC)’ (chapter 5), The Archaeology of China: From the Late Paleolithic to the Early Bronze Age. Cambridge: Cambridge University Press, pp. 123—168.\r  2. Rice and Hemudu Culture (5500—3300 BC)\r Carbonated rice husk was found in a number of early and mid-Neolithic sites in China. All evidence points to the origins in the mid and lower Yangtze River valley. This lecture uses Hemudu site as an example. The excavations over the last decades revealed many earliest finds in this Neolithic culture: rice paddy field, musical instruments, fortune-telling devices, etc. \r Reading:\r a. 《河姆渡: 新石器考古遺址發掘報告》北京 : 文物出版社 2003\r b. 賀聖達，《稻米之路:中國與東南亞稻作業的起源和發展》,《東方論壇》2013年05期，第23-30頁。\r  3. Noodles and the site of Lajia of Qijia Culture (c.2500—c.2000 BC)\r Lajia of Qinghai province is the Chinese version of Pompeii. It was a small town destroyed and covered by dust right after an earthquake. There preserved a bow of unfinished noodles made of millet (小米) and husk millet (黍米). The noodles still carried a tinge of the original yellowish colour. This lecture begins with the finds at Lajia and refers to many other archaeological evidence of noodles consumption found in later periods. \r Reading:\r a. 王明輝，《青海民和喇家遺址發掘報告》,《考古》2000.12, 第12—28页。\r b. 葉茂林，《喇家遺址與飲食文明》，《中國飲食文化》2008，4(2)，45—76。\r   4. Jiaozi (Dumplings) and the State of Xue (?—327 BC)\r Jiaozi takes in different forms in Chinese cuisine. The earliest evidence came from a site in the State of Xue of the Warring States period (c.476—221 BC). This lecture uses Xue as the introductory point and unfolds the story of the many states and their finds from the period before the First Emperor unified China. \r Reading:\r a. 薛國故城勘查和墓葬發掘報告《考古學報》1991.4。\r b. 印群，《論春秋時期魯東南殉人墓隨葬青銅禮器的特點 —兼談莒、薛文化因素之異同》，《齊魯學刊》2015.3，40—46。\r  5. Meat and wine and the Xianyang Airport site\r In 2009, a bowl of meat soup was found in Xi’an. Domesticated pigs, sheep and ox were found in as early as late Neolithic. Boiling was the primary method of cooking. In Xi’an this tomb of the Han dynasty revealed the soup serving, as well as bottle of wine. This lecture illustrates a banquet in association with the many bronze cooking and serving vessels found. \r Reading:\r a.陕西省考古研究院，《西安咸陽國際機場專用高速公路十六國墓發掘簡報》，《文博》2009.4，3—11。\r b. 陝西省考古研究所，《漢陽陵》，北京︰文物，2006。\r  6. Fieldtrip: Sauces and Seasoning\r Sauces are not commonly found at archaeological sites. Because Hong Kong has a number of locally produced sauce workshops, a fieldtrip to one of them is enriching. The arrangement has to be made in due course. Otherwise, the fieldtrip may be a visit to a relevant museum exhibition in Hong Kong or Shenzhen.\r  7. Snacks and the early Han-dynasty tombs of Mawangdui, Hunan province\r When food surplus is sufficient, snacks are desired. At Mawangdui, the tomb of the wife of the regional lord contained bottles of nuts, chestnut, and other food. \r Reading:\r a. 《馬王堆漢墓帛書》，北京︰文物，1980—85。\r b. 陳建明，《馬王堆漢墓研究》，長沙︰岳麓書社，2013。\r  8. Tofu and the Han-dynasty Tomb at Mixian Dahuting, Henan province \r Tofu was not preserved in any archaeological site. But the process of making tofu was recorded. At Mixian, the relief paintings found in the tomb illustrate the tofu-making processes in detail, along with other cooking and food preparing pictures. It remains a mystery as to why the people of the Han preserved such scenes in burials. But they provided insightful details about how these people perceived of food in relation to their afterlife. \r Reading:\r a. 河南省文物研究所，《密縣打虎亭漢墓》，北京︰文物，1993。\r b. 馮麗麗，《秦漢飲食略考》，《宜春學院學報 》，2010，32(11)，79—81。\r  9. Bread and the Western Xia Hoard of Inner Mongolia \r Bread or bun did not survive well in most archaeological sites. But a hoard of Western Xia in Inner Mongolia revealed several well-preserved pieces. The Inner Asian forms of these finds related them to the Silk Road. In fact, a number of dried food examples came from that part of the world, because the dry weather favoured preservation. \r Reading:\r a. 伊克昭盟文物工作站，《准格爾旗發現西夏窖藏》，《文物》1987.8。\r b. 王仁湘，《考古貴州》，電視廣播資源。\r  10. Tea and the Liao-dynasty tombs of Xuanhua, Hebei province \r Tea leaves have always been important in China. The cemetery at Xunhua belonged to a Han family living in the Liao regime. There were many pictures of tea preparation and serving. \r Reading:\r 《宣化遼墓︰1974—1993年考古發掘報告》，北京，文物，2001。\r  11. Exotic food \r Chili, spices, potatoes, and a number of essential ingredients in Chinese cuisines came from abroad at different times. How did they manage to enter an established food culture? \r  12. Guest lecture \r In China, food is a topic inevitably related to health, festivals and rituals. It will be exciting to include a lecture to be given by a specialist in Religious Studies, Chinese Medicine, or Maritime Trade, who has research interests in food. The lecture provides another dimension of looking at Chinese food.\r  13. Food and rituals \r In conclusion, food is indispensable in social lives and rituals. In the examples discussed, food was always found in tombs, closely associated with the desires of nourishment, social engagement, and even hierarchy. Today, what’s the role of food in our ‘rituals’? And how do we shape ‘rituals’ through different food?", "required_readings": "Part I: Discoveries of food and drinks\r  1. Introduction: Food, climate, and geography \r Reading: \r Liu Li and Chen Xingcan. ‘Neolithization: sedentism and food production in the Early Neolithic (7000—5000 BC)’ (chapter 5), The Archaeology of China: From the Late Paleolithic to the Early Bronze Age. Cambridge: Cambridge University Press, pp. 123—168.\r  2. Rice and Hemudu Culture (5500—3300 BC) \r Reading:\r a. 《河姆渡: 新石器考古遺址發掘報告》北京 : 文物出版社 2003\r b. 賀聖達，《稻米之路:中國與東南亞稻作業的起源和發展》,《東方論壇》2013年05期，第23-30頁。\r  3. Noodles and the site of Lajia of Qijia Culture (c.2500—c.2000 BC)\r Reading:\r a. 王明輝，《青海民和喇家遺址發掘報告》,《考古》2000.12, 第12—28页。\r b. 葉茂林，《喇家遺址與飲食文明》，《中國飲食文化》2008，4(2)，45—76。\r   4. Jiaozi (Dumplings) and the State of Xue (?—327 BC)\r Reading:\r a. 薛國故城勘查和墓葬發掘報告《考古學報》1991.4。\r b. 印群，《論春秋時期魯東南殉人墓隨葬青銅禮器的特點 —兼談莒、薛文化因素之異同》，《齊魯學刊》2015.3，40—46。\r  5. Meat and wine and the Xianyang Airport site\r Reading:\r a.陕西省考古研究院，《西安咸陽國際機場專用高速公路十六國墓發掘簡報》，《文博》2009.4，3—11。\r b. 陝西省考古研究所，《漢陽陵》，北京︰文物，2006。\r  6. Fieldtrip: Sauces and Seasoning\r  7. Snacks and the early Han-dynasty tombs of Mawangdui, Hunan province\r Reading:\r a. 《馬王堆漢墓帛書》，北京︰文物，1980—85。\r b. 陳建明，《馬王堆漢墓研究》，長沙︰岳麓書社，2013。\r  8. Tofu and the Han-dynasty Tomb at Mixian Dahuting, Henan province \r Reading:\r a. 河南省文物研究所，《密縣打虎亭漢墓》，北京︰文物，1993。\r b. 馮麗麗，《秦漢飲食略考》，《宜春學院學報 》，2010，32(11)，79—81。\r  9. Bread and the Western Xia Hoard of Inner Mongolia \r Reading:\r a. 伊克昭盟文物工作站，《准格爾旗發現西夏窖藏》，《文物》1987.8。\r b. 王仁湘，《考古貴州》，電視廣播資源。\r  10. Tea and the Liao-dynasty tombs of Xuanhua, Hebei province \r Reading:\r 《宣化遼墓︰1974—1993年考古發掘報告》，北京，文物，2001。\r  11. Exotic food \r  12. Guest lecture \r  13. Food and rituals", "recommended_readings": "Albala, Ken. Routledge international handbook of food studies. New York: Routledge, 2012.\r Anderson, E. N. Food and environment in early and medieval China. University of Pennsylvania Press, 2014.\r Barton, Loukas William. Early food production in China's western Loess Plateau. Thesis (Ph.D.). University of California, Davis, 2009.\r Bray, Tamara L. The archaeology and politics of food and feasting in early states and empires. New York: Kluwer Academic/Plenum, 2003.\r Brothwell, Don R. Food in antiquity: a survey of the diet of early peoples. Md.: Johns Hopkins University press, 1998.\r Chang, Kwang-chih. The archaeology of ancient China, New Haven, Conn.: Yale University Press, 1986.\r Ebrey, Patricia. Cambridge Illustrated History of China, 2nd edition, Cambridge: Cambridge University Press, 2010. \r Gosden, Chris, and Hather, Jon, eds. The prehistory of food: appetites for change. London; New York: Routledge, 1999.\r Graff, Sarah R., and Rodríguez-Alegría, Enrique, eds. The menial art of cooking archaeological studies of cooking and food preparation. Boulder, Colo.: University Press of Colorado, 2012.\r Kim, Kwang Ok, ed. Re-orienting cuisine: East Asian foodways in the twenty-first century. New York: Berghahn Books, 2015.\r Lehmann, LV. \"The Garbage Project Revisited: From a 20th Century Archaeology of Food Waste to a Contemporary Study of Food Packaging Waste.\" Sustainability 7, no. 6 (June 2015): 6994-7010.\r Loewe, Michael, and L. Shaughnessy, Edward, eds. The Cambridge history of ancient China: from the origins of civilization to 221 B.C., Cambridge, U.K.; New York: Cambridge University Press, 1999.\r Pulleyblank, Edwin G. Central Asia and non-Chinese peoples of ancient China, Aldershot; Burlington, VT: Ashgate, 2002.\r Sterckx, Roel, ed. Of tripod and palate: food, politics and religion in traditional China. Conference on Food and Religion in Traditional China, Cambridge, England, 2004. New York: Palgrave Macmillan, 2005.\r Sterckx, Roel. Food, sacrifice, and sagehood in early China. New York: Cambridge University Press, 2011.\r Twiss, Katheryn. \"The Archaeology of Food and Social Diversity.\" Journal of Archaeological Research 20, no. 4 (2012): 357-95.\r Wang, Ming-ke. The Chʻiang of ancient China through the Han dynasty: ecological frontiers and ethnic boundaries, Ann Arbor : UMI, 1995.\r 李清泉. 宣化遼墓 : 墓葬藝術與遼代社會. 北京：文物出版社, 2008.\r 齊東方. 隋唐考古. 北京：文物出版社, 2002.\r 唐俊杰. 南宋臨安城考古. 杭州：杭州出版社, 2008.\r 李志偉, 彭淑清, 陳祥軍. 中國風物特產與飲食 . 北京: 旅游教育出版社, 2003.\r 張景明. \"歲時節慶與北方游牧民族飲食文化.\" 黑龍江民族叢刊 2006, no. 2 (April 15, 2006): 116-22.\r 呂一飛. 胡族習俗與隋唐風韻 : 魏晉北朝北方少數民族社会風俗及其對隋唐的影響 . 北京: 書目文獻出版社, 1994.", "terms": {"2020-21 Term 1": {"--LEC (5900)": {"startTimes": ["12:30"], "endTimes": ["15:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor PENG Peng"]}}}, "assessments": {"Essays": "80", "Presentation": "10", "Participation": "10"}}, {"code": "2002", "title": "Language and Practice of Cultural Management", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "The course looks into the practical as well as the critical sides of cultural management, giving students a more elaborated understanding of cultural management, covering several major areas including 1) The cultural and social implication of cultural institution and its dynamic interaction with contemporary society; 2) Mode of governance and operation of different types of cultural institutions; 3) Basic administrative and technical skills in planning and implementing various types of cultural programmes; 4) Professional ethics, social responsibilities and responsiveness to community needs. It intends to help students to build a solid technical as well as intellectual base for further specialized studies in cultural management.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2003", "title": "Art Institutions in Twentieth-Century China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "The course examines the correlation between art and institutions in twentieth-century China, aiming to encourage students to think about modern Chinese art through the concept of the artworld. The downfall of the Qing dynasty and the establishment of the Republican China transformed the social and institutional organisation of the production, distribution, and consumption of art as well as the traditional patronage system in modern China. The structural changes conditioned the emergence of formal and informal art institutions that facilitated yet constrained artistic practices, laying the foundation for the development of a modern art world in China. The course looks at the history of modern Chinese art and the formation of different art institutions in the sociocultural and economic context of modern China. Weekly topics are structured chronologically and thematically, which cover a wide range of themes, including art schools, art societies, museums, exhibitions, and art market. Adopting an interdisciplinary approach, the course offers students multi-perspectives to understand the transformation of modern Chinese art and the interactions between artistic practices and society in modern China.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2004", "title": "Chinese Material Culture", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "(UGED2285 is double-coded with CUMT2004.) This is a cross-disciplinary course straddles the studies of history, anthropology, and sociology from the perspective of material objects. The course intends to achieve two goals: first, it leads students to identify and appreciate the traditional Chinese values, which include the teachings of Confucianism and Daoism, embodied in the many production types pertinent to what we now regard as Chinese; and second, it explains how those various material types ended up being included and translated as the representative categories of Chinese civilization throughout the historical times. The course will begin from the basic by introducing the mainstream material productions from ancient to modern China: jades, antique bronzes, lacquer, ceramics, architecture, silk, as well as grave goods. The discussions instruct students to appreciate these essential elements of Chinese culture from the perspectives of their physical qualities, craftsmanship, and historical values. They are also to encourage students to think about the roles of material objects in shaping cultural, ethnic, and even national identities.", "outcome": "Upon completion of the course, students would be able to identify the material and artistic features of some mainstream Chinese artifacts; develop interests in Chinese culture from the perspective of objects; identify key historical sites and remains of pre-modern China; develop acute senses for appreciating traditions and values; develop interests in culture and history; analyze the sources of Chinese heritage and traditions; think critically about historical and other relevant cultural presentations; and get prepared for further trainings in the disciplines of art history, archaeology, anthropology and history.", "syllabus": "1. Introduction: What is the present view about Chinese material culture?  Present-day China received huge inheritance from the many groups of people and cultural traditions that existed in antiquity. This session introduce a range of material culture that makes up the broad family of Chinese culture. The most important types include jades, antique bronzes, lacquer, ceramics, and architecture. The definitions given here hope to broaden the scope and include the less-discussed categories of clothing and costumes, sculpture, and grave goods. This overview leads students to consider the many sources of traditional values now embodied in the material culture that we now describe as ‘Chinese’.  2. Jades In China, jades have always been understood to have spiritual power and artistic values. What is the scientific definition of jades? How did Confucius and his contemporaries define the roles of jades? How did their teachings shape the understanding of jades in Chinese society? And what are the present views about jades? This session will respond to this question by giving a review of jade history, usage and craftsmanship.  3. Antique bronzes Among the many treasures inherited from the past, bronzes are core collections that they are always found as representatives of ancient China in modern museums both in China and overseas. This session will describe different categories of bronzes and the motifs found on them in relation to their dates. It will also introduce the imperial collections found in the Kaogu tu, and later on in Xiqing gujian; and explain the values and significance of bronze collections in modern museums.   4. Lacquer Lacquer is a unique production of ancient China. This session introduces the complicated steps involved in its production, and reviews lacquer-using history in China and in other parts of Asia. The discussion leads student to become aware of the broad transmission of the lacquer-using traditions in Asia that shaped a central role for China in antiquity.  5. Sculpture In China, sculptural representation is closely tied with religious practices. This session will introduce the Buddhist sites in Henan and Sichuan, as well as the pictorial representations found in the Daoist temples in Hebei. The session will describe the renewed definition of sculpture in the modern times when the Western artistic values were received.  6. Architecture Architecture forms an essential part of material culture. In China, however, the studies of historical architecture began rather late. This session introduces the classic writings by Liang Sicheng, as well as the renowned Yingcao fasi, the Building Manual composed in the Song period, which founded the standardized Chinese construction works.   7. Silk Silk production began in the late Neolithic period. This session introduces the traditional steps in silk-making and weaving as found in craftsman handbooks published in the Ming period; and discusses how silk as commodity embodies the rich history of cultural exchange between China and the West through trade.  8. Ceramics Ceramics are representative productions of south China. This session introduces the production of the classic kilns of Ge, Yu, Ding, Longquan, and Jingdezhen. This session instructs students to identify the colour, texture, decoration, as well as motifs found on the ceramics produced in different areas. They embody rich aesthetic values deemed appropriate in Confucian classics.  9. Ornaments Chinese ornaments comprise an extended family of motifs that include flowers, birds, figures, beasts, characters, as well as scenes. This session discuss two key groups: plants and dragons. The former was adopted from both nature and religious practices; whereas the latter was acquired through cultural construction over time. This session discusses how the two genres merged along difference courses into what we understand as being Chinese today.   10. Chinese calligraphy and paintings Chinese calligraphy and paintings represent a major aesthetic system that includes the use of ink and brush, writing, as well as imagination particularly defined in Daoist writings. This session introduces the basic concepts of calligraphy and the features found in the classic paintings from the Song to the Qing periods.   11. Grave goods: objects for the deceased  Mingqi is a unique category of items produced in China. It is a group of goods created especially for the burial with the deceased that they are closely connected with the Chinese ideas about ghosts, spirits, and afterlife. This session will review the history of mingqi from as early as the Bronze Age, and look into how this understanding is translated in modern practice.  12. Antique collection and modern consumerism The antiquities of China provide a resourceful base for modern designers and cultural industries. In light of modern consuming practices, Chinese designers, architects, museum workers, historians, and other culture-related professionals fall back on inheritance to seek for ideas to create something new and unique for the country. This session reviews the concerns of relevant practitioners.   13. Conclusion  The concluding session outline the present ideas about material culture and its role in modern society, which is a topic that has become increasingly important in the spheres of anthropology and sociology. This session will combine the discussions on Chinese material culture and the discourse of object studies. This will give students ideas to develop interests in the study of China; and enable them to engage the past with the present.", "required_readings": "Primary textbooks i. Dant, Tim. Materiality and Society, Maidenhead : Open University Press, 2005.  ii. Rawson, Jessica (ed.). The British Museum Book of Chinese Art, 2nd edition, London: British Museum, 2007.  1. Introduction: What is the present view about Chinese material culture? Reading:  i. Dant 2005, pp. 1—32.   2. Jades Reading:  i. Rawson, Jessica. Chinese Jade from the Neolithic to the Qing, London : British Museum Press, 1995, Chapters 1—2 and Appendix (The minerology and occurrence of jade).  ii. Rawson 2007, pp. 44—83 (Jessica Rawson, ‘Jades and bronzes for ritual’).   3. Antique bronzes Reading:  i. Rawson 2007, pp. 44—83.  ii. 馬承源，《中國青銅器》(修訂本)，上海 : 上海古籍出版社，2003，頁1—18、393—443、491—521。  4. Lacquer Reading:  i. Hu, Shih Chang and Jane Wilkinson. Chinese Lacquer, Edinburgh : National Museums of Scotland Pub, 1998 (catalogue).  ii. Webb, Marianne. Lacquer: Technology and Conservation, Oxford ; Boston : Butterworth-Heinemann, 2000, pp. 1—23.   5. Sculpture Reading:  i. Rawson 2007, pp. 134—167 (Jessica Rawson, ‘Sculpture for tombs and temples’)  6. Architecture Reading:  i. Liang Ssu-ch'eng, A pictorial history of Chinese architecture : a study of the development of its structural system and the evolution of its types, Cambridge, Mass. : MIT Press, 1984, chapters 1—3.  ii. 羅哲文，《中国古代建筑》(修订本) ，上海 : 上海古籍出版社，2001，頁1—30及136—188。  7. Silk Reading:  i. Vainker, Shalagh, Chinese Silk: A Cultural History, London: British Museum Press, 2004, pp. 20—73.   8. Ceramics Reading:  i. Rawson 2007, pp. 212—255 (Shelagh Vainker, ‘Ceramics for Use’) ii. 馮先銘，《中國陶瓷》 (修訂本)，上海 : 上海古籍出版社，2006，頁375—420及452—461。  9. Ornaments Reading:  i. Rawson, Jessica. Chinese Ornament: The Lotus and the Dragon, London: British Museum, 1984, chapters 1—2.  ii. Tang, Chung (ed.) The First Dragon of China Exhibition Catalogue, Hong Kong: CUHK, 2012.   10. Chinese calligraphy and paintings Reading:  i. Rawson 2007, pp. 84—133 (Anne Farrer ‘Calligraphy and painting for official life’)  11. Grave goods: objects for the deceased  Reading:  i. Wu, Hung. The Art of Yellow Spring: Understanding Chinese Tombs, Honolulu: University of Hawaii Press, 2010, pp. 85—125.   12. Antique collection and modern consumerism Reading:  i. Dant 2005, pp. 108—135.   13. Conclusion  Reading:  i. Dant 2005, pp. 136—147.", "recommended_readings": "Ahern, Emily Martin. Chinese Ritual and Politics. Cambridge, England: Cambridge University Press, 2007. Bell, Daniel A. and Chaibong, Hahm. Confucianism for the Modern World. Cambridge, UK; New York: Cambridge University Press, 2003. Buonanni, Filippo. Techniques of Chinese lacquer: the classic eighteenth-century treatise on Asian varnish. Los Angeles: J. Paul Getty Museum, 2009. Cahill, James. Chinese Painting. New York, N.Y.: Rizzoli, 1990. Chiang, Yee. Chinese Calligraphy: An Introduction to Its Aesthetic and Technique, Third Revised and Enlarged Edition. Cambridge, Mass.: Harvard University Press; Revised edition, 1974. Clunas, Craig. Art in China. Oxford ; New York : Oxford University Press, 1997. Coutinho, Steve. An introduction to Daoist philosophies. New York : Columbia University Press, 2014. Fan, Jinshi & Hai, Weilan. Dunhuang: Buddhist art at the gateway of the Silk Road. New York: China Institute Gallery, 2013. Feng, Jiren. Chinese Architecture and Metaphor: Song Culture in the Yingzao Fashi Building Manual (Spatial Habitus). Honolulu, Hawaii: University of Hawaii Press, 2012. Gardner, Daniel K. Confucianism: A Very Short Introduction. New York : Oxford University Press, 2014. Gardner, Daniel K. The Four Books: The Basic Teachings of the Later Confucian Tradition. Indianapolis : Hackett Pub., 2007. Guo, Qinghua. The mingqi Pottery Buildings of Han Dynasty China: 206 BC-AD 220. Brighton England; Portland, Or.: Sussex Academic Press, 2010. Hearn, Maxwell K. How to Read Chinese Paintings. New York : Metropolitan Museum of Art ; New Haven : Yale University Press, 2008. Hu, Shih Chang & Wilkinson, Jane. Chinese lacquer. Edinburgh: National Museums of Scotland Pub., 1998. Huang, Shih-shan Susan. Picturing the True Form: Daoist Visual Culture in Traditional China. Cambridge, Mass.: Harvard University Asia Center: Distributed by Harvard University Press, 2012. Leidy, Denise Patry and Strahan, Donna. Wisdom Embodied: Chinese Buddhist and Daoist Sculpture in The Metropolitan Museum of Art. New York: Metropolitan Museum of Art; New Haven Conn.: Yale University Press, 2010. Little, Stephen; Schipper, Kristofer; Hung, Wu and Steinhardt, Nancy. Taoism and the Arts of China. 1st ed.. Chicago: Art Institute of Chicago; Berkeley: In association with University of California Press, 2000. Mollier, Christine. Buddhism and Taoism Face to Face: Scripture, Ritual, and Iconographic Exchange in Medieval China. Honolulu: University of Hawai'i Press, 2008. Ouyang, Zhongshi and Fong, Wen C. Chinese Calligraphy. New Haven: Yale University Press; Beijing: Foreign Languages Press, 2008. Shelton, Marla & Haig, Paul. Threads of Gold: Chinese Textiles, Ming to Ching. Atglen, PA: Schiffer Pub., 2006. Thorp, Robert L. and Vinograd, Richard Ellis. Chinese Art and Culture. New York: Abrams, 2001. Tythacott, Louise. The lives of Chinese objects: Buddhism, imperialism and display. New York: Berghahn Books, 2011. Watson, James L. and Rawski, Evelyn S. Death Ritual in Late Imperial and Modern China. Berkeley: University of California Press, 1988. Webb, Marianne. Lacquer: technology and conservation: a comprehensive guide to the technology and conservation of Asian and European lacquer. Oxford; Boston: Butterworth-Heinemann, 2000. Welch, Patricia Bjaaland. Chinese Art: A Guide to Motifs and Visual Imagery. North Clarendon, VT: Tuttle Pub., 2008. Yao, Xinzhong. An Introduction to Confucianism. New York: Cambridge University Press, 2000. Zhang, Hongxing. Masterpieces of Chinese Painting 700-1900. London: Victoria & Albert Museum, 2013. Zhao, Feng & Li, Wengying. Chinese Silks (The Culture & Civilization of China). New Haven: Yale University Press, 2012. 陳戍國，《中國禮制史:先秦卷》，湖南：湖南教育出版社，2001。 陳戍國，《中國禮制史:秦漢卷》，湖南：湖南教育出版社，2011。 戴欽祥，陸欽，李亞麟，《中國讀本：中國古代服飾》，北京：中國國際廣播出版社，2010。 洪石，《戰國秦漢漆器研究》，北京：文物出版社，2006。 華梅，《古代服飾》，北京：文物出版社，2004。 雷德侯 (Lothar Ledderose)，《萬物:中國藝術中的模件化和規模化生產》，北京：生活・讀書・新知三聯出版社，2012。 孫大章，《禮制建築》，北京：中國建築工業出版社，2012。 王靜芬，《中國石碑：一種象徵形式在佛教傳入之前與之後的運用》，北京：商務印書館，2011。 王世襄，《中國古代漆器》，北京：生活・讀書・新知三聯書店，2013。 王小盾，《中國早期思想與符號研究：關於四神的起源及其體系形成》上海：上海人民出版社，2012。 巫鴻，朱青生，鄭岩主編，《古代墓葬美術研究》(第2輯)，北京：文物出版社， 2011。 張榮著，張文彬主編，《古代漆器》，北京：文物出版社，2005。", "terms": {"2020-21 Term 1": {"--LEC (5901)": {"startTimes": ["12:30"], "endTimes": ["15:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor PENG Peng"]}}}, "assessments": {"Essays": "60", "Presentation": "40"}}, {"code": "2005", "title": "Management of Public and Non-profit Cultural Organization", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "Public and non-profit cultural organizations are positioned in the core part of traditional arts management education. This course aims to equip students with knowledge on the characteristics of public and non-profit cultural organizations as one type of cultural organizations, and mastery of the key management components of public and non-profit cultural organizations, including strategic planning, structural design, human resource management, leadership building, financial planning and fiscal management, marketing cultural products, and the organizations’ internal and external control and performance evaluation. A series of in-class exercises and individual and group projects is designed to develop students’ knowledge and management skills simultaneously.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2006", "title": "Understanding Chinese Art through Exhibitions", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-tripLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "(UGED2286 is double-coded with CUMT2006.) The exhibition has become a site of knowledge production and a prominent and diverse part of contemporary culture. Regarding “Chinese art” as a social constructed concept, the course uses “exhibition” as an entry point to engage with issues concerning Chinese art and to explore the role played by exhibitions in the formation of the knowledge of Chinese art. It introduces the current theories and debates on the theory and history of exhibition, and the display methods, examining the changing concept of Chinese art and curatorial practices through detailed analysis of case studies. The first part of the course traces the formation of the concept of “Chinese art” by looking closely at the history of exhibitions on Chinese objects from the late Qing dynasty to the early twentieth century. The second part examines important exhibitions that have shaped our understanding of Chinese art. Structured thematically, the course discusses the curatorial concepts of selective significant international exhibitions on Chinese art, and investigate how scholarly research has been transformed into exhibitions which have shaped our understanding of Chinese art, constructed identity and been deployed for political ends.", "outcome": " Upon the completion of the course, students will be able to:  ·      Explain the theories of exhibition and the changing concepts of Chinese art  ·      Identify and describe the important exhibitions on Chinese art and prominent Chinese art objects. ·      Identify and evaluate the curatorial ideas of important exhibitions on Chinese art. ·      Select research materials and Chinese art objects to develop original research. ·      Design and plan a virtual exhibition based on original research.   ", "syllabus": " Part I The Theory of Exhibition and the History of Exhibitions on Chinese Art 1.       Introduction: Narrative Theories and Exhibition Rhetorics 2.       Displaying Chinese objects in international expositions and world fairs 3.       Museum practices and curating international exhibitions on Chinese art 4.       Two Palace Museums: canonising Chinese art history   Part II Exhibitions that Have Shaped Our Understanding of Chinese Art 5.       Constructing a canonical narrative and continuous visual history of Chinese art Catalogue of the exhibition Splendors of Imperial China: Treasures from the National Palace Museum, Taipei (New York: The Metropolitan Museum of Art, 1996) Chang Lin-sheng, “The National Palace Museum: A History of the Collection”, in Possessing the Past: Treasures from the National Palace Museum, Taipei (New York: The Metropolitan Museum of Art, 1996), 3-25. Wen Fong, “Chinese Art and Cross-Cultural Understanding”, in Possessing the Past: Treasures from the National Palace Museum, Taipei (New York: The Metropolitan Museum of Art, 1996), 27-39. 6.       Funding paradigms: politics, literati tastes and imperial collection in the Northern and Southern Song Dynasties Catalogues of the exhibitions Grand View (Taipei: National Palace Museum) and Dynastic Renaissance (Taipei: National Palace Museum) Wen Fong, “Deconstructing Paradigms in Sung and Yuan Painting: Life After the Death of Mastering Representation’, in Wang Yao-ting ed., Conference on Founding Paradigms: Papers on the Art and Culture of the Northern Sung Dynasty (Taipei: National Palace Museum, 2008), 9-39. Huang Kuan-chung, “All Embracing the Arts: The Development of Features of Southern Song politics, Scholars, and Culture”, in Dynastic Renaissane: Art and Culture of the Southern Song (Taipei: National Palace Museum), 18-30. 7.       The arts under the Mongols: mutual assimilation between Chinese culture and foreign cultures Catalogue of the exhibition The World of Khubilai Khan: Chinese Art in the Yuan Dynasty (New York: The Metropolitan Museum of Art, 2010) James C.Y. Watt, “Introduction”, James C.Y. watt ed., the World of Khubilai Khan Chinese Art in the Yuan Dynasty (New Haven and London: Yale University Press, 2010), 3-38. Maxwell Hearn, “Painting and Calligraphy under the Mongols”, in James C.Y. watt ed., the World of Khubilai Khan Chinese Art in the Yuan Dynasty (New Haven and London: Yale University Press, 2010), 181-242. 8.       Re-examining the Ming Dynasty: courts and global cultural exchange Catalogue of the exhibition Ming 50 Years that Changed China (London: British Museum) Craig Clunas, “A Second Founding: Ming China 1400-1450 ”, in Craig Clunas and Jessica Harrison-Hall eds., The BP Exhibition Ming 50 Years that Changed China (London: British Museum, 2014), 18-43. Craig Clunas, “Wen: The Arts of Peace”, in Craig Clunas and Jessica Harrison-Hall eds., The BP Exhibition Ming 50 Years that Changed China (London: British Museum, 2014), 158-203. 9.       Cultural diversity and imperial tastes under the rule of Manchu Catalogues of the exhibitions China: The Three Emperors, 1966-1795 (London: Roy Academy of Arts) and The All Complete Qianlong: The Aesthetic Tastes of the Qing Emperor Gaozong (Taipei: The National Palace Museum, 2012) Evelyn Rawski, “The ‘Prosperous Age’: China in the Kangxi, Yongzheng and Qianlong reigns”, in Evelyn Rawski and Jessica Rawson eds., China: the Three Emperors, 1662-1795 (London: Royal Academy of Arts, 2006), 22-53. Alfreda Murck, “Silent Satisfactions: Painting and Calligraphy of Chinese Educated Elite”, in Evelyn Rawski and Jessica Rawson eds., China: the Three Emperors, 1662-1795 (London: Royal Academy of Arts, 2006), 306-55. 10.   Modernity, urban culture and nation-building   Catalogues of the exhibitions A Century in Crisis: Modernity and Tradition in the Art of Twentieth-Century China (Guggenheim Museum, 1998) and Between Two Cultures: Late Nineteenth- and Twentieth-Century Chinese Paintings from the Robert H. Ellsworth Collection in the Metropolitan Museum of Art (New York: The Metropolitan Museum of Art, 2001) Wen Fong, “Introduction: East Meets West”, in Between Two Cultures: Late Nineteenth- and Twentieth-Century Chinese Paintings from the Robert H. Ellsworth Collection in the Metropolitan Museum of Art (New York: The Metropolitan Museum of Art, 2001), 3-22. Aida Wong, “Tradition is a Foreign Country”, Parting the Mists: Discovering Japan and the Rise of National-style Painting in Modern China (Honolulu: University of Hawaii Press, 2006), 3-34. 11.   Art in the Mao era: revolution, popular arts and propaganda Catalogues of the exhibitions A Century in Crisis: Modernity and Tradition in the Art of Twentieth-Century China (Guggenheim Museum, 1998) and Art and China’s Revolution (New York: Asia Society, 2008) Ralph Croizier, “Politics in Command: Chinese Art, 1949-1979”, in Melissa Chiu and Shengtian Zheng eds., Art and China’s Revolution (New Haven: Yale University Press, 2008), 57-73. Kuiyi Shen, “Propaganda Posters and Art during the Cultural Revolution”, in Melissa Chiu and Shengtian Zheng eds., Art and China’s Revolution (New Haven: Yale University Press, 2008), 149-163. 12.   Wrap Up: Understanding Chinese art from multi-perspectives Catalogues of the exhibitions Fineries of Forgery: “Suzhou Fakes” and Their Influence in the 16th to 18th Century (Taipei: National Palace Museum, 2018) and Beauty Revealed: Images of Women in Qing Dynasty Chinese Painting (Berkeley: BAMPFA, 2013) “Introduction and sectional texts of the exhibition Fineries of Forgery”: http://theme.npm.edu.tw/exh107/SuzhouFakes/en/index.html#main) James Cahill, “Beautiful Women and the Courtesan Culture”, in Pictures for Use and Pleasure: Vernacular Painting in High Qing China (Berkeley: University of California Press, 2010), 149-198", "required_readings": " 1. Introduction: Narrative Theories and Exhibition Rhetorics  Bruce W. Ferguson, “Exhibition Rhetorics”, in Reesa Greenberg, Sandy Nairne, and Bruce W. Ferguson eds., Thinking About Exhibition (London: Routledge, 1996), 175-190. Tony Bennett, “The Exhibitionary Complex,” New Formations 4 (1988): 73-102. Criag Clunas, “Beginning and Ending”, Chinese Painting and Its Audiences (Princeton and Oxford: Princeton University Press, 2017), 5-35 2. Displaying Chinese objects in international expositions and world fairs Susan Fernsebner, “Objects, Spectacle, and a Nation on Display at the Nanyang Exposition of 1910,” Late Imperial China 27, no. 2 (December 2006): 99–124. Susan Fernsebner, “When the Local is the Global: Case Studies in Early 20th Century Chinese Exposition Projects.” In Expanding Nationalisms at World Fairs: Identity, Diversity And Exchange, 1851-1915, in David Raizman and Ethan Robey eds., Expanding Nationalisms at World Fairs: Identity, Diversity And Exchange, 1851-1915 (New York: Routledge, 2017), 173-194. 3. Museum practices and curating international exhibitions on Chinese art Jason Steuber, “The Exhibition of Chinese Art at Burlington House, London, 1935-1936”, The Burlington Magazine 148, 1241 (2006): 528-36. Pedith Chan, “Representations of Chinese Civilisation: Exhibiting Chinese Art in Republican China”, in Suzanne Macleod, Tricia Austin, Jonathan Hale, Oscar Ho eds., The Future of Museum and Gallery Design: Purpose, Process, Perception (London: Routledge, 2018), 71-85. 4. Two Palace Museums: canonising Chinese art history Susan Naquin, “The Forbidden City Goes Abroad: Qing History and the Foreign Exhibitions of the Palace Museum, 1974-2004”, T’oung Pao, vol. 90 (4) (2004): 341-97. Jane C. Chu, “The Palace Museum as Representation of Culture: Exhibitions and Canons of Chinese Art History,” in Huang Ke-wu ed., Hua zhong you hua: Jindai Zhongguo de shijue biaoshu yu wenhua goutu 畫中有話: 近代中國的視覺表述與文化構圖 (Taipei: Academia Sinica Institute of Modern History, 2003), 477-507.  5. Constructing a canonical narrative and continuous visual history of Chinese art Catalogue of the exhibition Splendors of Imperial China: Treasures from the National Palace Museum, Taipei (New York: The Metropolitan Museum of Art, 1996) Chang Lin-sheng, “The National Palace Museum: A History of the Collection”, in Possessing the Past: Treasures from the National Palace Museum, Taipei (New York: The Metropolitan Museum of Art, 1996), 3-25. Wen Fong, “Chinese Art and Cross-Cultural Understanding”, in Possessing the Past: Treasures from the National Palace Museum, Taipei (New York: The Metropolitan Museum of Art, 1996), 27-39. 6. Funding paradigms: politics, literati tastes and imperial collection in the Northern and Southern Song Dynasties Catalogues of the exhibitions Grand View (Taipei: National Palace Museum) and Dynastic Renaissance (Taipei: National Palace Museum) Wen Fong, “Deconstructing Paradigms in Sung and Yuan Painting: Life After the Death of Mastering Representation’, in Wang Yao-ting ed., Conference on Founding Paradigms: Papers on the Art and Culture of the Northern Sung Dynasty (Taipei: National Palace Museum, 2008), 9-39. Huang Kuan-chung, “All Embracing the Arts: The Development of Features of Southern Song politics, Scholars, and Culture”, in Dynastic Renaissane: Art and Culture of the Southern Song (Taipei: National Palace Museum), 18-30. 7. The arts under the Mongols: mutual assimilation between Chinese culture and foreign cultures Catalogue of the exhibition The World of Khubilai Khan: Chinese Art in the Yuan Dynasty (New York: The Metropolitan Museum of Art, 2010) James C.Y. Watt, “Introduction”, James C.Y. watt ed., the World of Khubilai Khan Chinese Art in the Yuan Dynasty (New Haven and London: Yale University Press, 2010), 3-38. Maxwell Hearn, “Painting and Calligraphy under the Mongols”, in James C.Y. watt ed., the World of Khubilai Khan Chinese Art in the Yuan Dynasty (New Haven and London: Yale University Press, 2010), 181-242. 8. Re-examining the Ming Dynasty: courts and global cultural exchange Catalogue of the exhibition Ming 50 Years that Changed China (London: British Museum) Craig Clunas, “A Second Founding: Ming China 1400-1450 ”, in Craig Clunas and Jessica Harrison-Hall eds., The BP Exhibition Ming 50 Years that Changed China (London: British Museum, 2014), 18-43. Craig Clunas, “Wen: The Arts of Peace”, in Craig Clunas and Jessica Harrison-Hall eds., The BP Exhibition Ming 50 Years that Changed China (London: British Museum, 2014), 158-203. 9. Cultural diversity and imperial tastes under the rule of Manchu Catalogues of the exhibitions China: The Three Emperors, 1966-1795 (London: Roy Academy of Arts) and The All Complete Qianlong: The Aesthetic Tastes of the Qing Emperor Gaozong (Taipei: The National Palace Museum, 2012) Evelyn Rawski, “The ‘Prosperous Age’: China in the Kangxi, Yongzheng and Qianlong reigns”, in Evelyn Rawski and Jessica Rawson eds., China: the Three Emperors, 1662-1795 (London: Royal Academy of Arts, 2006), 22-53. Alfreda Murck, “Silent Satisfactions: Painting and Calligraphy of Chinese Educated Elite”, in Evelyn Rawski and Jessica Rawson eds., China: the Three Emperors, 1662-1795 (London: Royal Academy of Arts, 2006), 306-55. 10. Modernity, urban culture and nation-building   Catalogues of the exhibitions A Century in Crisis: Modernity and Tradition in the Art of Twentieth-Century China (Guggenheim Museum, 1998) and Between Two Cultures: Late Nineteenth- and Twentieth-Century Chinese Paintings from the Robert H. Ellsworth Collection in the Metropolitan Museum of Art (New York: The Metropolitan Museum of Art, 2001) Wen Fong, “Introduction: East Meets West”, in Between Two Cultures: Late Nineteenth- and Twentieth-Century Chinese Paintings from the Robert H. Ellsworth Collection in the Metropolitan Museum of Art (New York: The Metropolitan Museum of Art, 2001), 3-22. Aida Wong, “Tradition is a Foreign Country”, Parting the Mists: Discovering Japan and the Rise of National-style Painting in Modern China (Honolulu: University of Hawaii Press, 2006), 3-34. 11. Art in the Mao era: revolution, popular arts and propaganda Catalogues of the exhibitions A Century in Crisis: Modernity and Tradition in the Art of Twentieth-Century China (Guggenheim Museum, 1998) and Art and China’s Revolution (New York: Asia Society, 2008) Ralph Croizier, “Politics in Command: Chinese Art, 1949-1979”, in Melissa Chiu and Shengtian Zheng eds., Art and China’s Revolution (New Haven: Yale University Press, 2008), 57-73. Kuiyi Shen, “Propaganda Posters and Art during the Cultural Revolution”, in Melissa Chiu and Shengtian Zheng eds., Art and China’s Revolution (New Haven: Yale University Press, 2008), 149-163. 12. Wrap Up: Understanding Chinese art from multi-perspectives Catalogues of the exhibitions Fineries of Forgery: “Suzhou Fakes” and Their Influence in the 16th to 18th Century (Taipei: National Palace Museum, 2018) and Beauty Revealed: Images of Women in Qing Dynasty Chinese Painting (Berkeley: BAMPFA, 2013) “Introduction and sectional texts of the exhibition Fineries of Forgery”: http://theme.npm.edu.tw/exh107/SuzhouFakes/en/index.html#main) James Cahill, “Beautiful Women and the Courtesan Culture”, in Pictures for Use and Pleasure: Vernacular Painting in High Qing China (Berkeley: University of California Press, 2010), 149-198.", "recommended_readings": " Crane, Susan ed., Museums and Memory (Stanford: Stanford University Press, 2000, 137-58) White, Julia, James Cahill etc eds., Beauty Revealed: Images of Women in Qing Dynasty Chinese Painting (Berkeley: University of California, BAMPFA, 2013) Clunas, Criag, Art in China (New York: Oxford University Press, 2009) Danzker, Jo-Anne, Ken Lum, and Zheng Shengtian eds., Shanghai Modern, 1919-1945 (Ostildern-Ruit: Hatje Cantz, 2004) Greenberg, Reesa, Sandy Nairne, and Bruce W. Ferguson eds., Thinking About Exhibition (London: Routledge, 1996) Kachur, Lewis, Displaying the Marvelous (Cambridge, Massachusetts: The MIT Press, 2001) Harrison-Hall, Jessica, China A History in Objects (London: Thames & Hudson, 2017) Hearn, Maxwell, Splendors of Imperial China: Treasures from the National Palace Museum, Taipei (New York: Metropolitan Museum of Art, 1996) Hearn, Maxwell and Judith Smith eds., Arts of the Sung and Yuan: Papers Prepared for an International Symposium Organized by the Metropolitan Museum in Conjunction with the Exhibition Splendors of Imperial China: Treasures from the National Palace Museum, Taipei (New York: Metropolitan Museum of Art, 1996) Ho, Chuimei and Bennet Bronson eds., Splendors of China’s Forbidden City: The Glorious Reign of Emperor Qianlong (Chicago: Field Museum, 2004) Kao, Mayching ed., Twentieth-century Chinese Painting (New York: Oxford University Press, 1988) Karp, Ivan and Steven D. Lavine eds., Exhibiting Cultures (Washington, DC: Smithsonian Institution Press, 1991) Kuo, Jason, Discovering Chinese Painting: Dialogues with Art Historians (Iowa: Kendall/ Hunt Pub. Co., 2006) Ledderose, Lothar, Ten Thousand Things: Module and Mass Production in Chinese Art (Princeton: Princeton University Press, 2000) Thorp, Robert and Richard Vinograd, Chinese Art & Culture (New York: Abrams, 2001) Twentieth Century Chinese Painting: Tradition and Innovation (Hong Kong: Urban Council, 1995) 李天鳴編：《文藝紹興：南宋藝術與文化 · 圖晝卷》（台北：國立故宮博物院，2010） 何傳馨編：《文藝紹興：南宋藝術與文化 · 書畫卷》（台北：國立故宮博物院，2010） 邱世華、林麗江、賴毓芝編：《偽好物：16至18世紀蘇州片及其影響》（台北：國立故宮博物院，2018） 林伯亭編：《大觀：北宋書畫特展》（台北：國立故宮博物院，2006） 林伯亭編：《大觀：北宋汝窯特展》（台北：國立故宮博物院，2006） 蔡玫芬編：《文藝紹興：南宋藝術與文 · 器物卷》（台北：國立故宮博物院，2010）", "terms": {"2020-21 Term 1": {"--LEC (4783)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor YI Hye-shim"]}}}, "assessments": {"Essays": "50", "Presentation": "40", "Participation": "10"}}, {"code": "2007", "title": "Curation in Arts and Culture", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "“Curating,” a word that was once only used in museums, now has applications in everything in our lives, ranging from radio station DJs to almost all types of social media content. The popularity of the word reflects the growing importance of assembling, managing and presenting data and collection, a process of gathering information that brings maximum value relevant to different audiences.In this context, this course is designed to provide students with an opportunity to learn about both historical and contemporary examples of how culture is understood through exhibition design and curating. By covering various forms of curatorial traditions, disruptive ideas, and emergent digital practices in the ever-expanding field of curation, this course equips students with the ability to question what they take for granted and reflect on existing issues conducive to different cultures, values and beliefs. By the end of the course, students will be able to critically examine how knowledge is created inside and outside of art institutions and how curation could potentially become public knowledge.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2009", "title": "Introduction to the Art Market", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "The artworld is constructed through a network of individuals and institutions, all of which participate in con-tributing to the wider ecosystem of the global network and marketplace for art. The co-generative or mutu-ally constitutive nature between key players and institutions provides the context and rules for evaluating the aesthetic and economic value of art objects. In recent years, the art market has witnessed tremendous growth, and clusters of new galleries, global art fairs and auction houses have sprung up in cities within both developed and emerging economies, forming an ever-expanding network of art transitions, exhibi-tions, and causing an explosion of cultural activities amid various forms of urbanization. This course aims to provide students with theoretical knowledge and practical skills on how to identify the dynamic roles and activities of key players and institutions in the art market. It begins with an introduction to the history of art market, patronage system and art market logic. The, various practical skills are covered, including art valuation methods, techniques of buying and selling art, and agreements and laws that govern art transactions. In addition to practical skills, this course also encourages students to critically evaluate the complex relationships between the economy, aesthetic values and social behaviors within the global market-place. Special focus will be on emerging technologies and platforms concerning the global online art market.\r", "outcome": "Upon completing this course, students will be able to:\r • Identify the roles and activities of key players and institutions in the art market\r • Explain and analyze the history of the art market, patronage system and art market logic\r • Develop skills in art valuation, the buying and selling of art, creating agreements and understanding the laws that govern art transactions\r • Acquire personal and social competencies in connecting with the art community and pursuing future careers\r • Develop skills in critical analysis concerning the complex relationships between the economy, aesthetic values and social behaviors within the global marketplace\r • Develop an attitude of innovation and creativity by understudying emerging technologies and plat-forms concerning the global online art market", "syllabus": "Major Concepts / Topics Core Readings\r • Introduction to the history of the art market and patronage system\r • The logic of art market\r • Global network and market place of art\r • Art valuation method\r • Techniques for buying and selling art\r • Agreements and laws that govern art transactions\r • Complex relationships between the economy, aesthetic values and social behaviors\r • Emerging technologies and platforms concerning the global online art market", "required_readings": "1) Introduction to the history of the art market and patronage system\r • Crenshaw, P. (2014). Rembrandt's bankruptcy: The artist, his patrons, and the art market in seventeenth-century Netherlands. New York: Cambridge University Press.\r • Hulst, T. V. (2017). A history of the western art market: A sourcebook of writings on artists, dealers, and markets. Oakland, CA: University of California Press.\r  2) The logic of the art market\r • Robertson, I. (2015). Understanding art markets: Inside the world of art and business. London: Routledge.\r • Harris, J. (2011). Globalization and contemporary art. Chichester: Wiley-Blackwell.\r  3) Art valuation methods\r • Findlay, M. (2014). The value of art money, power, beauty. Munich: Prestel.\r • McNulty, T. (2014). Art market research: A guide to methods and sources. Jefferson, NC: McFarland & Company.\r  4) Techniques for buying and selling art\r • Matassa, F. (2017). Valuing your collection: A practical guide for museums, libraries and ar-chives. London: Facet Publishing.\r • Winkleman, E. (2017). Selling contemporary art: How to navigate the evolving market. New York: Allworth Press.\r  5) Agreements and laws that govern art transactions\r • DuBoff, L. D., & Murray, M. D. (2017). Art law: Cases and materials. New York: Wolters Kluwer.\r • Prowda, J. B. (2013). Visual arts and the law: A handbook for professionals. Farnham: Lund Humphries.\r  6) Complex relationships between the economy, aesthetic values and social behaviors\r • Throsby, C. D. (2013). The economics of cultural policy. Cambridge: Cambridge University Press.\r • Dirks, N. B., Eley, G., & Ortner, S. B. (2004). Culture/power/history: A reader in contemporary social theory. Princeton, NJ: Princeton University Press.\r  7) Emerging technologies and platforms concerning the global online art market\r • Catlow, R., Garrett, M., Jones, N., & Skinner, S. (2017). Artists re:thinking the blockchain. Eng-land: Torque editions.\r • Graham, B. (2015). Rethinking curating: Art after new media. Place of publication not identified: MIT Press.", "recommended_readings": "• Adam, G. (2017). Dark Side of the Boom: The excesses of the art market in the 21st century. S.l.: Lund Hunphries.\r • Aerts, D., Stalpaert, C., Roy, F. L., & Vanderbeeken, R. (2012). Drunk on Capitalism. An Interdiscipli-nary Reflection on Market Economy, Art and Science. Springer Netherlands.\r • Bamberger, A. S. (2018). The art of buying art: How to evaluate and buy art like a professional collec-tor. London: Robinson.\r • Bayer, T. M., & Page, J. R. (2016). The development of the art market in England: Money as muse, 1730-1900. London: Routledge.\r • Braathen, M. (2007). The price of everything ...: Perspectives on the art market. New Haven, CT: Yale University Press.\r • Davis, R. (2009). Art dealer's field guide: How to profit in art buying and selling valuable paintings. Jacksonville, FL: Capital Letters Pub.\r • De Filippi, P. (2015). Blockchain-Based Crowdfunding: What Impact on Artistic Production and Art Consumption? Observatório Itaú Cultural, Issue 19, 2015. Available at SSRN: https://ssrn.com/abstract=2725373\r • Fillitz, T., & Grijp, P. V. (2018). An anthropology of contemporary art practices, markets, and collec-tors. London: Bloomsbury Academic, An imprint of Bloomsbury Publishing Plc.\r • Fletcher, P. M., & Helmreich, A. (2011). The rise of the modern art market in London. Manchester: Man-chester University Press.\r • Flynn, T. (2017). The A-Z of the international art market: The essential guide to customs, conventions and practice. London: Bloomsbury Business.\r • Gamboa, S. (n.d.) The Influence of Technology in Art Appreciation and Sales as a Factor in the Sus-tainability of the Retail Art Industry.\r • Graham, B (2017). New Collecting: Exhibiting and Audiences after New Media Art. Garland Science.\r • Horowitz, N. (2014). Art of the deal: Contemporary art in a global financial market. Princeton: Princeton University Press.\r • Jones, M. E. (2016). Art law: A concise guide for artists, curators, and art educators. Lanham, MD: Rowman et Littlefield.\r • Jung, Y., & Love, A. R. (2017). Systems thinking in museums: Theory and practice. Lanham, MD: Rowman & Littlefield.\r • Kagge, E. (2015). A poor collector's guide to buying great art. Oslo: Kagge Forlag.\r • Moulon, D. (2018). Art Beyond Digital. S.l.: lulu.com.\r • Plattner, S. (1996). High art down home: An economic ethnography of a local art market. Chicago: Univ. of Chicago Press.\r • Reid, M. (2008). How to buy and sell art. Crows Nest, N.S.W.: Allen & Unwin.\r • Rhodes, A. (2011). Art law & transactions. Durham, NC: Carolina Academic Press.\r • Sanctis, F. M. (2015). Money laundering through art: A criminal justice perspective. Cham: Springer.\r • Shiner, L. (2008). The invention of art a cultural history. Chicago: Univ. of Chicago Press.\r • Spieth, D. A., & Fumaroli, M. (2018). Revolutionary Paris and the market for Netherlandish art. Leiden: Brill.\r • Thornton, S. (2009). Seven days in the art world. London: Granta.\r • Towse, R., & Handke, C. (2014). Handbook on the Digital Creative Economy. Edward Elgar.\r • Velthuis, O. (2013). Talking Prices: Symbolic Meanings of Prices on the Market for Contemporary Art. Princeton: Princeton University Press.\r • Zarobell, J. (2017). Art and the global economy. Oakland, CA: University of California Press.", "terms": {"2020-21 Term 1": {"--LEC (7843)": {"startTimes": ["12:30"], "endTimes": ["15:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor LEUNG Hok Bun Isaac"]}}}, "assessments": {"Essays": "80", "Presentation": "20"}}, {"code": "2010", "title": "Music, Culture and Outreach", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "It is of crucial significance for cultural practitioners and managers to develop a solid foundation and capability in understanding the nature of music from various perspectives, as well as possessing the competency in appreciating the aesthetic and artistic value of musical works for the sake of advocating, marketing, coordinating and managing various programmes, events and outreach in music. Through exploring a wide range of music literature from different historical periods in music, the course focuses on three main perspectives:The first perspective focuses on listening and examining the major masterpieces in the history of music from Middle Ages to Modern, in which musical elements and characteristics of major forms and genres will be introduced and analysed. The second perspective is identified by the relationship of music to culture, in which the influence that cultural, social, political and religious events have exerted on music will be discussed. The third perspective focuses on experiencing and examining the approaches of music education in advocating music in the society. Through experiential learning, students will be able to develop basic knowledge and skills for applying the current theories and approaches in music education (e.g. play-based approach, Orff Schulwerk, Dalcroze, Kodaly) to outreach and education in the society.\r", "outcome": "By the end of the course, students should be able to:\r 1. Develop a comprehensive understanding of the musical elements which define styles, genres and historical periods of music; 2. Demonstrate cognitive, analytic and critical skills in analysing the musical works of different historical periods; 3. Gain comprehensive and in-depth understanding of the influence that cultural, social, political and religious events have exerted on music; 4. Understand pertinent education theories in music education and their implications on musical enculturation and advocacy; 5. Develop plans of introducing music through outreach activities to children and the general public by creative, play-based and other current music pedagogies such as Orff Schulwerk and Dalcroze.", "syllabus": "Part I: Basics in Music Appreciation\r  1. What is “Music Appreciation”? \r This session gives an introduction to how to be an ‘educated’ listener’. Major elements and focus of listening in appreciating the aesthetic and artistic value of music will be introduced.\r  2. Roles of Music in the Society\r This session discusses the roles of music in the society and various impacts of music will be discussed. Also, this section investigates how cultural, social, political and religious events have influenced the development of music.\r  3. Understanding Orchestration \r This session uses musical excerpts and examples to illustrate the characteristics and timbre/tone colour of a wide range of orchestral instruments, as well as various concepts on orchestration. \r  4. Field Trip\r Field trip to a music institution (e.g. orchestra) will be arranged for students to gain a deeper understanding on the various aspects of performance as well as management of music institutions.\r  Part II: A Journey to Appreciating Music\r  5. Music in Middle Ages (500-1400) and Renaissance (1450-1600)\r This session introduces the main characteristics of Middle Ages and Renaissance music. Major genres and musical styles of the Middle Ages will be discussed, e.g. Gregorian Chant, Mass, Estampe, Rondeau. Featured genres in the Renaissance will also be discussed, e.g. Motet, Mass, Madrigal, Lute Song, Polychoral Motet. Through exploring the musical works of Middle Ages and Renaissance, the interrelationship among music, culture and society will be discussed.\r  6. Music in the Baroque Period (1600-1750) \r This session studies the main characteristics and musical style of Baroque music. Major forms and genres of Baroque music will be introduced and analysed, e.g. Opera, Solo Concerto, Prelude and Fugue, Cantata, Oratorio, Suite. Through exploring the musical works of Baroque period, the interrelationship among music, culture and society will be discussed.\r  7. Music in the Classical Period (1750-1820)\r This session studies the main characteristics and musical style of Classical Period. Major forms and genres of Baroque music will be introduced and analysed, e.g. sonata form, theme and variation, rondo, classical symphony, classical concerto. \r  8. Music in the Romantic Period (1820-1900) \r This session studies the main characteristics of Romantic period. Romantic art songs, operas, programme music, and instrumental works will be introduced and analysed. Through exploring the musical works of Classical period, the interrelationship among music, culture and society will be discussed.\r  9. Modern Music (1900-Present)/Music of Non-Western Cultures\r This session studies the main characteristics of modern music. For example, expressionism, impressionism, 20th century nationalism, and Jazz music will be introduced and analysed. This session also examines the characteristics, musical styles, genres, instrumentation of music from non-western culture, e.g. music in sub-Saharan Africa, classical music of India, Koto music of Japan. Through exploring music of non-western cultures and the musical works of modern period , the interrelationship among music, culture and society will be discussed.\r  Part III: Bringing the Joy of Appreciating Music through Education\r  10. Current Theories and Practices in Music Education \r This session focuses on discussing the current theories, thoughts, and approaches in music education, e.g. Developmentally Appropriate Practice (DAP), Play-Based Approach, Orff Schulwerk, and Dalcroze Approach. The application of these approaches and theories to music appreciation activities in outreach programmes will be discussed.\r  11. Workshop in Music Pedagogies (I)\r Through experiential learning and firsthand experience, this session introduces the skills and techniques in movement and choreography for conducting outreach and education in music. Musical excerpts discussed in Part II will be used as examples for illustration.\r  12. Workshop in Music Pedagogies (II)\r Through experiential learning and firsthand experience, this session introduces the skills and techniques in singing and chanting, and the application of percussion instruments for conducting outreach and education in music. Musical excerpts discussed in Part II will be used as examples for illustration.\r  13. Presentation and Conclusion", "required_readings": "1. What is “Music Appreciation”?\r Kamien, R. (2011). Music: An Appreciation ( pp.1-7). New York: McGraw-Hill.Kamien.\r Kamien, R. (2011). Music: An Appreciation ( pp.31-67). New York: McGraw-Hill.Kamien.\r  2. Roles of Music in the Society\r Hoffer, C. (2013). Music Listening Today (pp.2-8). Boston: Schirmer Cengage Learning.\r Elliott, D. J. (1995). Music Matters: A New Philosophy of Music Education (pp.296-304). New York & Oxford: Oxford University Press.\r  3. Understanding Orchestration \r Hoffer, C. (2013). Music Listening Today (pp.29-48). Boston: Schirmer Cengage Learning.\r Kamien, R. (2011). Music: An Appreciation ( pp.10-29). New York: McGraw-Hill.Kamien.\r  4. Field Trip\r  5. Music in Middle Ages (500-1400) and Renaissance (1450-1600)\r Kamien, R. (2011). Music: An Appreciation ( pp.71-91). New York: McGraw-Hill.Kamien.\r Kamien, R. (2011). Music: An Appreciation ( pp.93-115). New York: McGraw-Hill.Kamien.\r  6. Music in the Baroque Period (1600-1750) \r Kamien, R. (2011). Music: An Appreciation ( pp.117-181). New York: McGraw-Hill.Kamien.\r Hoffer, C. (2013). Music Listening Today (pp.108-125). Boston: Schirmer Cengage Learning.\r  7. Music in the Classical Period (1750-1820)\r Kamien, R. (2011). Music: An Appreciation (pp.188-204). New York: McGraw-Hill.Kamien.\r Hoffer, C. (2013). Music Listening Today (pp.141-169). Boston: Schirmer Cengage Learning.\r  8. Music in the Romantic Period (1820-1900) \r Kamien, R. (2011). Music: An Appreciation ( pp.251-355). New York: McGraw-Hill.Kamien.\r  9. Modern Music (1900-Present)/Music of Non-Western Cultures\r Kamien, R. (2011). Music: An Appreciation (pp.525-547). New York: McGraw-Hill.Kamien.\r Hoffer, C. (2013). Music Listening Today (pp.254-281). Boston: Schirmer Cengage Learning.\r  10. Current Theories and Practices in Music Education \r Goodkin, D. (2001), Orff Schulwerk in the New Millennium, Music Educators Journal, 88(3), p.17-23.\r Greater, J. D. (2004). An Introduction to Music in Early Childhood Education (pp.174-179). NY: Delmar Publishers.\r  11. Workshop in Music Pedagogies (I)\r Pope, J. (2010), Dalcroze Eurhythmics: Interaction in Australia in the 1920s, Australian Journal of Music Education, 2(1), p.135-147.\r Young, S., and Glover, J. (1998). Music in the Early Years (pp. 69-89). Bristol, PA: RoutledgeFalmer.\r  12. Music Appreciation in Education Workshop: Techniques and Skills (II) \r Niland, A. (2009). The Power of Musical Play: The Value of Play-Based, Child-Centered Curriculum in Early Childhood Music Education. General Music Today, 23(1), p.17-21.\r Campbell, P. S., and Scott-Kassner, C. (2002). Music in Childhood: From Preschool through the Elementary Grades. (2nd ed.) (pp.350-359). Belmont, CA: Wadsworth Publishing.\r  13. Presentation and Conclusion", "recommended_readings": "Charlton, K. (2007). Experience music. Boston: McGraw-Hill.\r Compier, D. (2013). Listening to popular music. Minneapolis: Fortress.\r Ferris, J. (2008). Music: the art of listening. Boston: McGraw-Hill.\r Forney, K. (2003). Study guide for the enjoyment of music. New York: Norton.\r Hawkins, S. (2011). Pop music and easy listening. Farnham, Ashgate. \r Herbert, R. (2011). Everyday music listening: absorption, dissociation and trancing. Farnham, Ashgate.\r Jacobson, J. (2008). The classical music experience: Hear & discover exclusive access to more than 40 hours of music from the world’s greatest composers online. Naperville: Sourcebooks\r Kramer, L. (2011). Interpreting music. Berkeley: University of California Press. MediaFusion.\r Yudkin, J. (2010). Understanding music. Upper Saddle River: Prentice Hall.", "terms": {"2020-21 Term 2": {"--LEC (6327)": {"startTimes": ["12:30"], "endTimes": ["15:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor CHUNG Ming Yan Fanny"]}}}, "assessments": {"Essays": "60", "Others": "10", "Presentation": "30"}}, {"code": "2013", "title": "Art Institutions in Twentieth-Century China", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Chinese University of HK", "requirements": "", "description": "(GENA2372 is double-coded with CUMT2013)The course examines the correlation between art and institutions in twentieth-century China, aiming to encourage students to think about modern Chinese art through the concept of the artworld. The downfall of the Qing dynasty and the establishment of the Republican China transformed the social and institutional organisation of the production, distribution, and consumption of art as well as the traditional patronage system in modern China. The structural changes conditioned the emergence of formal and informal art institutions that facilitated yet constrained artistic practices, laying the foundation for the development of a modern art world in China. The course looks at the history of modern Chinese art and the formation of different art institutions in the sociocultural and economic context of modern China. Weekly topics are structured chronologically and thematically, which cover a wide range of themes, including art schools, art societies, museums, exhibitions, and art market. Adopting an interdisciplinary approach, the course offers students multi-perspectives to understand the transformation of modern Chinese art and the interactions between artistic practices and society in modern China. \r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3001", "title": "Visual Arts Management", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "This course leads students to study various modes and philosophies of visual arts management undertaken in different venues. Aesthetics and art criticisms are critical in directing art interpretation and presentation. Contemporary management of visual arts responds predominantly to the worldwide discussions on modernism as well as various post-modernist writings. In addition, it has to operate in accordance with the prescribed state policy. For this bilateral concern of art management, the course comprises two sections. The first section leads students to study the writings on aesthetics by critics from Plato to Foucault, whose arguments are still valid in inspiring many art exhibitions. The second section discusses the practical concerns and techniques in maximizing the social and economic impacts of art exhibitions and relevant events. Both sections discuss case studies taken from different parts of the world.", "outcome": "Upon completion of the course, students will be able to describe different categories of visual arts in professional language; to define and explain the key terms in visual art literature; to appreciate and analyze art exhibitions with reference to intellectual debates on aesthetics; to describe and explain the art policies implemented in East Asia and the West; and to develop independent thinking on the operation and promotion of art organizations.", "syllabus": "Section I: Aesthetics and art criticisms \r  1. Introduction: Shifting perspectives on visual art management in the 20th century \r Visual art management was a new discipline born in late 19th century when museums appeared in Europe. This session reviews the early practices in museum curatorship and its transformations under the impact of modernism. It explains how the focus in managing visual art shifted from scholarly field to public arena in the 21st century. \r  2. ‘Is it good art?’: From Plato, Hume to Danto on aesthetics \r ‘What is beauty?’ has been the most discussed topic in Western art history since the times of Plato. This session discusses the canonical writings by Plato and his followers and critics during the times of Renaissance. The discussion links to their contributions to the post-modern theories that still weigh importantly today. \r  3. Visuality and Perception\r The intention of artists and the perception of arts of the beholders are core issues in Western aesthetics. This section discusses the most well-read writings by Ernest Gombrich and John Berger, who respond to the question as to whether arts comprise social values. \r  4. ‘Does Fine Arts still stand today?’: From fine arts to commercial arts \r Visual arts comprise a wide range of categories today that include both traditional oil paintings and sculpture, as well as contemporary art forms that includes installation, and industrial designs. This section discusses the shifting definitions of arts and the incorporation of commercial arts in exhibitions. \r  5. Cross-cultural aesthetics \r Are Western art theories applicable to the Asian contexts? Correlation exists between civilization and visual culture. This session discusses the Chinese visual art system and explains its difference from that in the West. \r  Section II: Concerns and Practices \r  6. Writing and arts \r This lecture analyzes different texts about visual arts taken from museum exhibition catalogues, auction house catalogues, newspaper reviews, as well as commercial gallery publications. This leads students to reflect on the different presentations of arts for education and commercial purposes. \r  7. Arts and state \r This lectures discusses the various policies implemented in the US, UK, and China that enables or hinders the developments of art organizations and individual artists. \r  8. Business and Arts \r Artists and art organizations s management relies heavily on the patronage of business firm. This session discuss the mutual relationship between arts and business, as well as their shifting roles in recent decades. \r  9. Audience and arts \r This lecture extends the discussion of the last, and focuses on the concerns and strategies of art and cultural promoters in non-profit, educational sectors. This introduces the issue of branding implemented in many world renowned institutes and evaluates their success. \r  10. Managers and arts \r This lecture discusses human resources management in the art industry. Examples of excellent directorship taken from the UK and US will be studied to shed light on the significance of professional leadership in the discipline. \r  11. The Biennial fever \r Bienne is world recognized art event to showcase and acknowledge the achievements of young artists. This lecture discusses the organization and social impacts of the bienne festivals held in Europe and Asia. \r  12. Artist villages \r Artist village is developing everywhere in the world. This lectures discusses the examples found in China and Taiwan and leads students to think whether Hong Kong will need an artist cluster for future cultural developments. \r  13. Art events and festivals \r Annual art events and festivals serve as major strategies to generate social and economic support for art today. This lecture discusses the organization and planning of those events and evaluate the examples taken from Europe, US and Asia.", "required_readings": "Textbook\r Taliaferro, Charles. Aesthetics: A Beginner’s Guide (Oxford: Oneworld, 2011). \r Chong, Derrick. Arts Management, 2nd edition (London and New York: Routledge, 2010). \r  Week 1:\r 1) Duncan, Carol. ‘From the princely gallery to the public art museum: the Louvre Museum and the National Gallery, London’ in Civilizing Rituals: Inside Public Art Museums (Routledge: London and New York, 1995), pp. 21−47.\r 2) Tseng, Alice Y. ‘The Museum in Ueno Park: Styling the Nation’ in The Imperial Museums of Meiji Japan: Architecture and the Art of the Nation (Seattle and London: University of Washington Press, 2008), pp. 39−81.\r 3) Chong, Derrick. ‘Introduction’ in Arts Management (Oxon: Routledge, 2010), pp. 1—30. \r  Week 2:\r 1) Taliaferro, Charles. ‘What is beauty?’ in Aesthetics: A Beginner’s Guide (Oxford: Oneworld Book, 2011), pp. 1—23. \r 2) Taliaferro, Charles. ‘What is a work of art?’ in Aesthetics: A Beginner’s Guide (Oxford: Oneworld Book, 2011), pp. 24—48.\r  Week 3:\r 1) Taliaferro, Charles. ‘Art and meaning.’ in Aesthetics: A Beginner’s Guide (Oxford: Oneworld Book, 2011), pp.49—73.\r 2) Gombrich, E. ‘The Visual Image: its Place in Communication’ in The essential Gombrich : selected writings on art and culture, edited by Richard Woodfield (London: Phaidon, 1996), pp. 41—64. \r 3) Berger, John. Ways of Seeing (London: Penguin, 2008). \r  Week 4:\r 1) Taliaferro, Charles. ‘What makes good art?’ in Aesthetics: A Beginner’s Guide (Oxford: Oneworld Book, 2011), pp. 74—101.\r 2) Benjamin, Walter. ‘’ in Art after Modernism : Rethinking Representation, edited by Brian Wallis (New York: New Museum of Contemporary Art, 1984). \r 3) Woodham, Jonathan. ‘Design promotion, profession and management’ in Twentieth-century Designs (Oxford: Oxford University Press, 1997), pp. 165—182. \r  Week 5:\r 1) Taliaferro, Charles. ‘Cross-cultural aesthetics?’ in Aesthetics: A Beginner’s Guide (Oxford: Oneworld Book, 2011), pp. 119—135.\r 2) Mitchell, Timothy. ‘Orientalism and the Exhibitionary Order’ in The Art of Art History: A Critical Anthology, edited by Donald Preziosi (Oxford and New York: Oxford University Press, 2008), pp. 455—472. \r  Week 6:\r 1. Ravelli, Louise J. Museum Texts: Communication Frameworks, Oxon: Routledge, 2006, chapter 4, pp. 69−94. \r 2. Barthes, Roland. ‘Death of the Author’ Art after Modernism : Rethinking Representation, edited by Brian Wallis (New York: New Museum of Contemporary Art, 1984).\r  Week 7:\r 1. Chong, Derrick. ‘Arts and the State’ in Arts Management, 2nd edition ((London and New York: Routledge, 2010), pp. 33—58.\r  Week 8:\r 1. Chong, Derrick. ‘Business and the Arts’ in Arts Management, 2nd edition (London and New York: Routledge, 2010), pp. 59—80. \r 2. Chong, Derrick. ‘Ownership and control of arts organizations’ in Arts Management, 2nd edition ((London and New York: Routledge, 2010), pp. 81—114. \r  Week 9:\r 1. Chong, Derrick. ‘Arts consumption and consumers’ in Arts Management, 2nd edition (London and New York: Routledge, 2010), pp. 115—142.\r 2. Chong, Derrick. ‘Globalization and the art world’ in Arts Management, 2nd edition (London and New York: Routledge, 2010), pp. 189—213.\r  Week 10:\r 1. Chong, Derrick. ‘Managing for excellence and artistic integrity’ in Arts Management, 2nd edition (London and New York: Routledge, 2010), pp.143—166. 169—188.\r  Week 11:\r 1. Altshuler, Bruce (ed). Salon to Biennial Exhibitions that Made Art History (London: Phaidon Press, 2008). \r 2. www.taipeibiennial.org\r 3. www.shanghaibiennale.com\r  Week 12:\r 1. Wang, Yang. ‘Leaving Chang’an: establishing contemporary art spaces in the ancient capital’, Yishu, vol. 11, no. 6, 2012, pp. 61—69. \r 2. Lai, Celine. ‘The pursuit of space: the art and artists of Hong Kong’, Yishu: Journal of Contemporary Chinese Arts, vol. 11, no. 1, pp. 52—65. \r 3. www.artistvillage.org (Taiwan) \r  Week 13:\r 1. www.hongkong.artfestival.org \r 2. www.frenchmay.com", "recommended_readings": "Berger, John. Ways of Seeing, London: Penguin, 2008. \r Buchli, Victor (ed.). The Material Culture Reader, Oxon and New York: Berg, 2002. \r Burcaw, G. E. Introduction to Museum Work, London: AltaMira Press, 1997. \r Byrnes, William J. Management and the Arts, Waltham: Focal Press, 2003.\r Clarke, David. Chinese Art and Its Encounter with the World, Hong Kong: Hong Kong University Press, 2011. \r D’Alleva, Anne. Methods & Theories of Art History, London: Laurence King Publishing, 2005. \r Dant, Tim. Materiality and Society, Maidenhead: Open University Press, 2005. \r Duncan, Carol. Civilizing Rituals: Inside Public Art Museums, Routledge: London and New York, 1995. \r Fitzgibbon, Marian and Kelly, Anne. From Maestro to Manager: Critical Issues in Arts and Culture Management, Dublin : Oak Tree Press in association with the Graduate School of Business, University College Dublin, 1997.\r G. Pollock and J. Zemans (eds.), Museums After Modernism: Strategies of Engagement, Oxon: Blackwell, 2008,\r Gerth, Karl. As China Goes, So Goes the World: How Chinese Consumers Are Transforming Everything, New York : Hill and Wang, 2010. \r Gombrich, E.H. The Story of Art, London: Phaidon, 2006. \r Hill, Liz. Creative Arts Marketing, Boston : Butterworth-Heinemann, 2003.\r Hong Kong Recreation and Culture Branch, Arts Policy Review Report : Consultation Paper, Hong Kong : Hong Kong Special Administration Region Government, 1993.\r Kalay, Yehuda E. New Heritage: New Media and Cultural Heritage, London ; New York : Routledge, 2008. \r Kearney, Richard and Rasmussen, David (eds.). Continental Aesthetics: Romanticism to Postmodernism, an Anthology, Oxon: Blackwell, 2001. \r Knight, Amanda. Effective Customer Care: for Voluntary and Community Organizations, London: Directory of Social Change, 1999.\r Lai, Celine. ‘The pursuit of space: the art and artists of Hong Kong’, Yishu: Journal of Contemporary Chinese Art, Jan/Feb 2012, vol. 11, no. 1, pp. 52─65. \r Liu, Xintian 廖新田. Yishu di zhangli: Taiwan meishu yu wenhua zhengzhi xue 藝術的張力︰臺灣美術與文化政治學, Taipei: Diancang, 2010. \r Mackenzie, John M. Museums and Empire: Natural History, Human Cultures and Colonial Identities, Manchester and New York: Manchester University Press, 2009. \r Maitland, Heather. A Guide to Audience Development, London: Arts Council of England, 1998.\r Malcolm, A. (ed.). Managing Archaeology, London and New York : Routledge, 1995. \r Miller, Toby. Cultural Policy, London : SAGE, 2002\r Misiura, Shashi, Heritage Marketing, Oxford : Butterworth-Heinemann, 2006. \r Philips, David. Exhibiting Authenticity, Manchester and New York: Manchester University Press, 1997\r Pick, John and Anderton, Malcolm. Arts Administration, London: E & FN Spon, 1996.\r Pooke, Grant and Diana Newall. Art History: The Basics, Oxon: Routledge, 2008.\r Preziosi, Donald (ed.). The Art of Art History, Oxford: Oxford University Press, 1998. \r Rawling-Jackson (ed.). Paying Attention: A Guide to Customer Care in the Arts, London: The Arts Council of England, 1994.\r Runyard, Sue and French, Ylva. The Marketing and Public Relations Handbook for Museums, Galleries and Heritage Attractions, California: Altamira Press, 1999.\r Said, Edward. Orientalism, London: Penguin, 2003. \r Shen, Zhongyuan 沈中元. Yishu yu falu 藝術與法津, Taipei: Wunan, 2009. \r Smith, George. Asking Properly: The Art of Creative Fundraising, White Lion, 1996.\r Sullivan, Michael. The Arts of China, Berkeley: University of California Press, 2009. \r UNESCO and ICOM, Running a Museum: A Practical Handbook, Paris: UNECO, 2006. \r Wallace, Margot A. Museum Branding: How to Create and Maintain Image, Loyalty, and Support, Lanham: AltaMira Press, 2006,\r Wallis, Brian (ed.). Art After Modernism: Rethinking Representation, New York: The New Museum of Contemporary Art, 1996. \r Wang, Jing. Brand New China: Advertising, Media, and Commercial Culture, Cambridge, Mass. And London: Harvard University Press, 2008. \r Xiang, Xueli 夏學理, Ling Gongshan 凌公山and Chen Yuan陳媛, Wenhua xingzheng 文化行政, Taipei: Wunan, 2009.\r Yasuo, Deguchi出口保夫, Monogatari daiei hakubutsukan 250 nen no kiseki大英博物館的故事, translated by Lu Lizhou呂理州, Taipei: Rye Field Publications, 2009.", "terms": {"2020-21 Term 1": {"--LEC (7872)": {"startTimes": ["12:30"], "endTimes": ["15:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Dr. TING Wing Yan Vivian"]}}}, "assessments": {"Essays": "40", "Others": "50", "Presentation": "10"}}, {"code": "3002", "title": "Performing Arts Management", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "This course discusses the missions, administrations, and strategies of performing art organizations. Since the 1950s, performing art managers have realized the significance of efficient management in achieving popularity and sale. This course will go through the general topics as to how the performing art organizations are administered in national and legal terms; how they solicit funding; how they are operated in terms of ticketing and touring; and how they are strategically promoted for both branding and social benefits.", "outcome": "Upon completion of the course, students will be able to describe the practical concerns of the performing art organizations in terms of their daily operation; to identify various sources of funding in support of performing arts; to evaluate the administration structure and strategies undertaken in different countries; and describe and explain the different policies implemented in East Asia and the West.", "syllabus": "1. Introduction: Profit-making vs Non-profiting making performing houses \r This lecture introduces the basic, binal division between two different types of performing houses. This leads students to reflect on the confliciting aims between the two types, and realize the significance of the overlapping features of the two. \r  2. Setting up the ‘mission’\r Clear directorship is recognizedly important among performing arts management. This lecture analyzes the various mission statements and approach of the performing houses in Europe, US and China. This discusses how a mission statement is being written up and executed. \r  3. Legal rights and obligations of non-profit making organizations. \r This lecture discusses the legal terms of the non-profiting making performing organizations, and provides an in-depth study towards their social obligations in exchange for tax exemption. \r  4. Commercial productions. \r This lecture discusses the concerns and strategies of Broadway productions. Examples of programming and touring techniques of the theatres in the US, France and China will be discussed. \r  5. Budget planning \r Financial management in the performing industry aims to maintain balance between expenses and revenue. This lecture discusses the management of book keeping, payroll taxes, facilities maintenance, and auditing. \r  6. Fund-raising possibilities for non-profit performing houses \r There are many fund-raising opportunities for non-profit organizations. Managers usually have to work closely with the Board of Directors. Tactics in securing interests and long-term partnerships with external and potential donors will be discussed.\r  7. Sale and ticketing \r Following up with the last session, this lecture discusses the marketing management of commercial productions. The role of ticket office and various advertising skills will be compared and discussed. \r  8. Performing arts and education \r This lecture discusses the American tactics in engaging junior and high school students in performing arts. It discusses the experience of the New York City Centre and the Kennedy Centre. This session invites students to reflect on the social impacts of the performing industry through arts education. \r  9. Human resources \r Theatres and Orchestras work closely with large numbers of members from various sorts of backgrounds. Management in labor relations has always been a key to achieve success in the performing industry. This section introduces various labour unions and legal regulations towards employment contracts. \r  10. Touring production \r Touring is a common tactic employed to increase revenue by taking the performing crew overseas. However, touring means many risks that may increase expenses. This lecture discusses the benefits and shortcomings in taking a production on a tour. \r  11. Facility management \r Facilities maintenance assumes a large share of expense on the financial sheet of presenters. This session discusses the contracting tactics in keeping the costs low. In addition, it also discusses event programming that draws attention to the management of facilities. \r  12. Internship and youth programmes \r This lecture discusses the outreach options for performing houses. It will focus on the networking and partnership formed on the basis of short-term internship; and on the audience-engaging programme that develops the audience base of different age range. \r  13. Presentation \r Student presentation of group project.", "required_readings": "Textbook\r Tobie S. Stein and Jessica Bathurst. Performing Arts Management: A Handbook of \r Professional Practices (New York: Allworth Press, 2008). \r John Russell Brown. The Oxford Illustrated History of the Theatre, Oxford, Oxford University Press, 2001. \r Stephen Archer. Theatre: Its Arts and Crafts, 6th edition, Plymouth: Rowman &  Littlefield, 2010.\r  Week 1\r 1) Stein and Bathurst 2008, chapter 1.\r Week 2\r 1) Stein and Bathurst 2008, chapter 2. \r Week 3\r 1) Stein and Bathurst 2008, chapter 3. \r Week 4\r 1) Stein and Bathurst 2008, chapter 4.\r Week 5\r 1) Stein and Bathurst 2008, chapter 5.\r Week 6\r 1) Stein and Bathurst 2008, chapter 6.\r Week 7\r 1) Stein and Bathurst 2008, chapter 7.\r Week 8\r 1) Stein and Bathurst 2008, chapter 8.\r Week 9\r 1) Stein and Bathurst 2008, chapter 9.\r Week 10\r 1) Stein and Bathurst 2008, chapter 10.\r Week 11\r 1) Stein and Bathurst 2008, chapter 11.\r Week 12\r 1) Stein and Bathurst 2008, chapter 11.", "recommended_readings": "Allen, Paul. Artist Management for the Music Business, Amsterdam: Focal Press, 2007.\r Allen, Paul. (ed.). Artist Management for the Music Business, Amsterdam: Focal Press, 2011.\r Allison, Mary E. A Survival Guide for Stage Managers: A Practical Step-by-step Handbook to Stage Management, Denver, Colorado: Outskirts Press, 2010.\r Blumenthal, Howard and Goodenough, Oliver. This Business of Artist Management, New York: Billboard Books, 1997.\r Bond, Daniel. (ed.). Stage Management: A Gentle Art, New York: Routledge, 1998.\r Brindle, Meg and Devereaux, Constance. (ed.). The Arts Management Handbook: New Directions for Students and Practitioners, Armonk, NY: M.E. Sharpe, 2011.\r Campbell, Drew. Technical Theater for Nontechnical People, New York: Allworth Press, 2004.\r Cleve, Bastian. (ed). Film Production Management, Boston: Focal Press, 2005.\r Conte, David M. and Langley, Stephen. Theatre Management, California: Quite Specific Media Group Ltd, 2007.\r Davis, Tracy C. and Holland, Peter. (ed.). The Performing Century: Nineteenth-century Theatre's History, Basingstoke: Palgrave Macmillan, 2008.\r Downs, William M., Wright and Ramsey, Erik. (ed.). The Art of Theatre: A Concise Introduction, Belmont, CA: Wadsworth Publishing, 2012. \r Downs, William M., Wright and Ramsey, Erik. (ed.). The Art of Theatre: Then and Now, Belmont, CA: Wadsworth Publishing, 2012.\r Frascogna, Xavier M. and Hetherington, H. Lee. Successful Artist Management, New York: Billboard Books, 1990.\r Grady, James M. A Simple Statement: A Guide to Nonprofit Arts Management and Leadership, Portsmouth: Heinemann Drama, 2006.\r Hardy, Hugh. Edited by Kliment Stephen A. Building Type Basics for Performing Arts Facilities, Hoboken, N.J.: J. Wiley & Sons, 2006.\r Ionazzi, Daniel. The Stage Management Handbook, White Hall, Va.: Betterway Publications, 1992.\r Kantor, Michael and Maslon, Laurence. Broadway: The American Musical, New York: Bulfinch Press, 2004.\r Kelly, Thomas A. (ed). The Back Stage Guide to Stage Management: Traditional and New Methods for Running a Show from First Rehearsal to Last Performance, New York: Back Stage Books, 2009.\r Liu, Siyuan. Performing Hybridity in Colonial-modern China, Palgrave Macmillan, 2013.\r Mulryne, J. R. and Shewring, Margaret. Making Space for Theatre: British Architecture and Theatre since 1958, Stratford-on-Avon: Mulryne & Shewring, 1995.\r Ortolani, Benito. The Japanese Theatre, Princeton, NJ: Princeton University Press, 1995.\r Schlaich, Joan and DuPont , Betty. (ed.). Dance: The Art of Production: A Guide to Auditions, Music, Costuming, Lighting, Makeup, Programming, Management, Marketing, Fundraising, Princeton, NJ: Princeton Book Company, 1998.\r Schneider, Doris. The Art and Craft of Stage Management, Belmont, CA: Wadsworth Publishing, 1996.\r Shagan, Rena. Booking and Tour Management for the Performing Arts, New York: Allworth Press, 2001.\r Shellard, Dominic. British Theatre since the War, New Haven: Yale University Press, 2000.\r Shepherd, Simon. The Cambridge Introduction to Modern British Theatre, Cambridge: Cambridge University Press, 2009.\r Sierz, Aleks. Rewriting the Nation: British Theatre Today, London: Methuen Drama, 2011.\r Sonder, Mark. Event Entertainment and Production . Hoboken, NJ: J. Wiley & Sons, 2003.\r Stempel, Larry. (ed) Showtime: A History of the Broadway Musical Theater, New York: W. W. Norton & Company, 2011.\r Stern, Lawrence. (ed). Stage Management. Boston: Allyn & Bacon, 2001.\r Stern, Lawrence. (ed). Stage Management, Boston: Allyn & Bacon, 2005.\r Stern, Lawrence and O'Grady, Alice. (ed). Stage Management, US: Pearson Education, 2012.\r Taylor, Joe Jr. Music Management for the Rest of Us, lulu.com, 2011\r Taylor, Robert D. and Strickland, Robert D. (ed.). Theatre: Art in Action, Illinois: National Textbook Company, 1999.\r Vaill, Peter B. Managing as a Performing Art: New Ideas for a World of Chaotic Change, San Francisco: Jossey-Bass, 1991.\r Vasey, John. Concert Tour Production Management, Boston, Mass.: Focal Press, 1997. \r Volz, Jim. How to Run a Theater: A Witty, Practical and Fun Guide to Arts Management, New York: Back Stage Books, 2004.\r Warden, Claire. British Avant-garde Theatre, Basingstoke: Palgrave Macmillan, 2012.\r Webb, Duncan. Running Theaters: Best Practices for Leaders and Managers, New York: Allworth Press, 2005.\r Ye, Tan and Zhu, Yun. Historical Dictionary of Chinese Cinema, Lanham, Md.: Scarecrow Press, 2012.", "terms": {"2020-21 Term 1": {"--LEC (5780)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor CHUNG Ming Yan Fanny"]}}}, "assessments": {"Essays": "40", "Others": "50", "Presentation": "10"}}, {"code": "3003", "title": "New Media Arts Management", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "This course introduces a new genre in the art discipline that employs electronic and digital devices as the main medium of communication. The course contains three sessions. The first session explains the birth of this set of contemporary art practices in relation to the Dadaist movement of the early twentieth century that opened up new concepts for visual arts. This will be followed by a session that discusses the range of media now commonly adopted in the discipline, including video, photography, computer graphics, webpage, and the Internet. Different set of techniques are involved in these productions, and they often generate quite different social impacts that affect both the producers and the users. Students are instructed to understand both the technological and social aspects of these areas. The last session comprises a series of workshops that lead students to appreciate and comment on the most featured productions. Emphasis is placed on the angle to promote this new art type as a rising cultural sector in the society.", "outcome": "Upon completion of the course, students will be able to describe and define the technical terms employed in the new media productions; to acquire the basic techniques involved in shooting, controlling sound effect, and designing for interactive visual experience; to identify the software and skills essential for creating different virtual experience; to recognize the economic aspects of using multi-media in cultural sectors; to analyze the social coverage and impacts of using the Internet for distribution; and to develop independent thinking about the cyber-culture and artificial identity.", "syllabus": "1.Art and Technology\r The history of new media art began in the early 20th century. The well-read article by Walter Benjamin defines a new age in art distribution. This lecture discusses the adoption of technological devices in modern art production, as well as the impact factors of using technology that both contribute to and alter the original aims of traditional arts. \r  2.How ‘new’ is the New Media? \r How does ‘New Media’ differ from the old one? Why was it born? This lecture discusses the work by Dali and Duchamp, as well as their critiques. It looks at how the artists found interests in the new devices and how they employed so in expressing thoughts and feelings during the so-called Dadaist and Pop Movement. \r  3.Virtual Effects and Visual Culture\r New technologies gave visual culture a new life in the 20th century that opened up many different opportunities of making interaction through the use of prints, drawings, photographs, and videos. This lecture discusses the concepts of simulation and immersion in visual arts. It also introduces the concept of virtual reality, which has been widely applied in both two and three-dimensional work. \r  4.Films and Animations \r This lecture continues the last one in discussing the idea of realism and representation in media production. This one focuses on the images reproduced in films and video games. It discusses the theories employed in photography and filming with digital devices that lead students to think how the new technologies alter the traditional views about representation. \r  5.Economy and the Web Media \r The New Media is often regarded as being reasonably economical in operation, compared with other traditional means of presentation. This lecture discusses the economic aspects of using different web engines and forums, as well as the commercial limits in employing those devices. \r  6. Wikis and Web 2.0 \r Web 2.0 is a concept introduced at the beginning of this century to describe the combination of software (HTML), hardware, and Internet in forming a major sector of social interaction. The Wikipedia introduced in 2004 gave every user a new participant identity in the virtual world. This lecture discusses how the boom of Internet information alter social practices and ideas. \r  7.Games, Animation And the Cyber-world\r In countries, such as Japan and Korea, games and animation form a major sector in the creative industries. This lecture introduces the Dreamweaver and Power Game Factory. It discusses the social impacts of those new entertaining devices in re-defining the issues of gender, ethnics, and even national identities. \r  8. Workshop I: Installation and Contemporary Arts \r In this workshop session, the instructor will lead students to look at the classic examples of installation in contemporary art display. The work by Damien Hurst, Cai Guoqiang, Xu Bing, and other contemporary artists will be discussed. \r  9. Workshop II: Editing Techniques in Photography\r This workshop leads students to practice photography and understand the central theories in shooting in relation to previous lecture on visual culture. \r  10. Workshop III: Editing Techniques in Filming \r This workshop teaches students the skills in editing and handling effects with Final Cut Pro and Snapz.\r  11. Workshop III: Sound, music and noise\r This workshop introduces the Sound Studio Pro, and leads students to acquire the skills in audio capture and sound recording. \r  12. Workshop IV: Webpage, Internet and Heritage \r This workshop reviews the use of web technology in preserving and reconstructing heritage and historical sites. \r  13. Project presentation\r  14. Conclusion: Can the New Media be Forever ‘New’? \r This last lecture is a response to the question stated in the first lecture, and is the key question in the field of New Media Studies. This lecture discusses how the new media constructs an artificial identity in the expanded visual world based on technology.", "required_readings": "Week 1 \r Benjamin, Walter: \"The Work of Art in the Age of Mechanical Reproduction”. \r Lister, Martin. New Media: A Critical Introduction, 2nd edition (London and New York: Routledge, 2009), pp. 9—44. \r  Week 2\r Lister, Martin. New Media: A Critical Introduction, 2nd edition (London and New York: Routledge, 2009), pp. 44—99. \r  Week 3\r Lister, Martin. New Media: A Critical Introduction, 2nd edition (London and New York: Routledge, 2009), pp. 105—123. \r  Week 4\r Lister, Martin. New Media: A Critical Introduction, 2nd edition (London and New York: Routledge, 2009), pp. 124—157. \r  Week 5\r Lister, Martin. New Media: A Critical Introduction, 2nd edition (London and New York: Routledge, 2009), pp. 163—191. \r  Week 6\r Lister, Martin. New Media: A Critical Introduction, 2nd edition (London and New York: Routledge, 2009), pp. 204—231. \r  Week 7\r Lister, Martin. New Media: A Critical Introduction, 2nd edition (London and New York: Routledge, 2009), pp. 237—308. \r  Week 9\r McLuhan, Marshall. ‘The medium is the message’ in Understanding Media: The Extensions of Man (New York: McCraw-Hill, 1964), which can be found at http://hannemyr.com/links/mcluhan/um.html#ch01\r  Week 11\r Murch, Walter. ‘Clear density, dense clarity’, http://transom.org/?page_id=7006.\r Chion, Michel. ‘Three modes of listening’, http://helios.hampshire.edu/~hacu123/papers/chion.html\r  Week 12\r ArtMuseum.NET Project, ‘From Wagner to Virtual Reality’, which can be found at http://www.w2vr.com/project.html. \r  Week 14\r Lister, Martin. New Media: A Critical Introduction, 2nd edition (London and New York: Routledge, 2009), pp. 317—412.", "recommended_readings": "Alberro, Alexander; Stimson, Blake. Conceptual Art: A Critical Anthology. MIT Press, 1999. \r Antin, David. \"Video: The Distinctive Features of the Medium.\" In Hanhardt, John, ed. ''Video Culture.''Visual Studies Workshop Press, 1986, p.147-166. \r Baudrillard, Jean. \"Requiem for the Media.\" In Waldrip-Fruin, pp. 277-288.\r Elger, Dietmar. Dadaism. Taschen, 2004. \r Enzensberger, Hans Magnus. \"Constituents of a Theory of the Media.\" In Waldrip-Fruin, pp. 259-275. \r Galloway, Alexander. \"Tactical Media: Internet Art,\" in Protocol: How Control Exists After Decentralization,\" MIT Press, Cambridge, 2004. pp.174-239.\r Greene, Rachel. \"Web Work: A History of Internet Art.\" Art Forum, 2000. \r Griffiths, Richard T. \"History of the Internet, Internet for Historians (and just about everyone else),\" Chapters One and Two. \r Huelsenbeck, Richard, ed. The Dada Almanac. Atlas Press, 1993. Preface, pp. i-xv and Introduction, pp. 9-15. \r Lev Manovich (2007), Database as Symbolic Form, p.39-60\r Lewitt, Sol. \"Paragraphs on Conceptual Art.\" In Conceptual Art: A Critical Anthology. In Alberro, Alexander; Stimson, Blake. Conceptual Art: A Critical Anthology. MIT Press, 1999, p.12-16. \r Lewitt, Sol. \"Sentences on Conceptual Art.\" In Conceptual Art: A Critical Anthology. In Alberro, Alexander; Stimson, Blake. Conceptual Art: A Critical Anthology. MIT Press, 1999, p.106-108. \r Lippard, Lucy. \"New York Pop.\" In Lippard, Lucy. Pop Art. Thames & Hudson, 1968. \r Lister, Martin et al. New Media: A Critical Introduction. New York, N.Y. : Routledge, 2009.\r Preston Wright, \"Reconstructing Ballet Mécanique: An interview with Paul Lehrman.\" American Public Media, January 2003 \r Richter, Hans. Dada, Art and Anti-Art. Oxford University Press, 1978. \r Rob Walker (1.Jan.2011), Things to Do in Cyberspace When You Are Dead, New York Times Magazine, p.30-37\r Smith, Roberta. \"Conceptual Art.\" In Stangos, Nikos, Concepts Of Modern Art. Thames & Hudson, 1994, pp. 256-270. \r Tribe, Mark and Reena Jana: New Media Art. Taschen, 2006.\r Warburton, Nigel. _The Art Question. \"_Art and Philosophy,\" pp. 1-8 and \"Institutional Contexts,\" pp. 87-120.", "terms": {"2020-21 Term 1": {"--LEC (5798)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Miss KWONG Kai Ling"]}}}, "assessments": {"Essays": "50", "Others": "10", "Presentation": "40"}}, {"code": "3004", "title": "Public and Community Art", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "Public art is considered as an important cultural asset of metropolitan cities, closely related to city images and development. Community art serves as a tool for community development, based on the understanding that expression, mastery and communication through the arts powerfully encode cultural values, thus bringing deeper meanings of experience, participation and involvement, sense of belonging to the general public and the community. This course aims to advance students’ understanding of public and community arts by embedding them in the theoretical discussions and critiques of cities and public spaces and practical experiences. It also imparts the knowledge and skills about managing public arts and actualizing community art programs, and discusses the way to support their development responding to the needs.", "outcome": "In terms of knowledge acquisition, students are expected to understand how public and community arts emerged in the context of urban regeneration and community activist movements. Students are encouraged to critically analyze the meanings and social values of public art spaces. In terms of managerial concepts and skills, students will learn how public and community arts are supported by government policies, material resources, infrastructure and training. Students are expected to understand public art commission and reception, to master basic principles of utilizing public art as an urban design strategy, and to apply varying approaches to facilitating community art development, for example, advancing community art education, utilizing the cultural planning approach to assess community based cultural resources and the place-event approach to creating a sense of community attachment.", "syllabus": "Part I. Understanding Public and Community Art 1. General Introduction This section begins with displaying a range of public and community art cases and presents an introduction to the course. Three issues are covered in this introductory lecture. First, this section provides the conceptual discussions of public space, public art, and their art forms to enable students to understand what public art space and public art is. Second, this section explores the role of artists in public art space and community development. Third, a historical picture of public art is unfolded, which traces its origin, displays its developing process, and takes a glimpse into its enshrined social values.   2. Understanding Public Art Spaces  How should we understand public art spaces and the public nature of public art? This section embeds these issues into the understanding of a city; it then conveys the ideas that public spaces are socially produced and that city forms are imbued with ideologies. Public art stems from an urban setting and then grows through the urban regeneration movement, which comprises several issues, such as urban image, urban form and urban planning as well as their connections with public art space as a form of representational space. Furthermore, this section explores the public nature of public art by examining the process, by which artists derive value from individual creativity in the studios and immense it into the public space.  Tutorial: Discuss the alternative history of public art (Lacy, 1995, 25–28).  3. Public Art: The Monument The monument is an important theoretical perspective to conceptualize public art. This section explains what a “monument” is and investigates its role—whether statue, memorial, or public statue—in upholding a value-laden system of Western society. Issues under examination range from the connection between monument and national identity, the power and representation of public arts, the transformative understanding of public art as a monument, and the contradictions of public art.  Tutorial: Discuss the public nature of public art.  4. Critical Issues of Public Art Spaces Who comprise the “audience” of public arts? What does “intention” mean and what is the “effectiveness” of public art? This section further discusses the theories on critical issues related to public art. This section begins with the discussions of the relevant terms and proceeds to various critical thoughts that challenge the value of public art and question its public nature. Students are expected to be able to analyze public art spaces and public art critically. Tutorial: Develop critical thinking about public art spaces and public art.  5. Public Arts and Community Cultural Development: Theoretical Underpinnings of Community Art This section provides a synopsis of the histories and theoretical issues of community art. The origin of community art is traced to the discourse of William Morris’s call for social reintegration of artists and a revival of art in the 19th century. Theoretical issues include the “popular front” and class consciousness, civil rights and identity politics, as well as cultural democracy and exchange. In addition, this section discusses the definitions of community, the role of community art, and the core purposes of community development.  Tutorial: Discuss the question, “What makes art valuable?”   Part II. Public Art Management  6. Commission and Reception of Public Art Based on the public nature of art, this section analyzes the process of art making, which comprises the elements of audience, context, and meaning. The process includes the following: acquiring cultural approval, arriving in public sites and places, providing visiting experiences with the audience, and generating meanings. Cases of Seattle and New York are used for this study. With regard to art reception, it analyzes the issues of taste, the education of the audience, as well as the relationship of art to society and popular visual culture. In addition, this section also distinguishes performance culture from monumental public art. Tutorial: Distinguish public art from community art.  7. Public Art and Urban Design This section presents an urban design approach to commissioning and making public art. It outlines the principles for creating a city image, which consists of five elements, and discusses their connections to public art. Various forms of public art in association with the urban setting and the mechanism of public art utilization as an urban design strategy are also discussed. Students are guided toward understanding the role of public arts in urban design guidelines. Moreover, we also discussed a set of design principles on the relationship between public art and various urban forms and spatial components, aimed at integrating public art into the urban setting as context and reference is discussed. Tutorial: Conduct design software training.  Assignment: Find a sample of public art (i.e., sculpture) using design principles to assess its location, site, and designs as well as to evaluate its strengths and weaknesses. Write a paper based on the research and use the design software to illustrate the arguments.   8. Government Policies for Public and Community Art Development The relation between power and public and community art is a critical issue in public and community art management. This section discusses the governmental structure that funds and commissions public art, the infrastructure that underpins public art, and the governmental policies that support community art. The selection of commissions and projects is discussed, along with the process of seeking public and professional responses. International and the local Hong Kong contexts are examined to explore how government policies affect public and community art. In the local context, the role of the Leisure and Cultural Services Department in promoting public art in Hong Kong is adopted as a case study. Tutorial: Conduct an in-class test.   9. Public Art in Metropolitan Cities This section analyzes the role of public art in metropolitan cities, especially in the spheres of public transport, public open spaces, and public health system. A number of cases are presented, including forms of public art in the New York Subway system, London Underground and Mass Transit Railway, and the Queen Elizabeth Hospital in Hong Kong. The issue of commissioning public arts is revisited in the public art in metropolitan context.  Tutorial: Discuss urban design and public art in Hong Kong.  Part III. Community Art Management 10. Developmental Needs of the Field How can community art development be supported? What do communities need? This section specifies the scope of cultural policies and the policy climate that community artists and community cultural development require. Moreover, this section discusses the material support that community cultural organizations and artists need, including funding supports and internal infrastructure and exchange. Tutorial: Discuss the cultural policies for public art in Hong Kong.  11. From Theory to Practice I: Process to Develop Community Arts From theory to practice, this section offers students a general orientation, which serves as a road map to the community-based art process. Five conceptual territories to advance community-based art as well as requisite techniques to fulfill tasks are introduced in this section, which include the following: 1) contacting people in the community; 2) conducting research on the culture of the community and the people’s perception of their community; 3) taking actions to make art projects; 4) gaining feedbacks from the community; and 5) incorporating these art forms into community art education programs to pass on skills and sustain the impact. The program also includes strategies for planning and organizing community outreach and engagement programs as well as ways to enhance public awareness. Tutorial: Discuss the process of applying theories in the creation of community art in order to practice and initiate the group project with the community.  12. From Theory to Practice II: Key Issues in Community Art Development Based on the holistic picture of the steps to develop community arts, this section focuses on certain key and challenging issues in the process, specifically those on research methods and art making. The section introduces qualitative and quantitative research methods for the project of community art development, and students are expected to learn how to identify survey areas, design survey questionnaires, run group discussions, and map cultural mind-sets and assets. Another key issue is how to make arts and work with artists. An artist will be invited to be the guest speaker to give the lesson. Tutorial: Develop a group project with the community.   13. Review and discussions Students will present their on-going group projects on community art development, and the professor then provides comments and feedbacks on their projects. Key points of this course will also be reviewed in this class.", "required_readings": "Goldbard, A., 2006, New Creative Community: The Art of Cultural Development, Oakland, CA: New Village Press.  Grogan, D., Mercer, C. and Engwicht, D., 1996, The Cultural Planning Handbook, St. Leonards, N.S.W.: Allen & Unwin, Harris, S. P., 1984, Insights/On Sites, Washington, DC, Partners for Livable Places.  Hui, D. ed., 2004, Proceedings of Soul of the City: International Symposium on Art and Public Space, Hong Kong: Hong Kong Arts Centre. Lacy, S., ed., Mapping the Terrain, Seattle, Bay Press. Miles, M., 1997, Art Space and the City, Public Art and Urban Future, London; New York: Routledge. Miles, M., Borden, I. & Hall, T., 2000, The City Cultures Reader, London; New York: Routledge. Oldenburg, C. and Bruggen, C., eds., Bottle of Note, Middlesbrough: Middlesbrough Borough Council in association with Lund Humphries Publishers; Wappingers Falls, NY Petherbridge, D., ed., 1987, Art for Architecture: A Handbook on Commissioning, London: H.M.S.O. Raven, A., 1993[1989], Art in the Public Interest, New York, da Capo.  Selwood, R., 1995, The Benefits of Public Art, London, Zed Books.  Townsend, P., ed., 1984, Art within Reach: Artists and Craftworkers, Architects and Patrons in the Making of Public Art, London: “Art Monthly” in collaboration with the Arts Council of Great Britain and the Crafts Council. Miles, M., Borden, I. & Hall, T., 2000, The City Cultures Reader, London; New York: Routledge. Willett, J., 2007[1967], Art in a City, Liverpool [England]: Liverpool University Press and the Bluecoat.", "recommended_readings": "Ambrose, T. and Paine, C., 1993, “Museum and Education Service: Within the Museum & Outside the Museum,” Museum Basic, New York: Routledge Press, pp.37-49.  -----------, 2000, “Events and Activities: Creating Programmes,” Museum Basic, pp.49-56.  Andrews, R., 1984, “Artists and the Visual Definition of Cities: The Experience of Seattle,” in Harris, S. P., pp.17-28. Baca, J., 1995, “Whose Monument Where? Public Art in a Many-cultured society,” in Lacy, S., ed., Mapping the Terrain, Seattle, Bay Press, pp.131-138. Bentley, Ian. 1985. Responsive Environments: A Manual for Designers. London: Architectural Press. Bird, J., Curts, B, Putnam, T., Robertson, G. and Tickner, L. eds., Mapping the Futures: Local Cultures, Global Change, London; New York : Routledge Burton, C. and Griffin, J., 2008, “More than a Museum? Understanding How Small Museums Contribute to Social Capital in Regional Communities,” Asia Pacific Journal of Arts and Cultural Management, 5(1): 314-332. Borrup, T., 2009, “The Role of Culture in Community Building,” The Creative Community Builder’s Handbook, chapter 1, p.3-15, Fieldstone Alliance.  Brown, C.R., Fleissig, W.B., Morrish, W.R., 1989. Building for the Arts: A Guidebook for the Planning and Design of Cultural Facilities, Santa Fe, N.M.: Western States Arts Federation. Carbonell, B. M., ed., 2004, Museum Studies: An Anthology of Contexts, Blackwell Publishing Limited.Certeau, M.D., The Practice of Everyday Life, Berkeley: University of California Press. Chang, G., 2004, “A Contextual Approach to Art Space in Hong Kong,” in Hui, D. ed., 2004, Proceedings of Soul of the City: International Symposium on Art and Public Space, Hong Kong: Hong Kong Arts Centre, pp.17-22. Cohen-Cruz, J., 2005, Local Acts: Community-Based Performance in the United States, Rutgers University Press. Cord, R., 1997, “Message in a Bottle,” in Oldenburg, C. and Bruggen, C., eds., Bottle of Note, Middlesbrough: Middlesbrough Borough Council in association with Lund Humphries Publishers; Wappingers Falls, NY, pp.13-30. Crimmin, M., 2004, “Commissioning Art for the U.K., Public Domain: Issues and Examples,” in Hui, D. ed., 2004, Proceedings of Soul of the City: International Symposium on Art and Public Space, pp.178-183. Cruikshank, J. L. and Korza, P., 1988, Going public : a field guide to developments in art in public places, Amherst, Mass.: Arts Extension Service in cooperation with the Visual Arts Program of the National Endowment for the arts Duggan, T. and Hooper, L., 1997, “Making the Monument,” in Oldenburg, C. and Bruggen, C., eds., Bottle of Note, pp.31-56. Felshin, N., ed., 1995, But is It Art? : The Spirit of Art as Activism, Seattle: Bay Press. Fleming, R. L., Tscharner, R. V., Melrod, G. and Barnes, B. S., 1987, Place Makers: Creating Public Art That Tells You Where You Are: With an Essay on Planning and Policy, Boston: Harcourt Brace Jovanovich. Frenchman, D., 2004, “Event Places in North America: City meaning and Making,” in Sabate, F. S., Event Places, Generaletat di Catalunya.  Gaffney, P., 2004, “MTR’s Role in Supporting Public Art,” in Hui, D. and Ting, S. eds., Soul of the City: Proceeding of International Symposium on Art and Public Space, Hong Kong: Hong Kong Arts Centre, pp.55-57. Goldbard, A., 2006, New Creative Community: The Art of Cultural Development, Oakland, CA: New Village Press.  Grodach, C., 2009, “Art Spaces, Public Space, and the Link to Community Development,” Community Development Journal, 45 (4): 474-493. Grogan, D., Mercer, C. and Engwicht, D., 1996, The Cultural Planning Handbook, St. Leonards, N.S.W.: Allen & Unwin, Graves, J. B., 2005, Cultural Democracy: The Arts, Community and the Public Purpose, Illinois: University of Illinois Press.  Harris, S. P., ed., 1984, Insights/On Sites, Washington, DC, Partners for Livable Places.  Hayden, D., 1995, The power of place: Urban landscapes as public history, Cambridge, Mass.: MIT Press. Hui, D. ed., 2004, Proceedings of Soul of the City: International Symposium on Art and Public Space, Hong Kong: Hong Kong Arts Centre. Jacobs, J., 1964, The Death and Life of Great American Cities, Harmondsworth: Penguin Books. Knight, K., Schwarzman, M. and others,2006, Beginner's guide to community-based arts, Oakland, Calif.: New Village Press. Lacy, S., 1993, ‘Fractured Space,’ in (ed.) Raven, 1993: 287-302. Lacy, S., ed., 1995, Mapping the Terrain, Seattle, Bay Press.  Lacy, S., 1995, ‘Toward a Critical Language for Public Art,’ in Lacy, S., ed., 1995, Mapping the Terrain, pp.173-177. Lam, A., 2004, “Public Art in a Compact City – How Urban Renewal Can Reclaim and Make New Space for Art,” in Hui, D. and Ting, S. eds., Soul of the City: Proceeding of International Symposium on Art and Public Space, pp.150-153.  Lau, L. 2004, “Role of Leisure and Cultural Services Department in the Promotion of Public Art in Hong Kong,” in Hui, D. and Ting, S. eds., Soul of the City: Proceeding of International Symposium on Art and Public Space, Hong Kong: Hong Kong Arts Centre, pp.62-65. Lefebvre, H., 1991, The Production of Space, Oxford: Blackwell. Lefebvre, H, translated by Moore, J., 1991, Critique of Everyday Life, London; New York: Verso. Leonard, R. H. and Kilkelly, A., 2006, Performing Communities: Grassroots Ensemble Theaters Deeply Rooted in Eight U.S. Communities, New Village Press.  Lippard, L., 1995, “Looking around: Where we are, where we could be,” in Lacy, S. ed., Mapping the Terrain, pp.114-130. Lynch, K., 1960, The Image of the City, Cambridge, Mass.: MIT Press. Miles, M., 1997, Art Space and the City, Public Art and Urban Future, London; New York: Routledge. Miss, M., 1984, “From autocracy to integration: Redefining the objectives of public art,” in Harris, S.P., ed., Insights/On Sites, 6-71.  Mumford, L., The City in History: Its Origins, Its Transformations, and Its Prospects, London: Secker & Warburg. Muniz, A. M. and O’Guinn, T.C., 2001, “Brand Community,” Journal of Consumer Research, 27: 412-432.  Myerscough, J., 1988, The Economic Importance of the Arts in Britain, London: Policy Studies Institute.  Ng, Augustine, 2004, “Towards Quality Public Space in Hong Kong,” in Hui, D., ed., Proceedings of Soul of the City: International Symposium on Art and Public Space, 134-136. O’Sullivan, T., 2007, “Sounding Boards: Performing Arts Organizations and the Internet Forum,” International Journal of Arts Management, 9(3): 65-77. Pelli, C. and Rosen, N., 1984, “The chemistry of collaboration: An architect’s view,” in Harri ed., 1984, 29-38.  Petherbridge, D., ed., 1987, Art for Architecture: A Handbook on Commissioning, London: H.M.S.O. Phillips, P.C., 1995, “Public Constructions,” In Lacy, S., ed., Mapping the Terrain, pp.60-71. -----------. 1988, “Out of order: the public art machine,” Artforum, December, pp. 92–96. Reprinted in: Miles, M., Borden, I. & Hall, T., 2000, The City Cultures Reader, London; New York: Routledge. Planning Department, 2002, Urban Design Guidelines for Hong Kong, http://www.pland.gov.hk/pland_en/p_study/comp_s/udg/udg_es/udg_es_eng.pdf Raven, A., 1993[1989], Art in the Public Interest, New York, da Capo.  Raven, A., 1995, “Word of honor,” In Lacy, S., ed., Mapping the Terrain, pp.159-170. Reynolds, P., 1997, “Cultural Animation,” in Art and Ceremony in Sustainable Culture, Context Institute. Rohd, M., 1998, Theatre for Community Conflict and Dialogue: The Hope is Vital Training Manual, Heinemann Drama.  Rosler, M., 1994, “Place, Position, Power, Politics,” in Becker, C. ed., The Subversive Imagination, New York: Routledge.  Sarkissian, W., 2010, Creative Community Planning: Transformative Engagement Methods for Working at the Edge, London; Washington, DC: Earthscan. Selwood, R., 1995, The Benefits of Public Art, London, Zed Books.  Townsend, P., ed., 1984, Art within Reach: Artists and Craftworkers, Architects and Patrons in the Making of Public Art, London: “Art Monthly” in collaboration with the Arts Council of Great Britain and the Crafts Council. Willett, J., 2007[1967], Art in a City, Liverpool [England]: Liverpool University Press and the Bluecoat. Willett, J., 1984, “Back to the Dream City,” Tin P. Townsend, Art within Reach, “Art Monthly” in collaboration with the Arts Council of Great Britain and the Crafts Council, pp.7-13. Wong, A., 2004, “The Relationship between Public Art and Community Space,” in Hui, D., ed., Proceedings of Soul of the City: International Symposium on Art and Public Space, pp.33-39. Zukin, S., 1996, “Space and Symbols in an Age of Decline,” in King, Anthony ed., Re-Presenting the City, London, Macmillan.", "terms": {"2020-21 Term 2": {"--LEC (8882)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Y.C. Liang Hall G03"], "instructors": ["Professor CHAN Yuk Keung"]}}}, "assessments": {"Essay test or exam": "20", "Others": "80"}}, {"code": "3005", "title": "Design Your Exhibition – Curatorial Planning and Practice", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "“Curator” once referred to an expert in keeping collections and making exhibitions, but has been expanded to encompass a hybrid role in innovation and knowledge creation. Today, curators are active agents in social and cultural transformation, taking part in dynamic projects presented by museums, commercial galleries, non-profit art spaces, biennials, art fairs, and many disruptive platforms beyond the field of art that didn’t previously exist. Curators produce knowledge, engage their audience, spark innovation, and constantly challenge the role of “curator” beyond the confines of the status quo across varied institutional settings. This course aims to provide students with hands-on experience in exhibition curation and engages students in a broad spectrum of real-world experiences and professional networking opportunities, aiming to prepare students for future curatorial projects/jobs. It covers topics such as idea conceptualization, proposal writing, pitching, budgeting, contracting, publication, exhibition design, installation and exhibition maintenance. By co-curating an exhibition in a non-profit art space in Hong Kong, students will take part in the various stages of exhibition making. With a focus on exhibition experience, audience engagement, and sociability, this course will train students in the role of being a curator and enable students to develop leadership skills and critically apply knowledge conducive to creative outcomes.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3007", "title": "Entrepreneurship in the Creative Industries", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "The concept of “creative industry” was proposed by the Labor Party in the U.K. in 1997. It refers to the activities that are embedded in individuals’ creativities, talents and skills, which have the potential for employment opportunities and economic growth through the exploitation of intellectual properties. Creative industry has become a key area in contemporary cultural policies. This course introduces students to the basic knowledge of managing entrepreneurship, which is a key issue in the creative industries. It comprises three parts. The first part provides a general introduction. The second part discusses the nature of entrepreneurship in creative industries and demonstrates the entrepreneurial process, through which, creative ideas are generated, cultural diffusion is stimulated and innovation processes are carried out. It informs students of the key traits of the creative entrepreneurs and the business opportunities and models for entrepreneurship processes in the creative industries. In the third part, it explores the conducive policy conditions to support and encourage entrepreneurship in creative industries.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3008", "title": "Curating and Organising Arts Festival", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "With a global growing interest in organizing grand scale arts and cultural activities to attract local and overseas audience, arts festivals have become popular urban cultural events for cultural development and for building the reputation of a city. Curating and managing cultural festival is subsequently an important area of studies in cultural management. Curating and organizing arts festival is a complex process that requires creative programming, skillful execution and careful financial control. This course not only studies the mode of operations of various types of cultural festivals, including festivals of performing arts, visual arts, film, literary arts and community festive celebration, but also introduces to students the basic skills and knowledge of curating and organizing arts festivals, with references to local and overseas examples.", "outcome": "- Understand the operation format, management process in organizing various types of cultural festivals; - Have the ability to curate and coordinate programmes within a specific arts/cultural festival; - Learn the supporting skills for successful implementation of arts/cultural festival, including publicity, marketing, public safety, security and finance control; - Equip students with the critical skills to review and evaluate the success and failure of a major cultural event.", "syllabus": "1. Cultural Festival: an introduction \r This session studies the history, social functions and basic modes of operation of cultural festivals, with examples from Hong Kong and fromvarious parts of the world.\r  2. Various types of festivals and their distinctive characters \r This session introduces various types of arts festival, from festivals focusing on specific media, grand scale multi-disciplinary festivals, to community based religious/celebrative events, with emphasis on studying their own distinctive characteristics and special technical requirements.\r  3. Planning cultural festival 1: \r This session focuses on programme planning and coordination, as well as resource management within the institutional and community context.\r  4. Planning festival 2: \r This session deals with the planning of setting up an operation framework, allocation of manpower, design of the technical support and working out an operational schedule for a major arts festival.\r  5. Planning festival 3: \r Funding is an essential part of organizing cultural festivals. This session studies the various ways to seek public and private fund, and ways to do financial planning and to exercise financial control over the running of projects.\r  6. Planning festival 4: \r In addition to curating and implementing programmes, a successful festival also includes much supporting activities, ranging from marketing to educational events. This session focuses on the studies of these supplementary activities in order to get the best results for an arts event.\r  7. Presentation and discussion\r Students are asked to form groups to work on proposals for an arts festival. Students are to do their representations at class, and engage in discussion after the presentations.\r  8. Curation and programming\r This session studies the curation of festival programmes with references to local cultural strength and needs, the use of available resources, as well as a study of the global trends in arts festival.\r  9. Execution and crisis management\r This session studies the security measure for major cultural events, and preparations required for unexpected incidents and crisis. \r  10. Case studies\r Using the Hong Kong Arts Festival and Hong Kong Film Festival for case studies, this session studies the actual implementation of cultural festivals within the specific social, cultural and financial context of Hong Kong.\r  11. Evaluation and research\r The success of a festival depends heavily on responses from the audience, the press and the public, this session studies the application of marketing strategies and its consequent results, and ways to make meaningful evaluation for future development.\r  12. Critical issues relating to arts festival\r As arts and cultural festivals become increasingly prolific, its social and cultural impacts are not to be underestimated. This session takes on a critical review of the impacts, the pro and con of organizing arts festivals, as well as possible alternatives.\r  13. Review and discussion\r This session reviews the entire course and engages students in an over-all discussion.", "required_readings": "1. Cultural Festival: an introduction\r Hope Tschopik Schneider, ‘Why? An Introduction to Producing a Festival’, P.14-15, About Festivals…, Department of Cultural Affairs, 2004, Los Angeles, USA\r  2. Various types of festivals and their distinctive characters\r http://www.escapenormal.com/2011/03/29/50-greatest-festivals-in-the-world/\r Audrey C. Shalinsky, ‘Studying Community Festival’, AnthroNotes University of Wyoming, vol. 7, no. 1, winter 1985\r  3. Planning cultural festival 1: \r Dan Magie, Yje, ‘Programming’ P.27-50, Arts Festival Work Kit, University of Massachusetts, USA 1989\r  4. Planning festival 2:\r Steve Brown and Jane James, “Event design and management’, P.53 – 64. Yeoman, I.et al..Festival and Events Management: An International Arts and Culture Perspective. Elsevier: Butterworth-Heinemann, 2004.\r  5. Planning festival 3: \r Sumi Sevilla Haru, ‘The Business Side of Festivals’, P.26-30, Judith Luther Wilder (editor) About Festivals…, Department of Cultural Affairs, 2004, Los Angeles, USA\r  6. Planning festival 4: \r Emma Wood, ‘Marketing information for the events industry’ P.130 – 157, Yeoman, I.et al... Yeoman, I.et al..Festival and Events Management: An International Arts and Culture Perspective. Elsevier: Butterworth-Heinemann, 2004.\r  7. Presentation and discussion\r N/A\r  8. Curation and programming\r Dan Magie, Yje, ‘Festival Concept: what kind of event will be?’, P.9 – 16, Arts Festival Work Kit, University of Massachusetts, USA 1989\r  9. Execution and crisis management\r Aaron Paley, ‘Timelines & Workplans’, P.18-25, Judith Luther Wilder (editor) About Festivals…, Department of Cultural Affairs, 2004, Los Angeles, USA\r  10. Case studies\r Hong Kong Arts Festival Programme Brochures, HKAF, 2014\r The 38th Hong Kong Film Festival Brochures, HKIFF Society, HK, 2014\r  11. Evaluation and research\r Planning strategy and applying the strategic Marketing process p65-88 , Arts Marketing Insights: The Dynamics of Building and Retaining Performing Arts Audiences, Jossey-Bass Publishing , 2006\r  12. Critical issues relating to arts festival\r Ros Derret, ‘Festivals, events and the destination’, P.32-50, Yeoman, I.et al..Festival and Events Management: An International Arts and Culture Perspective. Elsevier: Butterworth-Heinemann, 2004.\r  13. Review and discussion\r N/A", "recommended_readings": "Ali-Knight, J.et al..International Perspectives of Festivals and Events: Paradigms of Analysis. Elsevier Ltd, 2009.\r  Dan Magie, Yje, Arts Festival Work Kit, University of Massachusetts, USA 1989\r  Hoyle, L. H..Event Marketing: How to successfully promote events, festivals, conventions and expositions. John Wiley & Sons, 2002.\r  Judith Luther Wilder (editor) About Festivals…, Department of Cultural Affairs, 2004, Los Angeles, USA\r  Liana Giorgi, L., Sassatelli, M., Delanty, G..Festivals and the Cultural Public Sphere.Routledge, 2011.\r  Marc Duke, The Art Festival Handbook, Park Drive Publishing, 2008\r  Yeoman, I.et al..Festival and Events Management: An International Arts and Culture Perspective. Elsevier: Butterworth-Heinemann, 2004.", "terms": {"2020-21 Term 2": {"--LEC (8429)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor CHUNG Ming Yan Fanny"]}}}, "assessments": {"Essays": "50", "Others": "15", "Presentation": "35"}}, {"code": "3009", "title": "Interpreting Chinese Antiquities", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "Not for students who have taken CUMT4101 Special Topics in Cultural Management (Heritage, Archaeology and Interpretation theme)", "description": "From the perspective of archaeology, this course is tailored to cross disciplinary boundaries between heritage and contemporary issues. The world of ancient China is a rich source of inspirations for museum work; tourism; films and documentary; literature; designs; and even commercial productions. Yet misinterpretations over Chinese history have led to problematic descriptions of heritage and archaeological sites. Indeed, there have not been many discussions of Chinese historical past independent of texts, and this course intends to fill up the lacuna. Taking ancient and medieval China as subjects, this course leads student to appreciate Chinese arts and archaeological finds from between the Neolithic and the 13th century. The course urges students to develop acute senses in reading and writing about heritage for contemporary needs.", "outcome": "Upon completion of the course, students would be able to identify key historical sites and remains of pre-modern China; analyze the roles and management of heritage or its relevant institutions; think critically about historical exhibitions and other cultural events; develop acute senses for appreciating traditions and values; develop interests in culture and history; and get prepared for career related to management of heritage and arts industries.", "syllabus": "1. Introduction: Why is material culture? What is heritage?  What is the difference between history and archaeology? Why should we pay attention to material objects? This session introduces the discipline of archaeology and describes its application in China. It defines what we speak of Chinese heritage from the perspective of material remains.   2. Neolithic China: The Rise of Numerous Jade-using Sources  As of 2014, more than 10 different Neolithic cultures have been identified in China. To what extent have we moved beyond the old understanding about Yangshao and Longshan cultures in central China? What do the new finds tell us about China during the Neolithic times (c.5000—c.2000 BC). And how do they fit into the unified picture of what we call ‘China’ today.   3. The Shang period: the Dawn of Civilization  There are some textual descriptions about the Shang dynasty. But its archaeological boundaries are subject to debates. This session introduces the key Shang sites in Henan, as well as their contemporary sites found in Sichuan, Hunan, and other Chinese provinces. It leads student to pay attention to the interpretation presented in most Chinese museum—all Bronze Age cultures were re-think the connections between the early Bronze Age and the present.   4. Western Zhou: The Early Development of Cultural Borrowings Western Zhou is understood as one of the most esteemed periods in antiquity. This session looks into the archaeological finds from the 10th to 8th century BC and discusses what bronzes tell us about the several important political decisions the Zhou courts made to consolidate sovereignty. One key policy that the Zhou founders implemented was adaptation to various cultural streams collected from the preceding Shang and other neighbouring groups. This was an unknown yet profoundly important aspect of the Zhou that prepared it for taking the lead of what we today call ‘Chinese’ civilization.   5. Eastern Zhou: The Age of Conformity The flourishing workshops of bronze-casting, lacquers, pottery, and textiles from the Eastern Zhou period provide a vast number of important archaeological finds. This session introduces some key sites, which include Sanmengxia and Leigudun. From them we will discuss the significance of material culture in forming shared heritage roots.  Reading: Sullivan 2008, chapter 1, pp. 45—63.  6. Han I: Burial Culture The Han dynasty is a promising period with many textual records and archaeological finds. This first session looks into the Han tomb structure and burial goods, which present some interesting patterns in the religious ideas and practices of the period.  Reading: Sullivan 2008, chapter 1, pp. 65—97.  7. Han II: the Silk Road Connections with the West were well-formed under the Han regime. This session looks at the finds from the Silk Road, which continued to be in use throughout the Han and its following centuries. This session reviews the finds from the Silk Road and discusses their significance for both the intellectual and public sphere in the present times.  Reading: Sullivan 2008, chapter 1, pp. 65—97.  8. Northern & Southern Dynasties: Buddhism in China Buddhism began to appear in China from the Han times, and became vastly important throughout the divided Northern and Southern dynasties. This session introduces the key caves of Buddhist sculpture and discusses the impacts of Buddhist ideas on later Chinese material creations. In particular, Buddhism helped develop a range of ornamental features unprecedentedly formed in the context of China; yet those features have become central in the presentation of Chinese heritage today.  Reading: Sullivan 2008, chapter 1, pp. 99—129  9. Tang Dynasty: The Cosmopolitan Cities  This session focuses on the settlement finds from the Tang period. Little is known about ancient Chinese cities or settlement sites, which were prone to destruction. This session leads students to reflect on the urban life in Metropolitan Tang, which was benefited from the access to various exotic goods acquired through the Silk Road.  Reading: Sullivan 2008, chapter 1, pp. 131—161.  10. Song I: Antiquarianism and Imperial Collections of Arts The Song dynasty was the age of the studies of antiquities. This lecture introduces the early catalogues of imperial collections that developed the sense of shared inheritance from the ninth century.  Reading: Sullivan 2008, chapter 1, pp. 163—205.  11. Song II: Mural Paintings  Mural paintings are important finds from the tombs of the Song period. They usually represent the tomb owners in household quarters, engaged in various activities. More importantly, the neighbouring Qidan and Jin peoples also copied such tradition. This session leads student to discuss the importance in the exchange of burial practices and ideas.  Reading: Sullivan 2008, chapter 1, pp. 163—205.  12. Guest lecture/field trip, venue to be decided.  This session will bring some fresh air to the classroom by taking students to look at modern presentation of Chinese material culture. The permanent gallery of the Hong Kong Art Museum will be a good choice. But it depends on the range of exhibitions available during the teaching period. If possible, a trip to visit the site in Guangzhou or Shenzhen will produce constructive impression about modern understanding of China past.   13. Conclusion and discussions of final papers.  This session summarizes the key issues collected from the above lectures. This is hoped to open up discussions for students to review the various sources of traditions that were gathered to form the core of Chinese civilization.", "required_readings": "1. Reading: Rawson 2007, Introduction, pp. 13—43. 2. Reading: Sullivan 2008, chapter 1, pp. 1—15. 3. Reading: Sullivan 2008, chapter 2, pp. 15—35. 4. Reading: Sullivan 2008, chapter 3, pp. 35—43. 5. Reading: Sullivan 2008, chapter 4, pp. 45—63. 6-7. Reading: Sullivan 2008, chapter 5, pp. 65—97. 8. Reading: Sullivan 2008, chapter 6, pp. 99—129. 9. Reading: Sullivan 2008, chapter 7, pp. 131—161. 10-11. Reading: Sullivan 2008, chapter 8, pp. 163—205.", "recommended_readings": "Chang, Kwang-chih. The archaeology of ancient China, New Haven, Conn. : Yale University Press, 1986. Ebrey, Patricia. Cambridge Illustrated History of China, 2nd edition, Cambridge: Cambridge University Press, 2010.  Fong, Wen. The great bronze age of China : an exhibition from the People's Republic of China, London: Thames and Hudson, 1980. Golany, Gideon. Urban design ethics in ancient China, Lewiston, N.Y.: E. Mellen Press, 2001.  Greenblatt, Miriam. Han Wu Di and ancient China, New York: Marshall Cavendish Benchmark, 2005. Lin, James C.S. The search for immortality : tomb treasures of Han China, Cambridge : The Fizwilliam Museum, University of Cambridge ; New Haven : Yale University Press, 2012. Lu, Tracey Lie Dan. Museums in China: power, politics and identities, Routledge, 2013. Michael Loewe and Edward L. Shaughnessy (ed.). The Cambridge history of ancient China : from the origins of civilization to 221 B.C., Cambridge, U.K. ; New York : Cambridge University Press, 1999. Pulleyblank, Edwin G. Central Asia and non-Chinese peoples of ancient China, Aldershot; Burlington, VT: Ashgate, 2002. Rawson, Jessica (ed.). Mysteries of ancient China : new discoveries from the early dynasties, New York: G. Braziller, 1996. Rawson, Jessica (ed.). The British Museum Book of Chinese Art, London: British Museum, 2007.  Shaughnessy, Edward L. Sources of Western Zhou history : inscribed bronze vessels, Berkeley : University of California Press, 1991. So, Jenny F. Bronze styles of the Eastern Zhou period, Ann Arbor, Mich.: UMI, 1994. So, Jenny F. and Bunker, Emma C. Traders and raiders on China's northern frontier, Seattle : Arthur M. Sackler Gallery, Smithsonian Institution, in association with University of Washington Press, 1995. Sullivan, Michael. The Arts of China, 5th edition, Berkeley: University of California Press, 2008.  Sun, Zhouyong. Craft production in the western Zhou Dynasty (1046-771BC) : a case study of a jue-earrings workshop at the predynastic capital site, Zhouyuan, China, Oxford : Archaeopress, 2008. Thorp, Robert and Richard Vinograd. Chinese Arts and Culture, New York: Abrams, 2001.  Wagner, Donald B. Iron and steel in ancient China, Leiden ; New York: E.J. Brill, 1993. Wang, Ming-ke. The Chʻiang of ancient China through the Han dynasty: ecological frontiers and ethnic boundaries, Ann Arbor : UMI, 1995. 耿占軍，楊文秀。漢唐長安的樂舞與百戲，西安市：西安出版社，2007。 龔國強。隋唐长安城佛寺研究，北京：文物出版社，2006。 河南省文物考古研究所编。北宋皇陵，鄭州 : 中州古籍出版社, 1997. 李朝遠等。中國青銅器，中國：五洲傳播出版社，2004。 李清泉。宣化辽墓 : 墓葬艺术与辽代社会，北京：文物出版社，2008。 李學勤。走出疑古時代，瀋陽：遼寧大學出版社，1994。 李學勤。東周與秦代文明，北京：文物出版社：新華書店北京發行所，1984。 鄧聰[主編]。東亞玉器，香港：香港中文大學中國考古藝術硏究中心，1998。 鄧聰[主編]。南中國及鄰近地區古文化硏究 : 慶祝鄭德坤敎授從事學術活動六十週年論集，香港：香港中文大學中國考古藝術硏究中心。 齊東方。隋唐考古，北京：文物出版社，2002。 錢穆。中國文化史導論，北京市 : 九州出版社，2011。 唐俊杰。南宋臨安城考古，杭州：杭州出版社，2008。 徐萍芳。中國歷史考古學論集，上海：上海古籍出版社，2012。 徐萍芳等。中國文明的形成，北京：新世界出版社；New Haven：Yale University Press，2004。 楊虎，劉國祥，鄧聰。玉器起源探索 : 興隆窪文化玉器研究及圖錄，香港：中國考古藝術硏究中心，2007。 中國社會科學院考古研究所，河南省文物考古研究所編。汉代城市和聚落考古与汉文化，北京：科学出版社，2012。 朱和平。中國青銅器造型與裝飾藝術，長沙 : 湖南美術出版社，2004。", "terms": {"2020-21 Term 2": {"--LEC (8875)": {"startTimes": ["12:30"], "endTimes": ["15:15"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor PENG Peng"]}}}, "assessments": {"Essays": "50", "Others": "10", "Short answer test or exam": "40"}}, {"code": "4001", "title": "Integrated Studies in Cultural Management", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "This course is continuation of CUMT1001, Introduction to Cultural Management, and looks at cultural management from the macro perspective. Successful culture managers work to maintain healthy balance between culture and its relevant fields of interests, which sometimes could turn harmful or beneficial to the growth and development of the corresponding cultural area. The first session discusses the mutual dependence between culture and various areas, which include laws, economy, community, national interests, and art practitioners. In practice, cultural managers usually have to conform to the values and ethnics of the corresponding countries. For that reason, the second session will look at the approach taken in a few remarkable examples, which Taiwan, China, Singapore, South Korea, U.K., and the U.S.", "outcome": "Upon completion of the course, students will be able to explain different national and social concerns for preserving culture; to identify the legal and ethnic issues relevant to cultural productions; to identify marketing strategies in cultural promotion; to evaluate the measures for maximizing the input of art practitioners; and to describe the various successful cultural schemes implemented in overseas countries.", "syllabus": "Section I: Culture in Context   1. Culture & States The growth of cultural industries is strongly related to political environment and state policy. This lecture discusses the tension and mutual expectations between cultural workers and politicians. It will use the experience of the European Union and the US as examples.   2. Culture & Laws Over the last few decades, there were a number of remarkable disputes over international art transactions and copy rights. Given the growing size of the art market, knowledge about the previous cases is essential. This lecture takes the examples taken from the US for discussions.   3. Culture & UNESCO UNESCO is arguably a rising new power in forming a standard for evaluating cultural heritage of different nations. This lecture discusses the roles of UNESCO and its work in different cultural disciplines. National disputes over ownership of World Heritage sites will be bought up.   4. Culture & Community Nowadays many nations and countries perceive culture and heritage as means to empower developing communities. This lecture discusses the conservation of indigenous or minorities cultures, and its impacts on the majority population of the same community.   5. Culture & Marketing  Culture and business are often taken as two contrasting disciplines. One of the key issues in cultural management is to develop cultural audience with both education and economic concerns. Religious sectors are a growing body of cultural venues for tourism and heritage management. This lecture discusses the debated concerns about conducting marketing or business-driven strategies in cultural and religious areas.   Section II: Case Studies 6. Cultural Management in Taiwan Taiwan provides an excellent example to demonstrate the top-down organization of heritage sites. This lecture reviews a series of campaigns launched in Taiwan during the past twenty years, and discusses the reasons that may have contributed to engage the mass of Taiwan into different aspects of cultural industries.   7. Cultural Management in China China represents many upcoming opportunities in cultural management. This lecture reviews some recent moves: rapid establishment of museums, growing number of commercial galleries and auction houses, rise of new Confucian schools, introduction of university degrees in cultural management, etc. The lecture discusses the consuming force underneath the cultural growth in the Mainland.   8. Cultural Management in Singapore During the last two decades, the government of Singapore invested heavily on constructing cultural venues for both national and economic purposes. This lecture gives an overview of their establishment and invites students to reflect on the opportunities found in other areas of Asia.   9. Cultural Management in South Korea This lecture discusses the contemporary cultural policies undertaken in South Korea. During the last decade, South Korea featured an economic miracle in Asia by rejuvenating the distressed financial market with cultural developments, which included the film industry, heritage protection, publication, and cultural tourism.   10. Cultural Management in UK The United Kingdom was one of the earliest countries that invested heavily on promotion of cultural and arts events. This lecture gives a short history of the early developments made in the UK after the Second World War, and discusses the recent campaigns undertaken to break the boundaries between high arts and popular culture.   11. Cultural Management in USA The United States distinguishes herself from all other countries by boosting the absence of a ministry for arts and culture, yet artists and cultural workers receive due respects for their contributions. This lecture looks at the case of the US and examines her success in cultural management.   12. Group presentation This lecture is taken as a mock symposium for students to present their group projects and make comments on those by their peers. The presentation will be evaluated against the clarity and thoughts over the approved topics.   13. Conclusion: What is the best for Hong Kong?  This last session will summarize the topics covered throughout the course. Hong Kong is facing the challenge that many aspects of cultural developments in relation to urban planning, legislation, economy, national identity, and education are all pending. This lecture is an open discussion for students to brainstorm the possible approaches that Hong Kong could take in years to come.", "required_readings": "Week 1 Rosenstein, Carole. ‘ Cultural policy and the political nature of culture’ in J.P. Singh ed., International Cultural Policies and Power (Basingstoke, Palgrave Macmillan, 2010), pp. 19—28.  Dewey, Patricia. ‘Power in European Union Cultural Policy’ culture’ in J.P. Singh ed., International Cultural Policies and Power (Basingstoke, Palgrave Macmillan, 2010), pp. 113—126.   Week 2 Hoffman, Barbara. ‘International art transaction and resolution of art and cultural properties disputes: a United States perspective’ in B. Hoffman ed., Art and Cultural Heritage: Law Policy, and Practice (Cambridge ; New York : Cambridge University Press, 2006), pp. 159—177.   Week 3 Sun, Kerya Chau. ‘Angkor sites, cultural World Heritage’ in B. Hoffman ed., Art and Cultural Heritage: Law Policy, and Practice (Cambridge ; New York : Cambridge University Press, 2006), pp. 148—156. Reap, James. ‘United States and the World Heritage Convention’ in B. Hoffman ed., Art and Cultural Heritage: Law Policy, and Practice (Cambridge ; New York : Cambridge University Press, 2006), pp. 234—238.  Week 4 Solomen, Maui. ‘Protecting Maori Heritage in New Zealand’ in B. Hoffman ed., Art and Cultural Heritage: Law Policy, and Practice (Cambridge ; New York : Cambridge University Press, 2006), pp. 352—362. Sullivan, Robert. ‘Indigenous cultural and intellectual property rights: a digital library context’ in B. Hoffman ed., Art and Cultural Heritage: Law Policy, and Practice (Cambridge ; New York : Cambridge University Press, 2006), pp. 416—418.  Week 5 Brown, Charles. ‘Selling faith: marketing Christian popular culture to Christian and non-Christian audiences’, Journal Religion and Popular Culture, 2012, Spring, 24.1, pp. 113—129.   Week 6 Shih, Fang-long (eds). Re-writing Culture in Taiwan (New York: Routledge, 2008).   Week 7 Lathan, Kelvin (eds.). Consuming China: Approach to Cultural Change in Contemporary China (Oxford: Routledge, 2006), pp. 1—55.   Week 8 Chong, Alan. ‘Small state soft power strategies: virtual enlargement in the cases of Vatican City State and Singapore’, Cambridge Review of International Affairs, 2010, 23.3, pp. 383—405.   Week 9 Yim, Haksoon. ‘Cultural identity and cultural policy in South Korea’, International Journal of Cultural Policy, 2002, 8.1, pp. 37—48.   Week 10 Hesmondhalgh, David. ‘Media and Cultural Policy as Public Policy: The Case of the British Labour Government’, International Journal of Cultural Policy, 2005, 11.1, pp. 95—109.   Week 11 Markusen, Ann. ‘Urban development and the politics of a creative class: evidence from a study of artists’, Environment and Planning A, 2006, 38, pp. 1921—40.   Week 12 N/A  Week 13  何志平、陳雲根，《文化政策與香港傳承 : 何志平五年的雪泥鴻爪》，香港︰中華書局，2008年。", "recommended_readings": "Brindle, Meg. Arts Management Handbook : New Directions for Students and Practitioners, New York: M.E. Sharpe, 2001. Byrnes, William J. Management and the Arts (4th ed.), MA : Elsevier Focal Press, 2009. Chong, Derrick. Arts Management (2nd ed.), London ; New York : Routledge, 2010. Colette, Henry. Entrepreneurship in the Creative Industries: An International Perspective, Cheltenham, UK; Northampton, MA: Edward Elgar, 2007. Du Cros, Hilary and Lee, Yok-shiu F. Cultural Heritage Management in China: Preserving the Cities of the Pearl River Delta, London; New York: Routledge, 2007. Fitzgibbon, Marian. Managing Innovation in the Arts : Making Art Work. Westport, Conn.: Quorum Books, 2001. Fitzgibbon, Marian and Kelly, Anne. From Maestro to Manager: Critical Issues in Arts and Culture Management, Dublin: Oak Tree Press in association with the Graduate School of Business, University College Dublin, 1997. Frost-Kumpf, Hilary A. Cultural Districts: Arts Management and Urban Redevelopment, Ph.D. Thesis, The Pennsylvania State University, 2001. Han, Sangwoo. Cultural Heritage Management in South Korea, Ph.D. Thesis, University of Minnesota, 2001 Messenger, Phyllis Mauch and Smith, George S. Cultural Heritage Management: A Global Perspective, Gainesville: University Press of Florida, 2010. Munoz-Seca, Beatriz and Riverola, Josep. When Business Meets Culture; Ideas and Experiences for Mutual Profit, Basingstoke, Palgrave Macmillan, 2010. Radbourne, Jennifer J. Arts Management: A Practical Guide, London: Allen & Unwin, 1996. Shepherd, Robert J. and Yu, Larry. Heritage Management, Tourism, and Governance in China: Managing the Past to Serve the Present. New York, NY: Springer New York: Imprint: Springer, 2013. Watts, Victoria and Gehl, Robert W. The Politics of Cultural Programming in Public Spaces, Newcastle upon Tyne : Cambridge Scholars, 2010. 夏學理等，《藝術管理》，台北市：五南圖書出版股份有限公司，2011年。", "terms": {"2020-21 Term 2": {"--LEC (8602)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Science Centre L5"], "instructors": ["Professor LEUNG Hok Bun Isaac"]}}}, "assessments": {"Essays": "40", "Others": "40", "Presentation": "20"}}, {"code": "4003", "title": "Culture-led City Development", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "This course aims to provide students with a comprehensive understanding of the culture-led city development phenomenon and equip them with the protocols for execution and practice. It comprises three blocks: Block 1 unfolds an overall picture of the phenomenon, introduces the related concepts, displays the disciplinary foundation of this topic, traces its history, and discusses the rationales and developing tendency. Block 2 studies the urban sociological and economic approaches employed in developing the theoretical foundation, highlighting a transition in capitalist production mode and urban governance upheld by public-private partnership modes. Criticisms are also presented to complete a dialectic mindset of this phenomenon. With a strong practical dimension, Block 3 teaches students various methods to make consultancy and policy recommendations for culture-led urban development projects. A variety of practices that constitute the culture-led strategy are discussed, such as how to plan for a creative city and cultural facilities, how to boost creative industries and develop cultural quarters and creative clusters, as well as how to revitalize historic quarters.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4004", "title": "Archaeology and Modern Applications", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "Pre-requisite(s): CUMT3009 or its equivalence", "description": "Archaeology is an intriguing topic. In CUMT3009 Interpreting Chinese Antiquities, students are taught the essential contents and arguments in each Chinese archaeological period. At this advanced level, students are led to analyze the presentation of Chinese archaeological materials in different modern forms, which are namely, movies, novels, documentary films, museum displays, auction houses, and antique shops. Each class picks up a representative topic and a form of modern expression for discussions. Students of this course are required to have knowledge in Chinese archaeology, because the discussions are carried out in seminar forms, in which their inputs are required. The course gets students to apply the designs and innovations of ancient China to areas, which they may find interests that will eventually get in touch with the wide public.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4005", "title": "Art and Propaganda", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "The course studies the history, theories and techniques of organizing cultural activities for social and political causes. It investigates the relationship between cultural expressions and the infrastructure of power, and the application of arts and culture for social, political actions, covering such major movements from the avant-garde of the 19th Century, the USSR and the Chinese propaganda movements, to the arts for civil right movements since 1960s. Case studies of similar movements in Hong Kong will also be included. The final part of the course will introduce to students the operational and managerial skill required for organizing such cultural activities.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4007", "title": "Museum Studies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "Not for students who have taken ANTH4720 or HIST5514", "description": "Museums have multiple roles in a society. They are academic institutes and public arenas for education. In the broad term, they represent national culture and communal heritage. This course leads student to understand museum exhibitions and management within social contexts. The lectures respond to the following issues: 1. What are the functions and achievements of museum activities? 2. In what ways can we understand and learn from an exhibition? What are the essential elements of museum catalogues and cultural writing? 3. How do museum workers balance both marketing and social needs? 4. In what ways can we participate in the operation of a museum? The course draws discussions from both the perspectives of museum workers and visitors. Some current issues concerning the roles of museums are also covered.", "outcome": "At the end of the course, students should be able to: \r 1. Identify the roles and management of museums; 2. Think critically about museum exhibitions and other cultural events; 3. Develop acute senses for art appreciation;  4. Develop interests in culture and history; and \r 5. Get prepared for career related to management of museums and cultural industries.", "syllabus": "1 Introduction:What is a museum? \r The introduction gives an overview of the museum structure and definition. This will introduce the various types of museums established around the world, defined according to the range of their collections. This will also compare the organization structure of a museum, in which the curatorial teams are working with a range of specialists relevant. \r  2 The history of museums \r The ‘history’ of museum sounds alien to the context of museum studies. But museum workers are coming to beware that the museums are products of modernity that marked a distinctive times in which antiquities could be treated as shared, public properties. This lecture reviews the establishments of the Louvre and the British Museum in the 18th century; and discusses how ‘museums’ were contextualized first in Japan and later on in China. \r  3 Curatorship I: Exhibiting Authenticity and Interpretation\r As the last lecture recalls, ‘Museum as Ritual’ has become an established social understanding—museum is a place where esteemed objects are being exhibited and therefore recognized. The first problem that encounters all museum works is whether the objects they are showing, or the theme of the objects that they are presenting are ‘authentic’. In this lecture, we will look at examples of some early colonial museums and study the created themes that they presented. \r  4 Curatorship II: Organizing a thematic exhibition\r Putting up a thematic exhibition (alongside the permanent exhibition) is a common practice in most museums. This lecture will give instructions as to what elements a thematic show should include. Then students are organized into groups to do a role play session for three parties: museum workers, overseas collaborators, and the donors. From this exercise, students will learn about the difficulties in negotiations and planning. \r  5 Curatorship III: Museum publications and cultural writings\r The writings published for the museums share a common theme of identifying the artistic or historical values of the objects. In practice, however, there are various levels in addressing objects through literary practices. This lecture will look into some representative examples written for different targeted groups, which include children, pupils, and foreign visitors. \r  6 Museum and society I: Architecture and Design\r Renovation projects were undertaken in numerous renowned museums around the world, because it has become aware that museums have to catch up with young generations and with the rapidly developed cities, in which they are located. This lecture will look into the case of Doha Quarter, where the locals took a deliberate attempt to a museum compound. From such we will consider the significance of architecture and museum collection. \r  7 Museum and society II: Education and Application of Digital Technology \r Smartphones and other technological devices have become useful sources for museum presentations and visits. This lecture reviews some applications both within the museum building and outside it. The lecture will also respond to the concerns that digital technologies may exhaust public interests in the museum collections. With these both sides of argument, this lecture leads students to consider both the usefulness and shortcomings of digital technologies. \r  8 Museum and society III: Patrons, Donors and Volunteers, the sources of Funding and Support\r Funding is always limited for cultural institutions. In this lecture, we will discuss the various potential fund sources for the museums. There is no standard way in the industry as to what the museum workers should do or write to apply for funding. But there are recognized sources about which they could get in touch: public visitors, membership programmes, volunteers, donars, and governmental resources. The key of the lecture is to develop an open mind to expand the coverage of funding from monetary values to public recognition. \r  9 Current issue I: Museum Branding and Marketing\r Museum branding has been identified as a major marketing strategy for cultural institution. In this lecture, we will look at the suggestions of some successful museum workers and study their marketing approaches by creating a brand for museums. \r  10 Current issue II: Soft Power and the Political Roles of Museums.\r As soon as Joseph Nye published his idea about soft power, which is based on the dissemination of cultural products or ideas, the discussion is always concerned with museum exhibitions. Museums could be taken as political statement of national treasures. In this lecture, we will discuss the ideas of Nye and look at how such concept has been interpreted in Asia. \r  11 Fieldtrip/site visit week \r This week we will take some fresh air by visiting a local museum/site. \r  12 Current issue III: Museums and Contemporary Arts. \r Should we include contemporary art in the context of museum? This is a difficult question that happens to most museums around the world. The well-used resolution is construction of a new venue dedicated to contemporary arts. The differences between the two disciplines—museums and contemporary arts—are related to the level of curatorship and public recognition. But the two themes seem to have blurred since the last decade. \r  13 Current issue IV: M+ and other museums in Hong Kong\r In this last session, we will return our discussion to Hong Kong and look at what options this city has in comparison from what we have seen in other parts of the world. The M+ is dedicated to contemporary arts, or experimental arts; but the local museums remain fairly traditional in terms of collection and their range of exhibitions. Can Hong Kong develop a cultural hub? If so, what roles do these institutes would play?", "required_readings": "Topic 1: \r 1. Burcaw, chapters 1, 3 and 4. \r  Topic 2:\r 1. Burcaw, chapter 2;  2. Duncan, Carol. ‘From the princely gallery to the public art museum: the Louvre Museum and the National Gallery, London’ in Civilizing Rituals: Inside Public Art Museums (Routledge: London and New York, 1995), pp. 21−47. \r 3. Tseng, Alice Y. ‘The Museum in Ueno Park: Styling the Nation’ in The Imperial Museums of Meiji Japan: Architecture and the Art of the Nation. Seattle and London: University of Washington Press, 2008, pp. 39−81. \r  Topic 3:\r 1. Burcaw, chapters 5, 9−11 and 20\r 2. Storr, Robert. ‘Show and Tell’, in P. Marincola (ed.) What Makes a Great Exhibition? Questions of Practice, Philadelphia: Philadelphia Centre for Arts and Heritage, 2006, pp. 14−31. \r 3. Philips, David. Exhibiting Authenticity, Manchester and New York: Manchester University Press, 1997, chapters 6 & 8, pp. 127−164 and pp. 197−218.\r  Topic 4:\r 1. A few museum catalogues and online resources. \r  Topic 5: \r 1. Ravelli, Louise J. Museum Texts: Communication Frameworks, Oxon: Routledge, 2006, chapter 4, pp. 69−94. \r 2. A museum catalogue (to be announced). \r  Topic 6:\r 1. Burcaw, chapter 17. \r 2. Mertins, Detlef, ‘Mies’s New National Gallery: Empty and Full;, in in P. Marincola (ed.) What Makes a Great Exhibition? Questions of Practice, Philadelphia: Philadelphia Centre for Arts and Heritage, 2006, pp. 76−85.\r 3. Antonelli, Paola. ‘Design and Architecture’, in P. Marincola (ed.) What Makes a Great Exhibition? Questions of Practice, Philadelphia: Philadelphia Centre for Arts and Heritage, 2006, pp. 86−93.\r  Topic 7: \r 1. Mastai, Judith. ‘There is no such thing as a Visitor’ in G. Pollock and J. Zemans (eds.), Museums After Modernism: Strategies of Engagement, Oxon: Blackwell, 2008, pp. 173−177. \r 2. Miranda, J. B. de. ‘The end of distance: the emergence of telematics culture’, in C. Alvares (ed.) Representing Culture: Essays on Identity, Visuality and Technology, Newcastle upon Tyne: Cambridge Scholars Publishing, 2008, pp. 149−177. \r  Topic 8:\r 1. Walker, John. ‘Curators, Directors and Donors’ (chapter two) and ‘Anxieties and Adventures’ (chapter three), Self-portrait with Donors, Boston and Toronto: Atlantic, Little Brown, 1974, pp. 32−67. \r 2. Goodlad, S. and McIvor, S. in Museum Volunteers: Good Practice in the Management of Volunteers, London and New York: Routledge, 1998, pp. 9−20 and 30−56\r  Topic 9:\r 1. Wallace, Margot A. Museum Branding: How to Create and Maintain Image, Loyalty, and Support, Lanham: AltaMira Press, 2006, chapters 1−4 (pp. 1−23) and chapters 11−12, pp. 81−98\r 2. Kotler, Neil G, et al. ‘Museum Branding and Brands’ in Museum Marketing & Strategy: Designing Missions, Building Audiences, Generating Revenue & Resources, 2nd edition, San Francisco: John Wiley & Sons, Inc., 2008, , pp. 138−149; and \r 3. Bucolo, Mario. ‘Managing Marketing Communications’ (chapter 11), ibid, pp. 347−408. \r  Topic 10:\r 1. Nye, Joseph. ‘The changing nature of power’ (chapter one), Soft Power: The Means to Success to World Politics, New York: Public Affairs, 2004, pp. 1−32. \r 2. Suzuki, Shogo. ‘The myth and reality of China’s ‘soft power’’, in I. Parmar and M. Cox (eds) Soft Power and US Foreign Policy: Theoretical, Historical and Contemporary Perspectives, London and New York: Routledge, 2010, pp. 199−214. \r  Topic 11:\r N/A\r  Topic 12:\r 1. Cooke, Lynne. ‘In lieu of higher ground’, in P. Marincola (ed.) What Makes a Great Exhibition? Questions of Practice, Philadelphia: Philadelphia Centre for Arts and Heritage, 2006, pp. 32−43.\r 2. Museum catalogues (to be announced). \r  Topic 13:\r 1. Skramstad, Harold. ‘An agenda for museums in the twenty-first century’, in Gail Anderson (ed.) Reinventing the Museum: Historical and Contemporary Perspectives on the Paradigm Shift, Lanham: Altamira, 2004, pp. 118−132. \r 2. Speech of Mr Graham Sheffield, 23 June 2010, Chief Executive Officer of the West Kowloon Cultural District Project.", "recommended_readings": "Camenson, Blythe. Opportunities in museum careers, New York : McGraw-Hill, 2007.\r Chen, Yung-yuan (ed.). Museum and architecture : toward a new museum : proceedings for forum of museum directors, 2000, Taipei: National Museum of History, 2000.\r Darragh, Joan and Snyder, James S.. Museum design : planning and building for art, New York : Oxford University Press in association with the American Federation of Arts and the National Endowment for the Arts, 1993.\r Dean, David. Museum exhibition : theory and practice, London ; New York : Routledge, 1994.\r Genoways, Hugh H. and Ireland, Lynne M. Museum administration : an introduction, Walnut Creek, CA : Altamira Press, 2003.\r Henderson, Justin. Museum architecture, Gloucester, MA. : Rockport Publishers ; Cincinnati, OH. : distributed by North Light Books, 1998.\r The IESNA Committee on Museum and Art Gallery Lighting. Museum and art gallery lighting : a recommended practice, New York : Illuminating Engineering Society of North America, 1996.\r Images Publishing, Images Australia Pty Ltd. Museum and art spaces of the world : a pictorial review of museum and art spaces, Melbourne, Australia : Images Publishing Group, 2001.\r MacLeod, Suzanne; Hanks, Laura Hourston, and Hale, Jonathan (ed.). Museum making : narratives, architectures, exhibitions, Abingdon, Oxon [England] ; New York, NY : Routledge, 2012.\r Moffat, Hazel and Woollard, Vicky. Museum and gallery education : a manual of good practice, Walnut Creek, Calif. : Altamira Press, 1999.\r Neill, Amanda C.. Museum docents' understanding of interpretation, Thesis (D.Ed.), The Pennsylvania State University, 2010.\r Primary Research Group. Museum & library special collection use of major internet sites, New York : Primary Research Group, 2013.\r Schittich, Christian (ed.). Exhibitions and displays : museum design concepts, brand presentation, trade show design, Basel : Birkhäuser Verlag AG, 2009.\r Yu, Jasmin (ed.). Museum display design, Hong Kong : Design Media Pub., 2012, 2010.\r 深圳市智美精品文化傳播有限公司編。設計中的設計：博物館，劇院，武漢市：華中科技大學出版社，2012。\r 王嵩山。博物館與文化，臺北市：遠流出版事業股份有限公司，2012。\r 黃光男。博物館企業，臺北市：國立臺灣藝術大學藝術博物館，2006。", "terms": {"2020-21 Term 2": {"--LEC (8630)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [1], "locations": ["William M W Mong Eng Bldg 404"], "instructors": ["Dr. TING Wing Yan Vivian"]}}}, "assessments": {"Essays": "80", "Others": "20"}}, {"code": "4008", "title": "Advanced Museum Studies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "Pre-requisite(s): CUMT4007", "description": "This course picks up topics, which cannot be fully covered in CUMT4007 Museum Studies, but are essential for students pursuing careers in the area of museum and exhibition planning. This course is an advanced version, because it will touch on debated issues regarding museums. It focuses on installation, display, and site management. The purposes of the course may be summarized as follows: 1. What are the various display methods in museums? What are the concerns involved in selecting the ‘right’ ones? 2. How are museum workers (non-curatorial) trained? 3. What are the essential facilities a museum is expected to have? Why? 4. What is the role of museum in the contemporary arts, which is the area of debate regarding its significance and curatorship? The course develops students’ awareness towards global developments in world-class museums, so that they are equipped with skills and knowledge necessary for long-term competition in museums or other cultural institutions.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4101", "title": "Special Topics in Cultural Management", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "---", "description": "Cultural Management covers a broad range of inter-disciplinary topics, which include visual arts, history, heritage, music, performance arts, digital technology, public policy, cultural theories, national identity, as well as cultural globalization. The instructor is to design lectures and tutorials around a special topic relevant to the international issues of Cultural Management. The course is set at a senior level that leads students to apply and think critically of the humanity subjects in relation to contemporary global and ideological concerns.Students are allowed to take this course not more than twice, and gain the units each time they pass the course. However, students cannot take courses with the same course code more than once in a single term.", "outcome": "Depends on the topics", "syllabus": "Depends on the topics", "required_readings": "Depends on the topics", "recommended_readings": "Depends on the topics", "terms": {"2020-21 Term 1": {"--LEC (5872)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [2], "locations": ["T.C. Cheng Bldg 111"], "instructors": ["Professor CHAN Sau Yan"]}}, "2020-21 Term 2": {"--LEC (8145)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Lady Shaw Bldg C3"], "instructors": ["Mr. CHUI Wan Shun Vincent"]}}}}, {"code": "4102", "title": "Research Project", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "Students are required to take either this course or “CUMT4103 Internship” to fulfill the capstone course requirements of the Programme. In this course, students are expected to be able to integrate the knowledge and skills that they learnt into a research project. This course has two specific objectives. First, it aims to allow the students to experience completing a coherent research project either by participating in faculty-directed projects as a research group member or conducting independent research under supervision. Second, it will help students develop the preliminary idea of applying theories to answering research questions. This can be done by adopting a constructivist approach with cultural theories to account for a certain phenomenon pertinent to cultural management, or by identifying resolutions based on positive social science theories for cultural management. A faculty member will be assigned based on the student’s area of interest for the research project.", "outcome": "The students are expected to develop a preliminary perception of academic or applied research, and understand the key steps of research, which include identifying and reviewing the key literature, developing a topic and focus for the research project, and mastering basic methods for data collection, analysis, and application of theories. The process of completing a coherent research will enable students to enrich research skills, such as applying theories, identifying problems, and conducting data collection and analysis.", "syllabus": "The students will work closely with their supervisor, starting from the second semester of year 3. In the middle of the semester, the students will submit their proposals, which should include literature review, research topic/focus, research question/problem identification, and research design. The key literature of the specialized area should also be identified. The students will be required to prepare and to have an annotated bibliography approved by the supervisor. The literature review should include the mainstream knowledge for doing cultural management in a specialized area, the nature of the management process, and the political, economic, and organizational contexts, in which cultural management is done. \r A research topic or focus will be developed based on the observation and interest of the students. The students should seek the advice of the supervisor in deciding the topic or focus, and in doing the succeeding research design. Materials covered under research design include problem identification, hypothesis generation, and major issue and concept. The supervisor will also advise students about the basic qualitative and quantitative research methods, such as statistical methods, interview, and participatory observation, appropriate to developing a conceptual framework. Alternatively, students may identify a social phenomenon pertinent to cultural management or a cultural phenomenon represented by artistic or intellectual works. Students will be encouraged to apply computer-programming techniques covered in related courses. \r Students who participate in faculty directed research projects may have the opportunity to avail of partial or full funding for their research and field trips depending on the funding situation. Their work should contribute to the research projects of their supervisors. The students will be advised on how to fulfill the required research tasks and improve their academic writing techniques. \r This research project will lead to the completion of a thesis or its equivalent, and further studies at the graduate level. Part of the final product will be a presentation on the research project open to the university. The date for presentation is subject to future arrangements.", "required_readings": "Cooley, L. and Lewkowicz, J. (2003). Dissertation Writing in Practice: Turning Ideas into Text, Hong Kong : Hong Kong University Press.\r Lipson, C. (2005). How to write a BA thesis: A practical guide from your first ideas to your finished paper. Chicago: University of Chicago Press. \r Lyden, M. (2009). College students do this! get hired!: From freshman to ph. D. the secrets, tips, techniques and tricks you need to get the full time job, co-op, or summer internship position you want (2nd edition ed.). Charleston, South Carolina: BookSurge Publishing. \r McMillan, K. and Weyers, J., 2011, How to write dissertations & project reports, Harlow, Essex: Pearson Education.\r Taylor, K.W., 1990, Social Science Research: Theory and Practice, Scarborough, Ont.: Nelson Canada.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"-M01-TMC (7844)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor LEUNG Hok Bun Isaac"]}}, "2020-21 Term 2": {"-M01-TMC (8555)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor LEUNG Hok Bun Isaac"]}}}, "assessments": {"Essays": "70", "Presentation": "30"}}, {"code": "4103", "title": "Internship", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Cultural Management Pgm Comm", "requirements": "", "description": "Students are required to take either this course or “CUMT4102 Research Project” to fulfill the capstone course requirements of the Programme. This course has two specific objectives. First, it aims to assist the students’ understanding of the way that cultural organizations or institutions operate. Students will acquire the chance to observe the organization’s administrative structure with regard to the external policy environment, its strategies for development, partnership with other organizations, the management styles, approaches and methods and decision-making procedures. Second, it will allow students to gain the experiences through the transition from classroom learning to in-practice learning. Students are expected to reflect their learned knowledge with the live cases during the intern and apply professional norms to assess the functionalities and performances of the organization. Recommendations for improvements based on identified challenges and problems that the organization faces will be included into their final reports. A faculty member will be assigned based on the student’s area of interest for the internship.", "outcome": "The internship will prepare students with the direction of career development in cultural management related areas. Upon completion of this internship course, students will have acquired first-person work experiences in his or her interested aspects of cultural management. Students will also deepen the understanding of the classroom knowledge with self-reflection and develop hand-on skills by applying the knowledge to administrative practices.", "syllabus": "The internship is typically taken by BA degree students within a cultural agency or organization during the summer vacation period at the end of the third year. The duration of the internship is six to eight weeks and it is normally full-time work (240-320 hours), subject to the agreement with the corresponding party. There might be exceptional cases in which students are engaged in part-time internship programmes held during the academic year because of the scheduling of specific arts projects.\r During the internship, students are expected to maximize the opportunities to access the staff, board meetings, internal and cross-organizational communications, in order to develop the understanding of the operation of the organization through participatory observation. To enhance on-job professional experience, the students are expected to complete professional management tasks independently or as a member of the agency’s management team with maximized exposure to the entire management process. The students’ internship will be largely in the charge of a field supervisor in the agency. It is important to have adequate on-job supervision that clarifies the policies and job requirements. The student’s supervisor in the Programme will provide advices regarding how to prepare the students for the working environment, carry out on-site observations, and write the final report. The Programme endorses the students’ full-time/part-time internships to fulfill the requirement for the BA degree. \r  List of available organizations will be announced and interviews arranged normally three to four months prior to actual participation of internship, Students are required to identify three options of organizations, with advices from the internship panel. Arrangement will be made for interviews and the final decisions are to be made by the organizations.\r  Option is opened for students to suggest organizations that are not of the list provided by the Programme. The suggested organizations must meet the following criteria: 1) Confirmed interest in offering internship; 2) Established organization with proper operational office, full time staff and creditable reputation; 3) Could provide a safe and proper learning/working environment; 4) No possible conflict of interest or personal linkage that might affect the final assessment. Based on the above criteria, the internship panel would make decision regarding the inclusion of the organizations into the internship programme. \r  Students are urged to timely hand in copies of documentary outputs, if any, of the intern employment, or reports prepared as a part of their internship experience. Arrangement for discussions with their Programme supervisors regarding the internship experience and critiques is encouraged. Students’ performance during the intern should be assessed by their field supervisors. A reviewing letter from the supervisor should be submitted, which contributes to the students’ final grades. In addition to the field supervisors’ assessment, students’ final report and a presentation open to the university are required and will be graded. \r In case the student prefers academic pursuit or has tried and failed to obtain an internship, the student may consider conducting an individual research project or participating in faculty-directed research projects as specified in “CUMT4102 Research Project.”", "required_readings": "Baird, B.N. (2010). The Internship, Practicum, and Field Placement Handbook: A Guide for the Helping Professions, Upper Saddle River, NJ: Prentice Hall.\r Department of Urban and Regional Planning at the University of Wisconsin-Madison, ‘Department Policy Statement on Summer Internships,’ http://urpl.wisc.edu/current/\r Fedorko, J. (2006). The intern files: How to get, keep, and make the most of your internship. New York: Gallery Books. \r Kiser, P. (2002). Getting the most from your human service internship : Learning from experience. San Francisco, CA: WetFeet, Inc. \r Ladany, V., Walker, J.A., and Melincoff, D.S. (2001). ‘Supervisory style: Its relation to the supervisory working alliance and supervisor self-disclosure,’ Counselor Education and Supervision, 40, 263-275. \r Rodalfa, E., Vieille, R., Russell, P., Nijjer, S., Ngugyen, D., Mendoza, M., and Perrin, L. (1999). ‘Internship selection inclusion and exclusion criteria,’ Professional Psychology: Research and Practice, 30(4): 415-419.", "recommended_readings": "Useful websites\r Internship opportunities at Guggemheim Foundation\r http://www.guggenheim.org/new-york/education/adult-and-academic-programs/intern-and-fellowship-opportunities/internship\r  West Kowloon Cultural District Authority\r http://www.wkcdauthority.hk/en/job_opportunities/current_openings/index.html", "terms": {"2020-21 Term 1": {"-F01-FLD (7845)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor LEUNG Hok Bun Isaac"]}}, "2020-21 Term 2": {"-F01-FLD (9109)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor LEUNG Hok Bun Isaac"]}}}, "assessments": {"Essays": "40", "Others": "40", "Presentation": "20"}}]