[{"code": "6701", "title": "Phonetics and Phonology for English Language Teaching", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA English Language Teaching", "description": "This course covers the basic concepts of phonetics and phonology, with special reference to the sound system and phonological features of the English language. Course content includes: 1) the articulatory and auditory aspects of the English sound system covering both segmental and suprasegmental features; 2) phonological rules 3) phonemic representations and transcription systems; 4) phonological processes underlying speech acquisition and production, and 5) key differences between English and Cantonese phonology. Throughout the course, participants will be guided to consider the pedagogical implications of the concepts covered.", "outcome": "Upon successful completion of this course, participants should be able to:\r • learn a range of phonemic symbols and vocabulary relevant to English teaching\r • gain a good understanding of English phonemic inventories\r • develop an understanding of phonological rules and processes\r • master the production of English phonemic distinctions and demonstrate how they are produced\r • be able to differentiate the major English accents and describe their distinctive sounds\r • be able to identify difficulties of English learners in Hong Kong and help them deal with pronunciation problems with effective classroom-based methods\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "• Production & classification of vowels, English vowels \r • Production & classification of consonants, English consonants \r • The syllable, word stress \r • Stress and rhythm in connected speech, strong & weak forms \r • Suprasegmental features \r • Phonological rules and processes\r  (For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "Roach, P. (2009). English phonetics and phonology (4th ed.). Cambridge: Cambridge University Press\r  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "1. Bauman-Waengler, J. (2009). Introduction to phonetics and phonology: From concepts to transcription. Boston: Pearson. \r 2. Celce-Murica, M., Brinton, D., & Goodwin, J. (2010). Teaching pronunciation: A reference for teachers of English to speakers of other languages. Cambridge: Cambridge University Press\r 3. Ladefoged, P. (2001). A course in phonetics (4th ed.). Fort Worth: Harcourt College.\r 4. Ladefoged, P. (2001). Vowels and consonants. Oxford: Blackwell.\r 5. Thorum, A. (2013). Phonetics: A contemporary approach. Burlington: Jones & Bartlett Learning\r 6. Wells, J.C. (2000). Longman pronunciation dictionary (2nd ed.). Harlow: Pearson Education.\r 7. Carr, P. (2013). English phonetics and phonology: An introduction (2nd ed.). West Sussex: Wiley-Blackwell.\r 8. Kirkpatrick, A. (2007). World Englishes: Implications for international communication and English language teaching. Cambridge: Cambridge University Press\r 9. Rogerson-Revell, P. (2011). English phonology and pronunciation teaching. London: Continuum International Publishing Group.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 1": {"--LEC (3273)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor BAI Barry"]}}}, "assessments": {"Essay test or exam": "60", "Others": "40"}}, {"code": "6702", "title": "Morphology and Syntax for English Language Teaching", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA English Language Teaching", "description": "This course covers major linguistic concepts of the English morphological and syntactic systems. Participants will be introduced to corpora of spoken and written English for the understanding and conceptualizing of the meaning and forms of words at sentence and discourse levels. Course content includes 1) basic concepts of linguistic treatment of the morpho-syntax of the English language; 2) form and meanings of grammatical/ syntactic and lexical constructions and their relationships with the context of use; 3) syntactic behaviour associated with the word such as tense, aspect, mood, transitivity and voice as well as gender, number, person and case; 4) word knowledge such as denotation, connotation, collocation, lexical sets and semantic fields, sense relations, synonymy, antonymy, hyponymy and meronymy; and 5) implications for teaching and learning.", "outcome": "By the end of the course, students should be able to:\r  1. Demonstrate a systematic and up-to-date knowledge of the grammar of English, and a critical understanding of the nature of grammar and grammatical rules; 2. Use an online English corpus (such as British National Corpus and Corpus of Contemporary American English) to search for data on any given grammatical structure or lexical expression; 3. Critically analyze language data and use it as evidence to formulate appropriate generalizations to account for the grammatical patterns or structures in question, and to evaluate the validity of other explanations (including traditional prescriptive ‘rules’); 4. Apply their knowledge of English grammar for pedagogical purposes, including the identification and explanation of learner errors.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "Topic\r 1. What is ‘grammar’? Descriptive vs. prescriptive grammars\r 2. Approaches to Grammar \r 3. Corpus Linguistics\r 4. English morphological structure\r 5. Nouns and noun phrases\r 6. Verbs and verb phrases\r 7. Tense, aspect, modality, voice\r 8. Adjective, adverb and preposition phrases\r 9. Clause and sentence structure\r 10. Contrastive analysis, error analysis and interlanguage analysis\r 11. Standard English and linguistic variation: implications for language teaching\r  Contents/ fundamental concepts\r 1. The nature of grammar; modern linguistic approaches to the analysis and description of grammar, contrasted with traditional prescriptive approaches.\r 2. An overview of some major linguistic approaches to grammar, including formal, functional, cognitive and pedagogical approaches.\r 3. Computerized corpora as sources of data on the current state of the language; how to use the British National Corpus and Corpus of Contemporary American English.\r 4. Basic categories and concepts in grammar; morphological structure and processes in English.\r 5. Properties of nouns (count and mass) and the structure of noun phrases.\r 6. Properties of verbs and the structure of verb phrases.\r 7. The English tense and aspect system, modal auxiliaries, and transitivity/ voice.\r 8. Properties of adjectives, adverbs and prepositions; structure of APs, AvPs and PPs.\r 9. The structure of the clause and sentence; main and subordinate clauses; finite and non-finite clauses; relative clauses.\r 10. Analyzing learner language: contrasting the grammatical structures of learners’ L1 and L2, their systematic errors, and their internalized language system (interlanguage).\r 11. The notions of ‘standard English’ and linguistic variation; their place in society and their implications for language teaching.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "Biber D., Leech, G. & Conrad, S. (2002). Longman Student Grammar of Spoken and Written English. Longman.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "(i) On Grammar\r Biber D., Johansson S., Leech G., Conrad S. & Finegan E. (1999) Longman Grammar of Spoken and Written English. Longman.\r Carter R., & McCarthy M. (2006) Cambridge Grammar of English. Cambridge University Press.\r Greenbaum, S. & Quirk, R. (1990). A Student’s Grammar of the English Language. Longman.\r Huddleston, R. & Pullum, G. K. (2002). The Cambridge Grammar of the English Language. Cambridge University Press.\r Huddleston, R. & Pullum, G. K. (2005). A Student’s Introduction to English Grammar. Cambridge University Press.\r Hung, T. T. N. (2005). Understanding English Grammar: A Course Book for Chinese Learners of English. Hong Kong University Press.\r Leech, G & Svartvik, J. (2002). A Communicative Grammar of English (3rd Ed.) Longman.\r Quirk R., Greenbaum S., Leech G. & Svartvik J. (1985) A Comprehensive Grammar of the English Language. Longman.\r  (ii) On Grammar Teaching\r Bygate, M., Tonkyn, A. & Williams, E. (eds.). (1994). Grammar and the Language Teacher. Prentice Hall.\r Hung, T. T. N. (2000). ‘Interlanguage analysis and remedial grammar teaching’. Papers in Applied Language Studies, Vol.5, pp.155-168. Hong Kong Baptist University. \r Hung, T. T. N. (2002). ‘Modern perspectives on the teaching of grammar’. In Low, E. L. & Teng, S. C. (eds.). The Teaching and Use of Standard English, pp.14-24. Singapore Association for Applied Linguistics.\r Hung, T.T.N. (2002) ‘The use of language corpora in the teaching of English’. Hong Kong Journal of Applied Linguistics, Vol. 7, No.1, pp.34-48. Hong Kong University Press.\r Larsen-Freeman, D. (2003). Teaching Language: From Grammar to Grammaring. Heinle.\r Rutherford, W. (1988). Second Language Grammar: Learning and Teaching. Longman.\r Rutherford, W. & Sharwood Smith, M. (1988). Grammar and Second Language Teaching: A Book of Readings. Newbury House.\r  (iii) On Corpus Linguistics\r Anderson, W. & Corbett, J. (2009) Exploring English with Online Corpora: An Introduction. Palgrave Macmillan.\r British National Corpus: http://corpus.byu.edu/bnc/\r Corpus of Contemporary American English: http://corpus.byu.edu/coca/ \r Corpus of Global Web-Based English: http://corpus.byu.edu/glowbe/ \r International Corpus of English: http://www.ucl.ac.uk/english-usage/ice/\r Teubert, W. (2007) Corpus Linguistics: A Short Introduction. Continuum.\r Thomas, J. & Short, M. (1996) Using Corpora for Language Research. Longman.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 2": {"--LEC (2114)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [3], "locations": ["Esther Lee Bldg 203"], "instructors": ["Dr. HUANG Zeping"]}}}}, {"code": "6703", "title": "Spoken and Written Discourse for English Language Teaching", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA English Language Teaching", "description": "Through a study of discourse conventions of written and spoken language, participants will be introduced to some of the techniques for deconstructing connected speech and writing. Analysis of the structure of discourse, its phonological and orthographic rules, rhetorical structures and pragmatic conventions, will build awareness of how spoken and written language differ in substance and in style, how coherence and cohesion is achieved in speech and in writing, and how speakers and writers address themselves to an audience.", "outcome": "By the end of the course participants will have increased their understanding of\r • why discourse is important to English language teaching\r • features of text\r • features of spoken and of written discourse\r They will also be able to\r • analyse genres relevant to their teaching situation\r • evaluate classroom materials as not/ representing authentic discourse, and design improvements where necessary\r • plan a lesson to help students with appropriate features of English discourse\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "(Required readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "recommended_readings": "(Recommended readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 1": {"--LEC (2697)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [5], "locations": ["Lee Shau Kee Archi Bldg G01"], "instructors": ["Professor Scott Charles AUBREY"]}}}}, {"code": "6704", "title": "Psychological and Social Perspectives on Language", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA English Language Teaching", "description": "This course will examine the psycholinguistic and sociolinguistic aspects of language. In terms of psycholinguistics, course content will examine the relationship between cognition, cognitive development and language; the stages, processes, and roles that affective factors play in first- and second-language acquisition. This course will also introduce sociolinguistics and study the ways in which groups of people use language, examining the close intertwining between a language and the social context in which it is used. Bilingualism and bilingual education in different contexts will be examined, with particular reference to Hong Kong. Aspects of language variation and dialects, societal bilingualism and multilingualism, language and power, and language policy and planning issues, together with the function of the second language and principles underlying the use of English as a medium of instruction in Hong Kong will also be covered.", "outcome": "Upon completion of this course, students are expected to be able to:\r 1. explain the major theories of first and second language acquisition using academic terminology;  2. analyse how individual and contextual factors contribute to English language development; 3. design a thematic unit of work with a focus on differentiation;  4. describe and justify the design of the unit of learning with Psycholinguistic theories in both written and spoken communication; 5. identify the roles of language in society and in education;  6. analyse the social aspects of language related to education in Hong Kong.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "A. Psycholinguistics, Second Language Acquisition and Bilingualism\r  This course will examine the psychological aspects of language with an emphasis on second language acquisition.\r - Language and cognition \r - Stages and processes of first- and second-language acquisition\r - Individual and contextual factors contributed to English language development\r - Language learning and identity\r - Implications for teaching a second language in the classroom\r - Function of the second language and principles underlying the use of English as a medium of instruction\r  B. Sociolinguistics and English as an International Language\r  This course will explore the relationships between language and society as well as issues relating to English as an International Language.\r  - Key concepts of sociolinguistics – speech community, diglossia, accent, dialect, language change, language variety, languages in contact and standard languages\r - English as an International Language\r - Linguistic imperialism\r - Varieties of English\r - Relevance of these concepts to the language policy and education in Hong Kong, with additional reference to language planning in other regions of the world.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "Jenkins, J. (2009). Global Englishes: A Resource Book for Students. London: Routledge. \r Lightbown, P. M. & Spada, N. (2006). How languages are learned (3rd edition). Oxford: Oxford University Press.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Bolton, K. (Ed.). (2002). Hong Kong English: Autonomy and creativity. Hong Kong: Hong Kong University Press.\r Crystal, D. (2003). English as a global language. Cambridge: Cambridge University Press.\r Dörnyei, Z. & Ushioda, E. (Eds.) (2009). Motivation, language identity and the L2 self. Bristol: Multilingual Matters.\r Ellis, R. (1997). Second language acquisition. Oxford: Oxford University Press.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 1": {"--LEC (3589)": {"startTimes": ["9:30"], "endTimes": ["12:00"], "days": [6], "locations": ["Online Teaching"], "instructors": ["Dr. CHUK Yim Ping"]}}}, "assessments": {"Essays": "50", "Presentation": "20", "Project": "30"}}, {"code": "6705", "title": "Literature in English", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA English Language Teaching", "description": "Literature and non-utilitarian texts can introduce living language and bridge the gap between communicative language teaching and culture. Interaction with texts leads to multi-level interpretations of meaning, affective responses, and exploration of cultural and aesthetic values. This course aims to build understanding of the skillful uses and manipulation of language to achieve a variety of effects in prose and poetry as well as in public speeches, advertising and journalism: it aims to open up for the language teacher a diversity of linguistic resources to enrich the curriculum.", "outcome": "By the end of the course, participants will be able to: \r 1. compare ways in which literature can be defined and used, and critically discuss different approaches and perspectives; 2. develop a conceptual framework for understanding the uses and characteristics of the language in literature; 3. apply concepts and techniques in analysing and talking about a broad range of literary texts; 4. personalize and adapt approaches to literature in materials selection, task design and teaching strategies for integration into the language curriculum; 5. foster interests in reading literature for personal and professional development.\r   How the learning activities facilitate students to achieve the expected learning outcomes:\r  The Course will take participants from the concepts of the language-literature interface through practical analyses to literary theories, drawing on their professional experience and language knowledge. It features multi-modal materials of different literary genres for students to try out the ideas and techniques derived from the conceptual framework and methodological component. Activities include discourse stylistic analysis, genre awareness practice, intensive reading, creative writing, materials development, task analysis, and curriculum tailoring and evaluation. Participants are expected to do the assigned readings, prepare for the tasks, and take an active part in class discussion and project presentation.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "1. Towards defining literature\r 2. The place of literature in language education\r 3. Approaches to learning and teaching literature\r 4. Analysing and teaching fiction\r 5. Analysing and teaching poetry \r 6. Analysing and teaching drama\r 7. Analysing and teaching song \r 8. Analysing film\r 9. Analysing pop culture \r  (For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "Topic 1: Towards defining literature \r  • Carter, R. (1997). Investigating English discourse (pp. 111-139). London: Routledge. \r  • Hall, G. (2005). Literature in language education (pp. 9-38). New York: Palgrave Macmillan.\r  • Lazar, G. (1993). Literature and language teaching: A guide for teachers and trainers (pp. 1-14). New York: Cambridge University Press.\r  • Parkinson, B., & Thomas, H. R. (2000). Teaching literature in a second language (pp. 40-52). Edinburgh: Edinburgh University Press. \r   Topic 2: The place of literature in language education\r  • Hall, G. (2005). Literature in language education (pp. 39-59). New York: Palgrave Macmillan.\r  • Lazar, G. (1993). Literature and language teaching: A guide for teachers and trainers (pp. 14-21). New York: Cambridge University Press.\r  • Carter, R. A., & Long, M. N. (1991). Teaching literature (pp. 1-11). Burnt Mill, Harlow, Essex: Longman.\r   Topic 3: Approaches to learning and teaching literature \r  • Maley, A. (2001). Literature in the language classroom. In R. Carter, & D. Nunan (Eds.), The Cambridge guide to teaching English to speakers of other languages (pp. 180-185). Cambridge: Cambridge University Press.\r  • Carter, R. A., & Long, M. N. (1991). Teaching literature (pp. 71-93). Burnt Mill, Harlow, Essex: Longman.\r  • Parkinson, B., & Thomas, H. R. (2000). Teaching literature in a second language (pp. 26-39). Edinburgh: Edinburgh University Press. \r   Topic 4: Analysing and teaching fiction\r  • Hall, G. (2005). Literature in language education (pp. 169-175) New York: Palgrave Macmillan.\r  • Parkinson, B., & Thomas, H. R. (2000). Teaching literature in a second language (pp. 80-105). Edinburgh: Edinburgh University Press. \r  • Verdonk. P. (2002). Stylistics (pp. 41-53). Oxford: Oxford University Press.\r  • Chan, P. (1999). Literature, language awareness and EFL. Language Awareness, 8 (1), 38-50. \r   Topic 5: Analysing and teaching poetry \r  • Hall, G. (2005). Literature in language education (pp. 160-168). New York: Palgrave Macmillan.\r  • Lazar, G. (1993). Literature and language teaching: A guide for teachers and trainers (pp. 94-132). New York: Cambridge University Press. \r  • Parkinson, B., & Thomas, H. R. (2000). Teaching literature in a second language (pp. 53-79). Edinburgh: Edinburgh University Press. \r   Topic 6: Analysing and teaching drama\r  • Lazar, G. (1993). Literature and language teaching: A guide for teachers and trainers (pp. 133-166). New York: Cambridge University Press. \r  • Chan, P. (1999). From reading and speaking to writing: dramatising for the English classroom. In P. Falvey, & P. Kennedy (Eds.), Learning language through literature book 3: a source book for teachers of English in Hong Kong (pp. 67-76). Hong Kong: Hong Kong University Press.\r  • Chan, P. (2003). Play into play: language through drama. In G. Subramaniam (Ed.), Teaching of literature in ESL/EFL contexts (pp. 159-173). Petaling Jaya: Sasbadi Sdn. Bhd.\r   Topic 7: Analysing and teaching song \r  • Chan, P. (1997). Using songs in the English language classroom. In P. Falvey, & P. Kennedy (Eds.), Learning language through literature: A resource book for teachers of English in Hong Kong (pp. 135-146). Hong Kong: Hong Kong University Press. \r  • Chan, P. (1998). A literary analysis of song as discourse: Some implications for the interface between language and literature in the English classroom. Perspectives TESOL-Italy, 24 (1), 67-86. \r   Topic 8: Analysing film\r  • Montgomery, M. , Durant, A., Fabb, N., Firmoss. T., & Mills, S. (2007). Ways of reading: Advanced reading skills for students of English literature (pp. 295-339). London: Routledge.\r  • Pramaggiore, M., & Wallis, T. (2005). Film: A critical introduction (pp. 12-54). London: Laurence King.\r   Topic 9: Analysing pop culture\r  • Graddol, D. (1997). The future of English? (pp. 34-40; 48-51). London: The British Council.\r  • Montgomery, M., Durant, A., Fabb, N., Firmoss. T., & Mills, S.(2007). Ways of reading: Advanced reading skills for students of English literature (pp. 168-192). London: Routledge.\r  • van Dijk, T. A. (2001). Principles of critical discourse analysis. In M. Wetherell, S. Taylor, & S.Yates (Eds.). Discourse theory and practice: A reader (pp. 300-317). London: Sage. \r  • Chan, P. (2005). Three pedlars. In A. Maley, & J. Mukundan (Eds.), Asian stories for young readers volume I (pp. 65-69). Petaling Jaya, Selangor Darul Ehsan: Pearson Malaysia Sdn Bhd.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "1. Aristotle. (1967). Poetics. (G. F. Else, Trans.). Ann Arbor: University of Michigan Press. \r  2. Bakhtin, M. (1981). The dialogic imagination: Four essays. Austin: University of Texas Press. \r  3. Brocket, O. G. (2000). The essential theatre. Fort Worth, Tex.: Harcourt Brace College. \r  4. Brumfit, C. J., & Carter, R. (Eds.). (1986). Literature and language teaching. Oxford: Oxford University Press.\r  5. Candlin, C., & Murphy, D. (Eds.). (1987). Language learning tasks. London: Prentice-Hall International & Lancaster University.\r  6. Carter, R. (1997). Investigating English discourse: Language, literacy and literature. London: Routledge.\r  7. Carter, R. A., & Long, M. N. (1991). Teaching literature. Burnt Mill, Harlow, Essex: Longman.\r  8. Carter, R. A., & Nash, W. (1983). Language and literariness. Prose Studies, 6(2), 123–41.\r  9. Carter, R., & McRae, J. (Eds.). (1996). Language, literature, and the learner: Creative classroom practice. White Plains, NY: Addison Wesley Longman. \r  10. Chan, P. (1997). Using songs in the English language classroom. In P. Falvey, & P. Kennedy (Eds.), Learning language through literature: A source book for teachers of English in Hong Kong (pp. 135-146). Hong Kong: Hong Kong University Press. \r  11. Chan, P. (1998). A literary analysis of song as discourse: Some implications for the interface between language and literature in the English classroom. Perspectives TESOL-Italy, 24 (1), 67-86. \r  12. Chan, P. (1999a). Literature, language awareness and EFL. Language Awareness, 8 (1), 38-50. \r  13. Chan, P. (1999b). From reading and speaking to writing: Dramatising for the English classroom. In P. Falvey, & P. Kennedy (Eds.), Learning language through literature book 3: A resource book for teachers of English in Hong Kong (pp. 67-76). Hong Kong: Hong Kong University Press.\r  14. Chan, P. (2003). Play into play: Language through drama. In G. Subramaniam (Ed.), Teaching of literature in ESL/EFL contexts (pp. 159-173). Petaling Jaya: Sasbadi Sdn. Bhd.\r  15. Chan, P. (2005). Three pedlars. In A. Maley, & J. Mukundan (Eds.), Asian stories for young readers volume I (pp. 65-69). Petaling Jaya, Selangor Darul Ehsan: Pearson Malaysia Sdn Bhd. \r  16. Chan. P. (2006). Reading into writing: Developing creativity in EFL/ESL classrooms. In J. Mukundan (Ed.), Creative writing in EFL/ESL classrooms II (pp. 97-104). Petaling Jaya, Selangor Darul Ehsan: Pearson Malaysia Sdn Bhd.\r  17. Chatman, S. (1978). Story and discourse: Narrative structure in fiction and film. London: Cornell University Press.\r  18. Collie, J., & Slater, S. (1987). Literature in the language classroom. Cambridge: Cambridge University Press.\r  19. Cook, G. (2000). Language play, language learning. Oxford: Oxford University Press.\r  20. Corrigan, T. (1999). Film and literature: An introduction and reader. Upper Saddle River, NJ: Prentice Hall.\r  21. Curriculum Development Council. (1999). Syllabuses for secondary schools: English language (Secondary1–5). Hong Kong: Printing Department.\r  22. Curriculum Development Council. (2002). English language education: Key learning area curriculum guide (Primary 1 – Secondary 3). Hong Kong: Printing Department.\r  23. Curriculum Development Council and Hong Kong Examinations and Assessment Authority (2007). The English language curriculum and assessment guide (secondary 4-6). Hong Kong: Government Logistics Department.\r  24. Curriculum Development Institute (2007). Suggested schemes of work for the elective part of the three-year senior secondary English language curriculum. Hong Kong: Government Logistics Department.\r  25. Duff, A., & Maley, A. (2007). Literature. Oxford: Oxford University Press.\r  26. Durant, A., & Fabb, N. (1990). Literary studies in action. London: Routledge.\r  27. Education Department. (1997). Language arts for secondary 1 to 5. Hong Kong: Printing Department.\r  28. Education Department. (2002). The learning and teaching of poetry (secondary 1-3) A resource package. Hong Kong: Printing Department.\r  29. Ellis, G., & McRae, J. (Eds.). (1991). The extensive reading handbook for secondary teachers. London: Penguin. \r  30. Falvey, P. (1998). Enhancing the experiential dimension of TOC: Making use of ETV programmes. In P. Falvey, & P. Kennedy (Eds.), Learning language through literature in primary schools: Resource book for teachers of English (pp. 77-94). Hong Kong: Hong Kong University Press.\r  31. Fairclough, N. (1995). Critical discourse analysis: The critical study of language. New York: Longman. \r  32. Fowler, R. (1981). Literature as social discourse: The practice of linguistic criticism. Batsford: London.\r  33. Forster, E. M. (1977). Aspects of the novel. Middlessex: Penguin.\r  34. Genette, G. (1980). Narrative discourse. Ithaca, NY: Cornell University Press.\r  35. Goodman, S., & O’Halloran, K. (Eds.). (2006). The art of English: Literary creativity. Basingstoke: Palgrave Macmillan in association with The Open University. \r  36. Graddol, D. (1997). The future of English?, London: The British Council.\r  37. Griffith. K. (2002). Writing essays about literature. Boston: Heinle & Heinle\r  38. Hall, G. (2005). Literature in language education. New York: Palgrave Macmillan.\r  39. Iser, W. (1971). Indeterminacy and the reader’s response to prose fiction. In J. H. Miller (Ed.), Aspects of narrative. New York: Columbia University Press.\r  40. Izod, J. (1984). Reading the screen: An introduction to film studies. Essex: Longman. \r  41. Kennedy, P., & Falvey, P. (1998). Learning language through literature in primary schools. Hong Kong: Hong Kong University Press.\r  42. Labov, W. (1972). Language in the inner city. Philadelphia: University of Pennsylvania Press.\r  43. Lazar, G. (1993). Literature and language teaching: A guide for teachers and trainers. New York: Cambridge University Press. \r  44. Leavis, F. R. (1948). Education and the university: A sketch for an English school. London: Chatto & Windus.\r  45. Leech, G. (1969). A Linguistic guide to English poetry. London: Longman.\r  46. Lehtonen, M. (2000). Cultural analysis of texts. London: SAGE Publications Ltd.\r  47. Maley, A. (1989). Down from the pedestal: Literature as resource. In R. Carter, R. Walker, & C. J. Brumfit (Eds.), Literature and the learners: methodological approaches. Basingstoke/London: Modern English Publications and The British Council.\r  48. Maley, A. (2001). Literature in the language classroom. In R. Carter, & D. Nunan (Eds.), The Cambridge guide to teaching English to speakers of other languages (pp. 180-185). Cambridge: Cambridge University Press.\r  49. Maley, A. (2004). Creativity is in the air we breathe. In T. B. Tin (Ed.), Creative Writing in EFL/ESL Classrooms (pp. 42-47). Serdang: Universiti Putra Malaysia Press. \r  50. Maley, A., & Duff, A. (2005). Drama techniques. Cambridge: Cambridge University Press.\r  51. Maley, A., & Moulding, S. (1985). Poem into poem. Cambridge: Cambridge University Press.\r  52. McCarthy, M., & Carter, R. A. (1994). Language as discourse. Burnt Mill, Harlow, Essex: Longman. \r  53. McRae, J. (1991). Literature with a small ‘l’. London: Macmillan Publishers Limited.\r  54. McRae, J. (1998). The Language of poetry. London: Routledge. \r  55. Montgomery, M. , Durant, A., Fabb, N., Firmoss. T., & Mills, S.(2007). Ways of reading: Advanced reading skills for students of English literature. London: Routledge.\r  56. Murphey, T. (1992). Music and song. Oxford: Oxford University Press. \r  57. Parkinson, B., & Thomas, H. R. (2000). Teaching literature in a second language. Edinburgh: Edinburgh University Press. \r  58. Pirie. D. (1985). How to write critical essays. London: Routledge.\r  59. Pramaggiore, M., & Wallis, T. (2005). Film: A critical introduction. London: Laurence King.\r  60. Propp, V. (1968). The morphology of the folktale. Austin: University of Texas Press. \r  61. Richards, I. A. (1929). Practical criticism: A study of literary judgement. London: Routledge & Kegan Paul.\r  62. Rimmon-Kenan, S. (1983). Narrative fiction: Contemporary poetics. London: Methuen.\r  63. Sage, A. (Ed.). (1995). The Hutchinson treasury of children’s literature. London: Hutchinson.\r  64. Sanger, K. (1998). The language of fiction. New York: Routledge. \r  65. Shklovsky, V. (1917). Art as technique. Translated in L. Lemon, & M. J. Reis (Eds.). (1965). Russian formalist criticism: Four essays (pp. 3-24). Lincoln: University of Nebraska Press.\r  66. Short, M. (1996). Exploring the language of poems, plays and prose. New York: Longman. \r  67. Simpson, P. (1997). Language through literature. New York: Routledge. \r  68. Simpson, P. (2004). Stylistics: A resource book for students. London: Routledge.\r  69. Styan, J. L. (1975). Drama, stage, and audience. London: Cambridge University Press.\r  70. Taylor, E. K. (2000). Using folktales. Cambridge: Cambridge University Press.\r  71. Toolan, M. J. (1998). Narrative: A critical linguistic introduction. London: Routledge. \r  72. van Dijk, T. A. (2001). Principles of critical discourse analysis. In M. Wetherell, S. Taylor, & S.Yates (Eds.). Discourse theory and practice: A reader (pp. 300-317). London: Sage.\r  73. Verdonk. P. (2002). Stylistics. Oxford: Oxford University Press.\r  74. Widdowson, H. G. (1992). Practical stylistics. New York: Oxford University Press.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 2": {"--LEC (3354)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [1], "locations": ["Esther Lee Bldg 203"], "instructors": ["Dr. CHAN Kam Wing"]}}}, "assessments": {"Homework or assignment": "60", "Presentation": "20", "Report": "20"}}, {"code": "6706", "title": "Special Topics in English Language", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA English Language Teaching", "description": "From time to time, courses focusing on area of English language or English language teaching not already covered in the regular programme of studies will be offered. These topics will reflect professional needs or interests and staff expertise.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6801", "title": "Language Testing and Assessment", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA English Language Teaching", "description": "This course covers basic principles associated with English language assessment in Hong Kong as well as the implementation and delivery of tests and modes of assessment in Hong Kong. Course covers: 1) important concepts such as reliability, validity, practicality and washback; 2) different test types; 3) test types used in present and past assessment practice – investigating issues such as psychometrically-oriented testing versus a more communicative approach as well as current alternative modes to assessment such as portfolios and school-based assessment; and 4) the setting and marking of tests and other modes of assessment. Participants will be encouraged to consider the different modes of assessment in the light of their own students and developments in the changing assessment scene in Hong Kong.", "outcome": "By the end of this course, students will:\r • have grasped the major principles underpinning language testing, evaluation and assessment\r • have arrived at an understanding of these principles and concepts apply to available tests - tests developed in school exams, public exams, outline tests\r • have grasped how to apply these principles and concepts to your own tests and exams\r • be able to use the major principles of assessment in the construction and analysis of a test for a particular group of Hong Kong school students\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "1. Introduction to course\r 2. What are we testing and why\r 3. Language test validity\r 4. Types & uses of language tests\r 5. Adopting & adapting language tests\r 6. Developing language test items\r 7. Item analysis in language testing \r 8. Describing language test results \r 9. Interpreting language test scores\r 10. Scoring and developing rating rubric\r 11. Correlation, reliability, washback & ethics in language testing\r 12. Assessing reading & vocabulary\r 13. Assessing listening\r 14. Assessing writing & grammar\r 15. Assessing speaking \r 16. Task-based language assessment\r 17. Final project presentation\r  (For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "Brown, J. D. (2005). Testing in language programs: A comprehensive guide to English language assessment. New York: McGraw Hill. [Brown]\r  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Davidson, F., & Lynch, B. (2002). Testcraft: A teachers’ guide to writing and using language test specifications. New Haven, CT: Yale University Press.\r Fulcher, G., & Davidson, F. (2007). Language testing and assessment: An advanced resource book. New York: Routledge. [F&D]\r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 1": {"--LEC (3136)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor PARK Moon Young"]}}}, "assessments": {"Essays": "60", "Others": "40"}}, {"code": "6802", "title": "Contemporary English Language Teaching Issues", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA English Language Teaching", "description": "This course will examine the background and implications of recent policy initiatives, research or key projects in English and/ or English language teaching in Hong Kong or overseas. The purpose of the course is to enable participants to reflect upon recent developments as these may affect or impact upon the English language teaching profession in general and their own teaching situation in particular. Typically the course would be delivered by speakers who are at the forefront of their area.", "outcome": "By the end of the course, students should be able to demonstrate:\r • Understanding of the theoretical background and the nature of the contemporary issues in ELT covered in the course\r • Ability to analyze/ evaluate such issues of ELT pedagogy with reference to the Hong Kong context\r • Ability to justify analysis/ evaluation of the issues with empirical evidence\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "The course will examine two to three contemporary issues in English Language teaching. The specific issues covered will be chosen with reference to current trends and innovations in English language education on the global level as well as recent developments in Hong Kong. For each contemporary issue to be covered, the following dimensions will be addressed: \r - Origin and underlying rationales; - Related pedagogical innovations to date;  - Reflections on its relevance and/ or application in the Hong Kong context\r  (For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "Harmer, J. (2015). The practice of English language teaching. (5th Ed.). Harlow, Essex: Longman.\r  Gebhard, J. G. (2017). Teaching English as a foreign or second language : A self-development and methodology guide (Third ed.) Ann Arbor : University of Michigan Press.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "recommended_readings": "Burns, A., & Siegel, J. (2018). International perspectives on teaching the four skills in ELT : Listening, speaking, reading, writing. Cham, Switzerland : Palgrave Macmillan.\r  Celce-Murcia, M., Brinton, D., & Snow, M. A. (2014). Teaching English as a second or foreign language (4th ed.). Boston : National Geographic Learning.\r  Lee, I., & Sze P. (2015). Voices from the frontline : Narratives of nonnative English speaking teachers. Hong Kong : Chinese University Press.\r  Richards, J. C., & Burns, A. (2012). The Cambridge guide to pedagogy and practice in second language teaching. New York : Cambridge University Press.\r  Scrivener, J. (2011). Learning teaching : The essential guide to english language teaching (3rd ed.). Oxford : Macmillan Education.\r  Tsui, A. (2003). Understanding expertise in teaching : Case studies of second language teachers. Cambridge: Cambridge University Press.\r  Wedell, M., & Grassick, L. (2018). International perspectives on teachers living with curriculum change. London : Palgrave Macmillan.\r  (And other references related to the specific issues to be covered in the course.)\r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 2": {"--LEC (2054)": {"startTimes": ["9:30"], "endTimes": ["12:00"], "days": [6], "locations": ["Wong Foo Yuan Bldg UG01"], "instructors": ["Dr. SZE Man Man"]}}}, "assessments": {"Essay test or exam": "0", "Homework or assignment": "0", "Others": "0", "Project": "0"}}, {"code": "6803", "title": "Reading and Writing - Teaching and Learning", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA English Language Teaching", "description": "This course will examine the theoretical bases for reading and writing in the light of current perceptions of the processes and strategies involved in the two areas, exploring recent developments and models of second language reading and writing, and the pedagogical impact of these developments. Course participants will be encouraged to reflect on their classroom practice in helping second language learners develop the communicative competence necessary for appropriate and successful written English. The course will also focus on the what and the how of teaching reading and writing.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6804", "title": "Listening and Speaking - Teaching and Learning", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA English Language Teaching", "description": "This course will review the theories and approaches related to listening and speaking. Course content will cover an analysis of the different processes and strategies that speakers and hearers employ as they listen or speak with reference to their interlocutors, the discourse context and process features associated with the particular skill. The course will also examine ways of helping local students to become more proficient in listening and speaking with reference to current second language acquisition theories.", "outcome": "By the end of the course, students should be able to: • gain an understanding of the theories and approaches related to listening and speaking • enhance your understanding of different methodologies, strategies and techniques in teaching listening and speaking • demonstrate the ability to plan, design and implement English language lessons with a focus on developing students’ listening and speaking strategies and abilities  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "1. The nature of listening and speaking  2. Second/ foreign language acquisition theories (focusing on listening and speaking) 3. Pedagogical approaches in teaching listening and speaking 4. Materials design and adaptation  (For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "(Required readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "recommended_readings": "Flowerdew, J., & Miller, L. (2005). Second language listening : Theory and practice. Cambridge; New York: Cambridge University Press.  Folse, K. (2006). The art of teaching speaking: Research and pedagogy for the ESL/EFL classroom. Ann Arbor: University of Michigan Press.  Goh, C., & Burns, A. (2012). Teaching speaking: A holistic approach. New York: Cambridge University Press.  Grugeon, E. (2005). Teaching speaking & listening in the primary school (3rd ed.). London: David Fulton.  Harmer, J. (2015). The practice of English language teaching (5th ed.). Harlow, England: Pearson Education Limited.  Nation, I., & Newton, J. (2009). Teaching ESL/EFL Listening and Speaking. New York: Routledge.   Richards, J. (2005). Second Thoughts on Teaching Listening. RELC Journal, 36(1), 85-92.  Richards, J., & Burns, A. (2012). Tips for teaching listening: A practical approach. White Plains, NY: Pearson Education.  Rost, M. (1991). Listening in action: Activities for developing listening in language teaching. Englewood Cliffs, NJ: Prentice Hall.  Rost, M. (2011). Teaching and researching listening. Harlow; New York: Longman/Pearson.  Spiro, J. (2013). Changing methodologies in TESOL. Edinburgh: Edinburgh University Press.  Thornbury, S. (2005). How to teach speaking. Harlow, England: Longman.  Ur, P. (1996). A course in language teaching: Practice and theory. Cambridge: Cambridge University Press.  (Recommended readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 2": {"--LEC (3716)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [2], "locations": ["Esther Lee Bldg 203"], "instructors": ["Professor TSANG Wai Chung"]}}}, "assessments": {"Homework or assignment": "20", "Presentation": "20", "Participation": "20", "Short answer test or exam": "40"}}, {"code": "6805", "title": "Information and Communication Technology in English Language Teaching", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA English Language Teaching", "description": "This course covers the application of information and communication technology (ICT) for English language teaching in the light of the history and development of IT generally, and for computer-assisted language learning (CALL) specifically, over the past few decades. The course will look at the development of ICT in terms of the hardware and software available generally (as general-purpose software) or specifically for CALL. The course will examine the use of The Internet for computer-mediated communication such as email, chat programs and bulletin boards. Apart from standalone uses, the course will examine how ICT may be integrated into the broader language curriculum. Other issues covered will be ICT for teachers’ language development, for language research and the use of ICT in assessment.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6806", "title": "Professional Development in English Language Teaching", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA English Language Teaching", "description": "The course aims to develop participants' understanding of and experience associated with professional development in teaching English as a second language teaching (ESL). Participants will explore how to apply this knowledge and insight in sustaining their own professional development and to enable them to become more effective language teachers by taking increased responsibility for their own professional development. Topics covered will include: definitions and concepts of professional development; types of professional development, individual differences and their influence on professional development; the theory and practice of professional development; strategies to enhance and support professional development. The course will also examine ways of helping local ESL teachers to engage in professional development with reference to current professional development theories. Course participants are required to engage in a series of professional development activities, with a major focus on improving the teaching and learning of ESL writing, thus enabling them to contribute to an established sustainable professional development model.", "outcome": "By the end of the course, you should:\r • have grasped the major principles underpinning professional development (PD) for L2 teachers\r • have become familiar with ways to sustain your professional development\r • become more effective teachers by taking increased responsibility for your own professional development\r • have enhanced your understanding of different methodologies, teaching strategies and techniques available in the English language teaching profession\r • be able to evolve your teaching practices in response to the development and learning needs of your students back to your own classroom\r • enhance your ability to build a community of learners among students/ teachers\r • develop an inquiry ethic that could sustain your professional development throughout your teaching career \r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "1. Major principles underpinning teachers’ professional development (PD)\r 2. Reflective practice as a key strategy of PD\r 3. Teacher cognition and PD\r 4. Teacher change and professional growth\r 5. Innovation in English language teaching\r 6. Social and emotional aspects of PD\r 7. Teacher identity and PD\r 8. Impact of PD\r 9. Personal, critical reflection on PD\r  (For reference only, please refer to the course outline of respective teacher for details.)", "required_readings": "(Required readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "recommended_readings": "1. Bailey, K., Curtis, A., & Nunan, D. (2001). Pursuing professional development: The self as source. Boston, Massachusetts: Heinle & Heinle.\r 2. Borg, S. (2015). Teacher cognition and language education: Research and practice. London: Bloomsbury Publishing.\r 3. Burns, A. (2009). Action research in second language teacher education. In A. Burns & J. Richards (Eds.), The Cambridge guide to second language teacher education (pp. 289-297). New York: Cambridge University Press.\r 4. Burns, A. (2013). Innovation through action research and teacher-initiated change. In K. Hyland & L. C. Wong (Eds.), Innovation and change in English language education (pp. 90-105). New York: Routledge.\r 5. Burns A. (2017) Innovating Teacher Development: Transformative Teacher Education Through Classroom Inquiry. In Gregersen T., MacIntyre P. (Eds.), Innovative Practices in Language Teacher Education: Spanning the Spectrum from Intra- to Inter-Personal Professional Development (Vol. 30) (pp. 187-203). Cham: Springer.\r 6. Burns, A., & Richards, J. C. (Eds.) (2009). The Cambridge guide to second language teacher education. New York: Cambridge University Press.\r 7. Dörnyei, Z. & Kubanyiova, M. (2013). Motivating learners, motivating teachers: Building vision in the language classroom. Cambridge: Cambridge University Press.\r 8. Farrell, T. S. (2003). Reflective practice in action: 80 reflection breaks for busy teachers. Thousand Oaks, Calif.: Corwin Press.\r 9. Farrell, T. S. (2012). Novice-Service Language Teacher Development: Bridging the Gap between Preservice and In-Service Education and Education and Development. TESOL Quarterly, 46(3), 435-449.\r 10. Farrell, T. S. (2014). Promoting teacher reflection in second language education: A framework for TESOL professionals. New York: Routledge.\r 11. Farrell, T. S. (2015). Reflective language teaching: From research to practice. London: Bloomsbury Publishing.\r 12. Farrell, T.S.C. (2015). Language teacher professional development. Alexandria, Virginia: TESOL International Association. \r 13. Farrell, T.S.C. , & Laura Baecher, L. (2017). Reflecting on critical incidents in language education: 40 dilemmas for novice TESOL professionals. New York, NY: Bloomsbury.\r 14. Freeman, D. (1989). Teacher training, development, and decision making: A model of teaching and related strategies for language teacher education. TESOL Quarterly, 23(1), 27-45.\r 15. Freeman, D. (2001). Second language teacher education. In R. Carter & D. Nunan (Eds.), The Cambridge Guide to Teaching English to Speakers of Other Languages (pp. 72-79). Cambridge: Cambridge University Press. \r 16. Freeman, D. (2002). The hidden side of the work: Teacher knowledge and learning to teach. A perspective from North American educational research on teacher education in English language teaching. Language teaching, 35(1), 1-13.\r 17. Freeman, D. (2016). Educating second language teachers. Oxford: OUP.\r 18. Freeman, D., Johnson, K.E. (2005). Towards linking teacher knowledge and student learning. In Tedick, D. J. (Ed.), Language teacher education: International perspectives on research and practice (pp. 73–95) Mahwah, NJ: Lawrence Erlbaum.\r 19. Freeman, D., & Richards, J. (Eds.). (1996). Teacher learning in language teaching. New York: Cambridge University Press.\r 20. Johnson, K. E. (2006). The sociocultural turn and its challenges for second language teacher education. TESOL Quarterly, 40(1), 235-257.\r 21. Johnson, K. (2009). Second language teacher education: A sociocultural perspective. London: Routledge.\r 22. Johnson, K. (2009). Trends in second language teacher education. In A. Burns & J. C. Richards (Eds.), The Cambridge guide to second language teacher education (pp. 20-29). New York: Cambridge University Press.\r 23. Johnson, K.E., Golombek, P.R. (Eds.) (2002). Teachers’ narrative inquiry as professional development. New York: Cambridge University Press.\r 24. Johnson, K.E., Golombek, P.R. (Eds.) (2011). Research on second language teacher education: A sociocultural perspective on professional development. New York: Routledge.\r 25. Johnson, K.E., Golombek, P.R. (2018). Making L2 teacher education matter through Vygotskian-inspired pedagogy and research. In Lantolf, J., Poehner, M. (Eds.), Handbook of Sociocultural Theory and Second Language Development (pp. 73-95) New York: Routledge.\r 26. Johnson, K. E., & Golombek, P. R. (2018). Informing and transforming language teacher education pedagogy. Language Teaching Research, 1362168818777539.\r 27. Richards, J. C. (1990). The language teaching matrix. Cambridge: Cambridge University Press.\r 28. Richards, J. C. (1998). Beyond training: Perspectives on language teacher education. New York: Cambridge University Press.\r 29. Richards, J. C. (2008). Second language teacher education today. RELC journal, 39(2), 158-177.\r 30. Richards, J. C., & Farrell, T. (Eds.). (2005). Professional development for language teachers: Strategies for teacher learning. New York: Cambridge University Press.\r 31. Richards, J., & Farrell, T. (2011). Practice teaching: A reflective approach. New York: Cambridge University Press.\r 32. Richards, J. C., & Nunan, D. (Eds.). (1990). Second language teacher education. Cambridge University Press.\r  (For reference only, please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 1": {"--LEC (3540)": {"startTimes": ["18:30"], "endTimes": ["21:00"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor LEE Kit Bing Icy"]}}}, "assessments": {"Essays": "50", "Homework or assignment": "20", "Project": "30"}}, {"code": "6900", "title": "Project in English Language and Teaching", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "LectureProject", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA English Language Teaching", "description": "In their second year, with the guidance of a supervisor, students may conduct a small-scale project investigating one significant issue related to English language or to English language teaching. In principle, this project may have the focus of a survey, an experimental study or a case study. Students will have to complete a report of their piece of research according to a standard format. Projects will generally be done on an individual basis, but with the permission of the supervisor it may be possible for up to three students, as a group, to conduct one substantial project.", "outcome": "After taking this course, students will be able to:\r 1. Demonstrate the application of knowledge and method to the investigation of a specific area within the field of English Language Teaching.\r 2. Identify an issue to which solutions and/ or recommendations can be addressed; and produce a written report which sets out clearly the aims, context, content and outcome.\r 3. Integrate the skills and knowledge which have been taught in the degree programme with specific application to a topic to produce a well-argued report.\r  (Individual course teachers may update the learning outcome as and whenever necessary.)", "syllabus": "(Please refer to the course outline of respective teacher for details.)", "required_readings": "(Required readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "recommended_readings": "(Recommended readings (if any) would depend on individual course teachers. Please refer to the course outline of respective teacher for details.)", "terms": {"2020-21 Term 1": {"AJ01-PRJ (2110)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}, "2020-21 Term 2": {"BJ01-PRJ (2115)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}}}]