[{"code": "1000", "title": "Exploring the Earth System", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Field Studies/Field-tripLectureVisit", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "", "description": "The course provides an interdisciplinary platform for students to navigate the Earth System Science curriculum. Natural phenomena associated with the atmosphere, hydrosphere, geosphere, cryosphere, and biosphere will be described, and concepts related to their dynamics and anthropogenic impacts will be introduced. The connection with global environmental change, natural hazards and the water-energy-food nexus will be highlighted. In addition to attending lectures, students will undertake visits to Museum of Climate Change and a geological field trip.", "outcome": "(1)To understand basic concepts of Earth’s different spheres and their interactions. (2)To understand the importance of an interdisciplinary approach for investigating Earth system dynamics.  (3)To understand the science and technical challenges related to global environmental changes, natural hazards, and the food-water-energy nexus.  (4)To motivate students to self-learn, work in team and critically think about the Earth system, anthropogenic activities, and environmental problems.  (5)To facilitate students’ navigation of teaching and research in the Earth System Science Programme.", "syllabus": "Topics Course Introduction + Overview of ESSC curriculum + The Birth of the Earth  Geosphere and Plate Tectonics  Hong Kong Geology Plate Tectonics  Po Toi Island (Mesozoic geology in HK) Marine Geology and Geophysics  Cryosphere in A Warming Climate  English advising talk Atmospheric Chemistry  Global Environmental Change and GHG Emission  Dynamics of the Earth’s Climate System  Ecosystem, Climate and Air Pollution  Poster Presentation", "required_readings": "N.A.", "recommended_readings": "1)Chan L. S., 2014. Geological Heritage of Hong Kong, Aristo Educational Press Ltd.ISB:9789888243655 2)Bernie Owen & Raynor Shaw, 2011. Hong Kong Geopark, Lions Nature Education Foundation, ISBN: 9789882113961 3)Brian J. Skinner & Barbara W. Murch, 2011. The Blue Planet-An Introduction to Earth System Science, 3rd Edition. Wiley, ISBN: 9780471236436. 4)Stephen Marshak, 2012. Essentials of Geology, 4th Edition. W. W. Norton & Company, ISBN-13: 860-1401249887.", "terms": {"2020-21 Term 1": {"--LEC (7742)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr. AU-YEUNG Yee Man, \n\rDr. TAM Pui Yuk, \n\rProfessor CHAN Man Nin, \n\rProfessor LIU Lin, \n\rProfessor TAI Pui Kuen Amos, \n\rProfessor TAM Chi Yung Francis, \n\rProfessor TAN Yen Joe, \n\rProfessor WONG Teng Fong, \n\rProfessor YANG Hongfeng"]}}}, "assessments": {"Fieldwork or field study": "20", "Presentation": "30", "Report": "10", "Short answer test or exam": "40"}}, {"code": "2010", "title": "Solid Earth Dynamics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Not for students who have taken ESGS2101.", "description": "This course presents an integrated introduction to the solid earth system stressing the geological, chemical, physical, and biological interactions among the lithosphere, hydrosphere and cryosphere. The course applies basic scientific and mathematical concepts to explain the history and behaviour of the solid earth system. Geophysical and geochemical techniques for probing the interior of the earth are reviewed. Plate tectonics is introduced as a unifying theme to understand geodynamic processes. The course includes discussions of topics that are relevant to society, resources and sustainability, such as the physical and chemical basis of natural hazards (earthquakes, tsunami, landslides) and their mitigation, and the impact of geological processes on the global environment.\r", "outcome": "This course will contribute to the understanding of the dynamics of the solid Earth system, specifically the lithosphere, hydrosphere, and cryosphere, as well as their interactions. The students should be able to: 1) describe and use the scientific process, explain how theories are built upon earth system observations, and how both are tested and revised; 2) explain how fundamental physical, chemical, and biological principles govern specific earth system processes, 3) participate knowledgeably and intelligently in discussions of public policy related to earth system science, particularly with respect to natural hazards, resources, environment and sustainable development; 4) work effectively in a team, and present information in a clear, concise and logical manner.", "syllabus": "Topics:\r Introduction and Earth in the universe\r Plate Tectonics\r Earth material: Minerals\r Lab 1: Minerals\r Earth material: Rocks\r Lab 2 and Lab 3: Rocks\r Crustal deformation and mountain building\r Geochronology\r Earthquakes and Tsunami\r Geologic Field Trip to Tung Ping Chau\r Geophysics: Global Seismology\r Volcanos\r Geophysics: Global Seismology\r Geophysics: Gravity and geomagnetic fields\r Glaciers\r Global changes", "required_readings": "Stephen Marshak, Essencials of geology (4th eds), New York : W W Norton, 2013", "recommended_readings": "1) Brian J. Skinner & Barbara W. Murck (3rd Eds.). The Blue Planet: An Introduction to Earth System Science, John Wiley & Sons Inc., New York (2009).\r 2) John Grotzinger , Thomas H. Jordan , Frank Press & Raymond Siever (6th Eds.) Understanding Earth, W.H. Freeman, San Francisco (2010).\r 3) Stephen Marshak (3rd Eds.) Earth: Portrait of a Planet, W.W. Norton, New York (2007)", "terms": {"2020-21 Term 2": {"--LEC (5932)": {"startTimes": ["13:30", "9:30"], "endTimes": ["15:15", "10:15"], "days": [2, 4], "locations": ["Mong Man Wai Bldg LT2", "Lee Shau Kee Building LT4"], "instructors": ["Dr. TAM Pui Yuk, \n\rProfessor LIU Lin", "Dr. TAM Pui Yuk, \n\rProfessor LIU Lin"]}, "-T01-TUT (6233)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Lee Shau Kee Building LT4"], "instructors": ["Dr. TAM Pui Yuk, \n\rProfessor LIU Lin"]}}}, "assessments": {"Essay test or exam": "30", "Lab reports": "30", "Presentation": "10", "Short answer test or exam": "30"}}, {"code": "2020", "title": "Climate System Dynamics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Not for students who have taken ESGS2101.", "description": "This course presents an integrated introduction to the climate system, stressing the dynamics of the atmosphere and its physical and chemical interactions with the hydrosphere, biosphere and geosphere. The course applies basic scientific and mathematical principles to explain the history, current state and future projection of weather and climate, natural hazards (e.g., typhoons, floods), and global climate change in the context of natural variability and anthropogenic influence. Topics include Earth’s energy balance, climate feedback, convection and clouds, general circulation of the atmosphere and ocean, biogeochemistry and global carbon cycle, roles of vegetation and ecosystems, and historical and future climate change. Student taking this course are expected to have taken PHYS1111, CHEM1070 and MATH1010 or equivalent.", "outcome": "This course will contribute to the understanding of the dynamics of the climate system, specifically the atmosphere, hydrosphere, biosphere and solid earth, as well as their interactions. The students should be able to: 1) describe and use the scientific processes, explain how theories are built upon earth system observations, and how both are tested and revised; 2) explain how fundamental physical and chemical principles govern specific climate system processes; 3) participate knowledgeably and intelligently in discussions of public policy related to earth system science, particularly with respect to extreme weather events, global climate change and sustainable development; 4) work effectively in a team, and present information in a clear, concise and logical manner.", "syllabus": "Topics Introduction; overview of the climate system Part I: Energy Balance of the Earth Basic radiation physics; energy balance of the Earth; greenhouse effect Simple climate model; radiative forcing, climate sensitivity and climate feedback Lab 1: Climate sensitivity and feedback in a simple climate model Climate variability and climate change; roles of aerosols; meridional structure of the atmosphere Part II: Dynamics of the Atmosphere Vertical structure of the atmosphere; Newton’s second law; pressure and hydrostatic balance; barometric law Convection; first law of thermodynamics; dry adiabatic lapse rate; atmospheric stability Potential temperature; water content in air; moist convection and cloud formation Lab 2: Conservation of angular momentum on a rotating Earth Coriolis force; pressure gradient force; horizontal momentum equations; geostrophic balance Thermal wind balance; atmospheric fronts and jet stream; surface friction and ageostrophic flow General circulation of the atmosphere; Hadley circulation in the tropics; baroclinic eddies and midlatitude weather systems Lab 3: Introduction to weather analysis and forecast Field trip to Hong Kong Observatory Part III: Ocean and Climate Overview of ocean circulation; Ekman transport and wind-driven circulation Effect of Ekman transport on the interior ocean; western boundary currents; thermohaline circulation Ocean heat buffer and transport; El Niño-Southern Oscillation; tropical cyclones Part IV: Ecosystems and Climate Fluxes in biosphere-atmosphere interactions; surface energy balance; evapotranspiration and photosynthesis; biogeophysical feedbacks Biogeochemical reservoirs and residence times; carbon and nutrient cycling in ecosystems; geological carbon cycle Contemporary carbon cycle; marine carbonate chemistry; biological bump; ocean biogeochemical feedbacks Lab 4: Global carbon cycle Global carbon budget; terrestrial carbon sink and biogeochemical feedbacks Part V: Past, Present and Future Climate Climate throughout Earth’s history; atmosphere of the early Earth; from Cretaceous to ice ages; recent 20,000 years Recent climate change: observations and attribution Future climate projections; impacts of climate change; where do we go from here?", "required_readings": "1. J. Marshall and R.A. Plumb (2007): Atmosphere, Ocean, and Climate Dynamics: An Introductory Text, First Edition, Academic Press", "recommended_readings": "1. M.E. McElroy (2002): The Atmospheric Environment: Effects of Human Activity, First Edition, Princeton University Press. 2. J.M. Wallace and P.V. Hobbs (2006): Atmospheric Science: An Introductory Survey, Second Edition, Academic Press.", "terms": {"2020-21 Term 1": {"--LEC (4757)": {"startTimes": ["14:30", "14:30"], "endTimes": ["16:15", "15:15"], "days": [1, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor TAI Pui Kuen Amos", "Professor TAI Pui Kuen Amos"]}, "-T01-TUT (6992)": {"startTimes": ["15:30"], "endTimes": ["16:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor TAI Pui Kuen Amos"]}}}, "assessments": {"Essay test or exam": "35", "Homework or assignment": "20", "Lab reports": "15", "Presentation": "5", "Short answer test or exam": "25"}}, {"code": "2110", "title": "Geoscience Field Study", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Field Studies/Field-tripLectureProjectInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "", "description": "ESSC2110 is a fundamental field-based course introducing elementary concepts of past Earth’s processes and environmental changes. It also covers important aspects of plate tectonics, different rock types, geological deformation, geomorphology and environmental changes, natural hazards and human impacts. The principal goal of this course is to let students understand how the present geological records and landforms reveal the past tectonic movements and affect the human urban planning. Students are trained to observe, describe and discuss field features, with the help of field tools (e.g. compasses-clinometer and GPS receiver). Basic skills of field techniques, interpreting geologic maps and making field notes are introduced to assist students acquiring field data and discuss possible geologic processes. A field report from each group is required to summarize the field study logically. Field locations of this course may change from year to year. All students are welcome, but priority will be given to students who have taken ESSC1000.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2120", "title": "Integrated Geoscience Field Study", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Field Studies/Field-tripLectureOthersInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Pre-requisite: ESSC2010 and ESSC2020.", "description": "Field study of current landform and geological features is the key to reveal past Earth’s processes and environmental changes. This also provides data for further studies on natural hazards. ESSC2120 is a fundamental level, field-based course of the Earth System Science Programme. It covers important aspects of atmospheric sciences, plate tectonics, volcanoes, deformation structures, sedimentology, coastal features, earthquakes and associated present-day infrastructures. The principal goal of this course is to let students study major atmospheric sciences, geological features and understand how tectonic movement and atmospheric phenomenon contributes to the current different landforms, disasters and urban planning. Students are trained to observe, describe and discuss field features. Basic skills of using field tools (e.g. compasses-clinometer), studying geologic maps and making field notes are introduced to help students acquire field data and analyze possible atmospheric phenomenon and geologic processes. A field report is required to summarize the field study logically. The field location and term of offer of this course may change from year to year. Due to limited quota, priority will be given to students who have taken ESSC2010 and will enroll in ESSC3110.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2130", "title": "Fundamental Geoscience Fieldwork", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-tripLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Pre-requisite: ESSC2010.", "description": "Field study of current landform and geological features is the key to reveal past Earth’s processes and environmental changes. This also provides data for further studies on natural hazards. ESSC2130 is a fundamental level, field-based course of the Earth System Science Programme. It covers important aspects of atmospheric sciences, plate tectonics, volcanoes, deformation structures, sedimentology, coastal features, earthquakes and associated present-day infrastructures. The principal goal of this course is to let students study major atmospheric sciences, geological features and understand how tectonic movement and atmospheric phenomenon contribute to the current different landforms, disasters and urban planning. Students are trained to observe, describe and discuss field features. Basic skills of using field tools (e.g. compasses-clinometer), studying geologic maps and making field notes are introduced to help students acquire field data and analyze possible atmospheric phenomenon and geologic processes. A field report is required to summarize the field study logically. The field location and term of offer of this course may change from year to year. Due to limited quota, priority will be given to students who have taken ESSC2010 and passed the pre-enrolment quiz.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2600", "title": "Biosphere, Climate and the Environment", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Not for students who have taken ESGS4005.", "description": "This course introduces basic concepts of the biosphere with a focus on its relationships with the Earth system and global environmental change. Topics include: ecosystem ecology; global biogeochemical cycles, climate and the roles of different life forms; evolution of life throughout Earth history; human perturbations of carbon and nutrient cycles; impacts of agriculture and deforestation; ocean acidification and eutrophication; responses and evolution of terrestrial and marine ecosystems and biodiversity under global climate change. Students are recommended to take ESSC2600 and MBTE2010 simultaneously.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2800", "title": "Introduction to Environmental Engineering", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Pre-requisite: MATH1010 or 1510 or 1520.", "description": "This is a multidisciplinary course introducing the fundamental physical, chemical and biological principles necessary for understanding the natural and built environments, with an emphasis on reliable water and food supplies, pollution mitigation, waste management, energy resources, climate change, and sustainable development. Examples of engineering solutions to tackle some of these resource and environmental issues are presented. Field trips are included to illustrate interesting case studies. Topics include: conservation principles for mass, energy and momentum in the environmental systems; basic environmental chemistry, hydrology and ecology; risk assessment; and basic principles of water resource engineering, solid waste treatment, noise pollution, air pollution control, climate change adaptation and mitigation, and the interplay between energy consumption and the environment.", "outcome": "- Understand the basic physical, chemical and biological principles governing the various resource and environmental issues of our society - Be able to use basic mathematical methods to assess environmental risks and the feasibility of various engineering solutions to resource and environmental problems - Be able to participate knowledgeably and intelligently in discussion of public policy related to global and regional resource and environmental issues including the food-water-energy crisis, water and air pollution, global climate change, and hazardous wastes. - Be able to work effectively in a team, and present information in a clear, concise and logical manner.", "syllabus": "Part I: Physical and Chemical Fundamentals 1. Mass transport and balance (2 lecture-hours) 2. Energy transport, balance and thermodynamics (3 lecture-hours) 3. Basic environmental chemistry and chemical kinetics (3 lecture-hours) 4. Ecosystem and population dynamics (3 lecture-hours) 5. Risk assessment tools (3 lecture-hours) Part II: Water Resources and Pollution 6. Basic hydrology (2 lecture-hours) 7. Water resources management and optimization (3 lecture-hours) 8. Water pollution: principles (2 lecture-hours) 9. Water pollution: control measures (3 lecture-hours) Part III: Solid Waste Management and Noise Pollution 10. Principles and measures of solid waste management (3 lecture-hours) 11. Principles and measures of noise pollution (2 lecture-hours) Part IV: Air Pollution and Climate Change 12. Atmospheric chemical composition and processes (3 lecture-hours) 13. Air pollution control measures (2 lecture-hours) 14. Climate change: principles, observations and projections (3 lecture-hours) 15. Climate change adaptation and mitigation (2 lecture-hours)", "required_readings": "Gilbert M. Masters and Wendell P. Ela (2007): Introduction to Environmental Engineering and Science (3rd Edition), Prentice Hall.", "recommended_readings": "Mackenzie Davis and David Cornwell (2012): Introduction to Environmental Engineering (5th Edition), McGraw-Hill Education.", "terms": {"2020-21 Term 1": {"--LEC (7880)": {"startTimes": ["16:30", "14:30"], "endTimes": ["18:15", "15:15"], "days": [2, 4], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Dr. AU-YEUNG Yee Man, \n\rProfessor CHAN Man Nin", "Dr. AU-YEUNG Yee Man, \n\rProfessor CHAN Man Nin"]}, "-T01-TUT (7881)": {"startTimes": ["15:30"], "endTimes": ["16:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr. AU-YEUNG Yee Man, \n\rProfessor CHAN Man Nin"]}}}, "assessments": {"Essays": "10", "Essay test or exam": "40", "Homework or assignment": "30", "Selected response test or exam": "20"}}, {"code": "3010", "title": "Continuum Mechanics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Not for students who have taken ESSC4010 or EASC5010.", "description": "This course presents the fundamentals of continuum mechanics illustrated with earth system science applications. Background materials on matrices, vectors and differential operators are first reviewed. The following topics will be covered: tensors and their properties; stress and strain; constitutive equations for Hookean elastic solid and Newtonian viscous fluid; mechanical properties and rheology of geomaterials; Eulerian and Lagrangian kinematics; momentum equations for fluids in a rotating frame; vorticity and divergence; geostrophic balance; boundary layer dynamics; applications in geomechanics, seismology, atmospheric dynamics, and oceanography.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3100", "title": "Structural Geology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-tripLaboratoryLecture", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Pre-requisite: ESSC2010 or permission of instructor.", "description": "This course is an important part of the core Earth System Sciences Curriculum. It introduces the processes and products of rock deformation in three dimensions, ranging from micro- (micron) to macro- (kilometer) scales. It discusses geometries and mechanism of faults, folds, structural features of igneous, sedimentary and metamorphic rocks, and superposed deformations and introduces regional deformational history and tectonics. Structural geology in the field of resource exploration (petroleum and mineral deposits) is also introduced. Class lectures are supplemented by lab exercise and demonstrations as well as field trips to local or overseas outcrops.\r", "outcome": "Students are expected to gain the following abilities:\r 1. Understand the geometry of different geological structures\r 2. Use concepts of solid mechanics to interpret the kinematics and geometries of geological structure formation.\r 3. Use graphical tools to compile and interpret structural data\r 4. Integrate topics in structural geology and plate tectonics through survey of scientific literatures\r 5. Make primary observations in the field and using them to construct and test structural hypotheses\r  Lectures focus on geometric, kinematic, and mechanical analysis of geological structures. Labs use geological maps, computers, stereonets, and physical analogs to illustrate these concepts. Students are encouraged to lead discussion of leading geological topics spread throughout the semester, each of which integrates recent class topics with large-scale active tectonics. Field trips in the second half of the semester encourage small-group discussion of observations and interpretations of deformational history of the field working area. \r  The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": "", "required_readings": "Nil", "recommended_readings": "(1)Haakon Fossen, Structural Geology, 2010, Cambridge University Press, ISBN-13: 9780521516648. \r (2)Ben A. van der Pluijm & Stephen Marshak, Earth Structure – An Introduction to Structural Geology and Tectonics, 2004, W. W. Norton & Company Inc., ISBN0-393-92467-X.\r (3)Robert J. Twiss & Eldridge M. Moores, Structural Geology, Second Edition, 2006, W.H.Freeman & Co. Ltd., ISBN 13: 9780716749516.\r (4)John Suppe, Principles of Structural Geology, 1985, Prentice-Hall, Inc., Englewood Cliffs, New Jersey 07362. ISBN: 0-13-710500-2.\r (5)Passchier C.W.& Trouw R.A.J., Microtectonics, Second Edition, 2006, Springer. ISBN: 978-3-540-64003-5 (print) & 978-3-540-29359-0 (Online).", "terms": {"2020-21 Term 2": {"--LEC (8772)": {"startTimes": ["14:30", "9:30"], "endTimes": ["15:15", "11:15"], "days": [4, 2], "locations": ["Science Centre 331", "Science Centre 331"], "instructors": ["Dr. TAM Pui Yuk", "Dr. TAM Pui Yuk"]}, "-L01-LAB (8791)": {"startTimes": ["15:30"], "endTimes": ["16:15"], "days": [4], "locations": ["Science Centre 331"], "instructors": ["Dr. TAM Pui Yuk"]}}}, "assessments": {"Essay test or exam": "35", "Fieldwork or field study": "20", "Lab reports": "20", "Short answer test or exam": "25"}}, {"code": "3110", "title": "Geoscience Field Course", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-tripLectureProjectInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Pre-requisite: ESSC2010 and (ESSC3100 or ESSC4120) or by instructor's approval.", "description": "Understanding of Earth processes and environmental changes over geological time is highly dependent upon the experience and capabilities gained through doing fieldwork. ESSC3110 is an intermediate level course of the Earth System Science Programme. It covers important aspects of field geology, including sedimentary, igneous and metamorphic petrology, tectonics, geophysics and surficial processes. The principal goal of this course is to train students to recognize different lithological units and their geometries in three dimensions, and understand the related tectonic environment and formation mechanism. Class lectures introduce basic skills of reading and interpreting geological maps, using geological equipment (i.e. Compass-clinometer, GPS receiver), and producing field notes and reports. Field projects include field observation and description, techniques of field data acquisition and analysis, sample collection, and geological map compilation. Field projects also focus on surficial processes (relatively occurring on short geological time scale), which are of environmental and ecological importance. The field location (either in mainland of China or overseas) may change from year to year.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3120", "title": "Physics of the Earth", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Pre-requisite: ESSC2010 or permission of instructor.", "description": "This course focuses on the concepts of the physics of the Earth to understand how the solid Earth works. Since 1960s, plate tectonics has been developed to explain observations on Earth such as mountain building, occurrence of earthquakes and volcanoes, as well as deposition of natural resources. The discovery of plate tectonics requires understanding of geophysical methods, which will be covered in this course. The topics covered include the Earth’s gravitational and magnetic fields, earthquake seismology, internal structure of the Earth, thermal and electrical properties, as well as geodynamics. Methods of geophysical survey will also be introduced.", "outcome": " At the completion of this course, the students will be able to know about Earth’s inner structure, composition, and thermal and electrical properties, understand principles of seismic wave propagation and earthquake physics, gain knowledge of gravity and geomagnetism, and have the ability to analyze the observation data for explanation of geophysical processes. The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.    ", "syllabus": "Plate tectonics: Magnetic field, Paleomagnetism, Plate motion and rotation Seismology: Earthquakes and plate boundaries, Earthquake location and magnitude, Earthquake energy and focal mechanism, Wave propagation, Refraction and reflection seismology Gravity: Gravity and geoid, Gravity corrections, Gravity anomaly, Isostasy Heat: Heat flow, Heat conduction, Heat convection", "required_readings": "Nil", "recommended_readings": "1. C. M. R. Fowler, 2005, The Solid Earth: An introduction to global geophysics, 2nd edition, 685 pp, Cambridge University Press.  2. D. L. Turcotte and G. Schubert, 2002, Geodynamics, 2nd edition, 472 pp, Cambridge University Press.", "terms": {"2020-21 Term 1": {"--LEC (5253)": {"startTimes": ["9:30", "9:30"], "endTimes": ["10:15", "11:15"], "days": [5, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor YANG Hongfeng", "Professor YANG Hongfeng"]}, "-T01-TUT (5408)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Professor YANG Hongfeng"]}}}, "assessments": {"Essay test or exam": "30", "Homework or assignment": "30", "Presentation": "20", "Short answer test or exam": "20"}}, {"code": "3200", "title": "Atmospheric Dynamics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Not for students who have taken ESGS5014. Pre-requisite: ESSC2020 and (MATH2550 or PHYS2051) or permission of instructor.", "description": "This course introduces observations of and physical principles governing the circulation of the Earth’s atmosphere in relation to weather and climate. The topics covered include atmospheric composition and structure, convection, fundamentals of atmospheric motions, and the basic principles for weather and climate modeling. Physical principles covered include basic conservation laws, balanced flows, atmospheric thermodynamics, circulation and vorticity, atmospheric waves, and theories for various weather systems.", "outcome": "At the completion of this course, the students will be able to\r 1) Gain fundamental concepts of atmospheric thermodynamics; 2) Understand fundamental motions in the atmosphere; 3) Develop the ability to analyze and explain observed atmospheric phenomena.\r  (Course outcomes as related to Programme Learning Outcomes) -- The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": "1. Basic conservation laws\r  - Fundamental forces, rotating frame, spherical coordinate, continuity equation, thermodynamic equation\r 2. Elementary applications of basics equations\r   - Scale analysis, hydrostatic approximation, isobaric coordinates \r 3. Thermodynamics,\r   - Gas laws, 1st and 2nd laws of thermodynamics, dry and moist convection\r 4. Circulation and vorticity\r  - Kevin circulation theorem, vorticity, Ertel potential vorticity\r 5. Atmospheric waves\r  - Perturbation method, gravity waves, Rossby waves\r 6. Qusai-geostrophic theory\r  - Qusai-geostrophic approximation, baroclinic disturbances\r 7. Weather systems\r  - Extratropical cyclones", "required_readings": "1. J. R. Holton and G. J. Hakim, 2012: An Introduction to Dynamic Meteorology. Fifth Edition, Academic Press.", "recommended_readings": "1. Wallace, J. M., and P. V. Hobbs, 2006: Atmospheric Science: An Introductory Survey. Second Edition, Academic Press.\r 2. J. Marshall and A. Plumb, 2008: Atmosphere, Ocean and Climate Dynamics, An Introductory Text, First Edition, Academic Press.", "terms": {"2020-21 Term 1": {"--LEC (7313)": {"startTimes": ["14:30", "9:30"], "endTimes": ["16:15", "10:15"], "days": [2, 4], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor TAM Chi Yung Francis", "Professor TAM Chi Yung Francis"]}, "-T01-TUT (7314)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor TAM Chi Yung Francis"]}}}, "assessments": {"Essay test or exam": "30", "Homework or assignment": "20", "Project": "20", "Short answer test or exam": "30"}}, {"code": "3220", "title": "Atmospheric Chemistry", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Not for students who have taken ESGS5014. Pre-requisite: CHEM1070 or CHEM1072 or CHEM1280 or permission of instructor.", "description": "This course introduces the physical and chemical processes determining the composition for the atmosphere and its implications for climate, ecosystems, air pollution and human welfare. Topics covered include atmospheric structure, atmospheric chemistry models, atmospheric transport, chemical kinetics, stratospheric and tropospheric chemistry, chemistry of aerosols, biogeochemical cycles, as well as critical environmental issues including stratospheric ozone depletion, acid rain, photochemical smog, and climate change.", "outcome": "At the completion of this course, the students will be able to 1) Gain fundamental concepts of atmospheric chemistry; 2) Understand the physical and chemical principles related to natural and pollution aspects of the atmosphere; 3) Develop the ability to analyze and explain observed atmospheric phenomena and environmental change; 4) Acquire the basics of atmospheric modeling used for air quality and climate projections. (Course outcomes as related to Programme Learning Outcomes) -- The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": "Topics Introduction and overview Measures of atmospheric composition Vertical structure of the atmosphere; chemical thermodynamics Chemical kinetics Atmospheric photochemistry Atmospheric lifetime; box and puff models Stratospheric chemistry: Chapman mechanism Stratospheric chemistry: HOx catalytic loss cycles Stratospheric chemistry: NOx catalytic loss cycles Stratospheric chemistry: ClOx and BrOx catalytic loss cycles Stratospheric chemistry: polar ozone hole Stratospheric chemistry: polar ozone hole recovery Oxidizing power of the troposphere Tropospheric ozone Tropospheric ozone pollution Atmospheric gas-phase chemistry Aerosol sources and formation Aerosol physics and thermodynamics Aerosol measurement techniques Aerosol – cloud formation Chemistry of atmospheric aqueous phase and precipitation Acid rain", "required_readings": "1. Jacob, D.J.: Introduction to Atmospheric Chemistry, Princeton University Press, 1999.", "recommended_readings": "1. Seinfeld, J.H. and Pandis, S.N.: Atmospheric Chemistry and Physics: From Air Pollution to Climate Change, 2006.", "terms": {"2020-21 Term 2": {"--LEC (7987)": {"startTimes": ["9:30", "16:30"], "endTimes": ["11:15", "17:15"], "days": [1, 4], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor CHAN Man Nin", "Professor CHAN Man Nin"]}, "-T01-TUT (7988)": {"startTimes": ["17:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor CHAN Man Nin"]}}}, "assessments": {"Essay test or exam": "40", "Homework or assignment": "25", "Presentation": "10", "Short answer test or exam": "25"}}, {"code": "3300", "title": "Ocean and Climate", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Not for students who have taken ESGS5013. Pre-requisite: ESSC2020 or permission of instructor.", "description": "This course describes the physical characteristics of the ocean, the observed mean ocean circulation, and explains the latter’s governing dynamical principles. Related biological and chemical processes are introduced. Climate and climate variability, as well as the role played by the ocean are also described. Topics include wind-driven circulation, thermohaline circulation, inertial motions and tides, El Niño-Southern Oscillation, and the roles of the ocean in climate and climate variability.\r", "outcome": "       ESSC3300 Learning Outcomes          At the completion of this course, the students will be able to 1) Gain knowledge of the physical chemical and biological process associated with the ocean,  2) Understand fundamental physic of phenomena including ocean current, waves, and tides, 3) Develop ability to analyze and explain observed oceanic phenomena.   (Course outcomes as related to Programme Learning Outcomes) -- The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.    ", "syllabus": "• Physical characteristics of the ocean\r  - Ocean basins, cryosphere, properties of sea water, mixed layer and thermocline\r • The role of the ocean on climate\r  - Energy transport of climate system, ocean general circulation, ocean heat transport\r • Basic equations\r  - Basic equations, inferences from geostrophic and hydrostatic balance, vorticity\r • The wind-driven circulation\r  - Wind stress and Ekman layers, , response to Ekman pumping, western boundary current, Sverdrup theory\r • Thermohaline circulation\r  - Observations, dynamical models for thermohaline circulation\r • Waves\r  - Inertial oscillations, surface waves, Rossby waves, Kelvin waves,\r • Climate and climate variability\r  - Climate variability, El Nino-Southern Oscillation, Paleoclimate", "required_readings": "1. G. Mellor, 1996: Introduction to Physical Oceanography, American Institute of Physics \r 2. J. Marshall and A. Plumb, 2008: Atmosphere, Ocean and Climate Dynamics, An Introductory Text, First Edition, Academic Press \r 3. Talley, L.D., G.L. Pickard, W.J. Emery and J.H. Swift, 2011: Descriptive Physical Oceanography, Elsevier.", "recommended_readings": "1. G. R. Biggs, 2004: The Oceans and Climate, Second Edition, Cambridge University Press\r 2. Knauss, J. A., 1996: Introduction to Physical Oceanography, Prentice Hall.", "terms": {"2020-21 Term 2": {"--LEC (8547)": {"startTimes": ["14:30", "14:30"], "endTimes": ["16:15", "15:15"], "days": [1, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor TAM Chi Yung Francis", "Professor TAM Chi Yung Francis"]}, "-T01-TUT (8723)": {"startTimes": ["15:30"], "endTimes": ["16:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor TAM Chi Yung Francis"]}}}, "assessments": {"Essay test or exam": "30", "Homework or assignment": "20", "Project": "20", "Short answer test or exam": "30"}}, {"code": "3320", "title": "Hydrogeology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Not for students who have taken ESGS5006. Pre-requisite: ESSC2010 or permission of instructor.", "description": "This course introduces the physical and chemical principles of hydrogeology. Concepts of surface and groundwater hydrology, as well as quantitative modelling of groundwater flow and contaminant transport are covered. Special topics on the coupling of hydrologic and geologic processes will also be addressed, with examples from tectonics, petroleum geology, geothermics, and global change.\r", "outcome": "       ESSC3320 Learning Outcomes          Students will acquire basic concepts in relation to the physical chemical processes of water circulations in the various components of the Earth system. The students will appreciate the interaction between the hydrosphere and geosphere, and its impact on natural resources and the environment. The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.    ", "syllabus": "", "required_readings": "Fetter, C. W., Applied Hydrogeology (4th edition), Pearson, 612 pp., 2014.", "recommended_readings": "1. Hornberger, G.M., Wiberg, P.L., Raffensperger, J.P. and P. D'Odorico, Elements of Physical Hydrology, 2nd edition, John Hopkins UP, 378 pp., 2014.\r 2. Fitts, C.R., Groundwater Science, 2nd edition, Academic Press, 672 pp., 2013.\r 3. Mays, L. W., Ground and Surface Water Hydrology, John Wiley & Sons, 640 pp., 2011\r 4. Schwartz, F. W. and H. Zhang, Fundamentals of Ground Water, John Wiley & Sons, 583 pp., 2003.", "terms": {"2020-21 Term 1": {"--LEC (7240)": {"startTimes": ["12:30", "12:30"], "endTimes": ["13:15", "14:15"], "days": [4, 2], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor TAN Yen Joe", "Professor TAN Yen Joe"]}, "-T01-TUT (7245)": {"startTimes": ["13:30"], "endTimes": ["14:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Professor TAN Yen Joe"]}}}, "assessments": {"Essay test or exam": "30", "Homework or assignment": "30", "Selected response test or exam": "40"}}, {"code": "3600", "title": "Ecosystems and Climate", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Not for students who have taken ESGS4005 or ESSC3601. Pre-requisite: ESSC2020 or permission of instructor.", "description": "This course introduces the physical, chemical and biological principles governing the functioning of terrestrial and marine ecosystems, and their roles in shaping the Earth’s climatic and geological environments. Topics include: basic hydrology and surface energy balance; energy, momentum, water and chemical exchange between ecosystems and the atmosphere; cycling of water, carbon and other nutrients in soil, vegetation and ocean; survival strategies of different life forms (especially plants and microorganisms); ecosystem structures and functions; landscapes, disturbances and ecosystem dynamics; human perturbations of biogeochemical cycles via pollution, greenhouse gas emissions and land use; responses and evolution of terrestrial and marine ecosystems under global climate change. This course serves as a comprehensive introduction to ecological climatology, biogeochemistry and ecosystem ecology, and requires basic mathematical operations.This version of the course includes an integrated set of computer laboratory sessions.", "outcome": "1. Students will understand fundamental concepts in the physical and chemical principles governing the structures and functions of ecosystems;2. Students will understand how ecosystems are impacted by natural processes and humans activities;3. Students will learn to search for information and data from the literature;4. Students will acquire mathematical skills required to conduct ecosystem and climate analysis, as well as presentation and writing skills.5. Students will develop the responsibility in study and work.6. Student will have motivation for life-long learning.", "syllabus": "Topic 1: Ecosystems, global plant biogeography and climateTopic 2: Plant ecophysiology: photosynthesis and transpirationTopic 3: Surface energy balance and biogeophysical climate-vegetation interactionsTopic 4: Soil and plant biogeochemistryTopic 5: Global carbon cycle and biogeochemical feedbacksTopic 6: Marine and wetland ecosystems and biogeochemistryTopic 7: Nitrogen, aerosols and atmospheric chemistryTopic 8: Sustainable ecosystem management", "required_readings": "1. Bonan, G.B. (2016): Ecological Climatology: Concepts and Applications (3rd edition). Cambridge University Press.2. Schlesinger, W.H., Bernhardt, E.S. (2013): Biogeochemistry: An Analysis of Global Change (3rd edition). Academic Press.", "recommended_readings": "1. Schimel, D. (2013): Climate and Ecosystems. Princeton University Press.2. Chapin (III), F.S., Matson, P.A., Vitousek, P.M. (2012): Principles of Terrestrial Ecosystem Ecology (2nd edition). Springer.3. Valiela, I. (2016): Marine Ecological Processes (3rd edition). Springer.", "terms": {"2020-21 Term 2": {"--LEC (7448)": {"startTimes": ["9:30", "9:30"], "endTimes": ["10:15", "11:15"], "days": [5, 3], "locations": ["Humanities Building 11", "Online Teaching"], "instructors": ["Professor TAI Pui Kuen Amos", "Professor TAI Pui Kuen Amos"]}, "-T01-TUT (7461)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [5], "locations": ["Humanities Building 11"], "instructors": ["Professor TAI Pui Kuen Amos"]}}}, "assessments": {"Essay test or exam": "60", "Homework or assignment": "5", "Lab reports": "30", "Participation": "5"}}, {"code": "3601", "title": "Principles of Ecosystems and Climate", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Not for students who have taken ESGS4005 or ESSC3600. Pre-requisite: ESSC2020 or permission of instructor.", "description": "This course introduces the physical, chemical and biological principles governing the functioning of terrestrial and marine ecosystems, and their roles in shaping the Earth’s climatic and geological environments. Topics include: basic hydrology and surface energy balance; energy, momentum, water and chemical exchange between ecosystems and the atmosphere; cycling of water, carbon and other nutrients in soil, vegetation and ocean; survival strategies of different life forms (especially plants and microorganisms); ecosystem structures and functions; landscapes, disturbances and ecosystem dynamics; human perturbations of biogeochemical cycles via pollution, greenhouse gas emissions and land use; responses and evolution of terrestrial and marine ecosystems under global climate change. This course serves as a comprehensive introduction to ecological climatology, biogeochemistry and ecosystem ecology, and requires basic mathematical operations. This course is the same as and meets with ESSC3600, except without the integrated computer laboratory sessions and exercises.", "outcome": "1.  Students will understand fundamental concepts in the physical and chemical principles governing the structures and functions of ecosystems;2.  Students will understand how ecosystems are impacted by natural processes and humans activities;3.  Students will learn to search for information and data from the literature;4.  Students will acquire mathematical skills required to conduct ecosystem and climate analysis, as well as presentation and writing skills.5.  Students will develop the responsibility in study and work.6.  Student will have motivation for life-long learning.", "syllabus": "Topic 1: Ecosystems, global plant biogeography and climateTopic 2: Plant ecophysiology: photosynthesis and transpirationTopic 3: Surface energy balance and biogeophysical climate-vegetation interactionsTopic 4: Soil and plant biogeochemistryTopic 5: Global carbon cycle and biogeochemical feedbacksTopic 6: Marine and wetland ecosystems and biogeochemistryTopic 7: Nitrogen, aerosols and atmospheric chemistryTopic 8: Sustainable ecosystem management", "required_readings": "1.  Bonan, G.B. (2016): Ecological Climatology: Concepts and Applications (3rd edition). Cambridge University Press.2.  Schlesinger, W.H., Bernhardt, E.S. (2013): Biogeochemistry: An Analysis of Global Change (3rd edition). Academic Press.", "recommended_readings": "1.  Schimel, D. (2013): Climate and Ecosystems. Princeton University Press.2.  Chapin (III), F.S., Matson, P.A., Vitousek, P.M. (2012): Principles of Terrestrial Ecosystem Ecology (2nd edition). Springer.3.  Valiela, I. (2016): Marine Ecological Processes (3rd edition). Springer.", "terms": {"2020-21 Term 2": {"--LEC (7462)": {"startTimes": ["9:30"], "endTimes": ["11:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor TAI Pui Kuen Amos"]}}}, "assessments": {"Essay test or exam": "80", "Homework or assignment": "10", "Participation": "10"}}, {"code": "3800", "title": "Global Environmental Change", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Pre-requisite: ESSC2010 and 2020, or permission of instructor.", "description": "This course includes the science behind the global warming issue, how the public views the issue and the critical thinking needed to analyze the evidence seen in the media/articles from the point of view of scientists. The world energy use, which is considered to be the cause of global warming, and the impacts are discussed in the course. In this course, students will learn about the radiation budgets/balance in the atmosphere, possible climate forcings that can upset the energy balance, how the earth’s global average temperature is measured, why global warming is described as “the biggest hoax” in human history, observations from the ocean and cryosphere and popular environmental issues/arguments discussed in the mainstream media. Newest observations from the Intergovernmental Panel on Climate Change (IPCC) report are included throughout the course. This course actively incorporates elements of innovation, design, global citizenship and social enterprisingness by asking the students to think innovatively but critically about possible solutions to adapt to and combat climate change and the global energy/health crisis. Different options including their pros and cons are actively discussed in class. Students are encouraged to think creatively about the problem from different angles, e.g., by standing in the shoes of climate skeptics – evaluating their “data”, how they present them, the arguments put forth by them – in order to develop a strategic approach to best communicate the issues to a variety of stakeholders. Project assignments will allow students to focus on one particular environmental issue in other part of the world, attempting to address the issue in the very different geographical, cultural, economic and political contexts from that of the students. Example projects can be “How to use geoengineering to combat climate change?”, “How can Sub-Saharan Africa secure its future food supply under the threat of climate change?”, etc. In the course, students will define and understand the problem. They shall form groups and discuss their own point of views and search information on the evidence of the corresponding arguments. They will present their ideas in class and write a self-reflection report. Each of the group will have to make an “infographic”- a layout of science knowledge learnt in the project that is easy enough for the public to understand but at the same time informative. Good infographics will be used in our OpenDay.", "outcome": "At the completion of this course, the students will be able to1) gain understanding of basic climate science behind the global warming issue, including how Earth’s global temperature has been measured by scientists and how the global average temperature is calculated2) study observations from different components of Earth besides the atmosphere, such as ocean and cryosphere observations, and how these components are affected by the human activities3) study how the scientific problem is presented and perceived in the society and learn how to use one’s scientific knowledge to identify possible solutionsThe active incorporation of elements of innovation and design in the course is critical in allowing the students to develop a keen scientific mindset and logic flow to understand the complexity of the climate change and energy issues (Learning Outcome #1), and to dissect the reasons behind contradictory arguments in a society (Learning Outcome #3). Critical evaluation of the arguments from both sides (climate alarmists vs. skeptics) will ultimately allow them to develop their own stance in the issue, and think critically about the ways to move the world forward towards sustainability (Learning Outcome #3). The incorporation of global citizenship and social enterprisingness is also crucial for students to develop a keen awareness of how environmental issues affect people in a huge variety of geographical and cultural contexts (Learning Outcome #2), and think critically about what kinds of solutions best fit a certain region (Learning Outcome #3).", "syllabus": "•  L01 Changing Planet (2 lecture-hours)•  L02 Energy: A Closer Look (2 lecture-hours)•  L03 Energy and Heat (2 lecture-hours)•  L04 Fossil Energy (2 lecture-hours)•  L05 Impacts of Fossil Fuels (2 lecture-hours)•  L06 Nuclear Energy (2 lecture-hours)•  Documentary Quiz: Pandora Promise (1.5 hour of video quiz)•  L07 Energy from Earth and Moon (2 lecture-hours)•  L08 Direct from the Sun: Solar Energy (2 lecture-hours)•  Documentary: Minimalism (1.5 hour of video)•  L09 Basic Climate Science (2 lecture-hours)•  L10 Climate Forcing (2 lecture-hours)•  Documentary Quiz: Merchants of Doubt (1.5 hour of video quiz)•  L11 Tropical Cyclone and Climate Change (2 lecture-hours)•  L12 Ocean Observations (2 lecture-hours)•  Documentary: Mission Blue (1.5 hour of video)•  L13 Cryosphere (2 lecture-hours)•  Documentary: Chasing Ice (1.5 hour of video)•  L14 Future Climate (2 lecture-hours)•  L15 Energy and Climate: Breaking the Link (2 lecture-hours)", "required_readings": "Nil", "recommended_readings": "1. Wolfson, Richard, and B. F. Wissler. Energy, environment, and climate (Second Edition). WW Norton & Company, Inc., 2011.2. McKibben, Bill. The global warming reader: a century of writing about climate change. Penguin, 2012.", "terms": {"2020-21 Term 1": {"--LEC (8546)": {"startTimes": ["16:30", "9:30"], "endTimes": ["17:15", "11:15"], "days": [3, 1], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Dr. AU-YEUNG Yee Man", "Dr. AU-YEUNG Yee Man"]}, "-T01-TUT (8652)": {"startTimes": ["17:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Dr. AU-YEUNG Yee Man"]}}}, "assessments": {"Homework or assignment": "30", "Participation": "30", "Report": "10", "Short answer test or exam": "10", "Selected response test or exam": "20"}}, {"code": "3900", "title": "Internship", "career": "Undergraduate", "units": "3.00", "grading": "Pass (P)/Fail (U)", "components": "Practicum", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Pre-requisite: ESSC2010 and 2020, and have taken at least one course from ESSC3100, 3120, 3200, 3220, 3300 or 3320.", "description": "This course aims to let students apply their Earth System Science knowledge in, and gain hands-on experience from workplace. Students are expected to gain practical experience from various internship opportunities such as CUHK units, government or private companies. The internship can be held through local fieldwork, guided tours, workshops or other related tasks, depending on the requests from different units. Students are required to serve at least 320 hours during the internship and will be evaluated based upon biweekly progress reports, final written report, presentation and the evaluation from the supervisor(s)/course coordinator (subject to their supervisors).Advisory: For year 2 or above Earth System Science major students.Note: Allowance may vary each year for the internships depending on the needs of students.", "outcome": "Students are expected to gain the following abilities: 1. Acquire hands-on experience related to various fields in Earth Sciences through participating in fieldwork, guided tours, summer workshop or other related tasks 2. Apply concepts and knowledge in atmospheric sciences and geology/geophysics in science education and/or workplace 3. Initiate students’ motivation to learn Earth Sciences knowledge from workplace 4. Develop students’ project management skills through organizing activities and handling project(s) independently", "syllabus": "(I) Pre-internship training (if applicable) ● Students will need to participate in pre-internship training (if any) provided by the respective units.  (II) Tentative schedule: ● 2-month internship held locally or overseas by the respective units ● On-job training by respective supervisor(s) ● Biweekly progress reports, individual written report and final presentation are required.", "required_readings": "Nil", "recommended_readings": "Nil", "terms": {"2020-21 Term 1": {"-P01-PRA (6077)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Dr. AU-YEUNG Yee Man, \n\rDr. TAM Pui Yuk"]}}}, "assessments": {"Essays": "30", "Presentation": "20", "Project": "30", "Report": "20"}}, {"code": "4010", "title": "Solid and Fluid Mechanics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Not for students who have taken ESSC3010 or EASC5010.", "description": "This course presents the fundamentals of continuum mechanics illustrated with earth system science applications. Background materials on matrices, vectors and differential operators are first reviewed. The following topics will be covered: tensors and their properties; stress and strain; constitutive equations for Hookean elastic solid and Newtonian viscous fluid; mechanical properties and rheology of geomaterials; Eulerian and Lagrangian kinematics; momentum equations; vorticity and divergence; applications in geomechanics, seismology, atmospheric dynamics, and oceanography.", "outcome": "Students will acquire systematic training in continuum mechanics, a body of knowledge in mathematics and physics which is of critical importance in a diversity of earth system science applications, including geomechanics, seismology, atmospheric dynamics, and oceanography. The mathematical concepts are illustrated with geophysical examples. Students will be well equipped with useful background to pursue more advanced courses on physical aspects of earth system science.", "syllabus": "TopicsVectors. Cartesian coordinates. Vector algebra.Determinants. Change of orthonormal basis.Tensors. Principal values and principal directionsTraction and stress tensor. Principal stresses.Mohr’s circle.Current and reference configurations. Strain tensor.Infinitesimal strain tensor. Rigid body rotation.Transformation of integrals. Velocity gradient, strain rate and vorticity.Conservation of mass. Conservation of momentum. Conservation of energy. Ideal constitutive relations: inviscid fluid. Bernoulli’s equation. Potential flow. Ideal constitutive relations: viscous fluid. Steady and non-steady flow.Ideal constitutive relations: linear solid.Elastic waves and elasostatics.", "required_readings": "Rudnicki, J.W. (2015) Fundamentals of Continuum Mechanics, Wiley, 199 pp.", "recommended_readings": "Fung, Y.C., A First Course in Continuum Mechanics, 3rd ed., Prentice-Hall, 1994.Mase, G.E. (1999), Continuum Mechanics for Engineers, CRC Press, 377 pp.Schey, H.M. (2005),  Div, Grad, Curl, and All That: An Informal Text on Vector Calculus, Norton, 163 pp.Bradford Hager: Course notes of MIT 12.005 Applications of Continuum Mechanics to Earth, Atmospheric, and Planetary Sciences (2006).James Hansen: Course notes of MIT 12.800 Fluid Dynamics of the Atmosphere and Ocean (2004)", "terms": {"2020-21 Term 2": {"--LEC (8891)": {"startTimes": ["11:30", "11:30"], "endTimes": ["13:15", "12:15"], "days": [2, 4], "locations": ["Institute of Chin Studies L1", "Lady Shaw Bldg LT2"], "instructors": ["Professor CHAU Kam Tim, \n\rProfessor WONG Hoi Chu", "Professor CHAU Kam Tim, \n\rProfessor WONG Hoi Chu"]}, "-T01-TUT (8893)": {"startTimes": ["12:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Lady Shaw Bldg LT2"], "instructors": ["Professor CHAU Kam Tim, \n\rProfessor WONG Hoi Chu"]}}}, "assessments": {"Essay test or exam": "40", "Homework or assignment": "40", "Short answer test or exam": "20"}}, {"code": "4110", "title": "Applied Geophysics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Pre-requisite: ESSC2010 and ESSC3120.", "description": "This course introduces concepts, principles, and applications of geophysical methods in environmental and engineering studies. It offers an overall survey of various geophysical methods for exploring the shallow subsurface. It provides the technical foundation needed to understand the use and limitations of gravity, seismic, ground penetrating radar, and electromagnetic methods. Demonstration of commonly used methods will be provided in the field along with tutorials of preliminary data analysis techniques.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4120", "title": "Petrology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Pre-requisite: ESSC2010.", "description": "Petrology is an essential subfield of Earth System Science because the rock record is the foundation for interpreting Earth history and internal processes. Petrologic concepts help us understand the Earth system, with connections to related fields such as geochemistry, geophysics, mineralogy, structural geology and geodynamics. This course broadly surveys the formation, distribution, chemical composition, mineral associations, and internal texture and structures in rocks of the earth’s crust and upper mantle, and establishes it relation to global tectonic environments. Class lectures are supplemented by lab exercise, demonstrations and tutorials (e.g. study of rock hand specimens, understand phase rule, use of optical microscope etc.).", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4130", "title": "Geomorphology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-tripLaboratoryLecture", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Pre-requisite: ESSC3100.", "description": "This course is an important part of the core Earth System Sciences Curriculum. It introduces the main concepts in geomorphology with emphasis on understanding the coupling of environments, processes and materials that leads to landform development. Understanding the underlying geological principles of rocks, minerals, structural deformation and geological time are important background knowledge to be enhanced by the study of geomorphology.It discusses the qualitative and quantitative techniques for investigation and research in the field, laboratory, and computer simulation. The application of geomorphology for public safety, engineering problems and development of sustainable solutions will be emphasized. Examples from theory and practice of geomorphology in Hong Kong will be introduced. Practical understanding and skills will be gained from lab exercises and field trips in Hong Kong.Students are suggested to be equipped with basic knowledge of rocks and minerals, structural geology and geological time scale.\r", "outcome": "Students are expected to gain the following abilities:\r 1. Understand the relationships between materials, processes and landforms; 2. Use concepts of solid and fluid mechanics to interpret the formation of landforms; 3. Use graphical tools to compile and interpret field and laboratory data; 4. Integrate topics in mineralogy, petrology, structural geology, plate tectonics, climate sciences, biogeosciences, hydrology, remote sensing and geotechnical engineering through survey of scientific literature, case studies, books and textbooks; and\r 5. Make primary observations in the field and using them to construct and test hypotheses.\r  Lectures focus on physical and chemical aspects of landform evolution and understanding spatial patterns in landscapes and how humans affect and are impacted by Earth surface processes. Labs use the geological maps, terrain classification maps, aerial photography interpretation, societal consequence assessment, and physical models to illustrate these concepts. \r Students are encouraged to ask, follow-up research and lead discussion of questions regarding lecture topics throughout the semester. Field trips in the second half of the semester encourage small-group discussion of observations and interpretations of landscape evolution and human impacts in mountainous and coastal terrains.\r The students will develop the ability: 1) to evaluate an issue critically based on evidence and\r scientific principles, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students will also be challenged to manage a large amount of reading in short periods of time and to think of their role as a citizen and in society.", "syllabus": "Topics\r Introduction to Geomorphology + Endogenic Geomorphic Processes\r Physical Properties of Minerals and Rocks Physical Weathering\r Chemical Weathering and Erosion Fluvial landform\r Coastal landform\r Volcanic / granitic landform\r Slope and Landslides\r Lab exercise I\r Lab exercise II + pre-trip course to Sai Kung Applications of Aerial Photograph Interpretation\r Field trip to Sai Kung\r Structural landform\r Field trip to Port Island\r Eolian landform\r Landslide mapping introduction\r Karst landform\r Landslide mapping\r Glacial landform", "required_readings": "1)Ritter, D.F., R.C. Kochel and J.R. Miller (2011) Process Geomorphology, 5th edition. McGraw Hill, NY. \r 2)Handouts/emails: Scientific articles, textbook extracts, book extracts, etc.", "recommended_readings": "1) Anderson, R.S. & Anderson, S. P., 2011. Geomorphology: the Mechanics and Chemistry of Landscapes, Fifth Edition.Waveland Press. Inc. \r 2) Leopold, L. B., Wolman, M. G. and Miller, J. P., 1964. Fluvial Processes in Geomorphology. Dover Publications.\r 3) Burbank, D. W. & Anderson R. S., 2011. Tectonic Geomorphology, 2nd Edition. Wiley-Blackwell.\r 4) Summerfield, M.A., 1991. Global Geomorphology. Longman Scientific & Technical.\r 5) Fookes, P. G., Lee, M., Griffiths, J., 2007. Engineering Geomorphology: Theory and Practice, Whittles Publishing.\r 6) Fookes, P. G., Lee, M., Milligan, G., 2005. Geomorphology for Engineers, Whittles Publishing.\r 7) Selby, M. J., 1993. Hillslope Materials and Processes. Oxford University Press, USA.\r 8) Bierman, P. R. & Montgomery, D. R., 2014. Key Concepts in Geomorphology. W.H. Freeman and Company Publishers.\r 9) Anderson, R. The little book of Geomorphology: Exercising the Principle of Conservation. http://instaar.colorado.edu/~andersrs/The_little_book_010708_web.pdf", "terms": {"2020-21 Term 1": {"--LEC (7743)": {"startTimes": ["12:30", "12:30"], "endTimes": ["14:15", "13:15"], "days": [1, 3], "locations": ["Science Centre 331", "Science Centre 331"], "instructors": ["Dr. TAM Pui Yuk, \n\rMr. LAW Chun Hei, \n\rProfessor NG Wai Pan, \n\rProfessor TANG Lai Kwan Denise", "Dr. TAM Pui Yuk, \n\rMr. LAW Chun Hei, \n\rProfessor NG Wai Pan, \n\rProfessor TANG Lai Kwan Denise"]}, "-L01-LAB (7744)": {"startTimes": ["13:30"], "endTimes": ["14:15"], "days": [3], "locations": ["Science Centre 331"], "instructors": ["Dr. TAM Pui Yuk, \n\rMr. LAW Chun Hei, \n\rProfessor NG Wai Pan, \n\rProfessor TANG Lai Kwan Denise"]}}}, "assessments": {"Essay test or exam": "40", "Fieldwork or field study": "10", "Homework or assignment": "35", "Report": "15"}}, {"code": "4140", "title": "Seismology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-tripLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Pre-requisite: ESSC3010 or ESSC3120.", "description": "This course focuses on the concepts and theory of elastic wave propagation and physics of earthquake. The topics covered include the Earth’s internal structure, material elasticity, travel time tomography, seismic ray theory, ray tracing, and earthquake source parameter. Methods and field practice of seismological survey will also be introduced.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4160", "title": "Marine Geology and Geophysics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-tripLectureProjectInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Pre-requisite: ESSC3010 or ESSC3120 or ESSC4010.", "description": "This course focuses on the concepts and theory of marine geology and geophysics. Marine geology is distinct from that of continent and is the important foundation to launch Plate Tectonics, the modern unified theory of the Earth. In this course, major components of marine geological settings such as mid-ocean ridges, transform faults, subduction zones, oceanic lithosphere, and etc. will be introduced and discussed in details. Methods of geophysical survey will also be introduced. Field experiments of scientific instruments such as Ocean Bottom Seismometers, marine magnetometer and gravimeter will be conducted. A geological field trip will also be included. This course will be jointly offered with Ocean College, Zhejiang University, as an initiative to develop ocean sciences at CUHK.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4210", "title": "Land-Atmosphere Interactions and Boundary-Layer Meteorology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Pre-requisite: ESSC2020 or ESSC3200 or permission of instructor.", "description": "This course introduces the physical, chemical and biological processes governing the exchange of energy, momentum, water and other chemical materials between the atmosphere and land surface, including a formal introduction into boundary-layer meteorology. Topics covered include the basic equations and concepts of heat, momentum and mass conservation and transfer at the land-atmosphere interface; soil physics and hydrometeorology; temperature, humidity and wind distribution in the atmospheric boundary layer; theories and observations of turbulence; boundary layer dynamics; biometeorology and ecophysiology of land plants; canopy and ecosystem exchange; and land use change and urbanization. Applications to weather phenomena, air pollution, forestry, agriculture and ecosystem management will be emphasized throughout.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4220", "title": "Tropical Meteorology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Pre-requisite: ESSC3200.", "description": "This course introduces the phenomena and motions in the tropical atmosphere. The topics covered include the role of the tropics in the global energy and momentum balance, ITCZ, subtropical high, upper-level anticyclones, weather and climate phenomena including meso-scale convective systems, tropical waves, the Hadley and the Walker circulation, El Nino-Southern Oscillation, tropical cyclones, Madden Julian Oscillation, and monsoons.", "outcome": "At the completion of this course, the students will be able to 1) Gain the knowledge of various tropical atmospheric motions, 2) Understand physical processes in the tropical atmosphere; and 3) Apply knowledge to understand tropical climate variability. The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": "• Radiative and convection: Radiative Processes in the Tropics, Surface Energy Balance, Top of the Atmosphere Net Radiation Fluxes, Dry and Moist Stability, Moist Convection\r • General circulation in the tropics: Observed zonally averaged Tropical circulation, Theory of the Hadley Cell, Zonally asymmetric circulation features, seasonal variations, diurnal cycle, Observed aspects of the Intertropical Convergence Zone (ITCZ), ITCZ theory, Gill model, Heat lows\r • Monsoons: Deﬁnition, Differential Heating and the Monsoon, Key Elements of the Asian Summer and Winter Monsoon , Onset and Withdrawal, Breaks in the Indian Monsoon\r • El Nino and Southern Oscillation (ENSO): Observational aspect, air-sea interaction, teleconnection, ENSO modeling\r •Madden Julian Oscillation (MJO): Observational aspect, Theory of MJO, Westerly wind bursts, Connection with ENSO\r • Tropical Waves and Tropical Depressions (TD): Matsuno wave theory, convective coupled equatorial waves, easterly waves and TD-type disturbances, relationship with Tropical Cyclones (TC) genesis\r • TC: Structure, Genesis, dynamics of TC movement, and intensiﬁcation, modeling and forecasting\r • Tropical Squall Lines and Mesoscale Convective Systems (MCS): Observations of MCS and squall lines, dynamical aspects, Organization of Convection", "required_readings": "Krishnamurti, T.N., Stefanova, Lydia, Misra, Vasubandhu, 2013: Tropical Meteorology- An Introduction. Springer.", "recommended_readings": "Hastenrath, S., 1991: Climate Dynamics of the Tropics. Updated Edition from Climate and Circulation of the Tropics. Springer, Kluwer Academic Publishers.\r Wang, Bing, 2006: The Asian Monsoon. Springer Praxis Books (Environmental Sciences).", "terms": {"2020-21 Term 2": {"--LEC (5311)": {"startTimes": ["13:30", "9:30"], "endTimes": ["15:15", "10:15"], "days": [2, 4], "locations": ["William M W Mong Eng Bldg 407", "Yasumoto Int'l Acad Park LT6"], "instructors": ["Dr. AU-YEUNG Yee Man, \n\rProfessor TAM Chi Yung Francis", "Dr. AU-YEUNG Yee Man, \n\rProfessor TAM Chi Yung Francis"]}}}, "assessments": {"Homework or assignment": "30", "Project": "30", "Short answer test or exam": "40"}}, {"code": "4230", "title": "Introduction to the Physics and Chemistry of Aerosol", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Pre-requisite: ESSC2020 or permission of instructor.", "description": "Fundamentals of aerosol physics and chemistry; condensation and evaporation; thermodynamics; nucleation, diffusion, coagulation; radiative, hygroscopic properties, and cloud formation potential of aerosols; aerosol phase oxidation reactions; heterogeneous oxidative processes.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4240", "title": "Air Pollution Science and Engineering", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "", "description": "This course will cover a variety of topics related to air pollution science and engineering. Topics include: indoor and outdoor air quality (including particulate matters (PM) and gases pollutants); air pollution measurement and statistics; air quality meteorology and dispersion models; principles and challenges of air pollution control and measurement.", "outcome": "- To understand the physical and chemical principles governing the sources, formation, transport, transformation, health impacts of air pollutants in both indoor and outdoor environments. - To understand the working principles of various air pollution monitoring instrumentation.  - To apply statistical tools and mathematical models to solve air pollutant dispersion problems.  - To apply various air pollution engineering approaches to solve air pollution issues. - To gain a better understanding of current air pollution problems and control challenges.", "syllabus": "Background and Review  Topic 1 Physics of Particulate Matter (PM) (or Aerosols) and Properties of Gases  Topic 2 Transport and Motion of PM in Fluid  Topic 3 Size Statistics of PM  PM and Gases Measurement Techniques  Topic 4 Inertial Impactors  Topic 5 Light Scattering Fundamentals and Optical Techniques of PM  Topic 6 Filtration Methods  Topic 7 Nanoparticle Measurement using Electrical Techniques  Topic 8 Gas Phase Species Measurement Techniques  Field Measurements  Topic 9 Atmospheric PM Measurement  Topic 10 Indoor PM Measurement  Topic 11 Biological Particles Detection and Characterization  Topic 12 Chemical Characterization and Detection of PM  Topic 13 Dispersion Models  Topic 14 Environmental and Health Impacts of PM  Air Quality Engineering and Control  Topic 15 - Removal of PM from Gas Streams  - Settling Chambers  - Cyclone Separators  - Electrostatic Precipitation  - Wet Collectors  Topic 16 - Removal of Gaseous Pollutants  - Absorption of Gases by Liquid  - Adsorption of Gases on Solid  Lab Demonstration  1. Submicrometer Particle Generation and Measurement  2. Micrometer Particle Generation and Measurement  3. Condensation Particle Counter  4. Personal PM Sampling", "required_readings": "1. J.H. Seinfeld and S.N. Pandis: Atmospheric Chemistry and Physics, From Air Pollution to Climate Change,Wiley-Interscience, 1998 (2nd edition: 2006)   2. W.C. Hinds, Aerosol Technology, Wiley-Interscience, 1999", "recommended_readings": "Nil", "terms": {"2020-21 Term 2": {"--LEC (7989)": {"startTimes": ["15:30"], "endTimes": ["18:15"], "days": [2], "locations": ["Y.C. Liang Hall 104"], "instructors": ["Professor CHAN Man Nin"]}, "-T01-TUT (8998)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor CHAN Man Nin"]}}}, "assessments": {"Essay test or exam": "40", "Homework or assignment": "40", "Presentation": "20"}}, {"code": "4250", "title": "Advanced Topics in Atmospheric Dynamics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Pre-requisite: ESSC3200 or permission of instructor.", "description": "This course introduces the basics of geophysical fluid dynamics. Topics include fundamental governing equations, scale analyses of geophysical flows in the Earth's atmosphere and ocean, filtered models, waves, vorticity, quasi-geostrophic theory, bartropic and baroclinic instabilities.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4260", "title": "Urban Climatology", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLecture", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Pre-requisite: ESSC2020.", "description": "Human modifications to the surface of the Earth during urbanisation change most of the elements of climate and weather in the urban atmosphere. This course introduces the fundamentals of urban climatology and the processes caused by the changes in the surface environment, particularly focusing on how urban structures interact with the atmospheric environment. Numerical modelling and field techniques are introduced to understand the underlying processes resulting urban climatic phenomena. It also examines the implications on human comfort and climate-sensitive urban planning and design, as well as the relationship between cities and climate change.", "outcome": "Students are expected to attain the knowledge about how urbanisation affects the local climate and the underlying processes. They should also be able to:  1. describe the scientific processes and explain the theories of how urbanisation alters local climate;  2. explain the physical mechanisms governing the formation of urban climatic phenomena;  3. conduct numerical modelling and field experiments of urban climatic processes; and  4. understand the practical implications of urban climatology on climate-sensitive urban planning and design.", "syllabus": "Topic and Content/Fundamental concept  Week 1 Lecture 1: Introduction to urbanisation and urban climate   Week 2 Lecture 2: Fundamentals of urban climatology I  • Urban boundary layer (UBL) and urban canopy layer (UCL)  • Urban climatic processes within UBL and UCL   Week 3 Lecture 3: Fundamentals of urban climatology II  • Heterogeneity of urban surface environment  • Atmospheric turbulence and exchange of energy and water   Week 4 Lecture 4: Urban energy balance I  • Anthropogenic heat flux  • Urban radiation balance   Week 5 Lecture 5: Urban energy balance II  • Urban canopy energy balance  • Urban neighbourhood energy balance   Week 6 Lab 1: Urban Multi-scale Environmental Predictor (UMEP): An integrated tool for city-based climate services   Week 7 Lecture 6: Urban heat islands – History and physical basis  • Detection of urban heat island: Luke Howard in 1810s  • Determinants of heat island magnitude and structure  • Diversity of urban heat island   Week 8 Lecture 7: Monitoring urban heat islands  • Ground-level meteorological measurements  • Mobile measurements  • Land surface temperature   Week 9 Lecture 8: Urban heat islands – Examples of different climatic regions  • Tropical climates: Singapore and India  • Sub-tropical climates: Hong Kong and South Africa  • Mediterranean climates: Greece and Spain  • High-latitude climates: Sweden and the United Kingdom   Week 10 Lecture 9: Urban climatic mapping  • Urban climatic maps – History, development, and applications  • Local climatic zones – Classification of surface environment   Week 11 Lecture 10: Application of urban climatology in climate-sensitive urban planning and design  • Why urban planning and design matters?  • Air Ventilation Assessment System  • Sustainable Building Design Guidelines   Week 12 Lab 2: Mapping of local climatic zones using WUDAPT methodology   Week 13 Lecture 11: Cities and climate change", "required_readings": "Nil", "recommended_readings": "1. Arnfield AJ, 2003. Two decades of urban climate research: a review of turbulence, exchanges of energy and water, and the urban heat island. International Journal of Climatology 23(1): 1-26. 2. Landsberg HE, 1981. The Urban Climate. Academic Press, New York. 3. Oke TR, 2015. Boundary-layer Climates (2nd Edition). Routledge, United Kingdom. 4. Santamouris M, 2001. Energy and Climate in the Urban Built Environment. Routledge, United Kingdom.", "terms": {"2020-21 Term 1": {"--LEC (7339)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [2], "locations": ["Lady Shaw Bldg LT5"], "instructors": ["Professor LAU Ka Lun"]}}}, "assessments": {"Essay test or exam": "50", "Lab reports": "20", "Project": "30"}}, {"code": "4510", "title": "Statistical Methods and Data Analysis for Earth System Science", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Not for students who have taken ESGS4004. Pre-requisite: STAT1011 or 1012 or permission of instructor.", "description": "This course covers the theoretical basis and practical applications of data analysis relevant for earth system science. This course aims to introduce students to Earth and environmental data manipulation, from sampling, reading and writing, to statistical analysis and parameter estimation, to time series analysis, to plotting and visualization. Topics include: digital signal processing, sampling techniques; probability distributions; hypothesis testing; correlation analysis; linear and nonlinear regression; statistical forecasting, harmonic analysis and spectral analysis; principle component analysis; and geostatistics. Tutorials will be based on real geophysical examples including remote sensing and in situ observations, as well as model data.\r", "outcome": "Students will become knowledgeable about the acquisition, pre-processing and analysis of geophysical and environmental data, including remote sensing, in situ observation and model data. Students will acquire knowledge on techniques for data processing, including visualization methods and statistical analysis, and on the applications of these data and tools to geophysical and environmental problems. The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principles, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students can also acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": "Topics \r Digital signal processing, sampling techniques;  Probability distributions;  Hypothesis testing;  Correlation analysis;  Linear and nonlinear regression;  Statistical forecasting, harmonic analysis and spectral analysis;  Principle component analysis; and \r Geostatistics.", "required_readings": "Nil", "recommended_readings": "Dalgaard, P., Introductory Statistics with R, 2nd edition, Springer, 2008.\r Field, A., J. Miles, and Z. Field, Discovering Statistics Using R, SAGE, 2012.\r Wilks, D.S., Statistical Methods in the Atmospheric Sciences, 3rd edition, AP, 2011.\r Oppenheim, A. V. and R. W. Schafer, Discrete-Time Signal Processing, Prentice, 3rd edition, 2010.\r Brigham, O. E., The fast Fourier transform and its applications, Prentice Hall, 1988.", "terms": {"2020-21 Term 2": {"--LEC (5153)": {"startTimes": ["16:30", "16:30"], "endTimes": ["18:15", "17:15"], "days": [1, 3], "locations": ["Humanities Building 11", "Humanities Building 11"], "instructors": ["Dr. AU-YEUNG Yee Man, \n\rProfessor TAN Yen Joe", "Dr. AU-YEUNG Yee Man, \n\rProfessor TAN Yen Joe"]}, "-T01-TUT (5154)": {"startTimes": ["17:30"], "endTimes": ["18:15"], "days": [3], "locations": ["Humanities Building 11"], "instructors": ["Dr. AU-YEUNG Yee Man, \n\rProfessor TAN Yen Joe"]}}}, "assessments": {"Essay test or exam": "60", "Lab reports": "40"}}, {"code": "4520", "title": "Numerical Methods and Modeling for Earth System Science", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Pre-requisite: MATH1010 or 1030 or 1520.", "description": "This course covers the principles of numerical methods and modeling relevant for earth system science applications. Topics include: optimization; interpolation; finite differencing; numerical solutions to ordinary and partial differential equations; programming numerical models; filtered models; boundary conditions; subgrid-scale processes; data assimilation; applications in earthquake, climate, air quality, weather forecast and groundwater models. Python will be used throughout the course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4530", "title": "Geospatial Information Management and Analysis Methods", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "", "description": "Students will be introduced to the ideas of natural geospatial information and models, as well as the methods of geospatial information acquisition, management, and analysis.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4540", "title": "Remote Sensing – Principles and Applications", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LaboratoryLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Not for students who have taken ESGS4002. Pre-requisite: (ESSC2010 and 2020) and (MATH1010 or 1030 or 1510 or 1520) and (PHYS1001 or 1002 or 1111 or 1113), or permission of instructor.", "description": "Remote sensing observations are critical for monitoring regional and global changes, determining spatial and temporal variability of the Earth System, and addressing fundamental global issues. This course introduces the basic physical principles of remote sensing, including electromagnetic waves and radiation, optical, microwave, and non-imaging remote sensing. It also presents key concepts and examples on remote sensing applications in Earth system science (such as atmosphere, lithosphere, hydrosphere, cryosphere) and global changes. This course also provides computer-based lab exercises that facilitate the understanding of remote sensing principles and the processing of remote sensing data.\r", "outcome": "This course will contribute to understanding of basic concepts and principles of remote sensing at optical and microwave frequencies from airborne and spaceborne platforms. With the help from laboratory analysis and case studies, remote sensing applications in Earth system science can be further understood. The students will develop: 1) the ability to evaluate an issue critically based on evidence and scientific principle, 2) to acquire knowledge effectively by self-study and using information technology, and to work independently, 3) to work effectively in a team, and 4) to present information in a clear, concise and logical manner. The students also can acquire a responsible attitude in study and work, and have motivation for life-long learning.", "syllabus": "", "required_readings": "Emery W. and Camps A., Introduction to Satellite Remote Sensing, 1st edition. Elsevier, 2017. \r Physical principles of remote sensing, 3rd edition, W.G. Rees, Cambridge University Press, 2013", "recommended_readings": "Sabins, F., Remote Sensing: Principles and Interpretation, 3rd edition, Waveland Pr Inc;, 2007.\r Mather, Paul M., Computer processing of Remotely-Sensed Images, Wiley, 2011.", "terms": {"2020-21 Term 1": {"--LEC (7362)": {"startTimes": ["14:30", "14:30"], "endTimes": ["16:15", "15:15"], "days": [1, 3], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Professor LIU Lin", "Professor LIU Lin"]}, "-T01-TUT (7447)": {"startTimes": ["15:30"], "endTimes": ["16:15"], "days": [3], "locations": ["William M W Mong Eng Bldg LT"], "instructors": ["Professor LIU Lin"]}}}, "assessments": {"Lab reports": "70", "Presentation": "5", "Short answer test or exam": "25"}}, {"code": "4810", "title": "Senior Project I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ProjectInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Not for students who have taken PHYS4610. Pre-requisite: Permission of project advisor.", "description": "A project in earth system science, either focusing more on research or on reviewing the literature. The project may be combined with ESSC4820 to form a more substantial project. Students should seek prior permission of project advisor before enrolment.\r", "outcome": "1. To identify key factors and apply basic concepts and principles in studying a problem in a project learning setting\r 2. To apply appropriate experimental, observational and/or theoretical techniques in studying a problem in a project learning setting\r 3. To present the findings of the project in written report and oral presentation in a clear, concise, and logical manner\r 4. To be self-motivated in learning new ideas and skills\r 5. To self-monitor, evaluate the progress critically, and accomplish the project goals on schedule", "syllabus": "Please refer to course description.", "required_readings": "", "recommended_readings": "Supervisor will provide reading materials, depending on the topic of the project.", "terms": {"2020-21 Term 1": {"-J01-PRJ (5049)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. AU-YEUNG Yee Man, \n\rDr. TAM Pui Yuk, \n\rProfessor CHAN Man Nin, \n\rProfessor LIU Lin, \n\rProfessor TAI Pui Kuen Amos, \n\rProfessor TAM Chi Yung Francis, \n\rProfessor TAN Yen Joe, \n\rProfessor YANG Hongfeng"]}}}, "assessments": {"Essays": "50", "Presentation": "50"}}, {"code": "4820", "title": "Senior Project II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ProjectInteractive Tutorial", "campus": "Main Campus", "academic_group": "Earth System Science Pgm Comm", "requirements": "Not for students who have taken PHYS4620. Pre-requisite: Permission of project advisor.", "description": "A project in earth system science, either focusing more on research or on reviewing the literature. The project may be combined with ESSC4810 to form a more substantial project. Students should seek prior permission of project advisor before enrolment.\r", "outcome": "1. To identify key factors and apply basic concepts and principles in studying a problem in a project learning setting\r 2. To apply appropriate experimental, observational and/or theoretical techniques in studying a problem in a project learning setting\r 3. To present the findings of the project in written form and orally in a clear, concise, and logical manner\r 4. To be self-motivated in learning new ideas and skills\r 5. To self-monitor, evaluate the progress critically, and accomplish the project goals on schedule", "syllabus": "Please refer to course description.", "required_readings": "", "recommended_readings": "Supervisor will provide reading materials, depending on the topic of the project.", "terms": {"2020-21 Term 1": {"-J01-PRJ (7346)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. AU-YEUNG Yee Man"]}, "-T01-TUT (7347)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. AU-YEUNG Yee Man"]}}, "2020-21 Term 2": {"-J01-PRJ (6316)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. AU-YEUNG Yee Man, \n\rDr. TAM Pui Yuk, \n\rProfessor CHAN Man Nin, \n\rProfessor LAI Yuk Fo, \n\rProfessor LIU Lin, \n\rProfessor TAI Pui Kuen Amos, \n\rProfessor TAM Chi Yung Francis, \n\rProfessor TAN Yen Joe, \n\rProfessor YANG Hongfeng"]}}}, "assessments": {"Essays": "60", "Presentation": "40"}}]