[{"code": "5001", "title": "Theories of Knowledge and Critical Thinking", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc General Education; or MSSc Public Policy", "description": "This course focuses various historical and contemporary approaches to the question of what knowledge is, what makes a belief become true, and how beliefs are justified. Philosophical analysis and critical thinking skills are also introduced. Students will learn to apply different concepts and theories to different context of life.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5101", "title": "Personal Growth and Lifespan Development", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc General Education", "description": "The goal of this course is to provide a broad overview of lifespan development. Psychological aspects of physical, cognitive, and psychosocial development will be considered in relation to development from infancy into old age. Students will have a basic understanding of major psychological theories as well as important psychosocial factors affecting human development across the lifespan.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5102", "title": "Interpersonal Communication", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc General Education", "description": "The course aims to cover both conceptual and practical issues in interpersonal communication. Both verbal and non-verbal communication modes will be discussed in two major domains: interpersonal relationships and in the workplace. In each of these domains, learners will be exposed to research on how communication varies as a function of factors such as gender, culture, and social status, as well as learning how to examine their own and others’ communication styles.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5302", "title": "Chinese Society", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc General Education", "description": "This course gives an overview of the post-1949 Chinese society, focusing on social changes since 1978. We will explore the basic institutional make-up of Chinese society. The different aspects of social change and the impact of post-Mao reforms on Chinese society. Changes in China's state-society relationship will be a theme weaving through the different topics discussed.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5401", "title": "Understanding Globalization", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc General Education", "description": "This is an advanced course that introduces key concepts, players, theories, and debates in globalization and helps students form a habit of caring and thinking about global issues in the long run. While familiarizing students with various aspects of globalization, e.g., economic, social, cultural, political, technology, and demographic, this course puts the current wave of globalization back into the overall human history, large spectrum of time and space, in order to emphasizes critical reflections on the world’s globalizing economy, culture, and governance, aiming at strengthening students’ analytical ability to recognize and sort out the complex impact and consequence by a growing global economy, cultural convergence, and political integration. Meanwhile, the course encourages students to be better informed of non-Western cultures and countries, how people of the developing world have coped with globalization in their own ways, and why.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5501", "title": "Foundations of Public Health", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc General Education; or MSSc Public Policy", "description": "This course aims at providing students with the basic understanding of fundamental concepts, scopes and relevant issues of public health. A broad range of topics will be discussed in order to illustrate the multidisciplinary nature of public health, the various determinants affecting it, and its relevance to our daily life.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5502", "title": "Frontiers of Biomedical Science: From Cell to Public Health", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc General Education", "description": "This course introduces the basic principles of science and technology and their application in public health. The application is in the aspects of disease prevention, diagnosis and therapy and policy making. This course also discusses the science advancement and its associated bioethics in medical research and development, application and social impacts for formulation and implementation of public health policy.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5601", "title": "Energy and Society", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc General Education; or MSSc Public Policy", "description": "This course introduces the important relationship between energy and the society. The demands for more energy input as a result of human development and the cost effectiveness of energy will be discussed. The world population relies very much on fossil fuel as the major energy source has triggered the energy crisis in the next decade. It also examines the relationship among Energy, Environment and Economy. The impact of energy exploitation on the environment, the drive for scientific and technological development, and management of different energy resources will be conferred. The energy outlook in China and the social, environmental and economic impacts of energy crisis will also be discussed.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5602", "title": "Environment and Sustainable Development", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc General Education", "description": "Students will learn current environmental issues and the interrelationship between life and environment. Practising sustainability is an important target in environmental development. The roles and duties of different stakeholders in the sustainable development and environmental protection will be discussed. Emphasis will be placed on the current sustainable development issues in Hong Kong.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5701", "title": "Understanding the World through News", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc General Education", "description": "This course aims to help students better understand the world and gain general knowledge through analyzing the news media and news events. Through this course, students will learn to grasp the essence of current affairs at a glance, and to understand society at macro and micro levels as well as the mega-trends.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5703", "title": "Exploring the Cosmos", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc General Education", "description": "The Earth is just a tiny spot in the universe, from where human beings can only observe a small fraction of the universe. Nevertheless, scientists could explain various mysterious natural phenomena, reveal the relationship among them, and construct theories to infer the past and future of the universe! In this course, based on a series of debates on astronomical theories, we will discuss how scientists argued, developed and verified profound scientific theories in simple language. Discussion of the interaction between natural science, technology and the human civilization will also be emphasized. No specialized technical knowledge beyond the basic aptitudes of a university graduate is assumed.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5801", "title": "Public Speaking", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc Public Policy; or MSSc General Education", "description": "This course is designed to help students understand the theoretical aspects of the total speech communication process, acquire the ability to distinguish good speeches from bad ones, and learn the skills of designing and delivering a speech. The course is structured to consist four components: theory, observation, analysis and application.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5802", "title": "The ROAD to Creativity", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc General Education", "description": "The course is designed to inspire and nurture participants to challenge the status quo to emerge triumphant for being courageous, insightful, creative, and bold to take innovative risks. Students will also be coached to overcome fear and subdue anxiety with creativity.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5902", "title": "Philosophies of Life", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc General Education", "description": "This course provides a special way of learning philosophy, through which we open an alternative vision for contemplating the modern world we now live in. Philosophy helps us to ask for the basic thoughts and faiths deeply concealed in the phenomenon of our lives. Films will be used to supplement readings to illustrate some abstract and lofty philosophical theories on the meaning of life. We can also understand how philosophy could impact individual lives, society and culture.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5903", "title": "Arts Appreciation", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students of MSSc Programme in General Education", "description": "How can we appreciate an artwork? When viewing a painting, watching a film, or reading a literary work, one would wonder what it means and what makes it a work of art. If art is composed of form and content, one should try to understand the symbolic meaning that lies behind the verbal and visual expressions. Arts appreciation consists then of thinking about artworks not only from the sensuous experience of a pure and abstract kind, but also of understanding artworks on the basis of theories and concepts that are essential for the comprehension of their universal and temporal qualities. This course aims at providing the student with basic issues and methodologies for the purpose of appreciating artworks. On one hand, it investigates the major movements and theories of art. On the other hand, it looks into the aesthetic meanings that lie behind their forms and contents. It gives a general view, discusses and examines many important artworks that are taken from the cinema, literature, theatre, music and the fine arts.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5911", "title": "Topical Studies in General Education (I)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc General Education", "description": "This course provides in-depth analysis of important topics in general education. Examples of these topics include individual, social and cultural competences in the new age, relationships between individual and society, interactions between humans and nature as well as cultural heritages of human societies. The focus of the course may vary according to the area of expertise of the instructor and the interests of the class.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5912", "title": "Topical Studies in General Education (II)", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc General Education", "description": "This course provides in-depth analysis of important topics in general education. Examples of these topics include individual, social and cultural competences in the new age, relationships between individual and society, interactions between humans and nature as well as cultural heritages of human societies. The focus of the course may vary according to the area of expertise of the instructor and the interests of the class.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]