[{"code": "2000", "title": "GPS Leadership Workshop Series I", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "DiscussionWorkshop", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "FO - MBChB Major", "description": "This series of workshops centres on leadership in society. The course consists of five lectures conducted by guest speakers and followed by group discussions. Each lecture will start with a real-life example of social leadership of a guest speaker illustrating important concepts and traits of leadership. Small group discussions will be led by GPS mentors focus to elaborate the social leadership concepts and prepare GPS students to become social leaders.", "outcome": "By the end of the course, students should be able to: master the basic concepts and traits of leadership; understand the important roles of social medical leaders", "syllabus": " Introduction to medical leadership The beginning of social leadership Network and leadership Leader as an outlier Building a team", "required_readings": "NA", "recommended_readings": "Suggested by speakers", "terms": {"2020-21 Acad Year (Medicine)": {"-W01-WKS (1018)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}}, "assessments": {"Attendance": "50", "Essays": "50"}}, {"code": "3000", "title": "GPS Leadership Workshop Series IIA", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "Workshop", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "FO - MBChB Major", "description": "This series of workshops in seminar format focuses on providing students the general concepts of medical leadership and developing them the skills and capacity that are essential for leadership. The course covers a broad range of topics including mentoring, servant leadership, risk management in healthcare organization, basic concepts in positive psychology and partnership in public health. Guest speakers are invited to provide stimulating lectures and discussion on different themes.", "outcome": "By the end of this course, students should be able to: understand the general concepts of medical leadership have a deeper understanding in mentoring, servant leadership, risk management in healthcare organization, positive psychology and partnership in public health master the skills that are essential for medical leadership", "syllabus": "1. Mentoring2. Servant leadership3. Risk management in healthcare setting4. Positive psychology5. Partnership in public health", "required_readings": "NA", "recommended_readings": "Suggested by Speakers", "terms": {"2020-21 Acad Year (Medicine)": {"-W01-WKS (1008)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}}}, {"code": "3100", "title": "GPS Project", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "Project", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "FO - MBChB Major", "description": "Under close supervision of a project mentor, GPS students must complete a GPS project within the period from Year Three until Year Five. Students are required to submit an end-of-project report by the end of Year Five.Students are required to submit an Interim Report by the end of Year Four. With the satisfactory performance of the report and the endorsement by the Year Four Coordinator, students are eligible for the exemption from course SSMU3000 Selected Study Modules.Students are expected to participate actively in a project in one of the following fields:• basic, clinical or translational research• health promotion, event organization related to humanitarian or social services in developing countries or for underprivileged groups in Hong Kong • social or clinical services programmeThe theme of GPS Project should strongly relate and be complementary to the core MBChB curriculum.", "outcome": "Depending on the nature of the project, students should be able to perform the following tasks by the end of the course: lead a project in the capacity of principal investigator or key co-investigator make significant intellectual contribution to the study design, protocol writing and data interpretation do statistical analysis and interpret data write report serve as key organizer in health promotion or health services project make presentation in conference display the skills as a medical leader and team player", "syllabus": " Orientation and basic research training Objective development, study design and conduct of the study Collection of data, analysis and interpretation of results Report writing and presentation", "required_readings": "NA", "recommended_readings": "NA", "terms": {"2020-21 Acad Year (Medicine)": {"-J01-PRJ (1047)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}}, "assessments": {"Others": "25", "Report": "75"}}, {"code": "4000", "title": "GPS Leadership Workshop Series IIB", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "Workshop", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "FO - MBChB Major", "description": "This series of workshops in seminar format focuses in providing students the general concepts of medical leadership and developing them the skills and capacity that are essential for team management. Important concepts and skills of public communication, conflict management and mediation are illustrated. Guest speakers are invited to provide stimulating lectures and discussion on different themes.", "outcome": "By the end of this course, students should be able to appreciate the importance of conflict management and mediation think critically and act emphatically when confronted with complaints and conflicts apply the skills in handling complaints and resolving conflicts", "syllabus": " Complaints management Mediation for healthcare professionals Conflict management in healthcare setting Negotiation and training in healthcare", "required_readings": "NA", "recommended_readings": "Suggested by Speakers.", "terms": {"2020-21 Acad Year (Medicine)": {"-W01-WKS (1019)": {"startTimes": ["12:00"], "endTimes": ["12:00"], "days": [1], "locations": ["No Room Required"], "instructors": ["Staff"]}}}, "assessments": {"Attendance": "50", "Essays": "50"}}, {"code": "4100", "title": "GPS Internship", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "Practicum", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "FO - MBChB Major", "description": "The course aims to enrich the experiential learning in research and medical leadership of GPS students, who are encouraged to look for internship opportunities based on their own interests and schedule. Students will have the opportunity to spend 4 to 6 weeks at a local or overseas institution that is either affiliated or not with CUHK through collaborative agreement.The internship is diversified, including summer exchange programme relevant to leadership, attachment to a unit of clinical services or research, basic or translational research, public health, healthcare services provider or industry, pharmaceutical or medical device industry, governmental organization or non-governmental organization, or any attachment relates to the student’s GPS Project. GPS Internship is arranged the latest by the end of Year Five.Students should seek endorsement by the GPS Director by providing details of the proposed internship to the Faculty and Planning Office at least 6 weeks prior to the commencement of the internship. Students are required to complete at least one GPS internship latest by Year Five, and submit an Internship Report afterwards. Once the requirement of GPS Internship is fulfilled, students can submit reports on an optional basis from the second GPS Internship onwards.GPS students who fulfill the requirement of GPS Internship can opt for exemption from course MEDU4410 Clinical Elective which is taken at the end of Year Five.", "outcome": "By the end of the course, students should develop a holistic perspective in the different roles of a physician leader in different settings through experiential learning to meet the ever-changing needs in the society and the profession.", "syllabus": "1. Orientation and basic research training2. Objective development, study design and conduct of the study3. Collection of data, analysis and interpretation of results4. Report writing and presentation", "required_readings": "NA", "recommended_readings": "Suggested by internship supervisor.", "terms": {"2020-21 Acad Year (Medicine)": {"-P01-PRA (1020)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}}, "assessments": {"Others": "50", "Report": "50"}}, {"code": "4200", "title": "GPS Leadership Workshop Series III", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "Workshop", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "FO - MBChB Major", "description": "This series of workshops focuses on leadership in healthcare profession. Basic concepts and real-life examples of various types of medical leadership are illustrated. The course covers broadly stress management, healthcare policy and administration, multidisciplinary team management and academic research leadership.\r", "outcome": "By the end of this course, students should be able to:\r 1. understand the general concepts of medical leadership\r 2. master the skills that are essential for medical leadership", "syllabus": "Organizational leadership in public hospital, public health, research institute, medical education and clinics.", "required_readings": "NA", "recommended_readings": "Suggested by Speakers", "terms": {"2020-21 Acad Year (Medicine)": {"-W01-WKS (1003)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Prince of Wales Hospital"], "instructors": ["Staff"]}}}, "assessments": {"Essays": "50", "Others": "50"}}]