[{"code": "5101", "title": "Special Topics in China Housing", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc Housing Studies", "description": "Course Description:This course is designed to introduce the development and reform of China housing policies, and basic theories, practical approaches and key supporting technologies regarding these policies. It focuses on how these policies in housing have shifted over time, and examines the factors which have driven this. Hot topic, such as senior housing, will also be introduced. The lectures will provide students a critical understanding of China housing. Experts from government, universities and companies will be invited as guest lecture.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5103", "title": "Comparative Study of International Housing Policy", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc Housing Studies", "description": "This course aims to provide students with an opportunity to analyze the role of the state and the market in meeting housing needs from both an international and comparative perspective. Students are expected to integrate conceptual and theoretical frameworks with major housing policies in the analysis.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5104", "title": "Housing and Community: Development, Management and Socio-Ecobalance", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc Housing Studies", "description": "Course Description:This course examines the activities that constitute housing and community from development, management, towards socio-ecobalance. In these units, students will learn to assess the effectiveness of different approaches to housing and community management tasks in the light of legislation, good practice and research evidence in the development process. The course further explores the contribution of housing and community management to wider government aims including community cohesion, social inclusion and neighbourhood regeneration. Further, the environmental impacts associated with all the stages in the life-cycle of a house will be illuminated. Global practices and models will be looked at and assessed for application in China. The context of housing and community management and the changing roles of actors within it are identified and the future of housing and community development is discussed.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5106", "title": "Housing Design and Development", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc Housing Studies", "description": "Course Description:This course is to evaluate what is meant by sustainable housing development and explore the process by which it is most likely to be delivered. The course therefore seeks to integrate consideration of a range of housing design and development issues, with an equal emphasis given to private and social housing. Another focal point will be the history of housing development and its social meaning. Evaluation systems for sustainable housing in China and Hong Kong will be introduced in this course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5107", "title": "International Schools Project in Housing Studies", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc Housing Studies", "description": "Course Description:This course is intended to consolidate students' learning and to enable them to apply the knowledge they accumulated throughout the programme. Within this course students will do a work on urban housing, exploring the socio-economic issues and environmental matters. Students will conduct a focused and practical study on current issues and important developments of sustainable urbanism in an international and inter-disciplinary context. Participants may go on a two-week overseas study trip led by a teacher, attending seminars and site visits hosted by distinguished overseas planning or design schools or institutions. Within this trip, teamwork and team spirit will be forced by elaborating the project in a multidisciplinary group of students; a situation very close to the operations and working environment of their future field of work.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5201", "title": "Sustainable Development and Construction", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc Housing Studies", "description": "Course Description:This course introduces the basic theories, practical approaches and key supporting methodologies for achieving sustainable planning and housing development. Learning will be conducted by way of formal lectures, development case studies and field trips. The “three pillars” of sustainable development --- social, economical and environmental considerations are emphasized. Global practice of sustainable mass production construction methodologies will be looked at. This course offers basic introduction to the methodological framework of the professional paradigm which the students will eventually operate in their planning and housing project management careers.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5202", "title": "Building Performance Simulation for Sustainable Housing Design", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc Housing Studies", "description": "Course Description:This course will introduce building performance simulation theories and technologies dealing with housing related issues including urban climatology, urban air ventilation, daylight provision, solar heat gain study, and road traffic noise impact. Furthermore, the lectures will focus on the urban processes involved in the development and redevelopment of cities in a sustainable mode. The lectures and tutorials will provide students with necessary scientific tools and assessment abilities to support the decision-making on housing development in urban context.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5203", "title": "Housing Design and Construction Technology", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc Housing Studies", "description": "Course Description:This course will inform students the latest housing design and construction technology around the globe but will focus on their appropriate application in China with relevance in both urban and rural contexts. Existing environmental friendly design methods will be introduced and analysed and the knowledge about Life-cycle assessment will be improved. Mass production, off site manufacturing, quality control and low carbon design of buildings issues will be looked at specifically. Sustainable duty will be at the forefront of the course curriculum.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5204", "title": "Project Planning and Management", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc Housing Studies", "description": "This course aims to equip students with a comparative understanding of different theoretical approaches to project planning and management for housing development, which they can apply to real-world cases.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5206", "title": "Green Building (GB) Technologies and Certification Schemes", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc in Housing Studies and MSc Advanced Environmental Planning Technologies", "description": "Course Description:The course contents integrate the Green Building (GB) essentials, technical knowledge, assessment criteria and case studies regarding the GB development. It helps to develop students' critical thinking and judgment in understanding various major aspects covered by the China 3-Star Green Building Evaluation Standard (GB 50378) issued by Ministry of Housing and Urban-Rural Development (MOHURD), and also the international rating system of Leadership in Energy & Environmental Design (LEED) developed by the U.S. Green Building Council (USGBC). Within the course, the students will get in-depth information about case studies in order to discover the effectiveness of Green Buildings.The lectures and tutorials will provide students with the necessary technical knowledge and assessment abilities to review and evaluate the performance of GB and the comparison on relevant GB certification schemes.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6100", "title": "Independent Research (Dissertation)", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Social Science", "requirements": "For students in MSSc Housing Studies", "description": "Course DescriptionThis course is devised as a consummation of the entire programme study. Students are required to demonstrate their learning and apply their knowledge and advanced technological skills acquired throughout the programme in this final dissertation/planning design project of a subject of their own choice. Research should be conducted on selected topics in housing studies or this could be an design project under the supervision and guidance of a supervisor. Students should select a format of project according to their own capability and interest.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]