[{"code": "1000", "title": "Italian I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Not for students who have taken ITAL2000,2001,2050(1010),3000,3001,3002,3050 or 3051", "description": "As the first in a series of six language courses, this course invites students without prior knowledge of Italian to explore the basic features of the Italian language. Supported by audiovisual aids, students will receive intensive practice in spoken and written Italian through interactive class work, homework and online exercises. They will become familiar with the basic concepts of Italian grammar and learn how to interact in some simple everyday situations.\r", "outcome": "The students at the end of the course will be able to have a correct pronunciation of the language, getting familiar with its different features. They will be able to have a basic conversation and oral understanding about various everyday situations, such as introducing oneself and others, greeting, asking and giving information, etc. The same skills will be developed for the written language (reading and writing), and the course will also transmit to the learners a good knowledge of the Italian culture, and a basic knowledge of the country and its lifestyle.", "syllabus": "    ITAL1000      ITAL 1000 Date Classes suspended Content     Week 1 10 Sept  - 15 Sept  Introduction, Lezione 1: Pronunciation, introducing yourself and other people, greetings   Week 2 17 Sept -  22 Sept  Lezione 1: Gender issue, definite and indefinite articles, interrogative pronouns, asking simple questions   Week 3 24 Sept - 29 Sept  Lezione 1 : Introducing verbs and conjugations, getting started with conjugations   Week 4 01 Oct -  06 Oct Tuesday, 2 Oct. due to public holiday Lezione 1: Finding out where someone is from and how old they are, Counting numbers, some nationalities. Movie  activity watching “The Tiger and the Snow”   Week 5 08 Oct - 13  Oct  Lezione 1:  Plurals of  nouns,  finding out what things are called   Week 6 15 Oct - 20 Oct  Lezione1: Some irregular verbs, some professions   Week 7 22 Oct - 27 Oct Tuesday, 23 Oct. due to public holiday Lezione 1: Verbs “to go” “to do” “to be” “to have” “to be called” “to take” , “to come” “to be feeling”   Week 8 29 Oct -  03 Nov  Lezione 2: Order in a restaurant, “drinks and food” “I would like”  What is the time?  Movie activity watching “Life is beautiful”   Week 9 05 Nov - 10 Nov  Lezione 2 :Basic prepositions: “a” “in” “con”. write a postcard.  More practice on the rule that the adjective and nouns are in the same gender. Movie “Life is beautiful” . irregular verb “to go” “to like” .How to attract someone’s attention.   Week 10 12 Nov - 17 Nov        Lezione 3: How to book a room in a hotel, ask  and give information. Some irregular plural of nouns in “co” and “go”. Movie activity watching “Il Divo”   Week 11 19 Nov - 24 Nov  Lezione 3: The ordinal numbers, how to express the date. Some prepositions “su” “da” “a”.   Week 12 26 Nov - 01 Dec  Lezione 3: Finish the program.   Week 13 03 Dec -  08 Dec  Revision and Practice . Oral Assessment    Centralized Examination  Test 2 (final test)     ", "required_readings": "Textbook: LINEA DIRETTA 1A (includes exercises section, grammar tables ).The book can be purchased from Swindon Tsimshatsui Bookstore (Ground Floor, 13-15 Lock Road, Tsimshatsui, Kowloon Tel: 2366 8309 ) \r  Different audio-visual materials can be found through the University library system \r A desk-size bilingual dictionary (pocket-size dictionaries are not recommended)", "recommended_readings": "Textbook: LINEA DIRETTA 1A (includes exercises section, grammar tables ).The book can be purchased from Swindon Tsimshatsui Bookstore (Ground Floor, 13-15 Lock Road, Tsimshatsui, Kowloon Tel: 2366 8309 ) \r  Different audio-visual materials can be found through the University library system \r A desk-size bilingual dictionary (pocket-size dictionaries are not recommended)", "terms": {"2020-21 Term 1": {"AC01-CLW (8615)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Ms. Silvia CASACCI"]}, "BC01-CLW (8616)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Ms. Silvia CASACCI"]}}, "2020-21 Term 2": {"-C01-CLW (5390)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Ms. Silvia CASACCI"]}}}, "assessments": {"Essays": "25", "Essay test or exam": "50", "Others": "5", "Presentation": "20"}}, {"code": "1100", "title": "Society and Culture in Contemporary Italy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "", "description": "This course offers information about Italian geography, modern history, political institutions, education, economics, and social and cultural life with special emphasis on Italian culture and artistic heritage. No knowledge of Italian is required.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2000", "title": "Italian II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "1. Not for students who have taken ITAL2001,2050(1010),3000,3001,3002,3050 or 3051 ;2. Prerequisite: ITAL1000 (1001)", "description": "Building on the knowledge acquired in ITAL1000, this course aims to further develop students’ ability to communicate in Italian in various everyday situations. It also seeks to give students a taste of Italian culture and invites them to explore cultural differences. Through intensive practice students will develop more confidence in interacting in Italian while further expanding and solidifying their understanding of the basic grammar and pronunciation patterns.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2001", "title": "Italian III", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "1. Not for students who have taken ITAL3000,3001,3002,3050 or 3051;2. Prerequisite: ITAL2000 or 2050", "description": "This course aims to further enhance students' communication skills in the four language domains listening, speaking, reading and writing. Students are expected to communicate confidently in a wider range of social interactions including more formal situations and simple professional contexts as well as reporting past events and sharing experience. At the end of this course, students will have completed a proficiency level comparable to level A1 of the Common European Framework of Reference for Languages (CEFR).\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "2050", "title": "Italian I & II", "career": "Undergraduate", "units": "6.00", "grading": "Graded", "components": "Classwork", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Not for students who have taken ITAL1000(1001), 2000(1002), 2001,3000,3001,3002,3050 or 3051", "description": "( Please read the Study Scheme Note.) This is a summer intensive Italian language course for beginners, covering the full syllabus of ITAL1000 and 2000.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3000", "title": "Italian IV", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "1. Not for students who have taken ITAL3050 (ITAL2010);2. Prerequisite: ITAL2001 or equivalent competence", "description": "This course aims at increasing students' communicative fluency in oral and written Italian. Using a variety of classroom activities and multimedia, students will build up their competence in the four language domains listening, speaking, reading and writing. Through intensive practice they will be able to communicate in a wide range of social situations with the appropriate awareness of the pragmatic rules involved. Students receive guidance in the process of composing longer texts displaying a range of registers and styles relating to past, present and future events.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3001", "title": "Italian V", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "1. Not for students who have taken ITAL3010;2. Prerequisite: ITAL2002 or 2010 or equivalent competence", "description": "This course focuses on the further development of communication skills in Italian with emphasis on the expression of personal views and the training of argumentative strategies. The course will also engage students in critical reflections on various aspects of life in Italian-speaking countries and their own social environment. Students will be guided to analyze various types of data to support their views. They will learn how to express their wishes and aspirations using the appropriate registers.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3002", "title": "Italian VI", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "ClassworkInteractive Tutorial", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "1. Not for students who have taken ITAL3010;2. Prerequisite: ITAL3001", "description": "This course builds on the knowledge acquired through previous Italian language courses. It aims at leading students to a proficiency level comparable to the threshold from A2 to B1 of the Common European Framework for Languages (CEFR), becoming “independent users” of Italian. To achieve this goal, students will be encouraged to work project-based through independent or collaborative work with their peers. At the end of this course students will have mastered the most important grammar features of Italian and be able to communicate effectively in a wide range of everyday situations and a number of professional contexts. They will be able to use their oral and written language skills to relate to, reflect on and analyze past and current issues involving the Italian-speaking societies.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3050", "title": "Italian III & IV", "career": "Undergraduate", "units": "6.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Not for students who have taken ITAL2001 or ITAL3000 (ITAL2002).", "description": "(Please read the Study Scheme Note.) This is a summer intensive Italian language course for beginners, covering the full syllabus of ITAL2001 and 3000.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "3051", "title": "Italian V & VI", "career": "Undergraduate", "units": "6.00", "grading": "Graded", "components": "Classwork", "campus": "Main Campus", "academic_group": "Dept of Linguistics & Mod Lang", "requirements": "Not for students who have taken ITAL3001 or 3002", "description": "(Please read the Study Scheme Note.) This is a summer intensive Italian language course, covering the full syllabus of ITAL3001 and 3002.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]