[{"code": "6050", "title": "Directed Research", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureProject", "campus": "Main Campus", "academic_group": "Div of Business Administration", "requirements": "For students in MBA; or Full-time MBA; or EMBA (Chinese)", "description": "Independent research on an individual work basis under the general supervision of a business administration faculty member, in any of the following areas: accounting, business economics, business law, finance, insurance, international business, management, management information systems, marketing, personnel and industrial relations, production and operations management, or real estate. Prerequisite: consent of an instructor after examination of a written research proposal outlining the research subject, objectives, and proposed methodology. The student may submit his proposal to the instructor of his choice, but with the understanding that no faculty member is obliged to accept research students. The course may be taken more than once, but total units for this course may not exceed 6 units, and students cannot take 2 directed research courses in a term.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6060", "title": "Management: Competencies and Current Perspectives", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Business Administration", "requirements": "For students in MBA; or Full-time MBA; or MBA (Evening Mode); or MBA (Weekend Mode)", "description": "The objective is to know and understand the significant events and issues that affect the business of running an organization. To discover and understand the human processes that are essential for developing leadership and management skills. The course comprises two parts: a) An experiential programme whereby students will participate in structured outdoor exercises to develop problem-solving, team building, leadership and communication skills. b) A residential course with an integrative approach to understand the complexities of leading and managing a business organization in the new millennium.", "outcome": "Upon completing the two components of this course, students should be able to acquire knowledge in overcoming the key challenges and opportunities facing managers and leaders on a global stage.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"W-LEC (3726)": {"startTimes": ["12:00"], "endTimes": ["12:00"], "days": [1], "locations": ["TBA"], "instructors": ["Professor CHAN Chi Bong Dominic"]}}}}, {"code": "6070", "title": "Business Practicum", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-tripProject", "campus": "Main Campus", "academic_group": "Div of Business Administration", "requirements": "For students in MBA: or Full-time MBA; or MBA (Evening Mode); or MBA (Weekend Mode); or JD/MBA Double Degree Programme", "description": "This course provides an opportunity for the MBA students to apply what they have learned in the classroom to solving real-world business problems. A minimum of three and a maximum of five students are required to form a project team, under the supervision of a BA faculty member. A project proposal outlining the work to be undertaken by the project team must be approved by the supervising faculty member and endorsed by the Director of MBA Programmes or his/her representative within 10 calendar days from the start of the term. The project must be sponsored by a company in Hong Kong and approved by the Director. The sponsorship includes joint supervision of the project by an appointed senior staff of the company, pledge of assistance and support to ensure the successful completion of the project, and possible remuneration to members of the project team, other than the supervising faculty member, for the work undertaken. Students are expected to spend, on the average, one day a week throughout the duration of the project. The project duration must cover the term time as published by the University calendar, but should not exceed four months in duration. A final report of the project to be submitted to the supervising faculty member and an oral presentation of the results to the management of the sponsor is part of the requirements of the course. The final grades of the students will be determined by the supervising faculty member, in which the evaluation of the project by the sponsoring body should be reflected. MBA (Evening Mode) and MBA (Weekend Mode) students are eligible to register the course subject to the Director's approval.", "outcome": "Students completed this course are expected to apply their newly acquired business knowledge and skills to real-life situations. They should also be able to prove their capability and performance to the business community, paving the way to create more work opportunities with the sponsoring company in the future when they move on.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 3": {"FJ01-PRJ (1090)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}}}, {"code": "6080", "title": "Business Field Study - Mainland China", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-tripLecture", "campus": "Main Campus", "academic_group": "Div of Business Administration", "requirements": "For students in MBA; or Full-time MBA; or MBA (Evening Mode); or MBA (Weekend Mode); or JD/MBA Double Degree Programme", "description": "This course consists of preparatory assignments in readings and a written study plan, followed by a seven-day residential programme in China, and concluded with a written report and oral presentation. The goal in taking classroom sessions abroad is to expose our MBA students to a wide spectrum of issues related to doing business in China. Trade, economics, finance, market, ventures, management practices, politics, as well as geographic and social issues are highlighted through lectures, seminars, and discussions with local government officials, managers, and academics. Site visits to state enterprises, joint ventures and manufacturing facilities are also included. Since much of the course will be conducted in Putonghua, students are expected to have adequate comprehension of the language/dialect.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6081", "title": "Business Field Study - Asia", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Div of Business Administration", "requirements": "For students in MBA; or Full-time MBA; or MBA (Evening Mode); or MBA (Weekend Mode); or JD/MBA Double Degree Programme", "description": "The course consists of preparatory reading assignments followed by a week-long residential program in Asia, concluding with a written report and oral presentation or other assignments. The goal in taking classroom sessions in Asia is to provide MBA students first-hand exposure to some of the issues related to doing business in dynamic Asian market economies such as trade rules, economics, finance, marketing, management practices, politics, as well as geographic and social issues. Course learning activities include lectures provided by top academic partner schools, seminars and discussions with local government officials, business professionals, and visits to multi-national companies, state enterprises, joint ventures and manufacturing facilities. Students will be offered the opportunity to interact with executives and leaders of industry, financial institutions and government organizations in the region.The trip is highly structured to provide intellectual and social experiences with other cultures for students learning to lead in a booming Asian market. Trips may embrace a theme or focus on a particular business topic of relevance to the location such as marketing, entrepreneurship, or globalization, to leverage learning throughout the in-country experience. (Eligible for recognition toward concentration requirements depending on course content)", "outcome": "1. Students will be able to develop an understanding and first-hand perspective of the business, political, and social climates within the country/region visited.\r  2. Students will be able to enhance their understanding of the culture, social norms, and latest business practices of the country/region visited, and foster their capacities to manage in a global business environment.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"FF01-FLD (3437)": {"startTimes": ["12:00"], "endTimes": ["12:00"], "days": [1], "locations": ["No Room Required"], "instructors": ["Staff"]}}, "2020-21 Summer Session": {"FF01-FLD (1155)": {"startTimes": ["12:00"], "endTimes": ["12:00"], "days": [1], "locations": ["TBA"], "instructors": ["Professor CHAU Chi Wai"]}}}}, {"code": "6082", "title": "Business Field Study - Europe", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Div of Business Administration", "requirements": "For students in MBA; or Full-time MBA; or MBA (Evening Mode); or MBA (Weekend Mode); or JD/MBA Double Degree Programme", "description": "This course consists of preparatory reading assignments followed by a week-long residential program in Europe, concluding with a written report and oral presentation or other assignments. The goal in taking classroom sessions in Europe is to provide MBA students first-hand exposure to some of the issues related to doing business in the EU, European business practices, and the influence of culture. This course may also focus on a particular business topic of relevance to the location such as marketing, entrepreneurship, or globalization. Course learning activities include lectures provided by top academic partner schools, seminars and discussions with local business professionals and/or government officials, and site visits to European enterprises.(Eligible for recognition toward concentration requirements depending on course content)", "outcome": "Upon completion of the course, students will be able to understand the concepts and instruments for international marketing and brand management in the global marketplace.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Summer Session": {"EF01-FLD (1156)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor CHEW Seen Meng"]}}}}, {"code": "6083", "title": "Business Field Study - US", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-tripLecture", "campus": "Main Campus", "academic_group": "Div of Business Administration", "requirements": "For students in MBA; or Full-time MBA; or MBA (Evening Mode); or MBA (Weekend Mode); or JD/MBA Double Degree Programme", "description": "This course consists of preparatory reading assignments followed by a week-long residential program in the US, concluding with a written report and oral presentation or other assignments. The goal in taking classroom sessions in the US is to provide MBA students first-hand exposure to some of the issues related to doing business in US, American business practices, and the influence of culture. This course may also focus on a particular business topic of relevance to the location such as marketing, entrepreneurship, or globalization. Course learning activities include lectures provided by top academic partner schools, seminars and discussions with local business professionals and/or government officials, and site visits to US enterprises. (Eligible for recognition toward concentration requirements depending on course content)", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6090", "title": "Selected Topics in Business", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Business Administration", "requirements": "For students in MBA; or Full-time MBA; or MBA (Evening Mode); or MBA (Weekend Mode); or JD/MBA Double Degree Programme", "description": "This course provides students with an opportunity to further their knowledge in selected areas of business. Topics and issues of current and emerging interest are discussed and explored. Throughout this course, student initiative and participation in discussion and projects related to the selected topics will be emphasized.", "outcome": "Learning objectives for selected topics covered under this selected topic course will depend on the topic addressed-learning objectives. For each selected topic will be determined via reference to the programme learning goals.", "syllabus": "", "required_readings": "", "recommended_readings": "References related to the topic(s) taught in the course will be provided by individual teacher", "terms": {"2020-21 Term 1": {"W-LEC (3759)": {"startTimes": ["14:30"], "endTimes": ["17:45"], "days": [0], "locations": ["TBA"], "instructors": ["Professor CHONG Tai Leung"]}}, "2020-21 Summer Session": {"F-LEC (1154)": {"startTimes": ["12:00"], "endTimes": ["12:00"], "days": [1], "locations": ["TBA"], "instructors": ["Staff"]}}}, "assessments": {"Essays": "20", "Essay test or exam": "40", "Presentation": "20", "Short answer test or exam": "20"}}, {"code": "6091", "title": "New Venture Business Project", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Business Administration", "requirements": "For students in MBA; or Full-time MBA; or MBA (Evening Mode); or MBA (Weekend Mode); or JD/MBA Double Degree Programme", "description": "This course is designed to hone students' entrepreneurial skills. To that end, each student will work in a group to develop a business plan and to devise a means for acquiring capital for a new venture. The instructors will lecture on various aspects of planning and financing start-ups, and guest speakers - entrepreneurs, venture capitalists and incubator sponsors - will describe their experience of dealing with start-ups. Students will succeed in this course only if they take the initiative to produce viable plans. The instructors are coaches and facilitators to help course participants. Students, together with the instructors, will critically assess each of the business plans.", "outcome": "After finishing this course, students are expected to have a good understanding on key issues such as how a new product/service should be created/formulated, business planning, market identification, business/revenue model, execution path and hurdles, how to write, present and pitch an eye-catching investment proposal.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"W-LEC (9193)": {"startTimes": ["14:30", "9:30"], "endTimes": ["17:45", "12:45"], "days": [6, 6], "locations": ["Cheng Yu Tung Building LT5", "TBA"], "instructors": ["Professor CHAN Chi Bong Dominic", "Mr. FOK Man Kit, \n\rProfessor CHAN Chi Bong Dominic"]}}, "2020-21 Term 3": {"W-LEC (1043)": {"startTimes": ["14:30"], "endTimes": ["17:45"], "days": [6], "locations": ["Esther Lee Bldg LT2"], "instructors": ["Staff"]}}}}, {"code": "6092", "title": "Applied Entrepreneurship: Remodeling & Fundraising in Asia", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Business Administration", "requirements": "For students in MBA; or Full-time MBA; or MBA (Evening Mode); or MBA (Weekend ;Mode); or JD/MBA Double Degree Programme", "description": "Most of the young ventures fail within the first three years of their establishment by making some fatal mistakes. However, it is a business nature to make mistakes, particularly for those young entrepreneurs who enter the market without proper preparation because they usually do not realize the constraints and problems faced by new ventures. Since the Lecturer of this course strongly believes that it is difficult to repeat a ‘success model’, this course will concentrate on teaching the ‘failure factors’ that can bring down new ventures. It emphasizes on several major topics related to executing a business opportunity and securing required financial resources. As the lack of financial resources is one of key failure factors and there are limited financial resources available to start-ups, students will be trained specifically for their fundraising skills. Since the investment community of Asia operates differently compared to the West, particularly USA, this course will concentrate on the assessment criteria of Asian investors in terms of the development and investment viability of ventures. This course covers critical issues concerning business ventures, especially ventures with innovative ideas and technology focuses, in detail. This course is highly practical in nature. Existing quality ventures that encounter problems in fundraising will be sourced through the Pan Asia Venture Development Platform (http://pavd.info/) globally. The students are required to review the business model of those ventures and modify them from the view of Asian investors: angels, venture capitalists, private equity investors – industrial players and other strategic investors. At the last day of the course, students will make a fundraising presentation to approximately 15 - 30 PAVD investors from China, Hong Kong, Japan, Malaysia, Singapore and Taiwan (http://pavd.info/Registered%20Investors/Judges/). The students may also see the performance of students from other programs and/or universities. In a nutshell, students of this course will work on real project and raise real money.Blended-mode class section is available for this course. Please refer to the “Class Notes” of the blended-mode class section for details.", "outcome": "After taking this course, students are expected to:\r 1. have a thorough understanding on several key issues such as business model, execution path and hurdles, investment proposal, due diligence, term sheet and presentation skills that are directly related to their ventures\r 2. learn from entrepreneurs who have start-up knowledge and experiences\r 3. build their own investors’ network", "syllabus": "Pan Asia Venture Development Platform\r Be Your Own Boss\r Problem of New Ventures\r Successful Entrepreneur and Team\r Fundraising for Entrepreneurial Venturing\r Project Evaluation \r The iI model of Venture Development (the failure factors)\r Stages of Financing\r Sources of Financing \r Angels vs Venture Capitalists\r Valuation and Justification\r Investment Proposal (& framework)\r Preparation for Due Diligence \r Term Sheet \r 3G IdeaSpace (Babson College)\r Teaser Sample", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"XA-LEC (1055)": {"startTimes": ["18:45", "13:30"], "endTimes": ["21:45", "18:15"], "days": [5, 6], "locations": ["TBA", "Cheng Yu Tung Building LT1A"], "instructors": ["Professor CHAU Chi Wai, \n\rProfessor CHOI Wai Shan", "Professor CHAU Chi Wai, \n\rProfessor CHOI Wai Shan"]}}}, "assessments": {"Essays": "20", "Others": "30", "Presentation": "50"}}, {"code": "6100", "title": "Current Topics in Business", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Business Administration", "requirements": "For students in MBA; or Full-time MBA; or MBA (Evening Mode); or MBA (Weekend ;Mode); or JD/MBA Double Degree Programme", "description": "This course provides students with an opportunity to further their knowledge in selected areas of business. Topics and issues of current and emerging interest are discussed and explored. Throughout this course, student initiative and participation in discussion and projects related to the selected topics will be emphasized.Blended-mode class section is available for this course. Please refer to the “Class Notes” of the blended-mode class section for details.", "outcome": "Learning objectives for selected topics covered under this selected topic course will depend on the topic addressed-learning objectives. For each selected topic will be determined via reference to the programme learning goals.", "syllabus": "", "required_readings": "", "recommended_readings": "References related to the topic(s) taught in the course will be provided by individual teacher.", "terms": {"2020-21 Summer Session": {"E-LEC (1069)": {"startTimes": ["18:45", "18:45", "18:45"], "endTimes": ["21:45", "21:45", "21:45"], "days": [1, 3, 5], "locations": ["TBA", "TBA", "TBA"], "instructors": ["Professor CHAN Shun Wai Ivan", "Professor CHAN Shun Wai Ivan", "Professor CHAN Shun Wai Ivan"]}}}}, {"code": "6110", "title": "Field Study in Hong Kong", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Visit", "campus": "Main Campus", "academic_group": "Div of Business Administration", "requirements": "For students in MBA Finance", "description": "This course is a five-day residential programme in Hong Kong. It provides students with an opportunity to be exposed to a wide spectrum of issues related to the financial operations in Hong Kong. Participants will attend seminars, visit financial institutions, and exchange views with local students. The course will be concluded with a group written report and an oral presentation. Accommodation and transportation expenses should be paid for by the participants. For those who cannot join the field trip are required to take MBAC6130 Group Report as a substitute.", "outcome": "After attending a series of seminars and visiting various financial institutions, students will understand the operation of financial markets in Hong Kong.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 3": {"-V01-VST (1032)": {"startTimes": ["9:00", "9:00", "9:00", "9:00", "9:00"], "endTimes": ["17:00", "17:00", "17:00", "17:00", "17:00"], "days": [2, 3, 4, 5, 1], "locations": ["No Room Required", "No Room Required", "No Room Required", "No Room Required", "No Room Required"], "instructors": ["Staff", "Staff", "Staff", "Staff", "Staff"]}}}}, {"code": "6120", "title": "Academic and Professional Seminars", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Business Administration", "requirements": "For students in MBA Finance", "description": "This three-credit course is designed to enhance students’ understanding of current issues in business. Guest speakers will be invited to cover various aspects of business and/or industries. The series of five to ten seminars will be conducted on average during the entire academic year. The course will be concluded with a group written report and an oral presentation.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6130", "title": "Group Report", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Business Administration", "requirements": "For students in MBA Finance", "description": "This project is designed for students who cannot join the field study in Hong Kong. It provides students with an opportunity to understand the capital market in China. Participants should submit a group research report.", "outcome": "Students will understand the operation of capital markets in China.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 3": {"-J01-PRJ (1059)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor LIU Ming"]}}}}, {"code": "6140", "title": "China in Transition: Growth Model Change and Innovation", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Business Administration", "requirements": "For students in MBA; or Full-time MBA; or MBA (Evening Mode); or MBA (Weekend Mode); or JD/MBA Double Degree Programme;Prerequisite: FINA5010", "description": "China is enjoying remarkable development and the status as the world’s second largest economy. However, China needs new drivers of growth to replace old ones and change in its growth models in almost all its walks of life. A combination of an over-reliance upon fixed asset investment and exports, failing to move up the value chain and the slow development of the service industry present substantial challenges for its sustainable development, labour supply and growth of returns. China aims at addressing these issues through shifting its strategic focus on growth model changes and innovation. This six weeks course explores the evolving business models in major China industries including manufacturing and banking, and brings together the roles played by the government and the markets.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6150", "title": "Overseas Field Study in Financial Institutions", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Div of Business Administration", "requirements": "For students in MBA Finance", "description": "This course is a week-long residential programme outside Hong Kong and China. It provides students with an opportunity to be exposed to a wide spectrum of issues related to international financial operations, global business and management. Students will attend seminars and visit financial institutions or international firms. The course will be concluded with a group written report and an oral presentation. Accommodation and transportation expenses should be paid by the students.", "outcome": "Students will: \r - understand the operation of international financial markets, global business and management\r - acquire awareness of, and an appreciation for the diversity and complexity of the international financial and business environment\r - be able to review contemporary and relevant developments in the global or regional arena, and to explore the possible strategic alternatives to capitalize on changes in the global scenario", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 3": {"-F01-FLD (1080)": {"startTimes": ["12:00"], "endTimes": ["12:00"], "days": [1], "locations": ["No Room Required"], "instructors": ["Professor LIU Ming"]}}}, "assessments": {"Homework or assignment": "80", "Participation": "20"}}, {"code": "6200", "title": "Independent Project", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Business Administration", "requirements": "For students in MBA; or Full-time MBA; or MBA (Evening Mode); or MBA (Weekend Mode); or JD/MBA Double Degree Programme", "description": "There may be occasions on which curricular offerings do not align fully with a given student’s academic, professional, and personal development goals. In those situations, students may be interested in pursuing independent work for academic credit with the guidance and permission of a faculty member and the MBA Programme Office. Students can use this study option to customize their educational experience, adding another benefit of curricular flexibility.This course is designed to allow students to pursue academic topics in greater depth than the coverage of the topic in a class. The project, which may vary by topic and student, normally involves formal, academic study resulting in a substantial, written paper as the final product. The study can be either academic-based, research-driven or application-oriented.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]