[{"code": "1110", "title": "Systemic Anatomy", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "DiscussionExerciseIndependent StudyLectureOthersPracticum", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "FO - MBChB Major", "description": "This course introduces the major organ systems in the human body by delivering the knowledge of how a system is basically composed and how different components function intimately in accomplishing their roles. The organization of each system is emphasized and illustrated using models and plastinated human bodies in laboratory demonstrations.\r", "outcome": "Upon completion of the course, students should be able to:  Knowledge: • describe the location, general organization, composition and function of the major organ systems in the body; • state the importance of interrelationship between different organ systems; and • provide clinical examples related to disorder of human structures.  Skills: • identify the position of different organs in situ; and • recognize the structural features of different organs and to differentiate them in situ or with the aid of plastinated specimens and models.  Attitude: • demonstrate respectfulness towards the prosected human body.", "syllabus": "Mastery Lecture Topic - Relevance of anatomy in clinical practice  eLecture Topics - Terminology on positions and planes of sectioning - Lymphatic system: Body defense  Lecture Topics - Respiratory system: Lung and breathing - Cardiovascular system: Heart and circulation - Musculoskeletal system: Body support and movement - Nervous system: Brain, coordination and control - Digestive system: Digestive organs and energy supply - Urogenital system: Elimination of wastes and continuation of life  Practical Topics - Respiratory and cardiovascular systems - Musculoskeletal system - Nervous system - Digestive system - Urogenital system", "required_readings": "-", "recommended_readings": "1) Martini, F. H., Tallitsch, R. B. & Nath J. L. (2018). Human Anatomy (9th ed.). San Francisco: Pearson Benjamin Cummings. [UL Oversize QS4 .M356 2018]", "terms": {"2020-21 Term 1": {"--LEC (4563)": {"startTimes": ["14:30", "16:30"], "endTimes": ["16:15", "18:15"], "days": [3, 3], "locations": ["No Room Required", "No Room Required"], "instructors": ["Dr. WAI Sen Mun", "Dr. WAI Sen Mun"]}}}, "assessments": {"Essays": "20", "Short answer test or exam": "80"}}, {"code": "1130", "title": "Cells and Tissues", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "LecturePracticum", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "FO - MBChB Major", "description": "This course introduces the microscopic anatomy of cells and tissues in the human body. Histological features of different tissues and organs are emphasized and demonstrated with the use of virtual microscopy. Topics include: histology of epithelial and glandular tissues, connective tissues and extracellular matrix, muscular tissues, nervous tissues, skin and appendages, tendons and ligaments, cartilages and bones.", "outcome": "Upon completion of this course, students should be able to:Knowledge:• recognize the microscopic structure of normal human tissues and organs, with emphasis on the basic tissues and musculoskeletal tissues;• relate the histological features of cells and tissues to their functions; and• provide clinical examples related to human structures.Skills:• recognize histological features of different cells and tissues with the use of microscopy.", "syllabus": "Lecture – Fundamental knowledge of the histology of human tissues will be delivered through lectures. Following 2-3 lectures, exercises (e.g. multiple-choice questions) will be provided to students as a form of continuous assessment for their self-learning.Practical – Study of the microscopic features of cells and tissues will be assisted by self- and guided examination of histological slides with the use of virtual and conventional microscopy.Online activities – Online exercises (e.g. multiple-choice questions) of each major topic, which aim at enhancing students’ understanding of the key concepts and providing a self-testing tool, will be set and released via Blackboard.", "required_readings": "NIL", "recommended_readings": "A) Recommended TextbookJunqueira’s Basic Histology: Text & Atlas Mescher Anthony L., New York: McGraw-Hill Education, 2018 (15th edition).[electronic resource available from CU Library https://accessmedicine-mhmedical-com.easyaccess2.lib.cuhk.edu.hk/book.aspx?bookID=2430]B) Recommended Reference BookHistology: A Text and Atlas with Correlated Cell and Molecular BiologyRoss, M.H. & Pawlina, W. (2015) (7th edition). Philadelphia: Wolters Kluwer/Lippincott Williams & Wilkins Health[electronic resource from CU Libraryhttps://meded-lwwhealthlibrary-com.easyaccess2.lib.cuhk.edu.hk/book.aspx?bookid=1316]", "terms": {"2020-21 Term 2": {"--LEC (6531)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Yasumoto Int'l Acad Park LT1"], "instructors": ["Dr. LAM Shi Ying Joyce"]}}}}, {"code": "1140", "title": "Bioethics I", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "DiscussionLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 1 (MYR1)", "description": "This course introduces students to the requisite critical thinking skills needed to analyze and reconcile a variety of ethical questions in biomedicine. By way of an interdisciplinary teaching team, cases and questions are presented to students in conjunction with insights drawn from history, philosophy, health policy, medicine and beyond. The curriculum introduces core ethical principles including autonomy, beneficence and justice and the utilitarian and deontological concerns related to these principles. The course addresses three key areas of bioethics—clinical ethics, public health ethics and research ethics and the specific ethical constructs in each field. The first unit serves to acquaint students with the features of the online learning platform.\r", "outcome": "Upon completion of this course, students should be able to: Recognise the relationships between humanities and bioethics; Apply the tools of ethical analysis to critically evaluate complex problems; Recognise competing interests and principles in tension; Assemble support for and craft an argument for a stance on an issue; Communicate ideas, verbally and in writing, in a clear and concise manner; and Think flexibly to apply bioethical reasoning to hypothetical medical decision-making scenarios.", "syllabus": "Module Topic: Introduction to Bioethics Beliefs about Health and Illness & Bias in Doctor-Patient Relationships Genetics & Disclosure Care for the Elderly Public Health Resource Allocation & Organ Transplantation Ethics of Clinical Research", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1038)": {"startTimes": ["16:30", "11:30"], "endTimes": ["17:15", "12:15"], "days": [1, 1], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Dr. NGAN Miu Yung Olivia", "Dr. NGAN Miu Yung Olivia"]}, "-T01-TUT (1014)": {"startTimes": ["9:30"], "endTimes": ["10:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Staff"]}, "-T02-TUT (1031)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Staff"]}}}, "assessments": {"Essays": "30", "Others": "70"}}, {"code": "1150", "title": "Perspectives of Medicine in Real Life", "career": "Undergraduate", "units": "1.00", "grading": "Medical School Grades", "components": "VisitWorkshop", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "FO - MBChB Major", "description": "Apart from knowledge gleaned from readings, students are encouraged to learn medicine in real life including the basic concepts and practice of emergency medicine in action, the history and evolution of healthcare system in Hong Kong, and to make full use of the medical library during their medical studies and future career development.\r", "outcome": "By the end of this course, students should be able to: \r 1. know the basic aspects of emergency medicine practice in Hong Kong; 2. understand the history and evolution of healthcare system in Hong Kong; and\r 3. appreciate the important functions of a library in supporting medical education and research.", "syllabus": "This course is composed of the following elements:\r 1. A Workshop on Basic Life Support\r 2. A Workshop on Emergency Medicine\r 3. A Visit to the Hong Kong Museum of Medical Sciences\r 4. An Orientation and Tour of the Medical Library", "required_readings": "Textbooks as listed on the Faculty website.", "recommended_readings": "Recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"-W01-WKS (1041)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Wai Tat"]}}}}, {"code": "2001", "title": "First Professional Examination", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "Others", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "", "description": "Students are required to pass the First Professional Examination in order to be eligible for promotion to the next year.\r", "outcome": "See details for the individual courses MEDU3300 and MEDU3400.", "syllabus": "See details for the individual courses MEDU3300 and MEDU3400.", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Acad Year (Medicine)": {"-O01-OTH (1054)": {"startTimes": ["12:00"], "endTimes": ["12:00"], "days": [5], "locations": ["Online Teaching"], "instructors": ["Staff"]}}}, "assessments": {"Discussion": "1", "Essay test or exam": "9", "Lab reports": "10", "Short answer test or exam": "32", "Selected response test or exam": "48"}}, {"code": "2140", "title": "Bioethics II", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "LectureSeminarWorkshop", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 2 (MYR2)", "description": "This course introduces students to foundational theories, concepts and historical developments in the field of bioethics. Topics covered in the course include:(i) the responsibilities of physicians and researchers and the rights of patients and research participants; (ii) controversies when physician duties conflict with patient or family preferences; (iii) justice in the allocation of health care resources and fair delivery of healthcare in a modern metropolitan setting; (iv) ethical considerations at the beginning and the end of life; (v) concerns for balancing individual liberties and the state’s interest in public health and public safety; and(vi) controversies that accompany the development, introduction and distribution of new technologies.", "outcome": "Upon completion of the course, students should be able to:1) develop an understanding of the philosophical and historical aspects of bioethics;2) apply critical analytic skills learned in Bioethics and Humanities I (in Year 1), to bioethical topics of historical and philosophical interests;3) explain bioethical concepts and reasoning orally using both interactive discussion and public presentation formats; and4) think flexibly to apply bioethical reasoning to hypothetical medical decision-making scenarios.", "syllabus": "Module Topic: When Does Someone First Exist: Ethics and the Beginning of Life Ethics of Genetic Testing: The Case of NIPT Adolescent Informed Consent Advanced Directives: Patient Autonomy at the End of Life Tobacco Control: A Case Study on Coercive Public Health Interventions Healthcare and Justice in Designing and Delivering Healthcare Medical Negligence and Error: Physician and System Failures", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1039)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Dr. NGAN Miu Yung Olivia"]}, "-W01-WKS (1036)": {"startTimes": ["9:30"], "endTimes": ["10:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr. NGAN Miu Yung Olivia"]}, "-W02-WKS (1037)": {"startTimes": ["10:30"], "endTimes": ["11:15"], "days": [4], "locations": ["Online Teaching"], "instructors": ["Dr. NGAN Miu Yung Olivia"]}}}, "assessments": {"Essays": "30", "Others": "70"}}, {"code": "2160", "title": "Resilience Building in Professional and Personal Development I", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "LectureWorkshop", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 2 (MYR2)", "description": "Medical schools strive to educate knowledgeable, caring and professional physicians. The growing interest in empathy, wellness and resilience has fuelled the design and implementation of structured educational programmes worldwide to cultivate empathy especially at a time of increasing professional burnout among undergraduates and resident trainees.Empathy in the medical setting includes the appreciation of the patient’s emotions and the expression of that awareness. Empathy is an essential learning objective and it is believed to significantly influence patient satisfaction, adherence to medical recommendations, clinical outcomes, and professional satisfaction.A key component to empathy is reflective capacity. Fostering reflective capacity within medical education helps develop critical thinking skills inform clinical reasoning, and enhance professionalism among trainees. Development of reflective capacity has been highlighted as necessary for effective use of feedback in medical education and is an essential aspect of self-regulated and lifelong learning. Failure to reflect on one’s own thinking processes, including critical examination of one’s assumptions, beliefs, and conclusions, was recently described as a cognitive component of “physician overconfidence,” a contributing cause of diagnostic error in medicine.Reflection is not necessarily intuitive, especially in students at initial stages of their medical careers.The over-arching aim of the course is to nurture and consolidate the key soft skills of an effective doctor, as well as healthy resilient personality through the development of reflective capacity and empathy.The course is delivered in progressive stages to build reflective capacity and empathy in specific professional developmental contexts. The four building blocks as outlined below will be emphasized in different years. The building blocks will be progressively built and integrated over curriculum from year 2 to year 4.1. Empathic Engagement (Year 2)2. Doctor and Society (Year 3)3. Doctor and Self- Reflection in Practice (Year 4)4. Doctor and Profession (Year 4)The four components encompass the core values of a healthy and competent doctor who is able to foster therapeutic alliance with patients, appreciate and reflect the meaning of work, being a team player as well as connection with public and society.\r", "outcome": "After completing the course, students are able to:\r 1. describe the key elements of an effective and empathic engagement with patients (affective, cognitive, somatic)\r 2. appreciate aspects of distressed or distancing empathy leading to over-arousal (sympathetic distress) or aversion\r 3. appraise contexts and factors leading to empathic failure, distressed or distancing empathy\r 4. understand the neural network of empathy, and how empathy (towards self and others, in personal and professional contexts), translates into sustainable professional practice and life satisfaction\r 5. understand the importance of cultivating reflective practice to maintain effective empathy in professional context\r 6. understand and practice process of reflective practice: reflection on content and process (context, self), reflection in action (real-time awareness), reflection on action (retrospective)", "syllabus": "The course is divided into three parts which utilize multimodal and multimedia means, which all aim to engage students’ active participation and self-reflection.\r  Topics: Empathy\r Learning Contents:\r 1) What is empathy? What is the difference between A.I. and a clinician who loses empathy or is defeated by empathy? (Clinical, psychological and neuroscience perspectives)\r 2)Virtual-reality assisted experiential learning—knowing how your patients feel\r  Topics: Self-practice/Self-reflection approach\r Learning Contents:\r 1) Self-practice/Self-reflection approach to improve your learning strategies in medical curriculum I-- overview\r 2)Self-practice/ Self-reflection approach to effective learning in clinical settings\r Scenario-based role-playing and reflections—common catches in clinical practice when your empathy engine is simply NOT working.\r  Topics: Mental Health Awareness & self-care for Doctors\r Learning Contents:\r 1)Introduction to mental health first aid\r 2)Practical- Capture baseline data on Burnout—Time-capsule personal aspirations, new year resolution and burnout scores\r  Workshop and Learning activities:\r The practical workshops will utilize multimodal and multimedia means. The scope of activities includes:\r -theme-based didactic lectures\r -participatory observation of role-plays, active participation in role plays,\r -case illustrations through artistic appreciation (e.g. in-depth appraisal of movie clips)\r -group discussion (in-class and web-based),\r -self-practice/self-reflection (in-class or web-based),\r -reflective writing with active feedbacks from tutors,\r -self-practice/self-reflection of brief cognitive behavioural exercise and/or mindfulness-based practice,\r -self-assessment on psychological burnout and longitudinal self-reflection with supportive feedbacks from tutors,\r -group presentation on thematic research or case studies,\r -VR-assisted experiential learning or via community projects.\r -self-study on suggested references and active self-reflection on the reading materials", "required_readings": "N/A", "recommended_readings": "Empathy\r 1. Halpern, Jodi (2001). From detached concern to empathy: Humanizing medical practice. Oxford, New York: Oxford University Press. [W62 H3128 2001, MD]\r 2. Norfolk, T., Birdi, K., & Walsh, D. (2007), The role of empathy in establishing rapport in the consultation: A new model. Medical education, 41(7),690-697.\r 3. Ramesh A (2013). A call for reflection: Medical student driven effort to foster empathy and\r compassion. Medical Teacher, 35(1),69–70.\r 4. Shapiro HM, Curnan MG, Peschel E, St. James D (1993). Empathy and the Practice of Medicine:\r Beyond Pills and the Scalpel. New Haven: Yale University Press. [W62. E46 1993, MD]\r 5. Sherry Turkle (2015). Reclaiming Conversation: The power of Talk in a digital age. New York: Penguin Press. [P96.T42 T85 2015]\r  Suggested movies for watching\r 1. Pete Docter (2015). Inside out 玩轉腦朋友(2015). United States: Pixar Animation Studios film.\r  Self-practice/Self-reflection approach\r 1. Bryan CS, Babelay AM (2009). Building character: A model for reflective practice. Academic\r Medicine,84 (9) ,1283-1288.\r 2. Epstein R (2008). Reflection, perception and the acquisition of wisdom. Medical Education,42(11),\r 1048–1050.\r 3. Mamede S, Schmidt HG, Penaforte JC (2008). Effects of reflective practice on the accuracy\r of medical diagnoses. Medical Education ,42 (5) 468–475.\r 4. Sandars J. (2009). The use of reflection n in medical education: AMEE guide no. 44. Medical Teacher,31(8),685–695.\r 5. Schön Donald A (1983). The reflective practitioner: how professionals think in action. New\r York: Basic Books. [ HD8038.A1 S35]\r 6. Plack MM, Greenberg L (2005). The reflective practitioner: Reaching for excellence in\r practice. Pediatrics,116(6),1546 –1552.\r  Suggested movies for watching\r 1. Akira Kurosawa (1965). Red Beard 赤鬍子. Japan : Screen & Stage 東宝株式会社.\r  Mental Health Awareness & self-care for Doctors\r 1. Brene Brown (2010). The Gifts of Imperfection: let go of who you think you‘re supposed to be and embrace who you are. Centre City, Minn.:Hazelden. [ BF575.S37 B76 2010]\r 2. Dyrbye L, Shanafelt T (2016). A narrative review on burnout experienced by medical students and\r residents. Medical Education,50 (1),132-49.\r 3. Frankl, Viktor E. (1905-1997). Man’s search for meaning. Boston, Mass.: Beacon Press. [ D805.G3 F7233 2014]\r 4. Matthew Johnstone (2006). Living with a black dog: his name is depression. Kansas City: Andrews McMeel Publishing. [WM171 .J635 2006]\r 5. Phyllis Chan (2018).Unveiling the Mystery: casebook of Child and Adolescent Psychiatry in Queen Mary Hospital. Hong Kong: Seedland Publishing Limited.\r 6. Robert J. Wicks (2006). Overcoming Secondary Stress in Medical and Nursing Practice: A Guide to Professional Resilience and Personal Well-Being. New York: Oxford University Press. [ WM172 .W434 2006]\r 7. Shailesh Kumar (2016). Burnout and Doctors: Prevalence, Prevention and Intervention. Health\r Care,4 (3) ,37.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1044)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor CHAN Sau Man Sandra"]}, "-W01-WKS (1045)": {"startTimes": ["9:30"], "endTimes": ["17:15"], "days": [6], "locations": ["Online Teaching"], "instructors": ["Professor CHAN Sau Man Sandra"]}}}, "assessments": {"Attendance": "20", "Homework or assignment": "30", "Participation": "50"}}, {"code": "2300", "title": "Human Structure I", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "LaboratoryLectureOthersInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 2 (MYR2)", "description": "This course introduces students to the structure of human body, which is the foundation for further studies in medicine. Organization of the body is taught through lectures and interactive practicals in the Dissecting Laboratory. Clinical relevance of anatomical knowledge is demonstrated in Clinical Skill sessions. Topics include: thorax and cardiovascular/ respiratory system, abdomen and digestive system, pelvis/perineum and urogenital system, and musculoskeletal system.\r", "outcome": "After completing the course in Medicine Year 2, students should be able to:\r 1) describe the organization and function of various body systems;  2) identify the structure in a specific region and its relationship to adjacent structures; and \r 3) appreciate the importance of anatomical knowledge in clinical examination of various body regions and systems.", "syllabus": "Topics covered:\r  1) Thorax, cardiovascular and respiratory system\r 2) Abdomen and digestive system\r 3) Pelvis and urogenital system\r 4) Musculoskeletal system \r  - Each topic above includes gross anatomy, histology, embryology and radiology lectures.\r 5) Embryology\r  - Fertilization, implantation, morphogenesis and fetal development", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1015)": {"startTimes": ["9:30", "14:30"], "endTimes": ["12:15", "18:15"], "days": [2, 2], "locations": ["Basic Med Sci Bldg", "Basic Med Sci Bldg"], "instructors": ["Dr. LAU Wing Sze Josephine, \n\rDr. WAI Sen Mun", "Dr. LAU Wing Sze Josephine, \n\rDr. WAI Sen Mun"]}}}, "assessments": {"Essay test or exam": "9", "Others": "18", "Short answer test or exam": "27", "Selected response test or exam": "46"}}, {"code": "2400", "title": "Human Function I", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "DiscussionLaboratoryLectureOthersInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 2 (MYR2)", "description": "This course introduces basic principles of physiological control and drug actions of various body tissues and systems. It is taught through lectures, case discussion, demonstrations, practicals and small group tutorials. The topics covered include: physiology of excitable cells, muscles, cardiovascular, gastrointestinal and renal systems, mechanisms of drug actions and pharmacokinetics, and drug actions on peripheral nervous system, cardiovascular system and gut.\r", "outcome": "After completing the course in Medicine Year 2, students should be able to:\r 1) describe the physiological control of excitable tissues in the body;  2) describe the functions of the cardiovascular, gastrointestinal and renal systems, and how these systems are regulated;  3) describe the mechanisms of drug action and pharmacokinetics; and\r 4) identify the use of important drugs on regulating functions of the peripheral nervous system, cardiovascular system and gut.", "syllabus": "1) Physiology of excitable cells \r 2) Muscle physiology\r 3) Cardiovascular physiology\r 4) Gastrointestinal physiology\r 5) Renal physiology\r 6) Basic mechanisms of drug actions\r 7) Pharmacokinetics\r 8) Drug action on the peripheral nervous system\r 9) Drug action on the cardiovascular system\r 10) Drugs and gut", "required_readings": "Recommended textbooks are listed in the Student Handbook and the teaching materials provided by the teachers.", "recommended_readings": "Recommended references are listed in the Student Handbook and other suggested readings provided by the teachers.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1009)": {"startTimes": ["8:30", "15:30", "14:30"], "endTimes": ["12:15", "18:15", "18:15"], "days": [3, 1, 4], "locations": ["Online Teaching", "No Room Required", "No Room Required"], "instructors": ["Professor KO Wing Hung, \n\rProfessor LAU Hang Yung Alaster", "Professor KO Wing Hung, \n\rProfessor LAU Hang Yung Alaster", "Professor KO Wing Hung, \n\rProfessor LAU Hang Yung Alaster"]}}}, "assessments": {"Essay test or exam": "9", "Lab reports": "2", "Others": "2", "Short answer test or exam": "36", "Selected response test or exam": "51"}}, {"code": "2500", "title": "Doctor and Patient I", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "LecturePracticumProjectSeminarInteractive TutorialVisit", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 2 (MYR2)", "description": "This course describes key elements in an effective doctor-patient relationship and in effective communications with the community. The course also introduces students to the biological, social and ethical aspects of health and illness. The course has two components. Part I is a series of visits with a medical doctor to observe, understand and acquire insight into the patient presentation and the role of a family doctor in the community and the doctor-patient relationship. Part II is longitudinal follow-up of a family with a new born baby in order to observe and interact with a family with a newborn to be able to understand and describe influences on child development e.g. socio-economic background of the family, health beliefs and practices, family adjustment to the newborn, social support, community support, assessment of milestones etc. This course is delivered by a series of lectures, small group tutorials, presentations, visits to family doctors in the community, and interviews with a family on wards and in the community.", "outcome": "After completing this course, student should be able to:1) Describe the patient's presentation by integrating biological, psychological and social aspects of illness;2) Describe the role of the family doctor and health professionals in the community and the key elements of an effective doctor patient relationship 3) Interact and gather information from the family regarding pregnancy, childbirth and child care4) Describe the health, social and developmental issues of a child from birth to 3 months5) Demonstrate skills in reflective writing", "syllabus": "   Topic Contents/fundamental concepts   Role of doctor in the community Roles of the doctor in the community Range of medical conditions and management   The doctor patient relationship Biological, psychological and social aspects to patient presentation and the therapeutic relationship   Beginning of life: Pregnancy and childbirth Health, psychological and social aspects and multidisciplinary care of pregnancy and childbirth   Beginning of life: Birth to 3 months Health, psychological and social aspects of the neonate and family adjustment and care in the community   ", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1048)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [4], "locations": ["Sir Run Run Shaw Hall"], "instructors": ["Professor WONG Carmen"]}}}, "assessments": {"Attendance": "5", "Essays": "30", "Participation": "5", "Report": "60"}}, {"code": "2600", "title": "Molecular Medicine and Genetics", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "LectureInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 2 (MYR2)", "description": "This course introduces basic principles of cellular structure, cell division and death, cellular metabolism and molecular genetics and genomics. The course provides the scientific basis in biochemical and molecular control of various cell functions, and on recent advances in genomic and personalized medicine. Topics include: cell biology, enzymology, metabolism of carbohydrates, proteins, lipids and nucleotides, molecular biology, extended topics on gene expression and genetics, as well as their applications in diagnosis, screening and patient care.\r", "outcome": "After completing the course in Medicine Year 2, students should be able to:\r 1) describe the structure and function of various biomolecules that build up a cell;  2) understand the metabolism of these biomolecules and its integrative control;  3) describe basic principles in molecular genetics, and \r 4) appreciate how molecular genetics and genomic medicine advance medical treatment to patients.", "syllabus": "Topics covered:\r 1) Molecular structure and function of cells\r 2) Cellular metabolism\r  - Enzymes and bioenergetics\r  - Carbohydrate metabolism\r  - Lipid metabolism\r  - Nitrogen metabolism\r  - Integrative metabolism\r 3) Molecular genetics and genomics\r  - Molecular Biology\r  - Molecular genetics and epigenetics\r  - Clinical genomics", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1010)": {"startTimes": ["9:30", "11:30", "9:30"], "endTimes": ["12:15", "12:15", "12:15"], "days": [4, 4, 1], "locations": ["Online Teaching", "Online Teaching", "Online Teaching"], "instructors": ["Dr. LEE Kit Ying Rebecca, \n\rProfessor CHENG Sze Lok", "Dr. LEE Kit Ying Rebecca, \n\rProfessor CHENG Sze Lok", "Dr. LEE Kit Ying Rebecca, \n\rProfessor CHENG Sze Lok"]}}}, "assessments": {"Essay test or exam": "9", "Short answer test or exam": "36", "Selected response test or exam": "55"}}, {"code": "3001", "title": "Second Professional Examination", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "Others", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "", "description": "The Second Professional Examination is held at the end of the academic year and may asses any content covered in Medicine Year 4. Students are required to pass the Second Professional Examination in order to be eligible for promotion to the next year.", "outcome": "See details for the individual courses MEDU3110, MEDU3210, MEDU3310, MEDU3320 and MEDU3330.", "syllabus": "See details for the individual courses MEDU3110, MEDU3210, MEDU3310, MEDU3320 and MEDU3330.", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Acad Year (Medicine)": {"-O01-OTH (1050)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Staff"]}}}}, {"code": "3110", "title": "Junior Medical Clerkship", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "DiscussionLectureOthersInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 4 (MYR4)", "description": "After a series of lectures in introductory courses and basic clinical skills teaching in Prince of Wales Hospital, students are assigned to medical wards and oncology wards in Prince of Wales Hospital and other acute and rehabilitation hospitals. History-taking and physical examination skills are taught in the form of small group tutorials and bedside teachings. They also begin to learn about communication skills and management of patients with different medical problems.", "outcome": "Towards the end of the year, students are expected to: \r 1. have competent history-taking skills, allowing them to record accurately patients’ past medical problems and present medical complaints;  2. be able to perform proper physical examination of the major systems, and to elicit accurate signs;  3. develop effective communication skills, enabling them to understand/elicit patients’ concerns and expectations;  4. be able to summarize findings from history-taking and physical examination, and to be able to put together a list of differential diagnosis and/or problems list; and \r 5. understand the need for continual learning during both their student years, throughout their medical careers.", "syllabus": "", "required_readings": "Recommended textbooks as listed on the Faculty website and Student Handbook.", "recommended_readings": "Recommended references as listed on the Faculty website and Student Handbook.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1032)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}}}, {"code": "3160", "title": "Resilience Building in Professional and Personal Development II", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "DiscussionField Studies/Field-tripWorkshop", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 3 (MYR3)", "description": "Medical schools strive to educate knowledgeable, caring and professional physicians. The course is delivered in progressive stages to build reflective capacity and empathy in specific professional developmental contexts. The four building blocks as outlined below will be emphasized in different years. The building blocks will be progressively built and integrated over curriculum from year 2 to year 4.1. Empathic Engagement (Year 2)2. Doctor and Society (Year 3) 3. Doctor and Self- Reflection in Practice (Year 4)4. Doctor and Profession (Year 4)The four components encompass the core values of a healthy and competent doctor who is able to foster therapeutic alliance with patients, appreciate and reflect the meaning of work, being a team player as well as connection with public and society.After completing the course MEDU2160 in Year 2, students are expected to build the reflective capacity and empathy in specific professional developmental contexts. On top of empathy, medical students are expected to explore more about the community/society in order to establish connection with the public and society as a team player. The course will cover 4 different themes for students to explore and reflect more.a. War zone/ humanitarianb. Povertyc. Disability/Impairmentd. Life and Death Studies\r", "outcome": "After completing the course, students are able to:\r • Practice communication with respect, knowledge, and skills related to clients' age, class, color, culture, disability, ethnicity, family structure, gender, marital status, national origin, race, religion, sex, and sexual orientation.\r • Reflect and develop the sensitivity to personal values, beliefs, bias and prejudice related to a person’s past socialization. \r • Explore the health care or related policy context and social welfare system in Hong Kong via the selected topics.\r • Identify current social policy, relevant legislation, and political, social, and/or economic systems and their impacts on medical service delivery.", "syllabus": "Field trip/visit to the NGO or social community and interactive lecture.\r  The course is divided into two parts which aim to engage students' active participation and self-reflection. \r Part 1: Group work in the community\r Learning Contents:\r 1) To explore one of the 4 main themes about the society/community in groups. \r 2) Group work to visit/participate the designated organizations to explore the selected theme\r  Part 2: Retreat\r Learning Contents:\r 1) to reflect what students have observed during the visit\r 2) to discuss their concerns about the visit \r  Workshop and Learning activities:\r -participatory observation of the community, active participation,\r -case illustrations through artistic appreciation (e.g. in-depth appraisal of movie clips)\r -group discussion (in-class),\r -self-practice/self-reflection (in-class or web-based),\r -reflective writing with active feedbacks from tutors,\r -group presentation on thematic research or case studies,\r -self-study on suggested references and active self-reflection on the reading materials", "required_readings": "NIL", "recommended_readings": "• Social determinants of health: About social determinants of health. (2018). Retrieved from \r https://www.who.int/social_determinants/sdh_definition/en/ \r  • 18.1 Understanding Health, Medicine, and Society. (2010). Retrieved from \r https://open.lib.umn.edu/sociology/chapter/18-1-understanding-health-medicine-and-society/ \r  • Khan Academy. (April, 9 2014). Macrosociology vs microsociology Society and Cutlure MCAT [Video file]. Retrieved from https://www.youtube.com/watch?v=-BVeSykcQeE\r  • Lau, M., Pantazis, C., Gordon, D., Lai, L., & Sutton, E. (2015). Poverty in Hong Kong. The China Review, Vol. 15, No. 2 (Fall 2015), pp. 23-58.", "terms": {"2020-21 Acad Year (Medicine)": {"-D01-DIS (1052)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Professor CHAN Sau Man Sandra"]}}}, "assessments": {"Attendance": "20", "Homework or assignment": "20", "Presentation": "30", "Participation": "30"}}, {"code": "3200", "title": "Skills Module for Medicine Year 4", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "LecturePracticumInteractive TutorialWorkshop", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 4 (MYR4)", "description": "By use of simulators, surrogates and actual patients as teaching aids, this course is designed for students to develop requisite skills in providing basic life support, clerking histories, performing physicals, inserting nasogastric tubes, and interpreting results of clinical investigations.", "outcome": "By the end of the course, students should be able to: \r 1. perform basic resuscitation skills;  2. take a proper history, document and present effectively;  3. assess a patient's neurological status and document properly on a neuro-observation chart;  4. insert nasogastric tube;  5. perform peripheral vascular examination; 6. use ophthalmoscope;  7. interpret blood-gas results.", "syllabus": "A. Medicine:\r Introductory course - history taking +/_ physical examination x 5 hours Reinforcement course - history taking +/_ physical examination x 5 hours\r B. Surgery: \r Introductory course –surgical bedside teaching X 2 hours \r Reinforcement course- clinical skills practice x1.75 hours\r C. Clinical Skills Learning Centre: \r Basic Life Support x 6 hours \r Basic Life Support revisit x 6 hours\r Interpretation of arterial blood gas x 90 mins\r Nasogastric tube insertion x 90 mins\r Peripheral vascular examination x 90 mins\r Neuro observation chart x 90 mins\r D. OVS: Ophthalmoscopy (90 min)", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1022)": {"startTimes": ["8:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Prince of Wales Hospital"], "instructors": ["Staff"]}}}}, {"code": "3210", "title": "Junior Surgical Dressership", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "LectureOthersProjectInteractive Tutorial", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 4 (MYR4)", "description": "Students are assigned to surgical wards in various hospitals and taught how to take a surgical history and to perform a surgical examination on patients. They learn how to manage patients with different surgical problems. During the surgical rotations, they have opportunity to participate in operative procedures in the operating theatre.", "outcome": "Following completion of this course, students are expected to: \r 1. recognize the common clinical presentations of patients with surgical problems and recognize those with serious or life threatening conditions;  2. make a reasonable differential diagnosis based on the clinical presentation and know appropriate diagnostic investigations necessary for the care of such patients;  3. know the anatomical, physiological and pathological basis of common diseases and disorders in the surgical patients;  4. interpret common diagnostic tests (laboratory and radiological) relevant to these common diseases; and \r 5. outline a management plan for the care of patients presenting with common surgical conditions.", "syllabus": "Please refer to the Junior Surgical Dressership Student Handbook", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1023)": {"startTimes": ["13:30", "8:30", "8:30", "8:30", "8:30", "8:30"], "endTimes": ["18:15", "12:15", "12:15", "12:15", "12:15", "12:15"], "days": [4, 4, 1, 5, 2, 3], "locations": ["Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital"], "instructors": ["Staff", "Staff", "Staff", "Staff", "Staff", "Staff"]}}}}, {"code": "3293", "title": "Doctor and Patient III", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "LectureProjectInteractive TutorialVisit", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 4 (MYR4)", "description": "The doctor and patient relationship is dynamic and essential in providing medical care. The therapeutic relationship enables the health professional and the patient to become cooperatively engaged and thereby effect beneficial change in the patient. This therapeutic relationship may be a one-off encounter or can be lifelong. The student should already have a deep understanding of the challenges from the doctor’s perspective and the range and variety of medical conditions of patient presentation. This course is a continuation of Doctor and Patient I and II and complements the experiences gleaned from the visits that are made in the family project during the child’s second and third year of life. The course aims to give students insights into the biological, social, psychological and medical context of care in the child's second and third year of life. This course is taught by a series of lectures and small group tutorials. There are family visits and interviews. The course ends after community and family medicine, paediatrics, obstetrics and gynaecology and psychiatry rotations so that the student has a comprehensive overview of the medical, developmental and social aspects to the family and child and the role of the community in health care. Case presentations in the interdisciplinary seminar discuss salient learning points in the course.\r", "outcome": "After completing the course, students should be able to: \r 1. describe normal physical and psychosocial developments of a child from birth to 3 years old and demonstrate awareness of common health problems in child health;  2. appraise a child's health and development and the family adjustment in terms of socioeconomic factors, health beliefs and health care provision;  3. outline key health care provisions and the role of health professionals in child health; and\r 4. evaluate the needs of the child and family and the role, skills and attitude of health professionals and community care facilities.", "syllabus": "1. Topic: Second year of life\r  Contents/fundamental concepts: Health, psychological, social and development aspects of the second year of life of the child and his/her family.\r  2. Topic: Third year of life\r  Contents/fundamental concepts: Health, psychological, social and development aspects of the first year of life of the child and his/her family.\r  3. Topic: Interdepartmental Seminar\r  Contents/fundamental concepts: Discussion of learning points and topical issues in child development and family health", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1033)": {"startTimes": ["14:30", "11:30", "17:30"], "endTimes": ["15:15", "12:15", "19:15"], "days": [5, 1, 1], "locations": ["Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital"], "instructors": ["Staff", "Staff", "Staff"]}}}}, {"code": "3300", "title": "Human Structure II", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "LaboratoryLecturePracticumInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 3 (MYR3)", "description": "The primary focus of this course is the anatomy of the head and neck in the human body. First part introduces organization of the extra-cranial structures; second part focuses on the organization of the central nervous system. The course is taught through lectures, supplemented with experiential learning in dissecting laboratory and other practical sessions. Different regions of the head and neck, including the bony components and associated organ systems are examined. The detailed blood supply and cranial nerve innervation is emphasized. This is followed by the study of the organization of the brain and spinal cord, and their control of the structures of the head and neck. Lastly, the embryonic development of the head and central nervous system including sense organs like the eye and ear is followed to allow students to appreciate how the overall complexity of this body region becomes established.\r", "outcome": "After completing the course, students should be able to:\r 1. describe the organization and function of various structures in the head and neck, and the central nervous system; 2. identify major structures in specific regions of the head and neck and the nervous system; and\r 3. describe and appreciate the principles governing development of the head and neck including the central nervous system.", "syllabus": "1) Skull and cranial cavity\r 2) Face, orbit, nasal and oral cavity\r 3) Mandible and TM joint\r 4) Neck \r 5) Pharynx and larynx\r 6) Temporal bone and middle ear\r 7) Blood supply of head and neck\r 8) Cranial nerves\r 9) Brain and spinal cord neuroanatomy\r 10) Blood supply of CNS\r 11) Eye and inner ear\r 12) Development of head\r 13) Development of CNS", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1002)": {"startTimes": ["14:30", "9:30"], "endTimes": ["18:15", "12:15"], "days": [1, 3], "locations": ["No Room Required", "No Room Required"], "instructors": ["Dr. SEE Christopher Yew Hong, \n\rProfessor CHEUNG Chi Kwan Vincent", "Dr. SEE Christopher Yew Hong, \n\rProfessor CHEUNG Chi Kwan Vincent"]}}}, "assessments": {"Essay test or exam": "9", "Lab reports": "18", "Short answer test or exam": "27", "Selected response test or exam": "46"}}, {"code": "3310", "title": "Anatomical Pathology and Clinical Hematology", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "LaboratoryLectureInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 4 (MYR4)", "description": "In continuation with MEDU3600 Basic Pathology, this course enables medical students to appreciate further the mechanisms of laboratory medicine, with emphasis on genomics and personalized medicine. MEDU3310 aims to illustrate the principles of diseases in an organ-system approach. The course focus on common diseases of Histopathology and Hematology. The emphasis is on the clinical context and the correlation with pathological features. Apart from conventional lectures and e-lectures, this course encourages students actively discuss common case scenarios and related laboratory investigations during small-group, laboratories/tutorials.", "outcome": "By the end of the course, students should be able to: 1. understand the principles and pathogenesis of common diseases; 2. describe common disease processes; 3. appreciate the rationale behind important laboratory approaches; and4. formulate a diagnostic approach and investigate the main pathology.", "syllabus": "Area 1 : Anatomical Pathology – Cardiovascular SystemArea 2 : Anatomical Pathology – Respiratory SystemArea 3 : Anatomical Pathology – Liver, Biliary Tree and PancreasArea 4 : Anatomical Pathology – Urogenital SystemArea 5 : Anatomical and Pathology – Gynecological SystemArea 6 : Anatomical and Pathology – Lymphoid SystemArea 7 : Anatomical Pathology – The Skin and The BreastArea 8 : Anatomical Pathology – Endocrine SystemArea 9 : Anatomical Pathology – Bones, Joints and Soft Tissue DiseasesArea 10 : Anatomical Pathology – Neuromuscular SystemArea 11 : Anatomical Pathology – Gastrointestinal Tract Area 12 : Clinical Hematology –Red Cell DiseasesArea 13 : Clinical Hematology – Diseases of White Cells, Lymph Nodes, and The Bone MarrowArea 14 : Clinical Hematology – Bleeding and Thrombotic DisordersArea 15 : Clinical Hematology – Blood Cancer Genomics and Cytogenetics", "required_readings": "Textbooks as listed on the Faculty website.", "recommended_readings": "Recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1011)": {"startTimes": ["13:30", "8:30"], "endTimes": ["18:15", "12:15"], "days": [1, 5], "locations": ["Prince of Wales Hospital", "Prince of Wales Hospital"], "instructors": ["Staff", "Staff"]}}}, "assessments": {"Short answer test or exam": "67", "Selected response test or exam": "33"}}, {"code": "3320", "title": "Chemical Pathology", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "LaboratoryLectureOthersPracticumInteractive Tutorial", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 4 (MYR4)", "description": "This course is designed to teach the pathophysiological basis of diseases and associated biochemical changes. Building on this knowledge, the students learn investigation and interpretation of laboratory results in Chemical Pathology and Clinical Immunology. Students learn how disease presentations and laboratory results correlate with pathophysiology. The course places emphasis on how clinical laboratory investigations play an important role in the diagnosis and management of diseases. The course also covers modern developments in laboratory genomic medicine. Students are expected to be competent in interpretation of laboratory results after completion of the course. This course includes lectures, laboratory sessions, tutorials and case discussions.", "outcome": "By the end of the course, students should be able to: \r 1. understand the pathophysiology of common diseases \r 2. initiate appropriate investigations; and \r 3. interpret investigation results and use them to make diagnosis and guide therapy.", "syllabus": "The Areas in the Syllabus of CP are\r A. Basic laboratory test interpretation and sample processing\r B.  Disorders of Electrolytes and acid-base disturbances\r C.  Disorders of lipids and proteins\r D.  Investigations of Renal function and insufficiency\r E.  Investigations of Liver and GI diseases\r F.  Investigations of Endocrine diseases\r G.  Molecular diagnosis\r H.  Other chemical pathology topics", "required_readings": "Textbooks as listed on the Faculty website.", "recommended_readings": "Recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1012)": {"startTimes": ["13:30", "8:30"], "endTimes": ["18:15", "12:15"], "days": [1, 5], "locations": ["Prince of Wales Hospital", "Prince of Wales Hospital"], "instructors": ["Staff", "Staff"]}}}}, {"code": "3330", "title": "Clinical Microbiology", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "LaboratoryLectureOthersPracticumInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 4 (MYR4)", "description": "The course aims to provide medical students with an understanding of microbiological infections relevant to human beings. Emphases are placed on commonly encountered micro-organisms, including bacteria, viruses, fungi and parasitic organisms, and those that are pathogenic. The diagnostic approach and case management of infectious diseases are discussed. The impact of antimicrobial resistance and the mechanisms of its spread are explored. Methods for infection prevention and control measures in the hospital are also introduced in the form of Basic Infection Control Module. N95 respirator qualitative fit-test is conducted in the module.\r", "outcome": "By the end of the course, students should be able to: \r 1. understand basic infection control concepts with the aim of protecting patients and healthcare workers;  2. able to choose and use appropriate personal protective equipment;  3. articulate different microbial causes of human infectious diseases, their diagnostic approaches and clinical management strategies; and \r 4. critically analyse the problems of antimicrobial resistance and potential solutions.", "syllabus": "Area 1 : Basic Infection Control Module\r Area 2 : Basic Microbiology\r Area 3 : Clinical Microbiology\r Area 4 : Diagnostic Microbiology & Antimicrobials", "required_readings": "Textbooks as listed on the Faculty website.", "recommended_readings": "Recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1013)": {"startTimes": ["13:30", "8:30"], "endTimes": ["18:15", "12:15"], "days": [1, 5], "locations": ["Prince of Wales Hospital", "Prince of Wales Hospital"], "instructors": ["Staff", "Staff"]}}}, "assessments": {"Short answer test or exam": "67", "Selected response test or exam": "33"}}, {"code": "3340", "title": "Integrated Clinical Communication Skills I", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "DiscussionLectureInteractive TutorialWorkshop", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 4 (MYR4)", "description": "Communication ability is a core clinical skill and essential in medical consultations, determining a diagnosis, management planning and teamwork coordination. As students, at this point in their medical education, are interacting with patients, the course runs in parallel with clinical curricula by enhancing students communications skills as they learn to take histories, perform examinations and other clinical tasks.Teaching modalities combine e-learning with experiential learning, self reflection and peer review and tutor feedback.\r", "outcome": "By the end of the course, students should be able to perform the following tasks.\r 1. Describe different communication models and components of effective communication as well as barriers to effective communication.\r 2. Demonstrate effective verbal, non verbal, listening and empathic skills while communicating with patients.\r 3. Critically appraise and provide helpful feedback in regard to one’s own and others’ communications skills.\r 4. Describe the approaches and key strategies used in consultations with a child, an adolescent and the elderly.\r 5. Construct an approach for ensuring confidentiality and for obtaining written consent.\r 6. Describe key concepts and strategies in cultural competence.", "syllabus": "1. Topic: General principles underpinning communications with patients\r  Content/fundamental concepts:\r  General Principles\r  Verbal and non verbal communication\r  Active listening and empathic response\r  Calgary Cambridge guide and Demonstration\r  2. Topic: The competent patient \r  Content/fundamental concepts:\r  Assessing competency: child, adolescent and old age\r  3. Topic: Consent\r  Content/fundamental concepts: \r  Consent of investigations and procedures\r  Negotiating mutual plan of action\r  Obtaining written consent\r  4. Topic: Patient confidentiality\r  Content/fundamental concepts: \r  Principles and common pitfalls\r  Breaching patient confidentiatlity\r  5. Topic: Cultural competence\r  Content/fundamental concepts:\r   Key concepts in cultural competence\r  Communication barriers\r  Ethnic minorities in Hong Kong\r   Course activities will include:\r Online learning and multiple choice/ short answer exercises\r Video roleplay workshop\r Video review and feedback tutorial\r Clinical case sharing discussion", "required_readings": "Textbooks as listed on the Faculty website.", "recommended_readings": "General Principles\r  1. John R. Tongue. Communication Skills for Patient-Centered Care. JBJS 2005; 87 (3): 652-658\r 2. Jennifer Fong Ha et al. Doctor-Patient Communication: A Review. The Ochsner Journal 2010 (10):38–43\r 3. John M. Travaline et al. Patient-Physician Communication: Why and How. JAOA 2005; 105 (1): 13-18\r  The competent patient\r  1. Hingle ST, Robinson S. Enhancing communication with older patients in the outpatient setting. Semin Med Pract 2009;12:1–7\r 2. Vic Larcher, Anna Hutchinson. How should paediatricians assess Gillick. Arch Dis Child 2010;95: 307-311\r 3. Vic Larcher. Consent, competence, and confidentiality. BMJ 2005;330:353–6", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1016)": {"startTimes": ["13:30", "8:30"], "endTimes": ["18:15", "12:15"], "days": [1, 5], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Staff", "Staff"]}}}, "assessments": {"Essays": "30", "Others": "30", "Short answer test or exam": "40"}}, {"code": "3360", "title": "Resilience Building in Professional and Personal Development III", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "ClassworkDiscussionInteractive TutorialWorkshop", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 4 (MYR4)", "description": "Medical schools strive to educate knowledgeable, caring and professional physicians. The course is delivered in progressive stages to build reflective capacity and empathy in specific professional developmental contexts. The four building blocks as outlined below will be emphasized in different years. The building blocks will be progressively built and integrated over the curriculum from year 2 to year 4.1. Empathic Engagement (Year 2)2. Doctor and Society (Year 3) 3. Doctor and Self- Reflection in Practice (Year 4)4. Doctor and Profession (Year 4)The four components encompass the core values of a healthy and competent doctor who is able to foster a therapeutic alliance with patients, appreciate and reflect the meaning of work, being a team player as well as connection with public and society.After completing the course MEDU3160 in Year 3, students are expected to build the reflective capacity on mapping their external and internal resources as well as develop sensitivity to connect with the society as a knowledgeable, caring and professional physician. Medical students are also expected to explore more about self and teamwork in a clinical environment with a good sense of professionalism. A clinical medical setting is a teamwork environment with multidisciplinary professionals, e.g. doctors, nurses, pharmacists, physiotherapists, who must work together, communicate frequently, and have a common goal to care for the patients. The World Health Organization (WHO) also recommends medical students to learn the principles of teamwork in their training. Moreover, nowadays, the work duty of a doctor is heavily loaded, physically and emotionally. The development of regular self-reflection in practice would help the students to enhance resilience in managing stress. In this course, Myers-Briggs Type Indicator (MBTI) will be used as a tool to help the students to reflect on how their values, needs, and personality traits greatly influence the helping process and style. Apart from MBTI, Mindfulness is recognized by the leading Medical Schools worldwide as a beneficial practice for their students and residents. Mindfulness is cultivated to promote self-care, self-awareness, and empathy with the ultimate aim of mutually improving the well–being of doctors-in-training and for the long term patient care with good quality. The course covers 3 different themes for students to explore and reflect. It includes:a. being an effective team player and negotiator; b. understanding personality type and professional Care Style through Myers-Briggs Type Indicator (MBTI); andc. Mindfulness and Cognitive techniques for medical students.\r", "outcome": "After completing the course, students are able to:  • acquire basic negotiation and helping skills in crisis scenes related to work settings  • have higher self-awareness and understanding of their own Care Style, based on their 16 MBTI personality type preferences • have specific recommendations on how they can flex their particular Care Style to increase patient’s satisfaction • reflect on how their individual personality type preferences affect the teamwork, communication and potential source of stress in clinical setting  • involve in the discussions relating to the professional issues, practical situations and attitudes necessary for the professionals • reflect their clinical experiences through peer review, constructive feedback and consultation by the medical professional • acquire and apply basic mindfulness and cognitive techniques", "syllabus": "The course is divided into three parts which aim to engage students' active participation and self-reflection.   Part 1: Being an effective team player and negotiator  - Teamwork in health care setting  - Introduction to negotiation and helping skills - Group discussion   Part 2: Understanding personality type and professional Care Style though MBTI  - Introduction of MBTI - Online questionnaire assessment  - Interpretation of MBTI result, Care Style and recommendations to self-development   Part 3: Mindfulness and Cognitive techniques for medical students", "required_readings": "N/A", "recommended_readings": "Teamwork and Negotiation:  World Health Organization. (2009). Being an Effective Team Player. WHO Patient Safety Curriculum Guide for Medical School. Retrieved from https://apps.who.int/iris/bitstream/handle/10665/44091/9789241598316_eng.pdf?sequence=1&isAllowed=y   MBTI and self-reflection:  Baker, E. K. (2003). Caring for ourselves: A therapist's guide to personal and professional well-being. Washington, DC: American Psychological Association. Davis Katrina, R., Banken Joseph, A. (2005). Personality type and clinical evaluations in an obstetrics/gynecology medical student clerkship. American Journal of Obstetrics & Gynecology, 193(5), 1807–1810. Ellis, A. (1999). How to control your anxiety before it controls you. New York, NY: Citadel Press. Katz, J., Lamperti, A., & Gaughan, J.P. (2007). MBTI types, gender and residency selection. Journal of Psychological Type, 67, 51-58. Myers, I.B., & Myers, P.B. (1980). Gifts Differing: understanding personality type. Mountain View, CA: Davies-Black Publishing. Wallace, J.E., & Lemaire, J. (2009). Physician well being and quality of patient care: An exploratory study of the missing link. Psychology, Health & Medicine, 14(5), 545-552. Sagone, E., & Elvira De Caroli, M. (2014), A Correlation Study on Dispositional Resilience Psychological Well-being, and Coping Strategies in University Students. American Journal of Educational Research, 2(7), 463-471.  Mindfulness:  Irving, J.A., Dobkin, P. L., Park, J. (2009). Cultivating mindfulness in health care professionals: A review of empirical studies of mindfulness-based stress reduction (MBSR). Complementary Therapies in Clinical Practice, 15, 61–66. Kabat-Zinn, J. (2005). Wherever you go, there you are: Mindfulness meditation in everyday life. New York, NY: Hyperion.  Nhat Hanh, T. (1991). Peace is every step: The path of mindfulness in everyday life. New York, NY: Bantam.", "terms": {"2020-21 Acad Year (Medicine)": {"-W01-WKS (1007)": {"startTimes": ["9:30"], "endTimes": ["17:15"], "days": [2], "locations": ["Prince of Wales Hospital"], "instructors": ["Staff"]}}}, "assessments": {"Attendance": "20", "Homework or assignment": "40", "Participation": "40"}}, {"code": "3400", "title": "Human Function II", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "DiscussionLaboratoryLectureInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 3 (MYR3)", "description": "This course focuses on the physiological function and pharmacological regulation of respiratory, endocrine, reproductive and nervous system as well as the integrated control of various body functions that involve hormonal, neural and immunological mechanisms. The course includes lectures, practicals and small group tutorials. Topics include: respiratory physiology, endocrinology, reproductive physiology, nervous system function, basic immunology and drug actions in pain control, CNS function and inflammation.\r", "outcome": "After completing the course, students should be able to:\r 1. describe the functions of respiratory, endocrine, reproductive, nervous and immune systems and how these are regulated; 2. describe the integrated control of various body systems by neural, hormonal and immune mechanisms; and\r 3. identify the use of important drugs in regulating functions of the airway, endocrine, reproductive, central nervous and immune systems and inflammation.", "syllabus": "1) Respiratory physiology\r 2) Endocrinology\r 3) Reproductive physiology\r 4) Nervous system function\r 5) Drugs in pain control and anaesthesia\r 6) Drug action on the central nervous system\r 7) Drug interactions / toxicology\r 8) Basic immunology\r 9) Autacoids and inflammation", "required_readings": "Recommended textbooks are listed in the Student Handbook and the teaching materials provided by the teachers.", "recommended_readings": "Recommended references are listed in the Student Handbook and other suggested readings provided by the teachers.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1021)": {"startTimes": ["14:30", "8:30", "9:30"], "endTimes": ["18:15", "12:15", "12:15"], "days": [2, 4, 2], "locations": ["No Room Required", "No Room Required", "No Room Required"], "instructors": ["Dr. NG Yuen Keng, \n\rProfessor YUNG Wing Ho", "Dr. NG Yuen Keng, \n\rProfessor YUNG Wing Ho", "Dr. NG Yuen Keng, \n\rProfessor YUNG Wing Ho"]}}}, "assessments": {"Discussion": "2", "Essay test or exam": "9", "Lab reports": "2", "Short answer test or exam": "36", "Selected response test or exam": "51"}}, {"code": "3500", "title": "Doctor and Patient II", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "LecturePracticumProjectSeminarInteractive TutorialVisit", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 3 (MYR3)", "description": "The doctor and patient relationship is essential to medical care and is a dynamic relationship. A therapeutic relationship enables the health professional and the patient to engage and effect beneficial change in the patient. This therapeutic relationship may be one encounter or lifelong. The student should already have a deep understanding of the challenges from the doctor’s perspective and the range and variety of medical conditions of patient presentation. This course is a continuation of Doctor and Patient I and takes a deeper exploration of patient’s perspective and narrative and how this impacts the patient doctor interaction and communication strategies. The student also continues to engage with the family as the child is reaching one year old and interact and observe family dynamic, child development, health beliefs and social, medical and community support.The course has two components:Part I: Doctor-patient relationship in the communityThis is a continuation of the clinical visits with a doctor. During these visits, the attention is now drawn to the patient’s perspective and narrative in looking and listening closely to the words, tones, gestures and actions used in the patient’s experience of illness, the communication and the interaction and exchange between the doctor and the patient. Meanwhile, issues relating to caring for those in decline and dying are discussed. Part II: Child and family development in the communityThis is the continuation of the family follow up project in which the students observe, interact and gain insight into the biological, social, psychological and medical context of care in the child's first year of life. This course is taught by a series of lectures and small group tutorials. There are clinical visits to family doctors and visits and interviews with a family.", "outcome": "After completing the course, students should be able to: describe and illustrate communication strategies used to enhance the patient-doctor relationship; demonstrate and explain close reading and listening to the patient narrative and experience of illness; understand types of illness trajectories and the role of doctor in patient-centred care; and evaluate and contrast the health, social, family and developmental issues of a child in the first year of life.", "syllabus": "   Topic Contents/fundamental concepts   Patient narratives Close observation, reading and listening of patient narratives, empathy and patient-centred care   Doctor- patient Communication Use of verbal and non-verbal communication and empathy and care in the consultation   First year of life Health, psychological, social and development aspects of the first year of life of the child and his/her family.  ", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1035)": {"startTimes": ["14:30"], "endTimes": ["18:15"], "days": [4], "locations": ["No Room Required"], "instructors": ["Professor WONG Carmen"]}}}, "assessments": {"Attendance": "5", "Essays": "60", "Participation": "5", "Report": "30"}}, {"code": "3510", "title": "Clinical Examinations in Medicine and Surgery", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "LectureOthersPracticum", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 4 (MYR4)", "description": "The Clinical Examinations in Medicine and Surgery is held at the end of the academic year. Students are assessed in terms of their medical and surgical clinical skills, it also forms part of their Second Professional Examination. The goal is to determine the skills and knowledge students learned during their Junior Surgical Dressership, Junior Medical Clerkship and other subjects, such as Communication Skills.\r", "outcome": "See details for individual courses MEDU3110, MEDU3210, MEDU3200, MEDU3340.", "syllabus": "See details for individual courses MEDU3110, MEDU3210, MEDU3200, MEDU3340.", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"-O01-OTH (1055)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Staff"]}}}}, {"code": "3520", "title": "Clinical Anatomy and Clinical Skills", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "LecturePracticumInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 3 (MYR3)", "description": "This course is a 3-week bridging course taught at the end of the year 3, i.e., the final year of preclinical education in the MBChB programme. It is aimed to help student to revise anatomy of all body regions and appreciate their relevance in basic skills in clinical examinations of the human body. It is an intensive course taught by basic and clinical lectures, e-lectures, interactive radiology sessions and small group clinical skill practical involving actual patients.\r", "outcome": "After completing the course in Medicine Year 3, students should be able to:\r 1. revise anatomical structure in major regions of the human body;  2. apply this anatomical knowledge to radiological imaging; 3. appreciate clinical relevance of this anatomical knowledge; and \r 4. apply relevant anatomical knowledge to basic clinical skills.", "syllabus": "1) Thorax and abdomen: This session is taught in the first week. It covers a review on anatomy of thorax and abdomen, radiological examinations of these regions, diseases associated with the heart, lung and pleural cavity, abdomen and Pelvis, and inguinal hernia. Clinical skills related to examination of these regions will be taught in the practical. \r 2) Limbs: This session is taught in the second week. It includes normal anatomy of the upper and lower limbs, radiological examinations, and clinical problems associated with the shoulder, upper limb, hip and thigh, and knee, leg and foot. Clinical examinations of structures in the limbs will be covered in the practical. \r 3) Head and neck, and the spine: This session is taught in the third week, covering topics in normal structure of the skull, brain, face and neck, and vertebral column. Radiological examinations and clinical relevance of these structures are covered. Clinical examinations of cranial nerves, neck and thyroid, and neural controls of limbs and trunk will be taught in the practical.", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1049)": {"startTimes": ["13:30", "13:30", "13:30", "8:30", "8:30", "8:30"], "endTimes": ["18:15", "18:15", "18:15", "13:15", "13:15", "13:15"], "days": [2, 1, 3, 2, 5, 4], "locations": ["Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital"], "instructors": ["Professor CHAN Sun On", "Professor CHAN Sun On", "Professor CHAN Sun On", "Professor CHAN Sun On", "Professor CHAN Sun On", "Professor CHAN Sun On"]}}}}, {"code": "3600", "title": "Basic Pathology", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "LaboratoryLectureInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 3 (MYR3)", "description": "This is a 3-week course aiming to help medical students bridging their pre-clinical knowledge and their upcoming clinical practice. Week 1 consists of general pathologic principles by Anatomical Pathology. Week 2 includes of immunology subjects by Chemical Pathology and Forensic Pathology particulars. Week 3 unveils the world of microbes by Microbiology. This intensive summer course includes lectures, e-lectures, laboratories and small-group tutorials.", "outcome": "After completion of this course, medical students should be able to: \r 1. acquire basic pathologic principles; 2. understand important pathologic definitions; 3. appreciate the range of pathologic services provided by Anatomical Pathology, Chemical Pathology, Forensic pathology and Microbiology; 4. apply appropriate pathologic studies in the clinical management of a patient.", "syllabus": "Anatomical Pathology(Week 1):\r Topic: 1.     Introduction to Pathological Science\r Content: Division of pathology departments\r  Anatomical pathologic practices\r  Topic: 2. Cellular Injury and Cell Death\r Content: Etiology and types of injuries\r  Necrosis and apoptosis\r  Types of necrosis\r  Infarction\r  Topic: 3. Subcellular Injury and Cellular Adaptation\r Content: Reversible injuries\r  Types of cell adaptations\r  Intracellular accumulations\r  Calcifications\r  Topic: 4. Inflammation and Repair\r Content: Acute inflammation\r  Chronic inflammation\r  Healing, repair and regeneration\r  Topic: 5. Amyloidosis & Hemodynamic Disturbances\r Content: Thrombosis\r  Embolism\r  Congestion\r  Edema\r  Shock\r  Topic: 6. Neoplasia\r Content: Classical pathology\r  Molecular mechanisms\r  General principles\r  Nomenclature\r  Malignant neoplasms versus benign tumors\r  Global burden\r  Tumor behavior\r  Implications to clinical intervention\r  Topic: 7. E-Learning: Environmental and Nutritional Diseases\r Content: Environmental effects on global disease burden\r   Health effects of climate change\r  Toxicity of chemical and physical agents\r  Environmental pollution\r  Occupational health risks\r  Alcohol\r  Adverse drug reactions and drug abuse\r  Nutritional diseases\r  Chemical Pathology(Week 2):\r Topic: Diseases of Immunity\r Content: Complement\r  Innate immunity\r  Adaptive immunity\r  B-cell responses\r  T-cell responses\r  Allergy\r  Hypersensitivity\r  Immunological tolerance and autoimmunity\r  Immune deficiencies\r  Forensic Pathology(Week 2)\r Topic: Forensic Pathology\r Content: Changes after death\r  Forensic investigation of death\r  Examination of wounds and injuries\r  Asphyxia and injuries\r  Sexual offences, abortion and child abuse\r  Microbiology(Week 3)\r Topic: Microbiology\r Content: Bacterial morphology and physiology\r  Staphylococci and Streptococci\r  Mycobacteria\r  E-learning: BICM\r  Enteric Gram negative bacilli", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1051)": {"startTimes": ["8:30", "13:30", "8:30", "8:30", "8:30"], "endTimes": ["12:15", "18:15", "12:15", "12:15", "12:15"], "days": [3, 4, 5, 2, 1], "locations": ["Online Teaching", "Online Teaching", "Online Teaching", "Online Teaching", "Online Teaching"], "instructors": ["Professor TO Ka Fai", "Professor TO Ka Fai", "Professor TO Ka Fai", "Professor TO Ka Fai", "Professor TO Ka Fai"]}}}}, {"code": "3700", "title": "Bioethics III", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "DiscussionLectureInteractive TutorialVisitWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 3 (MYR3)", "description": "Year 3 is the last pre-clinical year in the MBChB programme. It builds on the foundational subject areas introduced during years 1 and 2, while preparing students for the clinical years’ ethics curriculum. Topics addressed include health policy, public health, and research ethics, all of which are examined in terms of philosophical considerations and relevant empirical research.Year 3 is presented in a three-part mini-course format comprised of:• major philosophical issues in bioethics of significance in clinical practice and health policy;• public health ethics that are of global and Hong Kong relevance;• research ethics, i.e., the essentials for future clinicians, physician-researchers, and physician administrators", "outcome": "By the end of the course, students should be able to: apply critical thinking skills and tools of ethical analysis in recognizing and working to resolve difficult ethical dilemmas in biomedicine; identify critical trends, events, and episodes that have influenced the development of bioethics; analyze the social, political, cultural, and scientific factors that have shaped the development of bioethics; evaluate the motivations, beliefs, and actions of key actors – including physicians, scientists, patients, legislators, jurists, philosophers, and activists – who have shaped the history of bioethics; identify many of the fundamental ethical issues underlying contemporary biomedical practices in the three subject areas; map the various positions that have been proposed in an effort to resolve controversial bioethical issues, identify the arguments for and against each proposal, and discern any common ground between otherwise divergent viewpoints; and present clear, concise and carefully reasoned arguments in writing.", "syllabus": "Philosophy and Policy in Bioethics mini-course     1. Module 1                a. Models of the Physician-Patient Relationship and The Ends of Medicine     2. Module 2                a. Confidentiality and Risk: Physician Obligation and Public Safety     3. Module 3                a. Brain Death and Its Discontents: When Does “Someone” Come to an End?Public Health mini-course     4. Module 4                a. Diet and Obesity—a case study in public health ethics     5. Module 5                a. Aging and public healthcare challengesResearch Ethics mini-course     6. Module 6                a. Core issues in research integrity                b. Ethics of human subjects’ research with a focus on its relevance to clinical care     7. Module 7                a.   Ethics of genomic research and other new technologies", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1040)": {"startTimes": ["12:30", "14:30"], "endTimes": ["14:15", "17:15"], "days": [1, 4], "locations": ["Online Teaching", "Online Teaching"], "instructors": ["Dr. NGAN Miu Yung Olivia", "Dr. NGAN Miu Yung Olivia"]}}}, "assessments": {"Essays": "60", "Presentation": "20", "Selected response test or exam": "20"}}, {"code": "3800", "title": "Bioethics IV: Law and Medicine", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "ClassworkDebateDiscussionIndependent StudyLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 4 (MYR4)", "description": "The course builds on the foundation of Years 1-3 studies in bioethics to consider physician obligation expressed in law, regulations, professional codes and widely held norms of medical ethics. Areas considered include the doctor-patient relationship, patient capacity, consent, confidentiality, medical error and negligence, forensic pathology and related medical-legal issues, blood transfusion, end of life care and issues on the beginning of life. Attention is also devoted to presenting a general framework of the legal system, in understanding the difference between civil law and criminal law, branches of the law, the hierarchy of laws, the court system and the law making process. Students will study and consider the distinctions and possible conflicts among law and regulation, professional standards, and generally recognized normative ethical obligations.", "outcome": " Understand the Hong Kong legal framework governing selected ethically complex topics in clinical practice and policy Recognize governing bodies and professional standards for selected ethically rich topics in clinical practice and policy Understand generally accepted normative standards and requirements in relationship to selected ethically rich topics in clinical practice Consider and gain insight into the ethics of patient care in the overlapping contexts of Chinese and modern biomedicine Consider challenges and gain initial skills in demonstrating respect and empathy in the clinical setting", "syllabus": "This course will consist of five to eight modules of case-based study of legal, professional and normative standards governing:1. The doctor patient relationship and issues relating to patient capacity, consent, confidentiality2. Medical error and medical negligence3. Laws, regulations and norms relating to the beginning of life4. Laws, regulations and norms relating to the end of life care5. Forensic pathology and related medical-legal issuesGeneral legal topics will include:6. Introduction to the legal system7. Important legislation related to medical practice, .e.g. anti-discrimination legislation, protection of privacy legislation, offences against the persons ordinance, theft ordinance, public health and municipal services ordinance, medical registration ordinance, etc. (Specialist areas will be covered in the clinical years.)", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1034)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Staff"]}}}}, {"code": "3900", "title": "Elective", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "Others", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "", "description": "This elective course aims to enhance the diversity of experiential learning of MBChB students, and to foster their lifelong interest in medical related practice. Students will be required to conduct a self-initiated educational activity of not less than 26 weeks. A proposal should be submitted to the Course Committee for endorsement before commencement of the activity and a written report should be submitted for assessment upon completion.\r", "outcome": "To enhance the diversity of experiential learning of students and foster their lifelong interest in either medical research, humanitarian medical practice or study in society and medicine.", "syllabus": "A self-arranged educational activity on either medical research, humanitarian medical practice or study in society and medicine for not less than 26 weeks.", "required_readings": "N/A", "recommended_readings": "N/A", "terms": {"2020-21 Acad Year (Medicine)": {"-O01-OTH (1043)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Staff"]}}}}, {"code": "4001", "title": "(Part I) Third Professional Examination", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "DiscussionLectureOthersProjectSeminarInteractive TutorialVisit", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "", "description": "Students are required to pass the four module examinations (namely, Community & Family Medicine, Obstetrics & Gynaecology, Paediatrics, and Psychiatry) as well as the End-of-year Combined Clinical Examination and to achieve a pass in the (Part I) Third Professional Examination in order to be eligible for promotion to year six.", "outcome": "See details for the individual modules (Community & Family Medicine, Obstetrics & Gynaecology, Paediatrics, and Psychiatry)", "syllabus": "See details for the individual modules (Community & Family Medicine, Obstetrics & Gynaecology, Paediatrics, and Psychiatry)", "required_readings": "NIL", "recommended_readings": "", "terms": {"2020-21 Acad Year (Medicine)": {"-O01-OTH (1056)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Staff"]}}}}, {"code": "4002", "title": "(Part II) Third Professional Examination", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "Others", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 6 (MYR6)", "description": "Students are required to pass the (Part II) Third Professional Examination in Medicine and Surgery for conferment of the Bachelor MBChB Degrees.", "outcome": "See details for the individual courses MEDU4610 and MEDU4710.", "syllabus": "See details for the individual courses MEDU4610 and MEDU4710.", "required_readings": "N/A", "recommended_readings": "N/A", "terms": {"2020-21 Acad Year (Medicine)": {"-O01-OTH (1058)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Staff"]}}}, "assessments": {"Others": "60", "Short answer test or exam": "19", "Selected response test or exam": "21"}}, {"code": "4010", "title": "Community and Family Medicine Module", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "DiscussionExerciseLecturePracticumProjectSeminarInteractive TutorialVisitWorkshop", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 5 (MYR5)", "description": "This course provides 9 weeks of integrated teaching in Community and Family Medicine. In Community Medicine, three major areas are covered: Epidemiology, Public Health Practice, and Occupation and Environmental Health. Students are introduced to the principles and practice of public health, the application of epidemiological methods, and the prevention and control of communicable, non-communicable and occupational diseases. In addition to didactic lectures, students are required to actively participate in problem-solving exercises, field visits and presentations in seminars and tutorials. The clinical clerkship in Family Medicine teaches practical family medicine skills and equips students with the understanding and ability to diagnose and manage common medical conditions that present in primary care settings. Throughout the clerkship, students are taught skills in making differential diagnoses of presenting symptoms, prioritisation of multiple medical conditions and first line investigations and management of common medical problems in the community. Students also gain exposure to the basic principles and practice of family medicine, i.e., providing primary, comprehensive, holistic and continuing person centred care. The clinical clerkship consists of online teaching, case based seminars and tutorials, clinical attachments to private family medicine providers, Hospital Authority clinics and community hospitals and health care providers for vulnerable populations. To facilitate learning, role playing in workshops and clinical enhanced skills training are provided. Facilities utilised for this clinical teaching include the University Family Medicine Clinics, and Family Medicine clinics run by Hospital Authority and private practitioners, both in public and private settings across throughout Hong Kong.", "outcome": "By the end of the Module, students are expected to:  1. Understand and apply the principles and methods of studying health problems in population groups;  2. Know the major causes of mortality and morbidity in Hong Kong, including communicable and non-communicable diseases, and understand strategies of prevention and control of these problems;  3. Know the organization of health services and medical practice in Hong Kong;  4. Understand the principles and practice of occupational medicine and environmental health;  5. Apply the principles and methods of epidemiology in health care practice;  6. Adopt a person centred family medicine approach to clinical consultation and evidence based medicine;  7. Apply a family medicine approach in diagnoses formulation and first line management of common acute and chronic problems in primary care;  8. Counsel patients on lifestyle behavioral approach to health promotion in community settings; and 9. Understand the role and interactions of health and social issues and resources in the community.", "syllabus": "1. Epidemiology & Public Health Practice 2. Occupational and Environmental Health 3. Community Health Visit 4. Clinical Attachments to family doctors (Private and HA clinics) 5. Home Visit to a patient with chronic disease 6. Video consultation – Reflection and discussion 7. Family Medicine Consultation Skills workshops Sessions 8. Visits to health care providers in the community and vulnerable populations", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1024)": {"startTimes": ["8:30", "10:30", "8:30", "8:30", "8:30"], "endTimes": ["16:15", "18:15", "16:15", "16:15", "16:15"], "days": [1, 4, 5, 3, 2], "locations": ["Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital"], "instructors": ["Staff", "Staff", "Staff", "Staff", "Staff"]}}}, "assessments": {"Essays": "5", "Others": "40", "Participation": "10", "Report": "15", "Short answer test or exam": "30"}}, {"code": "4110", "title": "Obstetrics and Gynaecology Module", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "DebateDiscussionLectureOthersPracticumSeminarInteractive TutorialVisitWeb-enhanced TeachingWorkshop", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 5 (MYR5)", "description": "This 9-week module includes 4 clinical rotations that are based mainly at the Prince of Wales Hospital: (1) antenatal clinic and ward; (2) gynaecology clinic and ward; (3) labour ward; and (4) O&G services in affiliated hospitals. Core materials are covered in online lectures, tutorials and bedside teaching. During the antenatal attachment, students gain understanding of normal pregnancy, the development and growth of the unborn child, and acquire skill in performing obstetrics examination. In the labour ward attachment, students participate in the care and delivery of normal pregnancies, as well as observe operative deliveries. They learn common problems and emergencies in childbirth and the postpartum period. In the gynaecology rotation, students learn common gynaecological conditions and neoplasm of the female reproductive tract. They also acquire skill in gynaecological examination. Communication skills in taking history and conducting discussions on issues regarding sexuality and reproduction are emphasized. Students have the opportunity to rotate to the O&G unit in one of the following affiliated hospitals for attachment: Princess Margaret Hospital, Tuen Mun Hospital, United Christian Hospital, Queen Elizabeth Hospital and Kwong Wah Hospital. Students are also assigned an attachment at the Family Planning Association during the module.", "outcome": "By the end of the rotations, students are expected to be able to manage and counsel patients on common obstetric and gynaecological problems in a primary care setting.  1. Understand how to obtain obstetric & gynaecological history from patients with common O&G problems and communicate appropriately with female patients including sensitive issues in the medical history 2. Learn how to perform obstetric, bi-value speculum and bimanual examination in female patients 3. Learn how to order appropriate investigations for common obstetrics and gynaecological conditions, derive the correct diagnosis and formulate a management plan 4. Identify pregnancy risks and provide appropriate counselling 5. Recognise obstetric and gynaecological emergencies and formulate management plan 6. Diagnose and discuss the management of common malignancies and pre-malignant conditions in female patients 7. Become familiar with various obstetrics and gynaecological procedures 8. Discuss the management of common women’s health issues and counsel patient on screening and primary disease prevention 9. Become aware of major ethical and medical-legal issues related to O&G practice", "syllabus": "1. Clinical examination skills in obstetrics and gynaecology 2. Antenatal assessment and pregnancy care 3. Normal and operative delivery 4. Nutrition in Pregnancy and Lactation 5. Pregnancy complications and medical disorders complicating pregnancy 6. Contraception and family planning 7. Menstrual disorders and pelvic pain 8. Reproductive endocrinology 9. Genital prolapse and urinary incontinence 10. Gynaecological malignancy 11. Women's health", "required_readings": "Essential Obstetrics and Gynaecology International Edition Symonds I. and Arulkumaran S, Churchill Livingstone, 2013 (5th edition)  Clinical Obstetrics and Gynaecology Magowan B., Owen P., and Drife J., Edinburgh: Elsevier, 2014 (3rd edition)  Obstetrics by Ten Teachers  Baker P. and Kenny L., London: Arnold; New York: Co-published in the USA by Oxford University Press, 2011. (19th Edition)   Gynaecology by Ten Teachers Monga A. and Dobbs S., London: Arnold; New York: Co-published in the USA by Oxford University Press, 2011. (19th Edition)", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1025)": {"startTimes": ["8:30", "8:30", "8:30", "8:30", "8:30"], "endTimes": ["16:15", "16:15", "16:15", "16:15", "16:15"], "days": [1, 5, 4, 3, 2], "locations": ["Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital"], "instructors": ["Staff", "Staff", "Staff", "Staff", "Staff"]}}}, "assessments": {"Others": "30", "Presentation": "20", "Short answer test or exam": "25", "Selected response test or exam": "25"}}, {"code": "4201", "title": "Skills Module for Medicine Year 5", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "DiscussionLectureOthersSeminarInteractive TutorialVisit", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 5 (MYR5)", "description": "Clinical MethodsThe goal of this course is to further consolidate the students' abilities in history taking and physical examination, i.e., the skill in gathering relevant clinical information to reach a working diagnosis in Community & Family Medicine, Obstetrics & Gynaecology, Paediatrics, and Psychiatry.Communication SkillsStudent's skills in case presentation and discussion will be reinforced through practice and feedback in small groups and under guidance.\r", "outcome": "By the end of the course, students are expected to be able to:\r 1. identify and plan to resolve clinical problems through history taking, physical examination, evaluation and planning of diagnostic procedures; 2. understand and appreciate the interfaces and interdependence among the clinical disciplines addressed in Community & Family Medicine, Obstetrics & Gynaecology, Paediatrics, and Psychiatry; and\r 3. understand how a clinical problem affects the whole person.", "syllabus": "See details for the individual modules (Community & Family Medicine, Obstetrics & Gynaecology, Paediatrics, and Psychiatry)", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1026)": {"startTimes": ["8:30", "8:30", "8:30", "8:30", "8:30"], "endTimes": ["16:15", "16:15", "16:15", "16:15", "16:15"], "days": [1, 5, 4, 3, 2], "locations": ["Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital"], "instructors": ["Staff", "Staff", "Staff", "Staff", "Staff"]}}}}, {"code": "4202", "title": "Skills Module for Medicine Year 6", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "LectureOthers", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 6 (MYR6)", "description": "Skills Modules for Medicine Year 6 is embedded in the medical and surgical modules.Life long learning skills provide a “medical professionalism” component. Medical professionalism is primarily concerned with the attributes and behaviours of physicians in the practice of Medicine. The teaching of medical professionalism builds on introductory lectures provided in prior years and informal \"role modeling\" that occurs during the clinical curriculum. The module is designed to expand the students' cognitive base for professionalism, and to provide opportunities for internalizing related values and behaviours by collaborating in small group problem solving sessions. The workshops require analysis and development of moral solutions for simulated ethical dilemmas. Feedback provided by small groups to their whole class enables reflection and informed discussions.", "outcome": "1. Practice life-long learning skills.\r 2. Demonstrate professional collaboration.\r 3. Use ethical and moral principles to resolve ethical dilemmas within simulated contexts.", "syllabus": "Life-long learning skills\r Evidence-based practice embedded within clinical bedside and tutorial teaching.\r Professional Conduct Integrated Teaching Session: Lecture 1h, problem based learning tutorial 2h followed by class presentations 1.5h = 4.5h", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1027)": {"startTimes": ["8:30", "8:30", "8:30", "8:30", "8:30"], "endTimes": ["16:15", "16:15", "16:15", "16:15", "16:15"], "days": [1, 5, 4, 3, 2], "locations": ["Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital"], "instructors": ["Staff", "Staff", "Staff", "Staff", "Staff"]}}}}, {"code": "4210", "title": "Paediatrics Module", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "LecturePracticumSeminarInteractive TutorialVisit", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 5 (MYR5)", "description": "During this 9-week clinical module in paediatrics, students participate in a range of learning activities both in the hospital and in the community. Hospital-based experiences include the wards and outpatient clinics of the Prince of Wales Hospital as well as other regional hospitals. Students are exposed to primary care paediatrics in community-based centres, including the Maternal and Child Health Centres, Child Assessment Centres, Hong Chi Pinehill School and primary care private paediatric clinics. Lectures are combined with bedside and tutorial teaching. As part of the mentorship programme, students attend interactive teaching on bioethics and communication skills.", "outcome": "1. Acquire a core of basic knowledge that is commensurate with the amount of exposure students have to paediatrics, in particular clinical presentation, aetiology and pathology, principles of management, prevention and psycho-social consequences of common disorders seen in Hong Kong. \r 2. Recognise that (i) childhood is but one part of the human life span and that many problems of children have their origins before birth; (ii) given improved methods of care, more children are surviving chronic illness into adulthood with important medical, educational and social consequences; and (iii) childhood illness can and often does lead to problematic outcomes and consequences in adult life. \r 3. Use competently the clinical method to identify and plan to resolve clinical problems through: \r • reliable, relevant and sensitive history taking, relating effectively to parents and children;  • thorough, accurate and gentle physical examination;  • concise evaluation of the presenting clinical problem;  • orderly planning of any further diagnostic procedures which might be indicated to establish a diagnosis;  • appreciation of the PRINCIPLES of treatment (including the roles of other health professionals, e.g., speech therapists, physiotherapists, social workers, clinical psychologists in management);  • understanding the principles underlying FOLLOW-UP assessment in order to appreciate the natural or assisted course of a clinical problem;  • awareness of the psycho-social consequences (the impact of illness on behaviour, education, family life) of illness and its simple medico-legal consequences; and \r • appreciation of a broad, holistic and sensitive outlook towards the total health of individuals and communities. \r 4. Demonstrate skill in communicating with a child, parents and fellow professional workers, including traits of empathy, patience, kindness and counselling ability. \r 5. Provide at the bedside an orderly presentation of a clinical problem.\r 6. Appreciate the manner in which paediatric problems, their management and prevention interrelate with the practices of other disciplines, especially community medicine, psychiatry and obstetrics.", "syllabus": "On the first day of the module students will be given an introduction to the Paediatric Clinical Method to emphasize differences in approach that might exist between adults and children and between older children and younger children.\r Students will be allocated to one of eight groups (consisting of 7-8 students per group) that will rotate through the Prince of Wales Hospital and two of the four outside hospitals (United Christian Hospital, Kwong Wah Hospital, Alice Ho Miu Ling Nethersole Hospital and Tseung Kwan O Hospital).\r Lectures will be given on Mondays to all students in the module. Students will visit a Child Assessment Centre and also learn about the Student Health Service.\r On Tuesdays, students in groups will visit a number of regional hospitals (Princess Margaret Hospital, Queen Elizabeth Hospital, Tuen Mun Hospital, Caritas Medical Centre) and outside institutions (Hong Chi Association, Maternal & Child Health Clinic).\r On Wednesdays, Thursdays and Fridays students will undertake ward work which will involve clerking patients, participating in tutorials and bedside teaching sessions and attending outpatient clinics.\r Students will also participate in case studies and role play as interactive teaching on communication skills and give presentations on important bioethical topics.", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1028)": {"startTimes": ["8:30", "8:30", "8:30", "8:30", "8:30"], "endTimes": ["16:15", "16:15", "16:15", "16:15", "16:15"], "days": [1, 5, 4, 3, 2], "locations": ["Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital"], "instructors": ["Staff", "Staff", "Staff", "Staff", "Staff"]}}}}, {"code": "4300", "title": "Clinical Ethics I", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "DiscussionLectureWorkshop", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 5 (MYR5)", "description": "In Year 5, students rotate to attend teaching and learning activities under four clinical disciplines namely, Community and Family Medicine, Obstetrics and Gynaecology, Paediatrics, and Psychiatry. This course introduces clinical ethics and decision at the bedside arising from some special circumstances in the clinical practice of each discipline. In the Family Medicine module, students will learn about issues in common clinical encounter, including taking a sexual history, truth-telling, breaking the bad news, and dealing with clinical errors. Through small group teachings, students able to observe and discuss challenges with experienced local practitioners.In the Obstetrics and Gynaecology module, students will learn about ethical issues through the interactive student forum and seminar, such as termination of pregnancy, reproductive autonomy in the face to emerging technologies, as well as obstetricians' role in the decision-making between pregnant women and the potential human — fetus.In the Paediatrics module, students will learn about bioethical considerations that paediatricians face while treating children for health conditions. For children, unlike for adult patients, healthcare decisions are often made by someone other than the person to be treated, i.e. by the parents/primary carers. Issues of patient confidentiality, consent for treatment, and child protection require the treating doctor to be aware of the specific needs and desires of the child, and to be able to respect and adequately address situations when the child's and parents' views and needs diverge. In the Psychiatry module, students will learn about common and unique bioethical considerations that psychiatry faces while treating patients with mental health conditions, such as patient confidentiality, consent for treatment in psychiatric illness, and capacity determination.In addition, students are required to attend the annual Lanson Lecture hosted by the CUHK Centre for Bioethics.", "outcome": " To develop moral sensitively to identify the ethical problems that arise in day-to-day clinical practice To determine the right course of action when unethical practices or behaviours are observed in clinical practice", "syllabus": "Syllabus is embedded in the teaching given to students in obstetrics and gynaecology, paediatrics , psychiatry and community & family medicine.", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1017)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Prince of Wales Hospital"], "instructors": ["Staff"]}}}, "assessments": {"Discussion": "15", "Essays": "10", "Essay test or exam": "25", "Presentation": "40", "Participation": "10"}}, {"code": "4310", "title": "Psychiatry Module", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "LectureOthersPracticumInteractive TutorialVisit", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 5 (MYR5)", "description": "The goal for this 9-week course in psychiatry is to enable students to: 1. understand the relationship between the psychological, biological and social determinants of psychiatric disorders; 2. acquire basic practical knowledge in diagnosing and managing psychiatric disorders of major public health concerns; 3. become acquainted with the organization of psychiatric services in Hong Kong. A variety of teaching methods are employed including seminars, small-group tutorials, attendance of ward rounds, case conferences and outpatient clinics and visits to several psychiatric facilities (hospitals and community facilities). ", "outcome": "1. Take a psychiatric history and perform a thorough mental-status examination, cognitive and neuropsychiatric assessment. \r 2. Understand the principles of psychiatric diagnosis and current classification of mental disorders. \r 3. Appreciate mind-body connections, i.e., being aware of the interactions between psychiatric and medical diseases and the impact that mental disorders have on personal, social and occupational functioning. \r 4. Understand the basic pharmacology and therapeutic use of psychotropic drugs, as well the basic principles of psychological interventions. \r 5. Become familiar with the principles of psychiatric rehabilitation and recovery within the medical system and NGOs in the community. \r 6. Be aware of major ethical issues related to psychiatric and medical practice, such as mental capacity, treatment consent, and mental health ordinance.", "syllabus": "1. Affective disorders. \r 2. Anxiety and Depressive disorders in the community stress-related disorders also including phobic states, obsessive/compulsive disorder\r 3. Schizophrenic and paranoid disorders.\r 4. Neurocognitive disorders Common psychiatric disorders in the elderly.\r 5. Neuropsychiatric conditions.\r 6. Alcohol and drug abuse.\r 7. Psychiatric disorders in relation to medical and surgical diseases.\r 8. Major psychiatric disorders in childhood such as emotional and conduct disorders.\r 9. Attention Deficit Hyperactivity Disorders and Autistic Spectrum Disorders.\r 10. Disorders of sleep and circadian rhythms.\r 11. Personality disorders, including the special relevance of psychopathic personality disorder in forensic medicine, and alcohol and drug abuse.", "required_readings": "Textbooks\r Psychiatry (Oxford Medical Publication)\r Geddes J., Price J., McKnight R., Oxford; New York: Oxford University Press, 2012 (4th Edition).\r  Oxford Handbook of Psychiatry\r Semple D., Smyth R., Oxford\r University Press, 2013 (3rd Edition).", "recommended_readings": "Reference Books\r (General Psychiatry)\r Shorter Oxford Textbook of Psychiatry\r Cowen P., Harrison P., and Burns T., Oxford University Press, 2012 (6th Edition)\r Essentials of Clinical Psychiatry\r Robert E. H., Yudofsky S. C., and Glen O.G., American Psychiatric Publishing, 2010 (3nd Edition)\r MGH Handbook of General Hospital Psychiatry\r Theodore A. Stern, Gregory L. Fricchione, Jerrold F. Rosenbaum, Saunders, 2010 (6th Edition)\r (Psychopharmacology)\r Stahl's Essential Psychopharmacology\r Stephen M. Stahl, , Cambridge University Press, 2013 (4th Edition).", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1029)": {"startTimes": ["8:30", "8:30", "8:30", "8:30", "8:30"], "endTimes": ["16:15", "16:15", "16:15", "16:15", "16:15"], "days": [1, 5, 4, 3, 2], "locations": ["Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital"], "instructors": ["Staff", "Staff", "Staff", "Staff", "Staff"]}}}}, {"code": "4340", "title": "Integrated Clinical Communication Skills II", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "DiscussionLectureOthersInteractive TutorialWorkshop", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 5 (MYR5)", "description": "Communication skills are core clinical skills that are essential in the medical consultation for effective diagnosis, management planning and teamwork coordination. This course adopts a longitudinal developmental approach spanning preclinical and clinical years. Learning outcomes and teaching modalities are both explicit, as well as interwoven within general medical and specialist rotations to enhance the integration of these core skills in mainstream clinical teaching. Teaching modalities combine e-learning and experiential learning, self and peer review and tutor feedback in communication techniques in the specialties of Community and Family medicine, Obstetrics and Gynaecology, Paediatrics and Psychiatry.\r", "outcome": "Students should be able to: \r 1. communicate effectively with individuals from diverse cultural, social and medical backgrounds;  2. reflect and critically appraise their own and others' communication skills; and \r 3. understand the evidence base and the intricacies of good communication skills as the foundation of their professional development.", "syllabus": "1. Topic: Advanced communications skills\r  Content/ key concepts:\r  Cambridge Calgary guide (Explaining and planning)\r  Managing consultations\r  Motivational interviewing\r  2. Topic: Collecting sensitive information\r  Content/ key concepts: Communication skills in taking a sexual history\r  3. Topic: Explaining errors, iatrogenic complications and adverse events\r  Content/ key concepts:\r  Dealing with errors and complaints\r  Checking compliance and understanding\r  4. Topic: Breaking bad news\r  Content/ key concepts: Principles of breaking bad news\r   5. Topic: Death and Bereavement\r  Content/ key concepts:\r  Dealing with bereaved patients or family\r  Informing death\r  6. Topic: Discipline Specific Skills in:Community and Family Medicine , Obstetrics and Gynaecology, Paediatrics and Psychiatry\r  Content/ key concepts:\r   Enhancing communication skills (above and from MEDU3340) within the context of discipline specific consultations.\r  Course activities will include:\r  Online learning\r  Communication and consultation skills workshops \r  Video assignment and reflection \r  Tutor and peer feedback", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1042)": {"startTimes": ["13:30"], "endTimes": ["18:15"], "days": [5], "locations": ["Prince of Wales Hospital"], "instructors": ["Staff"]}}}}, {"code": "4400", "title": "Clinical Ethics II", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "DiscussionLectureInteractive TutorialWorkshop", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 6 (MYR6)", "description": "The year six medical school curriculum emphasizes clinical teaching through hospital rotations in medicine, surgery and other specialized disciplines including anaesthesia and intensive care, clinical oncology, and orthopaedics and traumatology. Besides the relevant medical knowledge necessary for day-to-day care, students must also learn to navigate the complex and multifaceted terrain of healthcare relationships between all stakeholders and the ethical challenges that arise therein.Parallel to clinical teaching, the year six bioethics course will enable and allow students to apply the theoretical models of clinical ethics in healthcare delivery. The curricular design leverages clinical experiences towards ethical decision making and resolution of dilemmas. In so doing, students will develop tangible critical thinking skills in the prevention and resolution of doctor-patient conflicts, a critical step in the transition to medical professional. Emphasis is placed on navigating difficult interactions at the bedside arising from ethically complex circumstances in the practice of each discipline. Students are expected to identify ethical issues in the patient experience inclusive of the descriptive steps required to forego or resolve ethical issues.", "outcome": " To learn advanced ethical theories and moral reasoning practices for recognition, prevention and resolution of ethical dilemmas in the clinical setting To acquire the reasoning abilities to identify the root causes of ethical dilemmas To gain appreciation of the multifaceted nature of the doctor-patient relationship exercised through skilled communication tailored to the needs of each patient and family  To demonstrate critical thinking in the application of clinical ethics theories via patient and family communication that in resolves clinical conflict To develop and display professional and ethical behaviours in the clinical settings, with emphasis on understanding the importance of these skills as they relate to patient interaction ", "syllabus": " Ethics Grand Round (6 hours, 2 hours per session) Workshops on Ethical Decision Making (3 hours)  Clinical Ethics Module (3 hours, 1 hour per rotation) Multi-media engagement & discussion (2 hours)", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1046)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}}, "assessments": {"Discussion": "50", "Presentation": "25", "Participation": "25"}}, {"code": "4410", "title": "Clinical Elective", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "Others", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 5 (MYR5)", "description": "Under the guidance of, and with the approval of, the Coordinator of Clinical Electives, each student will arrange an attachment of the student's choice in Hong Kong or overseas, in order to broaden the student's medical horizons.", "outcome": "1. To appreciate the difference between the health care systems in Hong Kong and other cities or countries. \r 2. To gain an understanding of the variations in treatment approaches used in different settings.", "syllabus": "", "required_readings": "N/A", "recommended_readings": "N/A", "terms": {"2020-21 Acad Year (Medicine)": {"-O01-OTH (1053)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}}}, {"code": "4440", "title": "Integrated Clinical Communication Skills III", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "DiscussionOthersInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 6 (MYR6)", "description": "Communication skills are core clinical skills which are essential in the medical consultation for effective diagnosis, management planning and interdisciplinary coordination. This course adopts a longitudinal developmental approach spanning preclinical and clinical years. Learning outcomes and teaching modalities may be explicit, as well as interwoven within general medical, surgical and specialties rotations to enhance the integration of these core skills in mainstream clinical teaching. Teaching modalities combines e-learning and experiential learning, self and peer review and tutor feedback.\r", "outcome": "Students should be able to:\r 1. deliver news about serious illness to patients/families in a clear, sensitive, and honest manner; 2. demonstrate effective communication skills that foster intra- and inter-disciplinary team collaboration; 3. anticipate, interpret, and respond to own, patients’ & families’ and healthcare team’s emotions appropriately; 4. apply strategies for handling complaints and conflicts that arise in patient care; 5. understand the evidence base and the intricacies of good communication skills as the foundation of their professional development; and\r 6. reflect and critically appraise their own and others’ communication skills as a lifelong learner.", "syllabus": "Clinical communication skills in medicine, surgery, subspecialties and internship\r  Topics:Serious Illness Communication\r Content/ key concepts: Delivering serious news; Responding to emotion; Shared decision-making\r Weighting: 40%\r Contact Hours: 2 hours\r  Topics: Teamwork\r Content/ key concepts: SBAR tool Team leadership Interprofessional team communication\r Weighting:25%\r Contact Hours: 1.5 hours\r  Topics: Handling conflicts and complaints\r Content/ key concepts: Emotion management; Understanding concerns; Establishing common ground\r Weighting: 25%\r Contact Hours: 1.5 hours\r  Topics: Informed Consent\r Content/ key concepts: Applying principles of informed consent\r Weighting: 10%\r Contact Hours: 30 minutes", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website..", "terms": {"2020-21 Acad Year (Medicine)": {"-O01-OTH (1004)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}}}, {"code": "4510", "title": "Combined Clinical Examination", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "DiscussionLectureOthersSeminarInteractive TutorialVisit", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 5 (MYR5)", "description": "This examination, held at the end of the academic year, is cooperatively administered by the Departments of Obstetrics & Gynaecology, Paediatrics and Psychiatry and the School of Public Health and Primary Care. The examination consists of a written paper and a structured clinical examination and complements the discipline based module examinations.", "outcome": "The examination assesses the students’ abilities to (i) understand and appreciate the interfaces and interdependence among the four disciplines, and (ii) understand how a clinical problem affects the whole person.   To assess the students’ abilities, a written paper and a structured clinical examination in applying the clinical method, i.e., taking a history, reaching a working diagnosis, understanding the principles of management and their social and psychological consequences.", "syllabus": "See MEDU4010, MEDU4110, MEDU4210, MEDU4310, MEDU4201", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1057)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Staff"]}}}, "assessments": {"Others": "65", "Selected response test or exam": "35"}}, {"code": "4610", "title": "Senior Medical Clerkship", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "DiscussionField Studies/Field-tripIndependent StudyLectureOthersPracticumSeminarInteractive Tutorial", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 6 (MYR6)", "description": "The Senior Medical Clerkship consists of two ten-week modules, referred to as Medicine A and Medicine B. Medicine A consists of a ten-week attachment to the medical wards in Princess Margaret Hospital, North District Hospital, Shatin Hospital, Our Lady of Maryknoll Hospital and Prince of Wales Hospital. Students are attached to each of the above hospitals in rotation. Medicine B involves small group attachments to medical wards under the supervision of Department of Medicine and Therapeutics, Department of Clinical Oncology, and Accident and Emergency Medicine Academic Unit in the Prince of Wales Hospital. Students are attached to each of the above Departments in rotation in order to learn by daily clinical contact with patients in the respective wards. Students are encouraged to clerk patients and present during subspecialty rounds, and to follow patients’ progress during their hospital stay. Subspecialty teaching sessions are also held every Wednesday throughout the two modules. Students are attached to subspecialty activities and outpatient clinics during their respective rotations. Bedside teaching of clinical skills is arranged in small groups twice weekly. All students in these medical rotations are expected to attend medical grand rounds every Wednesday.A one-week Resident Mentorship Programme (RMP) is integrated into Medicine A. Students shadow resident mentors, learning and experiencing daily clinical work with both inpatients and outpatients. Requiring active participation in clinical activities under close supervision by frontline doctors, the programme is designed to help students develop core competencies as medical professionals. The RMP aims to nurture self-initiative, sense of responsibility, stress coping strategies, communication skills and social responsibility through experiential learning in actual clinical settings.Small group tutorials during both clerkships as well as during Resident Mentorship Programme are provided in order to further develop students' communication skills within clinical and professional settings. This includes presenting in medical rounds, writing patients' scripts and referrals, having communications with lay public concerning medical matters, handling complaints and bad news, organizing and presenting literature or decision making in clinical conferences. These skills are assessed formally in the end-of-module examinations and are also an obligatory component of final year graduating examinations. Multidisciplinary integrative sessions are maintained throughout this course.", "outcome": "1. Manage common medical problems with appropriate diagnosis, investigations and treatment.\r 2. Deliver effective and holistic care to patients.\r 3. Communicate with patients in an effective, compassionate and ethical manner.\r 4. Make decisions rationally and ethically when faced with conflicting choices in the management of patients.\r 5. Appraise and use available evidence in order to provide the best treatment for patients.\r 6. Maintain life-long learning skills throughout their medical career.", "syllabus": "Please refer to the Senior Medical Clerkship Student Handbook.", "required_readings": "All textbooks as listed on the Faculty website.", "recommended_readings": "All recommended references as listed on the Faculty website.", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1030)": {"startTimes": ["8:30", "TBA", "15:30"], "endTimes": ["16:15", "TBA", "23:15"], "days": [1, "TBA", 4], "locations": ["Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital"], "instructors": ["Staff", "Staff", "Staff"]}}}, "assessments": {"Others": "50", "Short answer test or exam": "22", "Selected response test or exam": "28"}}, {"code": "4710", "title": "Senior Surgical Dressership", "career": "Undergraduate", "units": "0.00", "grading": "Medical School Grades", "components": "LectureOthersInteractive TutorialWeb-enhanced TeachingWorkshop", "campus": "Main Campus", "academic_group": "MB ChB Pgm Comm", "requirements": "For Medical Study Year 6 (MYR6)", "description": "The Senior Surgical Dressership consists of two ten-week modules involving small group attachments under the supervision of the Department of Surgery, Department of Orthopaedics and Traumatology, Department of Ophthalmology and Visual Sciences, Department of Anaesthesia and Intensive Care, Department of Imaging and Interventional Radiology and Department of Otorhinolaryngology, Head and Neck Surgery.The attachments include professional rounds, outpatient clinics and the operating rooms in the Prince of Wales Hospital, North District Hospital, Yan Chai Hospital, Queen Elizabeth Hospital, and Hong Kong Eye Hospital. Students work with qualified professionals in order to gain hands-on clinical experience (as in an apprenticeship). Students receive small group bedside teaching on each ward. Clinical management of patients in various specialties and essential clinical skills for junior doctors are the main foci in this training.Small group tutorials are held during both the Dressership as well as during the Assistant Internship period for purposes of developing communication skills in clinical and professional settings. This includes students presenting in medical rounds, writing patients' scripts and referrals, communicating with lay public concerning medical matters, handling complaints and bad news, organizing and presenting literature or decision making in clinical conferences. These skills are assessed formally at end-of-module examinations and are also an obligatory component in final year graduating examinations. Assessments include a written exam, an OSCE and a Clinical Examination that includes history taking, physical examination, interpretation of physical signs and investigations as well as management of patients with common surgical conditions.", "outcome": "1. Take histories.\r 2. Perform physical examinations.\r 3. Interpret signs and investigations.\r 4. Manage patients with common problems requiring surgical intervention.", "syllabus": "Please refer to the Senior Surgical Dressership Student Handbook.", "required_readings": "All textbooks as listed on the Faculty website.\r E-learning materials provided by Departments", "recommended_readings": "All recommended references as listed on the Faculty website..", "terms": {"2020-21 Acad Year (Medicine)": {"--LEC (1006)": {"startTimes": ["TBA", "12:00"], "endTimes": ["TBA", "12:00"], "days": ["TBA", 1], "locations": ["Prince of Wales Hospital", "Prince of Wales Hospital"], "instructors": ["Staff", "Staff"]}}}}]