[{"code": "5111", "title": "Public Policy Process", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "Through equipping students with knowledge of major concepts, models and theories of public policymaking process, this course aims to enhance the ability of students to understand and analyze public policy problems. The course consists of the following key components: foundation of public policymaking process and policy environment, competing models of policy-making, major policymaking actors and institutions, critical factors and stakeholders in major stages of policymaking. Case studies and real-world examples are used to illustrate how the theories are put into practice.", "outcome": "1) To equip students with the capacities of thinking critically and conceptually with multidisciplinary perspectives and a coherent theoretical framework about public policy process\r 2) To understand the nature, critical factors and stakeholders in each major stage of policymaking\r 3) To be familiar with the general contexts, policy environment and major policy-making institutions in Hong Kong and major countries", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (1819)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [1], "locations": ["Esther Lee Bldg LT4"], "instructors": ["Professor Maria Del Mar FRANCESCH HUIDOBRO"]}}}}, {"code": "5121", "title": "Values and Ethics in Public Policy", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "This course aims to study the relationship between public polices and the values and ethics underlying them. It is the basic contention of this course that the making of public policies cannot be made divorced from moral and political values. These values provide justification for the legitimacy of policies. The course is divided into two parts. The first part introduces some major political theories and theoretical frameworks for students to understand the meaning and importance of values in different moral outlook. Values discussed cover rights and obligation, justice and fair procedure, freedom and democracy, community and citizenship, and the proper relation between personal and social responsibility. The second part focuses on case studies.", "outcome": "1. To understand how different moral issues arise in the making of public policy.\r 2. To develop moral framework to analyze and evaluate social policies and public affairs.\r 3. To understand fundamental concepts and values in moral and political philosophy.\r 4. To think critically and philosophically.\r 5. To apply moral concepts to analyze public policies.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (3219)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [5], "locations": ["Esther Lee Bldg LT3"], "instructors": ["Dr. FONG Kwok Wing Peter"]}}}}, {"code": "5132", "title": "Public Policy Research", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "This course focuses on the application of methodological and statistical techniques in conducting policy research, with the objective of sensitizing students to adopt an evidence-based approach to assess public policies and social programs. Course contents include basic concepts in research designs, data collection techniques and statistical analyses. Discussions include both the qualitative and quantitative approaches to evaluate effectiveness, efficiency, and public accountability that define good public policies and social programs. Special attentions are given to the influences of the political environment and the competing interests among stakeholders in the research process. Real-world examples are used to illustrate practical skills in policy research.", "outcome": "(1) To understand the basic concepts of policy research;(2) To comprehend social, political, economic and organizational factors which influence the research process;(3) To acquire experiences in collecting and analyzing qualitative and quantitative information;(4) To develop a research proposal on an actual policy issue;(5) To relate research outcomes as inputs to policy formulation and implementation.", "syllabus": "The whole course consists of three parts. The first part introduces the basic elements: research question, theory, research design, and conceptualization. The second part discusses some qualitative methods, including case study, interviews, and content analysis. The final part focuses on quantitative methods: descriptive and inferential analysis, and survey research. For the quantitative part, Microsoft Excel will be used to conduct statistical analysis. The teacher will demonstrate the analysis steps in class where necessary. Students are expected to learn the basic skills of statistical analysis. This course also highlights the application and implication of methodological and statistical techniques in policy research. Therefore, real-life examples of public policies are discussed in class in order to advance students’ understanding and foster their policy analysis capacity.", "required_readings": "Babbie, E. R. (2013). The practice of social research. 13th edition (Student Edition).  Nelson EducationBerman, E., & Wang, X. (2011). Essential statistics for public managers and policy analysts. Los Angeles: CQ Press.Quirk T.J. (2012). Excel 2010 for Social Science Statistics: A Guide to Solving Practical Problems (e-book). Springer. Rubin HJ. & Rubin IS. (1995). Qualitative Interviewing: The Art of Hearing Data. Sage Publications.Saldaña, J. (2015). The coding manual for qualitative researchers. Sage Publications.Yin, R. K. (2009). Case study research: Design and methods. Sage Publications.", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (3507)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [5], "locations": ["Lee Shau Kee Building LT3"], "instructors": ["Dr. YANG Litianqing"]}}}, "assessments": {"Attendance": "15", "Presentation": "35", "Report": "50"}}, {"code": "5142", "title": "Economic Analysis of Public Policy", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "The course objective is to provide students with useful economic tools to perform a benefit-cost analysis of public policy. It covers economic theories that help understanding how individuals, firms and government interact with one another. Relevant applications of economic theory to public policy in housing, health, labor, transportation, welfare, and environment are examined.", "outcome": "Students who have taken this course will\r  1) be able to apply economic tools for analyzing public policy, and\r  2) have a better understanding of the economic and financial context of public policy making", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (1018)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [4], "locations": ["Lee Shau Kee Building LT1"], "instructors": ["Professor NG Ka Ho"]}}}}, {"code": "5301", "title": "Globalization, Social Problem and Policy", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "This course examines how policies of national government are shaped by the super-state institutions, such as the WTO, IMF and the World Bank, and how these relate to the current social problems in the World Cities, such as poverty, income disparity, marginalization of labour, etc. It will also explore the limits and possibilities of social policies of the national governments in alleviating such social problems.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5311", "title": "Public Organization Management", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "Through discussing key questions in public organization theory and public management, the course examines how different aspects of public organizations, including their structure, environment and culture, can have an enormous impact on different stages of policymaking and policy outcomes. Emphasis of the course is on the understanding of the general theoretical frameworks of the field and the ability to apply them to the context of real-world problems and issues. Examples and cases from Hong Kong, China and major Asian and western countries are used for linking up the theory and practice.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5321", "title": "NGOs & Government", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "This course examines the political, social and economic importance of NGOs in view of the theoretical discussions derived from a variety of empirical research in the Western countries and the practical experiences faced by NGOs in Hong Kong. The juxtaposition of theory and practice constitutes the major theme of the course. A number of NGOs are to be studied, ranging from interest groups, community groups, social movement organisations, to social service organisations and international NGOs. Emphasis is placed on the manners in which these organisations interact with government, political parties and other social groups in the local and international contexts.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5331", "title": "Government and the Economy", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "The course identifies and analyzes the objectives and policies developed and pursued by the Government in managing the economy and how these policies are implemented to achieve the objectives. It will explore the Government's assumptions and approach to the economy and economic development, as well as monetary, fiscal, industrial, trade and investment policies. The Hong Kong Government serves as the primary case example, particularly the Financial Secretary's office, the HK Monetary Authority and Bureaus of Commerce and Economic Development and Financial Services and the Treasury.", "outcome": "1. To develop concrete, practical knowledge and skills in economic policy analayis, development and application. \r 2. To provide guidance in devising and implementing policies that contribute to sustainable eocnomic growth and beneficial", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (4301)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [1], "locations": ["Wu Ho Man Yuen Bldg 505"], "instructors": ["Dr Mark Charles MICHELSON"]}}}}, {"code": "5351", "title": "Public Policy and Governance", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy.", "description": "This course analyses the relationship between public policy and governance in a rapidly changing world. It gives a general picture of contextual challenges confronting contemporary governments in forming and implementing public policies and discusses the ways in which governments have attempted to cope with these contextual changes and challenges, and how governance theories in public administration and more broadly political science have been developed to study the evolving modes of policy-making since the early 1990s.", "outcome": "1) To demonstrate an awareness of the fact that the environment in which governments make policies and organise the society has substantially changed; 2) To understand the changing mechanisms for governing in the recent decade and the impacts they bring about;  3) To reflect on both local and international cases and consider how they can contribute to a better understanding of public policy and administration in Hong Kong; and\r 4) To identity governing problems in the world and how the shared experience can help combat common governing problems faced by different governments.", "syllabus": "Please refer to course outline to be distributed in the first class.", "required_readings": "Please refer to course outline to be distributed in the first class.", "recommended_readings": "Please refer to course outline to be distributed in the first class.", "terms": {"2020-21 Term 1": {"--LEC (2844)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [2], "locations": ["No Room Required"], "instructors": ["Dr CHOU Kwok Ping"]}}}}, {"code": "5402", "title": "Comparative Public Policy", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "The course objective is to explain policy outcomes of different political units, whether they are national or sub-national governments. The course also discusses some fundamental issues concerning the approach, scope and methods of doing comparative public policy. The course is divided into two parts. First, some foundational concepts, conceptual definitions and the underpinnings of doing comparative public policy will be given. Second, cases in major policy areas including Hong Kong, China and major countries in regions around the world will be examined by applying the concepts and theoretical frameworks introduced.", "outcome": "1. To understand more about the concepts and nature of comparative public policy.\r 2. To integrate empirical findings with theoretical guidance in a comparative public policy context.\r 3. To understand and think critically about public policy in the Greater China and other regions.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (1094)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [2], "locations": ["Cheng Yu Tung Building 203"], "instructors": ["Professor TSAO King Kwun"]}}}}, {"code": "5412", "title": "Crisis Management and Public Governance", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "This course discusses theories and applications of crisis management and governance in the public service sector. It will also focus on how professionals in the public sector can reduce risks, get prepared, respond to and recover from crises for providing good governance.", "outcome": "1. Students are expected to be able to apply crisis management and governance theories to daily life.\r 2. Students are expected to analyze crisis critically with a better understanding of crisis management and governance.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (4538)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [2], "locations": ["Cheng Yu Tung Building LT5"], "instructors": ["Professor LEE Kaman"]}}}}, {"code": "5422", "title": "Environmental Policy Analysis", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy;or MSSc Government and Politics (Greater China)", "description": "This course introduces students to the fundamental concept of the environmental policy cycle in the context of the institutional setup, political ecology and advocacy of various stakeholders. The key considerations in environmental policy-making will be examined and appropriateness of different policy instruments in different context will be discussed. Students will be asked to discuss examples of current policies or policy instruments, in Hong Kong, China and the world.", "outcome": "At the end of the course, students are expected to be:\r (a) conversant with the environmental policy cycle and its complexity; (b) able to analyze and critique policies; (c) capable of choosing appropriate policy instruments; and\r (d) familiar with the dynamics of the environmental movement and pursuit for sustainability.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 2": {"--LEC (3398)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [3], "locations": ["Yasumoto Int'l Acad Park 505"], "instructors": ["Professor LAM Kin Che"]}}}}, {"code": "5432", "title": "Urban Planning and Development", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "In this course, different theories of planning and urban design are outlined, researched and adapted to current issues in Hong Kong and China. Urbanization, generic cities, the production of space, political planning, architectural culture and urban evolution will provide a contextual framework for the (re)vision of future environments in a critical and sustainable manner.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5433", "title": "Global Finance and Governance", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "The purpose of this course is to analyze both short-term and long-term flows of capital across borders, the patterns they assume, the forces driving them. It also examines the benefits and costs/risks arising as a result, the instruments developed by private agents to maximize their effectiveness, government efforts to minimize the disruption caused, and the institiutional architecture which is emerging as a by-product of their rapid expansion.", "outcome": "1. To acquire basic understandings of the relationship between finance and government.\r 2. To be able to apply knowledge of finance and capital flow to the public policy process.\r 3. To be able to analyze the effects of finance towards governance.", "syllabus": "", "required_readings": "", "recommended_readings": "", "terms": {"2020-21 Term 1": {"--LEC (3602)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [4], "locations": ["Cheng Yu Tung Building LT5"], "instructors": ["Professor MUSHKAT Miron"]}}}}, {"code": "5435", "title": "Government Relations, Diplomacy and Ethics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy.", "description": "The course provides students with understanding of policy and government landscape and analysis of how organizations which operate across geographic boundaries can develop a consistent approach to Government Relations and Partnership Agreement strategies while ensuring the approach adopted is in accordance with the nuances of the different structures and processes on the ground. The course also will examine theories and case examples of political and regulatory advocacy projects to help students develop strategies and skills to organise and implement campaigns.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5501", "title": "Public Policy in Hong Kong", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy.", "description": "With regard to Hong Kong as major case, the course will focus on and analyze the policy rationales and arguments put forward by the government, and the interaction between the administration and other stakeholders, including legislature, NGO, media and political parties. The course will also discuss the rising difficulties of the government in getting policy consensus from the general public and Legislative Council by illustrating intensive disputes of institutional reform, poverty problem, environment issues, and housing policies in Hong Kong.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5801", "title": "Topical Studies in Public Policy I", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "This course provides an in-depth analysis of important topics in public policy and government administration. Examples of these topics involve democratic governance, political sociology, social policy & welfare in Hong Kong & East Asia, political & economic transition in China, and program evaluation, etc. The topics of the course may vary according to the area of expertise of the instructor and the interest of the class.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5802", "title": "Topical Studies in Public Policy II", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy", "description": "This course provides an in-depth analysis of important topics in public policy and government administration. Examples of these topics involve democratic governance, political sociology, social policy & welfare in Hong Kong & East Asia, political & economic transition in China, and program evaluation, etc. The topics of the course may vary according to the area of expertise of the instructor and the interest of the class.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5803", "title": "Topical Studies in Public Policy III", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy.", "description": "This course provides an in-depth analysis of important topics in public policy and government administration. Examples of these topics involve democratic governance, political sociology, social policy & welfare in Hong Kong & East Asia, political & economic transition in China, and program evaluation, etc. The topics of the course may vary according to the area of expertise of the instructor and the interest of the class.", "outcome": "1) To acquire basic understandings of a public policy topic or issue.\r 2) To be able to analyze public policy issues in selected topics.", "syllabus": "Please refer to course outline to be distributed in the first class.", "required_readings": "Please refer to course outline to be distributed in the first class.", "recommended_readings": "Please refer to course outline to be distributed in the first class.", "terms": {"2020-21 Term 1": {"--LEC (3766)": {"startTimes": ["18:45"], "endTimes": ["21:30"], "days": [3], "locations": ["Cheng Yu Tung Building LT4"], "instructors": ["Professor TAM Kam Lan Annie"]}}}}, {"code": "5804", "title": "Topical Studies in Public Policy IV", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy.", "description": "This course provides an in-depth analysis of important topics in public policy and government administration. Examples of these topics involve democratic governance, political sociology, social policy & welfare in Hong Kong & East Asia, political & economic transition in China, and program evaluation, etc. The topics of the course may vary according to the area of expertise of the instructor and the interest of the class.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5901", "title": "Directed Studies", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Independent Study", "campus": "Main Campus", "academic_group": "Div of GPA", "requirements": "For students in MSSc Public Policy.", "description": "Research on an approved topic under individualized guidance and supervision of a Programme teaching staff, culminating in an individual research paper. The paper is usually expected to be based on a research project that integrates the theory and practice of public policy, with the use of appropriate research methods. Students taking this course should first obtain the teacher’s consent.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]