[{"code": "5001", "title": "Environmental Health Sciences", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "Through a few selected important topics, this course examines how environmental factors impact the health of people and the community, and what we can do to prevent or minimize the negative impacts.", "outcome": "Student should be able to:  1)Describe epidemiology & toxicology methods used to assess the impact of environmental exposures on human health;  2) Identify and define the steps in the risk-assessment and risk-management;  3) Explain how factors, such as risk perception, law and socioeconomic condition, may influence the practice of environmental health;  4) Define the major sources and types of hazards in the environment and workplaces; Describe the direct and indirect health effects of major environmental and occupational agents;  5) Describe general principles of environmental pollution mitigation and occupational hazard control;  6) Describe regulatory programs, guidelines & authorities on environmental health.", "syllabus": "   Basics of Environmental Health: (History and definition of environmental health and occupational health; toxicology & epidemiology methods used to assess the impact of environmental exposures on human health)     Natural environment, climate change and health: (Adverse health effects within the natural environment, particularly in developing countries; health outcomes linked to climate change.)          Air pollution and health: (The typical components of urban ambient air pollution and their corresponding health effects.)         Water and food safety:  (Hazardous substances that may be found in drinking water and  in the food supply; water & food safety control measures)         Solid and hazardous waste : (Hazards of poorly designed solid waste disposal sites & improperly processed sewage.)         Work and health (fundamental of occupational health, principles of preventing occupational diseases and injuries)         Occupational disease and injury (fundamental concepts related to occupational disease and injury, introduction to pneumoconiosis)         Risk management and environmental health policy: (The steps in the risk-assessment and risk-management processes; principles that guide environmental policy development; environmental health regulation.)        ", "required_readings": "Please refer to the course outline provided by course teacher", "recommended_readings": " 1) Living with the Earth: Concepts in Environmental Health Science. Moore, G. S. Boca Raton: Lewis Publishers. 2) Essentials of Environmental Health. Robert H. Friis.Sudbury, Mass. Jones and Bartlett, c2007; ", "terms": {"2020-21 Term 1": {"F-LEC (1234)": {"startTimes": ["14:00"], "endTimes": ["17:00"], "days": [2], "locations": ["Prince of Wales Hospital"], "instructors": ["Mr ZHOU Yitao, \n\rMs. SO Tsz Ning Cherryline, \n\rMs. TANG Hoi Ying Dior, \n\rProfessor HO Kin Fai, \n\rProfessor LAO Xiangqian"]}}, "2020-21 Term 2": {"P-LEC (1236)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [4], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor HO Kin Fai, \n\rProfessor LAO Xiangqian"]}}}, "assessments": {"Classwork": "30", "Examination": "70"}}, {"code": "5002", "title": "Lecture series on Occupational Health", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg students in Master of Public Health / Postgraduate Diploma in Public Health", "description": "A basic course for students intending to study in any discipline of occupational health. General basic principles of controls of hazards in the practice of occupational health and hygiene will be introduced. Other topics include chemical hazards, physical hazards, biological hazards, ergonomics, injury and return to work, workplace wellness, as well as common occupational diseases and challenges in Hong Kong.", "outcome": "After completing this course, students will be able to do the following:  • Describe the common occupational health risks caused by biological, chemical, physical, and ergonomics.  • Recognize work injury and return-to-work, occupational health surveillance, workplace wellness, common occupational diseases and challenges in Hong Kong.  • Acquire knowledge of current regulatory and policy issues related to occupational health.  • Apply principles in the practice of occupational health and hygiene to controls of hazards in the workplace as well as environmental health protection to the community.", "syllabus": "   Introduction to Occupational Health & Hygiene      Chemical Hazards  (Gases & Vapours, Organic Compounds, and Metals)HW#1 Assigned on Jan 31. (SK will mark)             Dust Hazards and Biological Hazards      Physical Hazards I (Noise and vibration) HW #1 due (SK will mark)     Physical Hazards II (radiation, pressure, heat, lighting) HW#2 Assigned (ST will mark)     Ergonomics      Control of Hazard, Occupational Exposure Limits, and Instrumentation HW #2 due (ST will mark)     Site Visit 2:00-5:00pm Submit individual HHE report two weeks after site visit (TW will mark the HHE report)     Injury and Return to Work HW#3 Assigned (Joan Fok will mark)     Framework of occupational health surveillance & Workplace wellness      Occupational diseases and challenges in HK       ", "required_readings": "Please refer to the course outline provided by course teacher", "recommended_readings": "Encyclopaedia of Occupational Health and Safety, Online edition 2012 [http://www.iloencyclopaedia.org]Jeremy Stranks. Occupational Health and Hygiene. Pitman Publishing.Waldron HA and Edling C. Occupational Health Practice. Butterworth-Heinemann; fourth edition, 2004.Occupational Safety & Health Administration (OSHA) [http://osha.gov/]National Institute for Occupational Safety and Health (NIOSH) [http://www.cdc.gov/niosh/].", "terms": {"2020-21 Term 3": {"--LEC (1179)": {"startTimes": ["18:30", "10:00", "14:00"], "endTimes": ["21:30", "13:00", "17:00"], "days": [5, 6, 5], "locations": ["Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital"], "instructors": ["Professor TSE Lap Ah", "Professor TSE Lap Ah", "Professor TSE Lap Ah"]}}}, "assessments": {"Classwork": "10", "Examination": "70", "Report": "20"}}, {"code": "5003", "title": "Occupational Health II (OM)", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "Field Studies/Field-tripLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg students in Master of Public Health / Postgraduate Diploma in Public Health", "description": "This is a follow-up of course \"Occupational Health I\" for medical doctors who want to specialize in the discipline of occupational medicine. A systematic approach to the study of occupational diseases and work-related health problem will be introduced, and practical management problems in occupational medicine will be covered.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5004", "title": "Occupational Health II (Hygiene)", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "Field Studies/Field-tripLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg students in Master of Public Health / Postgraduate Diploma in Public Health", "description": "This is a follow-up of course \"Occupational Health I\" for students who want to specialize in the discipline of occupational hygiene. A systematic approach to the anticipation, recognition, evaluation and control of occupational hazards will be introduced and practical experience with instrumentation in the assessment of the working environment will be emphasised.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5005", "title": "Occupational Health II (Health Practice)", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "Field Studies/Field-tripLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg students in Master of Public Health / Postgraduate Diploma in Public Health", "description": "This is a follow-up of course \"Occupational Health I\" for nurses who want to specialize in the discipline of occupational health nursing and occupational health practice. Common and important occupational diseases and work-related health problems will be introduced as well as the importance of health promotion in the workplace. Practical aspects in occupational health practice will be emphasised.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5006", "title": "Air Pollution", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg students in Master of Public Health / Postgraduate Diploma in Public Health", "description": "This course introduces the current state of knowledge in the key areas in which air pollutants impact on the health of the general population. Topics include the health impacts of gaseous air pollutants such as sulfur dioxide, nitrogen dioxide, carbon monoxide and ozone; mechanism of lung injury by airborne particulate matter; epidemiological evidence of the risk from particulate matter exposure; airborne chemical carcinogens; health effects of indoor air pollution; and setting health-based air quality standards.", "outcome": "Student should be able to: 1. Describe the importance of outdoor and indoor air pollution and its impact on human health 2. Discuss and distinguish the various source of air borne chemical pollutants and its potential health outcomes  3. Explain the major source of work related air pollutants and its effect 4. Understand the process of setting air quality standard 5. Understand the entire air quality management process of Hong Kong", "syllabus": "This course introduces the current state of knowledge in the key areas in which air pollutants impact on the health of the  general population. Topics include the health impacts of gaseous air pollutants such as sulfur dioxide, nitrogen dioxide,  carbon monoxide and ozone; mechanism of lung injury by airborne particulate matter; epidemiological evidence of the risk  from particulate matter exposure; airborne chemical carcinogens; health effects of indoor air pollution; and setting health-based air quality standards.", "required_readings": "Please refer to the course outline provided by course teacher", "recommended_readings": "Please refer to the course outline provided by course teacher", "terms": {"2020-21 Summer Session": {"--LEC (1011)": {"startTimes": ["9:30", "10:30", "14:00", "9:30", "14:00"], "endTimes": ["12:30", "12:30", "17:00", "12:30", "17:00"], "days": [4, 5, 2, 3, 1], "locations": ["Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital"], "instructors": ["Professor HO Kin Fai, \n\rProfessor LAO Xiangqian", "Professor HO Kin Fai, \n\rProfessor LAO Xiangqian", "Professor HO Kin Fai, \n\rProfessor LAO Xiangqian", "Professor HO Kin Fai, \n\rProfessor LAO Xiangqian", "Professor HO Kin Fai, \n\rProfessor LAO Xiangqian"]}}}, "assessments": {"Essays": "40", "Essay test or exam": "60"}}, {"code": "5007", "title": "Urban Environment and Health", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg students under School of Public Health", "description": "A course that covers aspects of environmental health specific to urban environmental with particular emphasis on noise pollution, air pollution, water quality issues and green spaces.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5008", "title": "Water and Health", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg students in Master of Public Health / Postgraduate Diploma in Public Health", "description": "This course gives a brief introduction to water, environment & health. Topics include: 1) Epidemiology of important waterborne diseases in developing countries, implications for health services, community health, economic impacts 2) Development & water-related health issues3) Health Impacts Assessment of water pollution in developing countries4) Health promotion in the Community for waterborne illness control in low income countries", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5009", "title": "Public Health Toxicology", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg students in Master of Public Health / Postgraduate Diploma in Public Health", "description": "This course provides students with the basic concepts of toxicology and its application to environmental, occupational, nutrition and food toxicology; discusses distribution, cellular penetration, metabolic conversion, and elimination of toxic agents, as well as the fundamental laws governing the interaction of foreign chemicals with biological systems; focuses on the application of these concepts to the understanding the result from environmental exposure to toxic substances through a case study format. [students are required to have good knowledge on biology and health or have taken PBHT5005 Basic Human Physiology]", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5010", "title": "Environmental Risk Assessment", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg students in Master of Public Health / Postgraduate Diploma in Public Health", "description": "This course provides students with an understanding of the role and scope of health risk assessment, the application of toxicology, epidemiology, exposure assessment and environmental monitoring in risk assessment, risk characterization and risk management.[students should also take OENV 5009– Public Health Toxicology]", "outcome": "After completing this course, students will be able to do the following:  1. Apply principles and methodologies used in risk assessment to identify and evaluate hazards in different contextual situations; 2. Plan, implement and evaluate an environmental health impact assessment; 3. Describe and justify the principles and methodologies employed in risk management; 4. Describe and evaluate the methodologies used in risk communication and public participation.", "syllabus": "Overview of risk assessment in public health. - Toxicology in health risk assessment - Exposure assessment and biological monitoring (biomarkers, genetics) in health risk assessment - Role of epidemiology in risk assessment (Dose-response relationship) - Case study analysis (linkage amongst animal study in the lab, epi results in the general population, epi data of workers)  - Risk characterization and conceptual model development - Risk management, risk communication and challenges  - Group work and case study development of a risk assessment [recent episodes of public health issue – air, water, food, soil].", "required_readings": "Please refer to the course outline provided by course teacher", "recommended_readings": "Please refer to the course outline provided by course teacher", "terms": {"2020-21 Term 2": {"--LEC (4134)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor WONG Tze Wai"]}}}, "assessments": {"Classwork": "15", "Examination": "60", "Project": "25"}}, {"code": "5011", "title": "Environmental Risk Management & Communication", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg students in Master of Public Health / Postgraduate Diploma in Public Health", "description": "This module builds upon the principles taught in OENV 5010 (Environmental Risk Assessment). The course gives students basic knowledge of the frameworks used for risk reduction and the protection of human health from chemical, physical, biological and ergonomic hazards. Students will be exposed to environmental risk communication frameworks and practical guidance on report writing for stakeholders and for future policy formulation.", "outcome": "After completing this course, students should be able to: 1) Describe different approaches for preventing, and managing biological, chemical, physical and ergonomic hazards that pose risks to human health and safety 2) Be able to demonstrate an understanding of the decision process behind the management of environmental and infectious disease risks and provide justification for the prioritisation of different risk management actions 3) Describe methods for risk reduction & control for chemical, physical, biological and ergonomic hazardsat local and international levels 4) Be able to formulate preventive action and risk control programs including programs for surveillance 5) Describe the roles of risk communication in environmental health and its role in the policy process 6) Be able to provide appropriate suggestions for communication of assessment", "syllabus": "   Introduction and Principle of Risk Management    Risk Management for Biological/ Infectious disease Hazards   Risk Management for Physical Hazards   Risk Management for Chemical Hazards    Risk Management for Occupational Health & Ergonomics    Introduction to Risk Communications   Risk Communication  ", "required_readings": "Please refer to the course outline provided by course teacher", "recommended_readings": "1.      Blumenthal UJ., Fleisher JM, Esrey SA, Peasey A. Epidemiology: a tool for the assessment of risk. In Water Quality: Guidelines, Standards and Health: Assessment of Risk and Risk Management for Water-Related Infectious Disease. World Health Organization.2001, IWA Publishing. (http://whqlibdoc.who.int/publications/2001/924154533X_chap7.pdf) 2. Haas C, 2.      Eisenberg JNS. Risk Assessment. In Water Quality: Guidelines, Standards and Health: Assessment of Risk and Risk Management for Water-Related Infectious Disease. World Health Organization.2001, IWA Publishing. (http://whqlibdoc.who.int/publications/2001/924154533X_chap8.pdf)3.      Food & drink : good manufacturing practice : a guide to its responsible management4.      HACCP / Sara Mortimore and Carol Wallace ; compiling editor, Christos Cassianos5.      The ISO 9000 quality system : applications in food and technology6.      Food safety in China : a comprehensive review / Linhai Wu, Dian ZhuJimÈnez B och Rose J. (Eds.) Urban water security: Managing risks, Urban Water Series, UNESCOIHP, Taylor and Francis ISBN 9780415485678 (selected parts )", "terms": {"2020-21 Term 3": {"--LEC (1020)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [3], "locations": ["Prince of Wales Hospital"], "instructors": ["Professor WONG Tze Wai"]}}}, "assessments": {"Presentation": "50", "Report": "50"}}, {"code": "5801", "title": "Injury prevention and control", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg students under School of Public Health", "description": "This course aims to provide students with an understanding that injury is a public health issue of global importance, the burden of injury to society, and strategies currently in place to prevent injury of different causes. The course includes the definition of injury, measurement and classification of injury, assessment of injury severity, risk factors identification for various types of injury, concept of prevention, intervention strategies and their evaluation, and cause-specific injury topics.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]