[{"code": "5000", "title": "Foundations of Public Health", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For taught postgraduate students in:- ;(i) PgD Health Services Management and Public Health; (ii) PgD Public Health; (iii) MSc Health Education; (iv) Master of Public Health; or ;(v) MBA Health Care", "description": "This course is an introductory course for all students which aims to provide an overview on the history, basic concepts and current issues in the field of public health. Students will gain a broad, general understanding on how public health issues can be framed in the three interrelated domains of health protection, health improvement, and health services. This foundation course will equip students with an analytic lens that is essential for deeper learning in each of the three domains.", "outcome": "Understand the basic concept and characteristics of public health and social determinants of health. Understand the key functions of health system in analyzing public health issues; Understand the basic concept of population, society and global disparities of health and promoting equity; Understand the basic structures of health systems, in particular the challenges of NCDs & communicable diseases; Gain familiarity of concepts of environmental change and global health.", "syllabus": "   Lecture 1   Case Study 1   Lecture 2   Case Study 2   Lecture 3   Case Study 3   Lecture 4   Case Study 4  ", "required_readings": "Please refer to the course outline provided by course teacher", "recommended_readings": "Please refer to the course outline provided by course teacher", "terms": {"2020-21 Term 1": {"--LEC (4174)": {"startTimes": ["12:00"], "endTimes": ["12:00"], "days": [1], "locations": ["TBA"], "instructors": ["Miss YUEN Rebacca, \n\rMr ZHOU Yitao, \n\rMs. SO Tsz Ning Cherryline, \n\rMs. TANG Hoi Ying Dior, \n\rProfessor CHUNG Roger Yat Nork"]}}}, "assessments": {"Attendance": "10", "Homework or assignment": "50", "Presentation": "40"}}, {"code": "5001", "title": "Introduction to Qualitative Research: Theories and Research Design", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For student in MPH", "description": "This qualitative methods course will introduce students to the topical issues related to conducting qualitative research and allow for some hands-on exposure to the methods of data collection and analysis used in this methodology.", "outcome": "Student should be able to: 1. Understand the definition and features of qualitative research 2. Understand philosophical basis of qualitative approaches and its applications 3. Understand data collection methods: ethnographic observation, interview, focus group 4. Understand the skills of data coding, reduction, and interpretation", "syllabus": "   Introduction to qualitative methods   Study design and sampling Observation   In-depth interviews             Interview guide   Reading discussion                                     Focus groups   Data analysis                          Coding   Qualitative writing  ", "required_readings": "Pope C, Mays N.  Qualitative research in health care (3rd edition).  BMJ Books, Blackwell Publishing, 2008.  ISBN: 978-1-4051-3512-2  ", "recommended_readings": "The BMJ published a good introductory series of articles about qualitative research. Use the links below to read these articles and get a basic understanding of qualitative methods. 1.        Introduction to qualitative methods in health Pope C, Mays N. Reaching the parts other methods cannot reach: an introduction to qualitative methods in health and health services research. BMJ. 1995;311(6996):42-5. http://www.bmj.com/cgi/content/full/311/6996/422.        Rigour of qualitative researchMays N, Pope C. Rigour and qualitative research. BMJ. 1995;311(6997):109-12. http://www.bmj.com/cgi/content/full/311/6997/1093.        ObservationMays N, Pope C. Qualitative research: Observational methods in health care settings. BMJ. 1995;311(6998):182-4. http://www.bmj.com/cgi/content/full/311/6998/1824.        In-depth interviewsBritten N. Qualitative interviews in medical research. BMJ. 1995;311(6999):251-3. http://www.bmj.com/cgi/content/full/311/6999/2515.        Focus groupsKitzinger J. Qualitative research. Introducing focus groups. BMJ. 1995;311(7000):299-302. http://www.bmj.com/cgi/content/full/311/7000/2996.        Consensus methods for medical and health services research.Jones J, Hunter D. Consensus methods for medical and health services research. BMJ. 1995;311(7001):376-80. http://www.bmj.com/cgi/content/full/311/7001/3767.        Case study evaluationKeen J, Packwood T. Case study evaluation. BMJ. 1995;311(7002):444-6. http://www.bmj.com/cgi/content/full/311/7002/4448.        Assessing quality Mays N, Pope C. Qualitative research in health care. Assessing quality in qualitative research. BMJ. 2000;320(7226):50-2. http://www.bmj.com/cgi/content/full/320/7226/509.        Analysing qualitative dataPope C, Ziebland S, Mays N. Qualitative research in health care. Analysing qualitative data. BMJ. 2000;320(7227):114-6. http://www.bmj.com/cgi/content/full/320/7227/11410.     Application of qualiative methodsMeyer J. Qualitative research in health care. Using qualitative methods in health related action research. BMJ. 2000;320(7228):178-81.        http://www.bmj.com/cgi/content/full/320/7228/178", "terms": {"2020-21 Term 1": {"--LEC (2806)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [1], "locations": ["TBA"], "instructors": ["Miss CHONG Chung Yan, \n\rMiss YUEN Rebacca, \n\rMr ZHOU Yitao, \n\rMs. TANG Hoi Ying Dior, \n\rProfessor DONG Dong"]}}}, "assessments": {"Classwork": "60", "Examination": "30", "Participation": "10"}}, {"code": "5002", "title": "Public Health Law", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "This Course examines the role of law as a tool for public health both within Hong Kong and at international level.", "outcome": "Student should be able to: 1. examine the role that law and lawyers play in protecting the public health and in promoting health, including in relation to both communicable and non-communicable disease  2. understand the principles of common law, administrative law, public law and of the legislation which purports to regulate the public health.  3. require consideration of the constitutional limits of the state’s power to impose public health interventions on individuals, and of principles of human rights and ethics that serve to protect the rights and dignity of individuals in the context of public benefit.  4. address the role of the international community in protection of national and global public health. 5. research the law and relevant LegCo papers for yourself  6. understand the structure of a Hong Kong Ordinance  7. analyse the duties and powers of Government Departments relevant to Public Health Law", "syllabus": "   Introduction to law, legal cultures and legal systems, and introduction to Hong Kong legal system   How law can work for the benefit of public health-:the Hong Kong and International  Perspective   The use of strategic thinking to by Public  Health ProfessionalsResearch skills  and preparing for your research paper   The gutter oil crisis and the Centre for  Food  Safety –the law and the consumer   The role of law in the prevention and control of non - communicable disease in Hong Kong  and internationally   The role of law  ethics and policy  in the prevention and control of communicable disease in Hong Kong and  internationally   The role of law and ethics in the prevention of tobacco harms   Public Health Law SimulationReview and evaluation of issues  ", "required_readings": "Gostin, L. Public Health Law: Power, duty, restraint. 2nd ed 2008. University of California Press; Dawson A, Verweij M (eds). Ethics, Prevention and Public Health. 2007; New York: Oxford University Press", "recommended_readings": "Gostin, L.  Public Health Law and Ethics: A Reader. 2nd ed. (2010). University of California Press. Richard Goodman.  Law in Public Health Practice (2007). Oxford University PressMartin, R. (2005). Public health and the scope of potential liability in tort. Journal of Professional Negligence. 21, 39-68.Wacks, R. Law - A Very Short Introduction. Oxford University Press 2009Martin, R., Lo, A. (2009) Comparative national public health legislation, in Oxford Textbook of Public Health Oxford: 2009.Martin, R. (2006). The exercise of Public Health Powers in cases of infectious disease: human rights implications. Medical Law Review. 14(1), 132-143.Martin, R., Lo, A. (2009) Comparative national public health legislation, in Oxford Textbook of Public Health Oxford: 2009.Martin, R.  (2008) The role of law in public health. In Dawson, A ed, The Philosophy of Public Health Ashgate Publishing, Burlington, USAPowers M, Faden, R. Social Justice: The Moral Foundations of Public Health and Health Policy. 2006; New York: Oxford University PressRabin, R and Sugarman, S. Regulating Tobacco: Premises and Policy Options 2001; US: OUPMello, M, Studdert, D and Brennan, T. Obesity-The New Frontier of Public Health Law. The New England Journal of Medicine 2006; 354: 2601-2610Martin, R. (2008) The role of law in the control of obesity in England: Looking at the contribution of law to a healthy food culture. Australia and New Zealand Health Policy. 5: 28Heller, G.(2007) Comparison of Surveillance Systems for Adverse Events Following Immunisation in Hong Kong and the United States, and Suggestions for Improvements of the Hong Kong System. Hong Kong Law Journal 805-830. Laws of Hong Kong at http://www.gov.hk/en/residents/government/law/index.htm Additional materials The Centre for Public Health Guidelines on Infection Control and Prevention in the Hotel IndustryConsumer Council website “HK Consumer Protection Legislations” October 2012 LegCo Briefing on Lamma Ferry Accident, wwwlegco.gov.hk/yr12-13/English/hc/paper hc1012cb2-8-1-e-pff February 2014, LegCo Paper on Follow up Action arising from Commission of Inquiry’s Report on Lamma Ferry Accident, wwwlegco.gov.hk/yr12-13/English/../paper.edv0722cb1-1522-2-e-pdf11th November 2014   “Administration’s Paper on the Update on the substandard lard incident and food safety issues in cooking oil”,CB(2) 218/14-15(05) ", "terms": {"2020-21 Term 3": {"--LEC (1181)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [1], "locations": ["No Room Required"], "instructors": ["Mrs Anne Rosamunde CARVER"]}}}}, {"code": "5004", "title": "Tuberculosis: Biology, Control and Policy", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg students in Master of Public Health / Postgraduate Diploma in Public Health", "description": "Tuberculosis (TB) has been declared as a public health threat by the WHO since 1990s, and the threat is recently more serious due to rapid development of multi-drug resistant TB and HIV/TB co-infection. The course will introduce TB microbiological, clinical and control aspects, and discuss TB epidemiology, evolution of control programmes, policies and practices both globally and locally. Health system and policy issues on TB control, regarding organisation, financing, payment, delivery will be widely explored. Examples on operational research over TB topics will be given.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5005", "title": "Basic Human Physiology", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "This course is a basic introduction to the human body for public health students without a bio-medical background. It is geared towards students with an undergraduate degree in the social sciences, arts and physical sciences. It will introduce the overview of basic scientific mechanisms, concepts and principles in health and in the pathogenesis of disease. It provides clinical scientific foundation for applications to the practice of public health. Professionals in the clinical health field such as physicians, nurses, dentists and allied health specialists will not be permitted to take this course for credit.", "outcome": "This course is a basic introduction to the human body for public health students without a bio-medical background. It is geared towards students with a undergraduate degree in the social sciences, arts and physical sciences. It will introduce the overview of basic scientific mechanisms, concepts and principles in health and in the pathogenesis of disease. It provides clinical scientific foundation for applications to the practice of public health. Professionals in the clinical health field such as physicians, nurses, dentists and allied health specialists will not be permitted to take this course for credit.", "syllabus": "   Introduction: cells, issuesCirculatory SystemDermatological system ISpecial Senses I   Reproductive and Urinary systems   Dermatological system IISpecial Senses IIRespiratory System   Gastrointestinal System   Musculoskeletal system    Endocrine systemDiabetes   Immune systemHematological system   Neurological System  ", "required_readings": "Please refer to the course outline provided by course teacher", "recommended_readings": "Please refer to the course outline provided by course teacher", "terms": {"2020-21 Term 1": {"--LEC (1296)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Mr ZHOU Yitao, \n\rMs. SO Tsz Ning Cherryline, \n\rMs. TANG Hoi Ying Dior, \n\rProfessor WONG Chi Sang"]}}}, "assessments": {"Homework or assignment": "20", "Short answer test or exam": "80"}}, {"code": "5006", "title": "Practice of Qualitative Research Methods", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg students under School of Public Health", "description": "The central goal of this course is to prepare students to enhance their knowledge and skills to design and conduct qualitative research projects and analyse qualitative data. The course begins with an advanced reflection about the theoretical and methodological foundations of different qualitative health research methods. It provides students with hands-on experience of designing an interview protocol, conducting in-depth interview, data analysis, and writing a qualitative report.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5801", "title": "Climate Change and Planetary Health", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg students in Master of Public Health / Postgraduate Diploma in Public Health", "description": "Climate change is an important topic for public health practice. As the frequency and severity of climate-related disasters increase, in order to protect health and well-being, the need to understand and prepare for unforeseeable events is rapidly growing. This course provides an overview of issues in relation to climate change and health in the context of public health practice. It introduces important concepts of how to tackle climate change related health impacts and how to support community preparedness, response, policy formulation and implementation.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5803", "title": "Development of Assessment instruments and questionnaire design", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For TPg students under School of Public Health", "description": "This course aims to provide students with an understanding of the basic principles and procedures in designing questionnaires and health-related assessment instruments. The course includes basic principles and procedures in questionnaire design, psychometrics, validation of an assessment instrument, and related statistical issues. At the completion of the course, students are enabled to develop a simple questionnaire suitable for collecting information for their own research project or in a specific area of their own interest.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5804", "title": "Ethics, Social Justice and Global Health", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "This course will introduce students to basic ideas of public health ethics and justice and discusses how those ideas apply to global biomedical issues.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5900", "title": "International Field Studies", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "This module is designed to allow students to conduct field studies abroad and locally, and to receive academic credit for their supervised work and studies. Field studies may include supervised field visits, public health-related field work, collaborative projects with an organization involving international public health activities . Short courses offered in abroad which require presence in that setting will also be accepted. All projects must receive prior approval from the module coordinator in order to receive credit. All field studies must include some form of assessment that must receive prior approval from the module coordinator. Students are to be selected by the course coordinator and subject to mutual agreement with partner organization.", "outcome": "Student should be able to: Understand concepts, theories and core issues in health equity Learn about the basic methodologies applied in health equity research Identify health equity issues in Hong Kong and around the world ", "syllabus": "   Health inequalities: history, definitions, concepts and theories Health inequalities: justice, equity and ethics    Global health inequalities Health equity case studies around the world   Discussion tutorial   Essential methodologies and measurements to examine health inequalities Life course approach to examine social determinants of health: the case of Taiwan   Health inequalities and COVID- 19 Vulnerable populations: Poverty and health Policy and system approach to achieving health equity    Marmot Review: 10 Years On Streamlining the journey for greater health equity in South Korea: from evidence and theory to policy and practice  ", "required_readings": "Please refer to the course outline provided by course teacher", "recommended_readings": "", "terms": {"2020-21 Term 2": {"-F01-FLD (1143)": {"startTimes": ["14:00", "14:00", "10:00", "14:00", "17:30"], "endTimes": ["15:30", "16:30", "12:30", "15:30", "20:00"], "days": [5, 6, 6, 0, 5], "locations": ["Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital", "Prince of Wales Hospital"], "instructors": ["Professor CHUNG Roger Yat Nork, \n\rProfessor YEOH Eng Kiong", "Professor CHUNG Roger Yat Nork, \n\rProfessor YEOH Eng Kiong", "Professor CHUNG Roger Yat Nork, \n\rProfessor YEOH Eng Kiong", "Professor CHUNG Roger Yat Nork, \n\rProfessor YEOH Eng Kiong", "Professor CHUNG Roger Yat Nork, \n\rProfessor YEOH Eng Kiong"]}}}, "assessments": {"Homework or assignment": "50", "Participation": "50"}}, {"code": "5901", "title": "Exchange Study", "career": "Postgraduate - Taught", "units": "1.50", "grading": "Graded", "components": "Independent Study", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For Master of Public Health and MSc Health Services Management students", "description": "Students enrolled in public health courses during their summer or winter terms in other universities can seek unit credits for their studies towards their MPH degree. Approval made on a case-by-case basis by the Concentration Coordinator after discussion with Curriculum Coordinator.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6802", "title": "Master Seminar & Tutorial", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Seminar", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "The tutorial sessions are designed as a supplement to the coursework and to provide some hands-on skills for future public health employment. The tutorials also serve as opportunities to discuss MPH projects and review materials from core modules as needed.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6803", "title": "Practicum", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health.", "description": "The practicum aims at providing a unique opportunity for students to gain familiarity with a variety of public health issues, programs, policies, and service delivery settings. Practicum experience allows students to integrate and apply the knowledge and skills they learned through coursework and prior experiences in a public health environment.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6900", "title": "Master Capstone Project & Report", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "LectureProjectInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Public Health", "requirements": "For students in Master of Public Health", "description": "Each student is required to develop and complete an individual project of a public health problem, under the direction of a supervisor in their chosen concentrations. The topic of each project should be relevant to the concentration selected. Students will be assigned a supervisor and are required to do presentations and to submit a final written report.", "outcome": "Upon satisfactory completion of the Capstone Project, all the students should be able to:  • conduct a proper literature review on a public health issue;  • develop a research protocol or practicum-based project plan;  • have practical, hands-on experience in the form of research or public health practice;  • perform data analysis or a systematic evaluation of a public health issue; • write a manuscript using standard journal format or an official report using institutional format; • orally present their work at a professional level; and  • create a professional poster for presentation at public health conferences.", "syllabus": "Please refer to the course outline for reference.", "required_readings": "Please contact your supervisor for required reading and recommended reading.", "recommended_readings": "", "terms": {"2020-21 Term 1": {"F-LEC (9263)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Mr ZHOU Yitao, \n\rMs. TANG Hoi Ying Dior, \n\rProfessor CHUNG Pui Hong"]}}, "2020-21 Term 3": {"F-LEC (1183)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor CHUNG Pui Hong"]}, "P-LEC (1184)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor CHUNG Pui Hong"]}}}}]