[{"code": "5001", "title": "Basic Clinical Embryology", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Obstetrics & Gynaecol", "requirements": "For students in MSc Reproductive Medicine and Clinical Embryology", "description": "The aim of this module is to provide basic knowledge on human embryology from fertilization through birth. It includes:1. The mammalian reproductive system2. Gametogenesis3. Fertilisation and Early embryogenesis4. Embryonic Development of special systems5. Congenital malformations", "outcome": "The students are expected to acquire the knowledge on:a. Molecular biology of the Cell;b. Gametogenesis;c. Female Reproductive Cycles;d. Fertilization, early embryogenesis and pre-implantation development;e. Embryonic development; andf. Human Birth Defects (congenital malformations).", "syllabus": "The topics will be stated in the course timetable and it will be provided in the first lesson.", "required_readings": "The required reading will be provided in the first lesson.", "recommended_readings": "The recommended reading will be provided in the first lesson,", "terms": {"2020-21 Term 1": {"--LEC (2211)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHI Ling, \n\rProfessor CHUNG Pui Wah Jacqueline"]}}}}, {"code": "5002", "title": "Advanced Clinical Embryology", "career": "Postgraduate - Taught", "units": "5.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Obstetrics & Gynaecol", "requirements": "For students in MSc Reproductive Medicine and Clinical Embryology", "description": "This course allows students to have a highly advanced theoretical and practical understanding of human embryology. It helps student to understand more the applied aspects of clinical embryology. And, it help students to have a comprehensive overview of all aspects of the ART Laboratory, including the set-up and running of the laboratory, specific procedures, and quality control to ensure the highest possible success rates in an IVF program", "outcome": "The students are expected to understand the IVF Laboratory in the aspect of environment, equipment, work flow, staff and common regulations. In addition, they should acquire the knowledge on: a. Clinical Embryology Laboratory Routing Procedures; b. Cryo-preservation; c. Preimplantation Genetic Testing; d. Other technologies and procedures used by IVF lab; e. Establishing and maintaining an IVF Laboratory; f. Trouble shooting; and g. Future development.", "syllabus": "Clinical embryology lab procedure flow overview ( Lab common rules, sample ID, handling and clinical embryologist behavior) Clinical Attachment-1 Lecture part -1: Jan. 14, 2017 afternoon ( 14:00 - 19:00) Oocyte retrieval and COC/oocyte assessment Semen preparation for ART Assisted hatching Embryo transfer Our center - clinical side Our center - lab side Lecture part -2 : Jan. 15, 2017 morning ( 08:00 - 12:00) Culture of preimplantation human embryos in vitro - 1: IVF lab (What is an IVF Lab: environment, equipment, culture system) Insemination- 1: conventional insemination and ICSI Insemination- 2: preparation and evaluation of oocyte for ICSI IVF lab data management/ Document management in the ART laborotory: computer network system Clinical Attachment-2 Human Embryo Culture Human embryo devolopment in vitro Embryo culture in vitro (from zygote to blastosyt) - history and introduction Culture of preimplantation human embryos in vitro - 1: media  Culture of preimplantation human embryos in vitro - 2: culture system Two Step Media Single Step Media Embryo Assessment and Selection What is embryo assessment and why the embryo selection is needed Fertilization check  Embryo selection - 1: mophology assessment - pronuclear, early cleavage, cleavage, morula, and blastocyst Embryo selection - 2: kinetics and dynamics assessment - Time-lapse assessment Embryo selection - 3: the other invasive and non-invasive assessments (PGS, embryo metabolomics, Omics, Oxygen consumption...) Cryopreservation Basic Cryobiology Oocyte cryopreservation: slow freezing and vitrification Embryo cryopreservation: slow freezing and vitrification Ovary tissue cryopreservation Fertility preservation strategies and managing the cryopreserved human materials Other technologies and procedures used by IVF lab Nuclear transfer and cytoplasmic transfer Mitochondria transfer Establishing and maintaining an IVF Laboratory  Establishment of an ART laboratory: location, construction, and design (including alarm system / ID system) What makes an IVF lab successful: KPI and benchmarking, staff, facility, equipment, consumables, processess, procedures, management, and communications Other technologies and procedures used by IVF lab Oocyte in vitro maturation Establishing and maintaining an IVF Laboratory Quality management and risk management in a ART laboratory: Quality Control and Quality Assurance Current standards for the ART laboratory: guidelines for good practice in IVF laboratories Trouble shooting IVF lab enviroment - air quality, VOCs, temperature, and lighting IVF culture system - Tep, pH, gas, osmometry, and other factors Procedures and staff Preimplantation Genetic Testing PGD and PGS Embryo biopsy: Polar body biopsy, Day3 cleavage stage embryo biopsy, and Day5 blastocyst biopsy Future deveolopment The future of IVF Lab Laboratory and its environment: evidence of effects of clean room technology upgrade", "required_readings": "The required readings will be provided in the first lesson.", "recommended_readings": "The recommended readings will be provided in the first lesson.", "terms": {"2020-21 Summer Session": {"--LEC (1091)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor CHUNG Pui Wah Jacqueline"]}}}}, {"code": "5003", "title": "Andrology", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Obstetrics & Gynaecol", "requirements": "For students in MSc Reproductive Medicine and Clinical Embryology", "description": "This course provides a knowledge set appropriate for the broad range of health care professionals involved in the treatment of the infertile male, provide training in the assessement of parameters of male reproductive function, and assist professionals in identifying strategies for the treatment of male infertility. The course includes:1. The physiology and pathophysiology of male reproductive function2. Key elements of the male factor evaluation3. Basic and advanced testing of reproductive function4. Surgical and nonsurgical treatments of male infertility5. Strategies for male fertility preservation", "outcome": "The students are expected to understand the male reproductive system and their function. In addition, they should acquire the knowledge on:a. Male Infertility and Factors;b. Male Infertility- Clinical Part (evaluation and treatment);c. Male Infertility - Andrology Laboratory Evaluation;d. Sperm processing and selection techniques in an IVF/IVSCI; ande. Controlling for quality in the Andrology Laboratory.", "syllabus": "The topics will be stated in the course timetable and it will be provided in the first lesson.", "required_readings": "The required reading will be provided in the first lesson.", "recommended_readings": "The recommended reading will be provided in the first lesson.", "terms": {"2020-21 Term 2": {"--LEC (2232)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor CHUNG Pui Wah Jacqueline"]}}}}, {"code": "5004", "title": "Clinical Issues and Controversies in ART", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Obstetrics & Gynaecol", "requirements": "For students in MSc Reproductive Medicine and Clinical Embryology", "description": "In this course, the latest opinion and controversies in ART field (including both clinical part and lab part) will be reviewed and discussed.It includes the latest opinion and controversies in:1. ART diagnosis2. ART treatment3. ART technology4. The latest guidelines and opinions in the ART world5. The latest regulation and law in the ART world6. The latest opinion regarding ART Ethics Assessment: Debate", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5005", "title": "Infertility and IVF Clinical Counseling", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Obstetrics & Gynaecol", "requirements": "For students in MSc Reproductive Medicine and Clinical Embryology", "description": "This course allows students to gain an understanding of the complex issues of infertility, modern fertility treatment, as well as current management strategies for infertile couples. It includes:1. Definition and diagnosis of infertility2. Treatment strategies of infertility3. Patient support and counselling", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5006", "title": "IVF Equipment: Selection, Application and Maintenance", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Obstetrics & Gynaecol", "requirements": "For students in MSc Reproductive Medicine and Clinical Embryology", "description": "The course will introduce the students how to select the suitable equipment according to the need of their laboratories, the maintenance and the related regulations. The equipment includes microscope and micromanipulation system, incubators, CASA and vitrification system. Hands-on workshop will be provided to the students during the lesson.", "outcome": "The students should be able to select, use and maintain the IVF laboratory equipment including microscopes, micromanipulation system and lazer, incubators, CASA and vitrification system.", "syllabus": "The topics will be stated in the course timetable and it will be provided in the first lesson.", "required_readings": "The required reading will be provided in the first lesson.", "recommended_readings": "The recommended reading will be provided in the first lesson. ", "terms": {"2020-21 Summer Session": {"--LEC (1092)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor CHI Ling, \n\rProfessor CHUNG Pui Wah Jacqueline"]}}}}, {"code": "5007", "title": "Preparatory Course for International Examination in Clinical Embryology", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Obstetrics & Gynaecol", "requirements": "For students in MSc Reproductive Medicine and Clinical Embryology", "description": "The course will include lectures and discussions on basic science and techniques relating to Human Reproductive Biology. In addition, full ESHRE (European Society of Human Reproduction and Embryology) Embryology exam syllabus will be covered.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5008", "title": "Genetics in Reproductive Medicine", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Obstetrics & Gynaecol", "requirements": "For students in MSc Reproductive Medicine and Clinical Embryology", "description": "Reproductive genetics is an increasing part of the assisted reproductive technology (ART) practice. Daily, ART centers use genetic information when couples undergo ethnicity screening, when donors are screened and chosen for recipient couples, to determine the cause of infertility or recurrent pregnancy loss, and when utilizing preimplantation genetic screening (PGS) and preimplantation genetic diagnosis (PGD). However, the application of genetic information and genetic testing is often limited due to lack of knowledge by the medical providers in the ART practice. This course serves to provide basic to complex genetic information to help such practices start to fill this education gap and competently apply genetic information to improve patient care. It includes:1. Both basic genetics education and review of real time application. 2. The faculty will address current knowledge of the genetic causes of infertility 3. The latest research on and testing for infertility treatment and diagnosis4. The gamete donor and gestation carrier screening5. The PGD in clinical application6. The latest information about PGS7. The latest technology and its applications", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5009", "title": "Reproductive Medicine & Assisted Reproductive Technology – Overview", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Obstetrics & Gynaecol", "requirements": "For students in MSc Reproductive Medicine and Clinical Embryology", "description": "This course allows students to gain an overall picture of ART, including basic conception, definition, basic clinical procedure, basic lab procedure, as well as the most updated knowledge and technology. It includes:1. The development of ART history2. The components of ART team 3. The basic procedures and responsibility of each ART components4. Communication of each components5. Definition and diagnosis of infertility6. Treatment strategies of infertility7. Patient support and counsellingAssessment: written examination", "outcome": "Students are expected to:1. Understand the ART history and current technology development2. Acquire the basic conception of Reproductive medicine and ART3. Acquire basic knowledge on the ART treatment4. Understand the whole procedure of ART in current clinical practice", "syllabus": "The development of ART historyThe components of ART team The basic procedures and responsibility of each ART componentsCommunication of each componentsDefinition and diagnosis of infertilityTreatment strategies of infertilityPatient support and counselling", "required_readings": "The required readings will be provided in the first lesson.", "recommended_readings": "The recommended readings will be provided in the first lesson.", "terms": {"2020-21 Term 1": {"--LEC (2207)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Online Teaching"], "instructors": ["Professor CHI Ling, \n\rProfessor CHUNG Pui Wah Jacqueline"]}}}}, {"code": "5010", "title": "Reproductive Medicine & Assisted Reproductive Technology - Clinical", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Obstetrics & Gynaecol", "requirements": "For students in MSc Reproductive Medicine and Clinical Embryology", "description": "This course allows students to gain detail knowledge and basic information about the modern ART treatment, infertility complex issues, as well as current management strategies for infertile patients.It includes:1. Investigation of infertility 2. Treatment strategies of infertility3. Ovulation induction4. In vitro fertilization in a clinical IVF lab5. Complications of ART (e.g. ovarian hyperstimulation syndrome)6. Counseling of infertile complex issues 7. Patient support", "outcome": "Learning outcomeThe students are expected to have knowledge and understand:                                                                                       1. Infertility investigation2. Infertility diagnosis3. Infertility treatment strategies4. The principle and strategy of ovulation induction  5. Basic procedure of oocyte retrieval6. Basic procedure of embryo transfer                               7. The strategy in counseling infertile patients 8. How to handle complications of ART treatment in clinical", "syllabus": "Infertility investigationInfertility diagnosisInfertility treatment strategiesThe principle and strategy of ovulation induction  Basic procedure of oocyte retrievalBasic procedure of embryo transfer                               The strategy in counseling infertile patients How to handle complications of ART treatment in clinical", "required_readings": "The required readings will be provided in the first lesson.", "recommended_readings": "The recommended readings will be provided in the first lesson.", "terms": {"2020-21 Term 2": {"--LEC (2221)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor CHI Ling, \n\rProfessor CHUNG Pui Wah Jacqueline"]}}}}, {"code": "5011", "title": "Cell Biology and Molecular Biology", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Obstetrics & Gynaecol", "requirements": "For students in MSc Reproductive Medicine and Clinical Embryology", "description": "The aim of this module is to quickly review the reproductive medicine related basic knowledge of cell biology and molecular biology, as well as the most update related knowledge. It includes:1. The cell structure and cell organelles2. The cell physiological properties 3. The cell metabolic processes and signaling pathway4. The cell cycles5. The structure and function of DNA, RNA and protein6. The processes of replication, transcription and translation7. The techniques of molecular biology8. The interactions between cell and their environment Assessment: written examination", "outcome": "The students are expected to acquire the basic and updated knowledge on:1. Cell biology and molecular biology of the Cell2. Modern techniques of cell biology and molecular biology", "syllabus": "The cell structure and cell organellesThe cell physiological properties The cell metabolic processes and signaling pathwayThe cell cyclesThe structure and function of DNA, RNA and proteinThe processes of replication, transcription and translationThe techniques of molecular biologyThe interactions between cell and their environment", "required_readings": "The required readings will be provided in the first lesson.", "recommended_readings": "The recommended readings will be provided in the first lesson.", "terms": {"2020-21 Term 1": {"--LEC (3986)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor CHUNG Pui Wah Jacqueline"]}}}}, {"code": "5012", "title": "IVF Laboratory Management and Communication", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Obstetrics & Gynaecol", "requirements": "For students in MSc Reproductive Medicine and Clinical Embryology", "description": "This course serves to provide basic knowledge and skills on IVF laboratory management, and the communication both inside and outside of the laboratory.It includes:1. IVF lab procedure management 2. IVF lab quality control and risk management3. IVF lab trouble shooting4. Communication inside of the lab5. Communication outside of the lab Assessment: written examination", "outcome": "At the conclusion of the course, students should be able to understand:1. The principle of procedure management2. The basic requirement of QC/QA system in an IVF lab3. The principle of risk management4. The principle of trouble shooting in an IVF lab5. The principle of communication inside/outside of the lab", "syllabus": "IVF lab procedure management IVF lab quality control and risk managementIVF lab trouble shootingCommunication inside of the labCommunication outside of the lab", "required_readings": "The required readings will be provided in the first lesson.", "recommended_readings": "The recommended readings will be provided in the first lesson.", "terms": {"2020-21 Summer Session": {"--LEC (1090)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor CHI Ling, \n\rProfessor CHUNG Pui Wah Jacqueline"]}}}}, {"code": "5013", "title": "Research Methodology", "career": "Postgraduate - Taught", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Obstetrics & Gynaecol", "requirements": "For students in MSc Reproductive Medicine and Clinical Embryology", "description": "This course facilitates students to use statistics to carry out their research projects adequately. It includes: 1. Basic research methodology2. Basic statistical concepts3. Research process and encourages an appreciation of why and how research is generatedAssessment: Written Examination", "outcome": "Students are expected to be able to:1. understand basic concepts of research and its methodologies2. identify the components of a literature review process3. identify the types of research methods best suited for investigating different types of problems and questions4. develop research questions that based on and build upon a critical appraisal of existing research5. understand basic statistical concepts6. design a research proposal7. be aware of the ethical principles of research, ethical challenges and approval process", "syllabus": "Concepts of researchMaking a research questionsScreening test and ROCIntroduction to the tool kit: Computer programs and graphicsProbabilityMeta-analysisPredictionBayesian Probability Receiver Operator Characteristics and ExerciseAssessment: what is it aboutCourse overview, Questions and Answers, evaluation and feedbackDiagnostic testingCritical appraisal of scientific publications (clinical)Important great studies in obstetricsFrom data collection to laboratory analysisCommon methodologies used in qualitative researchInterventional study, RCTEthical and legal issues related to researchTips to get successful publicationTranslating results to practiceTo plan a research, what, why How to write a research proposalQuality of life assessmentCommon data collection methods in quantitative researches and related principlesScreening and cleaning the dataSurvey & Questionnaires, gamblingRisk assessment & predictionUse of Normogram in obstetrics and gynaecologyLiterature searchSources of funding for research and grant writingEpidemiological study", "required_readings": "The required readings will be provided in the first lesson.", "recommended_readings": "The recommended readings will be provided in the first lesson.", "terms": {"2020-21 Summer Session": {"--LEC (1014)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["TBA"], "instructors": ["Professor CHI Ling, \n\rProfessor CHUNG Pui Wah Jacqueline"]}}}}, {"code": "5014", "title": "IVF Laboratory Design", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Obstetrics & Gynaecol", "requirements": "For students in MSc Reproductive Medicine and Clinical Embryology", "description": "This course gives students a chance to understand very basic requirement of designing a modern IVF laboratory. It includes:1. The basic conception of “clean room”2. The basic requirement of IVF lab designing3. The trend of IVF lab design Assessment: design an IVF lab", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6001", "title": "Research Project", "career": "Postgraduate - Taught", "units": "5.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Obstetrics & Gynaecol", "requirements": "For students in MSc Reproductive Medicine and Clinical Embryology", "description": "Research topics related to reproductive medicine and clinical embryology will be provided. The students are required to perform research work related to thesis topic under direction of their assigned supervisors, who are the principal investigators and senior academic staffs from the Chinese University of Hong Kong.The research project will either be a laboratory-based or clinical data-based investigation. Students are required to write up the result in a dissertation.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6002", "title": "Clinical Attachment", "career": "Postgraduate - Taught", "units": "5.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Div of Obstetrics & Gynaecol", "requirements": "For students in MSc Reproductive Medicine and Clinical Embryology", "description": "It will be clinic-based and laboratory-based attachment, students are required to attach to: A. Clinic-based Attachment1. Gynaecological out-patient clinic for infertility and gynae-endocrinological case management.2. Gynaecological operative theater for infertility surgical management.3. Assisted Reproductive Unit for cycle monitoring, ovarian stimulation, oocyte retrieval, embryo transfer, intrauterine insemination.B. Laboratory-based attachmentStudents will perform to followings by using the materials donated for teaching purpose after obtaining patient informed written consent.1. Semen analysis.2. Sperm preparation.3. Gametes handling4. Embryo culture5. Micromanipulation6. Crypreservation of gametes and embryos", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6003", "title": "Literature review", "career": "Postgraduate - Taught", "units": "5.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Obstetrics & Gynaecol", "requirements": "For students in MSc Reproductive Medicine and Clinical Embryology", "description": "In this course, students will review the literature on a selected topic of reproductive medicine / clinical embryology under the supervision of a teaching staff. Students are required to discuss their progress with their supervisors and complete a written report and make a seminar presentation at the end of the course.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6004", "title": "Field Trip", "career": "Postgraduate - Taught", "units": "1.00", "grading": "Graded", "components": "Field Studies/Field-trip", "campus": "Main Campus", "academic_group": "Div of Obstetrics & Gynaecol", "requirements": "For students in MSc Reproductive Medicine and Clinical Embryology", "description": "It will be clinic-based and laboratory-based attachment, students are required to attach to: 1. Clinic-based Attachmenta. Gynaecological out-patient clinic for infertility and gynae-endocrinological case management.b. Gynaecological operative theater for infertility surgical management.c. Assisted Reproductive Unit for cycle monitoring, ovarian stimulation, oocyte retrieval, embryo transfer, intrauterine insemination. 2. Laboratory-based attachmentStudents will perform to followings by using the materials donated for teaching purpose after obtaining patient informed written consent.a. Semen analysis.b. Sperm preparation.c. Gametes handlingd. Embryo culturee. Micromanipulationf. Cryopreservation of gametes and embryos", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]