[{"code": "6103", "title": "Sport Development and Delivery", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Sports Studies; MPhil Sports Sci & Phys Edu; PhD Education; Master of Education; PgD Exer Sci & Phy Edu", "description": "The course begins by defining sport and other forms of physical activity and discussing the relationship between sport and society, both past and present. The course then examines the difference between sports management and sports development and, in more detail, the scope, purpose, principles and framework of sports development. The course then looks at various sports delivery systems and, in detail, the process of strategic planning for sports development. Strategic planning and sports development models are evaluated during the course. The strategic and developmental plans of selected organizations in the public and private sectors will be discussed.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6202", "title": "Sponsorship and Marketing of Sport Events and Performance", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Sports Studies; MPhil Sports Sci & Phys Edu; PhD Education; Master of Education; PgD Exer Sci & Phy Edu", "description": "This course aims to help students to acquire knowledge of the basic concepts in sport marketing and sport sponsorship and the skills required in drawing up marketing plans and strategies in organizing sports events and sponsorship deals. Topics including the special nature of sport marketing, marketing management in sport, customer relationship management, sports pricing strategies, sport event as a product, customer’s and sport organization’s buying behaviour, sport market research and marketing information systems, sport sponsorship packages, public relations and promotion, ambush marketing and legal aspects in sport sponsorships will be covered. Other than lectures, students are requested to conduct case studies in sport marketing and to draw up a sport event marketing plan to earn hands-on experience.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6701", "title": "Guided Studies: Sports Studies", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Sports Studies", "description": "The purpose of this course is to allow students in the Masters’ degree programme to pursue advanced guided individual study in selected areas of sports studies. It provides an opportunity for students to review the literature of their fields of specialization and to prepare for the writing of their project proposals. Examples are topics within the areas of biomechanics, exercise physiology, sports management, sports psychology, etc. A student is expected to read according to a reading list prescribed or approved by the supervisors and to confer regularly and frequently with the supervisor. Assessment is based on the completion of reading and course requirements.", "outcome": "After taking this course, students will be able to\r • Identify a research topic and relevant references to the topic being studied\r • Select and adopt an appropriate research methodology to accomplish specific research study\r • Communicate with the course instructors with searched articles and materials\r • Prepare, organize and evaluate a research topic in the related discipline or field", "syllabus": "Nil", "required_readings": "Nil", "recommended_readings": "• Ha, A. S., Lonsdale, C., Lubans, D. R., & Ng, J. Y. Y. (2017). Increasing students' physical activity during school physical education: rationale and protocol for the SELF-FIT cluster randomized controlled trial. BMC Public Health, 18:11.\r • Ha, A. S., Lonsdale, C., Ng, J. Y. Y., & Lubans, D. R. (2017). A school-based rope skipping program for adolescents: Results of a randomized trial. Preventive Medicine, 101, 188-194.\r • Ha, A.S. (2016). Student Learning Outcome and Teacher’s Autonomy Support Toward Teaching Games for Understanding Through Adopting Accessible Technology and Alternative Sport Equipment: An Asian Experience. Research Quarterly for Exercise and Sport, 87, S12-S13.\r Chan, C.H., Ha, A.S. & Ng, J.Y.Y. (2016). Improving Fundamental Movement Skills in Hong Kong Students Through an Assessment for Learning Intervention that Emphasizes Fun, Mastery, and Support: The A + FMS Randomized Controlled Trial Study Protocol. SpringerPlus, 5, 1, 724-735.\r • Ha, A. S., Burnett, A., Sum, R., Medic, N., & Ng, J. Y. Y. (2015). Effects of a rope skipping program to Hong Kong children and adolescents. Journal of Human Kinetics, 45, 233-240.\r • Ha, A. S., & Ng, J. Y. Y. (2015). Autonomous motivation predicts leisure time physical activity in Hong Kong students. Applied Psychology, Health and Well-Being. Applied Psychology: Health and Well-Being, 7(2), 214-220.\r • Ng, J. Y. Y., Burnett, A., Ha, A. S., & Sum, K. W. (2015). Psychometric properties of the Chinese (Cantonese) versions of the KIDSCREEN health-related quality of life questionnaire. Quality of Life Research, 24, 2415-2421.\r • Ha, A.S., Wang, C.L., & Collins J. (2014). Perceptions of Hong Kong Physical Education Teachers on Teaching Games for Understanding: Implications for Continuing Professional Development. Educational Research Journal, 29(1&2), 91-110.\r • Ha, A. S., Ng, J. Y. Y., Lonsdale, C., & Lubans, D. (2014). School-based rope skipping intervention for adolescents in Hong Kong: Protocol of a matched-pair cluster randomized control trial. BMC Public Health 14:535.\r • Ha, A.S., Sum, R.K., Chan, C.H. & Ng, J.Y.Y. (2014). Promoting rope skipping at Hong Kong schools with low and mid socioeconomic statuses: An ecological perspective. International Review of Social Science, 2, 104-115.\r • Wang, C.L., Ha, A.S., & Wen Xu. (2014). Teaching Perspectives of Chinese In-service Teachers: Compatibility with Goals of Physical Education Curriculum. Journal of Teaching in Physical Education, 33, 213-231.\r • Fong, S.S., Ha, A.S., Chan, T. W., & Au, M.K. (2014). The enjoyment of physical activity determines body mass index in young people with physical disabilities. Open Journal of Preventive Medicine, 4, 241-249.\r • Wang, C.L., & Ha, A.S. (2013). Three groups of teachers’ views, learning experiences and understanding of Teaching Games for Understanding. Physical Education and Sport Pedagogy 18(3), 336-350.\r • Wang, C.L. & Ha, A.S. (2013). The theory of planned behaviour: predicting pre-service teachers’ teaching behaviour towards a constructivist approach. Sport, Education, and Society 18(2), 222-242.\r • Qi, J., & Ha, A. S. (2012). Inclusion in physical education: A Review of Literature. International Journal of Disability, Development and Education 59 (3), 257-281.\r • Ha, A.S., & Wang, C.L. (2012). Teaching Strategies on Children’s Sportspersonship and Moral Development. Pan – Asian Journal of Sports and Physical Education 4(1), 38 – 48.\r • Wang, C.L., & Ha, A.S. (2012). Factors Influencing Pre-service Teachers’ Perception of Teaching Games for Understanding: A Constructivist Perspective. Sport, Education, and Society 17 (2), 261 – 280.\r • Wang, C.L., & Ha, A.S. (2012). Mentoring in TGfU Teaching: Mutual Engagement of Pre –service Teachers, Teachers, Cooperating Teachers and University Supervisors. European Physical Education Review, 18(1), 47 – 61.\r • Qi, J., Ha, A. S., & Wang, L. (2011). Qualitative research method and its application in physical education. China Sport Science. 31(6), 74 – 80.\r • Ha, A.S., Sum, R.K., O’Sullivan, M., Pang, B.O., & Chan, D.W. (2010). Effects of a Professional. Development Programme on Teacher Receptivity and Curriculum Change in Physical Education. Educational Research Journal, 25(1), 47 – 80.\r • Ha, A.S., Macdonald, D., & Pang, B. (2010). Physical Activity in the Lives of Hong Kong Chinese Children. Sport, Education, and Society, 15(3), 331 – 346.\r • Ha, A.S., & Pang, B. (2010). Physical Activity and Confucianism: Relationships between Hong Kong Children and their Parents In J., Wright & D., Macdonald (Ed). Young People,\r • Physical Activity and the Everyday, pp. 93 – 103. United Kingdom – London: Routledge.\r • Pang, B.O., & Ha, A.S. (2010). Subjective task value in physical activity participation: The perspective of Hong Kong schoolchildren. European Physical Education Review, 16 (3), 223 –235.\r • Wang, C.L., & Ha, A.S. (2009). Pre – service Teachers’ Perception of Teaching Games for Understanding: A Hong Kong Perspective. European Physical Education Review, 15 (3), 407 – 429.\r • Ha, A.S., Abbott, R., Macdonald, D., & Pang, B. (2009). Comparison of perceived support for physical activity and physical activity related practices of children and young adolescents in Hong Kong and Australia. European Physical Education Review, 15(2), 155 – 171.\r • Janssen I, Leblanc A.G. (2010). Systematic review of health benefits of physical activity and fitness in school-age children and youth. International Journal of Behavioral Nutrition and Physical Activity, 7, 40-50.\r • Lohrmann, D. K. (2010). A Complementary Ecological Model of the Coordinated School Health Program. Journal of School Health, 80(1): 11-9.\r • Salmon J, Booth M.L., Phongsavan P, Murphy N, Timperio A. (2007). Promoting physical activity participation among children and adolescents. Epidemiologic Reviews, 29, 144-159.\r • Van Sluijs E.M.F., McMinn A.M., Griffin SJ. (2007). Effectiveness of interventions to promote physical activity in children and adolescents: systematic review of controlled trials. BMJ, 1-13.\r • Ward D.S., Saunders R.P., Pate R.R. (2007). Physical activity interventions in children and adolescents. Champaign IL: Human Kinetics.\r • Zhang T., Solmon, M.A., Gao, A., & Kosma, M. (2012). Promoting school students’ physical activity: a social ecological perspective. Journal of Applied Sport Psychology, 24:92-105.", "terms": {"2020-21 Term 1": {"AJ01-PRJ (3256)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor HA Sau Ching Amy"]}, "BJ01-PRJ (4099)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor YANG Yijian"]}, "CJ01-PRJ (1720)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor HUI Sai Chuen"]}, "DJ01-PRJ (4098)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Heung Sang Stephen"]}, "EJ01-PRJ (1719)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SIT Hui Ping"]}, "FJ01-PRJ (4097)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SUM Kim Wai Raymond"]}}, "2020-21 Term 2": {"AJ01-PRJ (3713)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor HA Sau Ching Amy"]}, "BJ01-PRJ (4250)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor YANG Yijian"]}, "CJ01-PRJ (1607)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor HUI Sai Chuen"]}, "DJ01-PRJ (4251)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Heung Sang Stephen"]}, "EJ01-PRJ (1608)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SIT Hui Ping"]}, "FJ01-PRJ (4252)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SUM Kim Wai Raymond"]}}}, "assessments": {"Essays": "70", "Presentation": "30"}}, {"code": "6900", "title": "Independent Study Project", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Sports Studies", "description": "Students registered in the MA in Sport Studies who wish to apply their knowledge to a project that would be useful in their career choice will be encouraged to carry out an independent project in which no new data will be collected. Instead, students will be expected to present for assessment a document that represents a substantial effort in the creation, design, application and presentation that will represent post-graduate level of understanding with regard to sport science and its direct application to the provision or performance of sport. It is anticipated that the document that is presented for assessment could be similar in nature to a yearly plan for an elite athlete or team, a human resource plan for the enhancement of personnel within a sport organization or a marketing guide to promote a specific sport. The student will be guided by a supervisor who will work closely with the student to ensure that the standards for post-graduate work are upheld.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6901", "title": "Research Project: Sports Studies", "career": "Postgraduate - Taught", "units": "9.00", "grading": "Graded", "components": "Project", "campus": "Main Campus", "academic_group": "Div of Education", "requirements": "For students in MA Sports Studies", "description": "The research project requires final year students to complete an independent research project that focuses on a specific aspect of sport that is of interest to the student. The student will be guided by a supervisor who will work closely with the student to develop a research question by reviewing the literature, plan the approach with an appropriate theoretical framework, select an appropriate methodology, collect data in a professional and ethical manner, analyze the data and present the analysis in a conventional research format.", "outcome": "After taking this course, student will be able to:\r • demonstrate the application of knowledge and method to the investigation of a specific area within the field of physical education and sport studies\r • identify an issue to which solutions and/or recommendations can be addressed; and produce a written report which sets out clearly the aims, context, content and outcome of the exercise.\r • integrate the skills and knowledge which have been taught in the degree programme with specific application to a topic to produce a well-argued report.", "syllabus": "Nil", "required_readings": "Nil", "recommended_readings": "• Ha, A. S., Lonsdale, C., Lubans, D. R., & Ng, J. Y. Y. (2017). Increasing students' physical activity during school physical education: rationale and protocol for the SELF-FIT cluster randomized controlled trial. BMC Public Health, 18:11.\r • Ha, A. S., Lonsdale, C., Ng, J. Y. Y., & Lubans, D. R. (2017). A school-based rope skipping program for adolescents: Results of a randomized trial. Preventive Medicine, 101, 188-194.\r • Ha, A.S. (2016). Student Learning Outcome and Teacher’s Autonomy Support Toward Teaching Games for Understanding Through Adopting Accessible Technology and Alternative Sport Equipment: An Asian Experience. Research Quarterly for Exercise and Sport, 87, S12-S13.\r • Chan, C. H., Ha, A.S. & Ng, J. Y. Y. (2016). Improving Fundamental Movement Skills in Hong Kong Students Through an Assessment for Learning Intervention that Emphasizes Fun, Mastery, and Support: The A + FMS Randomized Controlled Trial Study Protocol. SpringerPlus, 5, 724-735.\r • Qi, J., Wang, L.J., Ha, A.S. (2016). Perceptions of Hong Kong physical education teachers on the inclusion of students with disabilities. Asia Pacific Journal of Education, 37, 86-102.\r • Ha, A. S., Burnett, A., Sum, R., Medic, N., & Ng, J. Y. Y. (2015). Effects of a rope skipping program to Hong Kong children and adolescents. Journal of Human\r Kinetics, 45, 233-240.\r • Ha, A. S., & Ng, J. Y. Y. (2015). Autonomous motivation predicts leisure time physical activity in Hong Kong students. Applied Psychology, Health and Well-Being. Applied Psychology: Health and Well-Being, 7(2), 214-220.\r • Ng, J. Y. Y., Burnett, A., Ha, A. S., & Sum, K. W. (2015). Psychometric properties of the Chinese (Cantonese) versions of the KIDSCREEN health-related quality of life questionnaire. Quality of Life Research, 24,2415-2421.\r • Ha, A. S., Ng, J. Y. Y., Lonsdale, C., & Lubans, D. (2014). School-based rope skipping intervention for adolescents in Hong Kong: Protocol of a matched-pair cluster randomized control trial. BMC Public Health 14:535.\r • Wang, C.L., Ha, A.S., & Wen Xu. (2014). Teaching Perspectives of Chinese In-service Teachers: Compatibility with Goals of Physical Education Curriculum. Journal of Teaching in Physical Education, 33, 213-231.\r • Wang, C.L., & Ha, A.S. (2013). Three groups of teachers’ views, learning experiences and understanding of Teaching Games for Understanding. Physical Education and Sport Pedagogy 18(3), 336-350.8\r • Wang, C.L.& Ha, A.S. (2013). The theory of planned behaviour: predicting pre-service teachers’ teaching behaviour towards a constructivist approach. Sport, Education, and Society 18(2), 222-242.\r • Wang, C.L., & Ha, A.S. (2012). Factors Influencing Pre-service Teachers’ Perception of Teaching Games for Understanding: A Constructivist Perspective.\r Sport, Education, and Society 17 (2), 261 – 280.\r • Wang, C.L., & Ha, A.S. (2012). Mentoring in TGfU Teaching: Mutual Engagement of Pre – service Teachers, Teachers, Cooperating Teachers and University Supervisors. European Physical Education Review, 18(1), 47 – 61.\r • Qi, J., Ha, A. S., & Wang, L. (2011). Qualitative research method and its application in physical education. China Sport Science. 31(6), 74 – 80.\r • Ha, A.S., Sum, R.K., O’Sullivan, M., Pang, B.O., & Chan, D.W. (2010). Effects of a Professional. Development Programme on Teacher Receptivity and\r Curriculum Change in Physical Education. Educational Research Journal, 25(1),47 – 80.\r • Ha, A.S., Macdonald, D., & Pang, B. (2010). Physical Activity in the Lives of Hong Kong Chinese Children. Sport, Education, and Society, 15(3), 331 – 346.\r • Wang, C.L., & Ha, A.S. (2009). Pre – service Teachers’ Perception of Teaching Games for Understanding: A Hong Kong Perspective. European Physical Education Review, 15 (3), 407 – 429.\r • Ha, A.S., Abbott, R., Macdonald, D., & Pang, B. (2009). Comparison of perceived support for physical activity and physical activity related practices of children and young adolescents in Hong Kong and Australia. European Physical Education Review, 15(2), 155 – 171.\r • Denscombe M. (2007). The good research guide for small-scale social research projects. London: McGraw Hill, Open University Press.\r • Thomas, J.R., Nelson, J.K., Silverman, S.J. (2005). Research methods in physical activity. Champaign: Human Kinetics (5th edition).\r • Locke, L.F., & Lambdin, D. (2003). Putting research to work in elementary physical education: Conversations in the gym. Champaign: Human Kinetics.\r • Macdonald, D., Kirk, D., Metzler, M., Nilges, L. M., Schempp, P., & Wright, J. (2002). It's all very well, in theory: Theoretical perspectives and their applications in contemporary pedagogical research. Quest, 54(2), 133-156.\r • Ward, P., & Barrett, T. (2002). A review of behavior analysis research in physical education. Journal of Teaching in Physical Education, 21(3), 242-266.\r • Penney, D., & Chandler, T. (2000). Physical education: What future(s)?. Sport, Education and Society, 5(1), 71-87.\r • Biddle, S. J., Markland, D., Gilbourne, D., Chatzisarantis, N. L., & Sparkes, A.9C. (2001). Research methods in sport and exercise psychology: Quantitative and qualitative issues. Journal of Sports Sciences, 19(10), 777-809.\r • Cho, J., & Trent, A. (2006). Validity in qualitative research revisited. Qualitative Research, 6(3), 319-340.\r • Stern, E. (2005). Evaluation research methods. Thousand Oaks, Calif: SAGE.\r • Stringer, E. (2004). Action research in education. Upper Saddle River, N.J.: Pearson/Merrill/Prentice Hall.", "terms": {"2020-21 Term 2": {"AJ01-PRJ (3196)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor HA Sau Ching Amy"]}, "BJ01-PRJ (1916)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor YANG Yijian"]}, "CJ01-PRJ (3851)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor HUI Sai Chuen"]}, "DJ01-PRJ (1917)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Heung Sang Stephen"]}, "EJ01-PRJ (3852)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SIT Hui Ping"]}, "FJ01-PRJ (1199)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor SUM Kim Wai Raymond"]}}}, "assessments": {"Others": "30", "Project": "70"}}]