[{"code": "1000", "title": "In Dialogue with Humanity"}, {"code": "1001", "title": "In Dialogue with Humanity (Cross-Institutional)", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionIndependent StudyInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Not for students who have taken UGFH1000", "description": "The course invites students to investigate the problem of \"humanity\"—i.e., what it means to be human—at two levels: human as an individual and human as a social being. Students will be engaged in a direct dialogue with literary writers, philosophers and social reformers who address three fundamental questions: What makes a \"good\" life for me? What makes a \"good\" society for everyone? How do I make possible such a \"good\" life and \"good\" society?Students are expected to read, discuss, and write about a wide range of texts extracted from influential classics in the humanities East and West. They will be encouraged to discover their own answers to the three questions by considering views and arguments expressed in the texts, and by exploring how far and in what ways such views and arguments may hold true for the contemporary world. Emphasis will be placed on students’ capacity to respond critically to the selected texts in oral and written presentations, in the form of class or online discussions, short essays and term paper. Class size will be kept small to maximize discussions and to facilitate intensive guidance on academic writing.The content of this course is identical to that of “In Dialogue with Humanity” (UGFH1000). The mode of delivery is blended. Teaching and learning activities are mainly conducted online but there are also several on-site meetings. Students taking this course come from different UGC-funded institutions.Blended-mode class section is available for this course. Please refer to the “Class Notes” of the blended-mode class section for details.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]