[{"code": "1000", "title": "In Dialogue With Nature"}, {"code": "1001", "title": "In Dialogue with Nature (Cross-institutional)", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "DiscussionInteractive TutorialWeb-enhanced Teaching", "campus": "Main Campus", "academic_group": "Office of University GE", "requirements": "Not for students who have taken UGFN1000.", "description": "This course is an intellectual pursuit across various natural sciences including the two most fundamental ones, physical and biological sciences. Ancient Greek philosophers took the lead in exploring the physical world and the world of life with reason and hence laid the foundations of natural science. This human enquiry into Nature leads to a reflection on the human understanding of Nature and the humans’ place in Nature.From the writings and stories of great scientists selected from influential literatures, students can gain a general understanding of the concepts and methodology of science, and of how scientists relate their academic pursuit to contemporary life, thereby developing their own perspectives on scientific issues. Students will be required to read, discuss and write about a wide range of texts in philosophy, science and its history. Emphasis will be placed on students’ capacity to respond critically to these texts in written as well as oral presentations. Through these learning activities, students are expected to develop a lifelong capacity and enthusiasm to continue such dialogues with science texts in the future.The content of this course is identical to that of “In Dialogue with Nature” (UGFN1000). The mode of delivery is blended. Teaching and learning activities are mainly conducted online but there are also several onsite meetings. Students taking this course come from different UGC-funded institutions.Blended-mode class section is available for this course. Please refer to the “Class Notes” of the blended-mode class section for details.\r", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]