[{"code": "(5704)", "title": "Research Methods in Urban Design\n\n** available as of 2021-07-01", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Architecture", "requirements": "For students in MSc in Urban Design and Master of Architecture", "description": "This course consolidates students understanding of academic inquiry and enables them to conduct a range of research methods relevant for the field of urban design. The first part of the course covers general aspects such as research ethics, scoping of research areas, conceptualizing research frameworks and identifying relevant research questions. The second part provides students with the relevant research methods and skills for urban design, such as conducting field studies, surveys and semi-structured interviews, as well as performing a range of qualitative and quantitative analyses. Throughout the course, students will learn how to relate their findings from their mixed-method studies to address complex urban issues. The course is coordinated with students’ work in the design studio and prepares them for their final thesis project. Assignments are organized according to sub-themes linked to the core issues of urban design.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "(5735)", "title": "Environmental Design for Liveable and Healthy Cities\n\n** available as of 2021-07-01", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Div of Architecture", "requirements": "For students in MSc in Urban Design and Master of Architecture", "description": "This course introduces the principles of environmental design in order to maximise the comfort of occupants and minimise the environmental impacts due to the design of building, landscape and urban spaces. The effect of different environmental factors on the built environment is discussed in detail. Design features, such as building’s orientation and form, are closely related to the design details of other design features. The quantitative aspects of the interactions between various design details are discussed with practical examples demonstrating such effects. It also examines the applications of climate-sensitive and environmental urban design in enhancing the living quality as well as the health and well-being of citizens.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5702", "title": "Environmental & Urban Economics", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Architecture", "requirements": "For students of MSc in Urban Design and MSc in Advanced Environmental Planning Technologies.", "description": "This course will study urban economic issues associated with environmental and social issues within urban regions. The course will study this topic from an interdisciplinary perspective. A range of topics in urban economics will be discussed including planning policies related to urban environment, migration, and transportation, as well as, zoning and livability issues, and potentials for more sustainable, just and livable cities. Students will become familiar with contemporary urban economic research and online sources of economic data. The course will prepare students to develop criteria for value judgments about the complex social, economic and environmental impact of urban design and planning.", "outcome": "On successful completion of this unit, students will be able to: \r 1. Demonstrate a basic understanding of the principles of macro and micro economic theory and the valuation of environmental resources. \r 2. Apply elementary methods of economic analysis to contemporary issues relating to the planning and management of built and natural environments.", "syllabus": "", "required_readings": "", "recommended_readings": "CORE TEXTS \r Begg, D., Fischer, S and Dornbusch, R. (2003) Economics, McGraw-Hill, London \r Lipsey, R. and Chrystal, K. (1995) An Introduction to Positive Economics, OUP, Oxford \r Mankiw, N. (2000) Principles of Economics, Harcourt, London \r Parkin, M., Powell,M. and Matthews K. (1997) Economics, Addison-Wesley, Harlow \r Sloman, J. (2003) Economics, Prentice Hall, Harlow \r Urban economics \r Adams, D., Watkins, C. and White, M. (2005) Planning, Public Policy and Property Markets. Blackwell: Oxford. \r Evans, A. W. (2004) Economics and Land Use Planning. Blackwell: Oxford. \r Harvey, J. (1992) Urban Land Economics. Macmillan: London. \r Environmental Economics \r McCann, P. (2001) Urban and regional economics. Oxford University Press: Oxford. \r Armstrong, H. and Taylor, J. (2000) Regional economics and policy. Blackwell: Oxford. \r Hanley, N., Shogren, J. F. and White, B. (2001) Introduction to environmental economics. Oxford University Press: Oxford. \r Anderson, D. A. (2010) Environmental economics and natural resource management", "terms": {"2020-21 Term 2": {"--LEC (1852)": {"startTimes": ["9:30"], "endTimes": ["10:15"], "days": [4], "locations": ["Lee Shau Kee Archi Bldg G01"], "instructors": ["Professor HE Ying"]}, "-T01-TUT (4511)": {"startTimes": ["10:30"], "endTimes": ["12:15"], "days": [4], "locations": ["Lee Shau Kee Archi Bldg G01"], "instructors": ["Professor HE Ying"]}}}, "assessments": {"Essays": "80", "Presentation": "20"}}, {"code": "5703", "title": "Urban History & Theory", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "LectureSeminar", "campus": "Main Campus", "academic_group": "Div of Architecture", "requirements": "For students of MSc in Urban Design and Master of Architecture.", "description": "This course examines the main ideas, histories and theories of the city through specific local and international examples from significant historical, political, geographical and environmental periods and aspects. Important themes and debates in urban design will be critically explored to understand the relationship between the urban forms and the culture of cities. In particular, the way urban forms have been used and reinterpreted, adapted and challenged by different social, economic and political contexts. Well-known cities will be studied to compare and contrast insights related to topical themes such as the Vertical City, the Asian Megacity and Delta Urbanism.", "outcome": "This course will provide students with skills to understand complex forces that shape cities, and introduces critical methods and tools to describe and theorize the urban processes that influence the built environment. Using a themed approach and in-depth case studies, students will learn to articulate the relationship between visual and physical form of the urban environment and urban settings, processes and contexts in different perspectives, styles and methods of inquiry.", "syllabus": "This course examines the main ideas, histories and theories of the city through specific local and international examples from significant historical, political, geographical and environmental periods and aspects. Important themes and debates in urban design will be critically explored to understand the relationship between the urban forms and the culture of cities. In particular, the way urban forms have been used and reinterpreted, adapted and challenged by different social, economic and political contexts. Well-known cities will be studied to compare and contrast insights related to topical themes such as the Vertical City, the Asian Megacity and Delta Urbanism.", "required_readings": "", "recommended_readings": "Carmona, M. & Tiesdell, S. (eds.) (2007) Urban design reader. Chuihua J.C. [et al.] (2001) Great Leap Forward.  Harvey, D. (1985) Consciousness and the urban experience.  Koolhaas, R. (1994) Delirious New York.  Larice, M. & Macdonald, E. (eds.) (2007) The urban design reader  Low, S.M. (1999), Theorizing the city.  Miles, M. [et al.] (2000) The city cultures reader. Mumford, L. (1989) The city in history.  Mumford, L. (1997) The culture of cities.  Parker, S (2004), Urban theory and the urban experience: encountering the city. Robbins E. & El-Khoury, R. (eds) (2004) Shaping the city: studies in history, theory and urban design.", "terms": {"2020-21 Term 1": {"--LEC (3193)": {"startTimes": ["9:30"], "endTimes": ["10:15"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Ms. YIU Hoi Lam Melody, \n\rProfessor Hendrik TIEBEN"]}, "-S01-SEM (3192)": {"startTimes": ["10:30"], "endTimes": ["12:00"], "days": [3], "locations": ["Online Teaching"], "instructors": ["Ms. YIU Hoi Lam Melody, \n\rProfessor Hendrik TIEBEN"]}}}, "assessments": {"Essays": "60", "Others": "20", "Presentation": "20"}}, {"code": "5710", "title": "Urban Design Studio I", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "Studio", "campus": "Main Campus", "academic_group": "Div of Architecture", "requirements": "For students of MSc in Urban Design and Master of Architecture.", "description": "UD Studio I will focus on existing urban districts in the Pearl River Delta region including Hong Kong and Macau and beyond. Students develop in groups and as individuals a design project exploring opportunities for neighborhoods and public spaces.", "outcome": "Students begin to understand key urban issues, to come up with innovative and creative place making solutions to address some of the urban issues. Students develop capability to analyse urban forms and the forces resulting in the transformation of the urban fabric in existing areas and neighbourhoods. Students learn to facilitate participation of multiple stakeholders in a workshop setting and to help develop proposals and urban design strategies resuting design intervention at the local in community scale. Students gain experience working in groups and individually, to be better prepared for the real world, fostering critical thinking skills, about how to address community and environmental issues in a context sensitive and sustainable way.", "syllabus": "", "required_readings": "", "recommended_readings": "Gehl, J., and Gemzoe, L.,(1996), Public Spaces Public Life: Copenhagen, Narayana Press, Denmark.\r Whyte, H. W., (2004), The Social Life of Small Urban Spaces, Project For Public Spaces, New York, NY\r Bacon, Edmund N. (1978), Design of Cities, Thames and Hudson, London\r Barnett, J. (1982) Introduction to Urban Design, New York, Harper & Row\r Bentley, Ian, (1985) Responsive Environments, first edition, The Architectural Press Ltd., London.\r Hedman, R., Jaszewski, A. (1984) Fundamentals of Urban Design, Planners Press, APA.\r Jacobs, J. (1993) Death and Life of Great American Cities, Modern Library, New York.\r Lynch, Kevin (1965) Image of the City, Cambridge, MIT.\r Shelton, B., Karakiewicz, J. & Kvan, T. (2010) The Making of Hong Kong – From Vertical to Volumetric, Taylor & Francis.", "terms": {"2020-21 Term 1": {"AU01-STD (3195)": {"startTimes": ["13:30", "13:30"], "endTimes": ["18:15", "18:15"], "days": [1, 4], "locations": ["Lee Shau Kee Archi Bldg 501", "Lee Shau Kee Archi Bldg 501"], "instructors": ["Mr. Darren SNOW, \n\rProfessor Hendrik TIEBEN", "Mr. Darren SNOW, \n\rProfessor Hendrik TIEBEN"]}, "BU01-STD (1915)": {"startTimes": ["13:30", "13:30"], "endTimes": ["18:15", "18:15"], "days": [1, 4], "locations": ["Lee Shau Kee Archi Bldg 501", "Lee Shau Kee Archi Bldg 501"], "instructors": ["Mr. Darren SNOW, \n\rProfessor Hendrik TIEBEN", "Mr. Darren SNOW, \n\rProfessor Hendrik TIEBEN"]}}}, "assessments": {"Others": "30", "Presentation": "70"}}, {"code": "5720", "title": "Urban Design Studio II", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "Studio", "campus": "Main Campus", "academic_group": "Div of Architecture", "requirements": "For students of MSc in Urban Design and Master of Architecture.;Prerequiste: URBD5710 or ARCH5111", "description": "Urban Design Studio II focuses on the creation of a new urban area. Students develop in groups and as individuals on a design project.", "outcome": "1) Development of advanced design skills in urban design; 2) Capability to analyse urban and land forms and their interrelation; 3) Development of design porposals based on an integration of knowledge of complex ecosystems; 4) Integration of different urban transport networks based on their capability to create a livable and sustainable environment; 5) Development of the ability to work in teams and with various professional consultants; 6) Fostering critical thinking.", "syllabus": "", "required_readings": "", "recommended_readings": "Bosselmann, P. (2008) Urban Transformation. Understanding City Design and Form, Washington, Covelo, London: Island Pre.\r Busquets, J. (2005) Barcelona: The Urban Evolution of a Compact City, Rovereto: Nicolodi.\r Chung, C.-J. [et al.] (2001) Great leap forward, Cologne: Taschen; Cambridge, Mass.: Harvard Design School. \r Grahame Shane, D. (2011) Urban Design Since 1945 – A Global Perspective, Wiley.\r Koolhaas, R (1994), Delirious New York: a retroactive manifesto for Manhattan, New York: Monacelli Press.\r Lehnerer, A. (2009) Grand Urban Rules, Rotterdam: NAI 010.\r Rowe, P.G. (2011) Emergent Architectural Territories in East Asian Cities, Basel: Birkhauser. \r Shelton, B., Karakiewicz, J. & Kvan, T. (2010) The Making of Hong Kong – From Vertical to Volumetric, Taylor & Francis.", "terms": {"2020-21 Term 2": {"AU01-STD (1161)": {"startTimes": ["13:30", "13:30"], "endTimes": ["18:15", "18:15"], "days": [1, 4], "locations": ["Lee Shau Kee Archi Bldg 501", "Lee Shau Kee Archi Bldg 501"], "instructors": ["Miss WANG Nai Huei, \n\rProfessor Jeroen Bastiaan VAN AMEIJDE", "Miss WANG Nai Huei, \n\rProfessor Jeroen Bastiaan VAN AMEIJDE"]}, "BU01-STD (2627)": {"startTimes": ["13:30", "13:30"], "endTimes": ["18:15", "18:15"], "days": [1, 4], "locations": ["Lee Shau Kee Archi Bldg 501", "Lee Shau Kee Archi Bldg 501"], "instructors": ["Miss WANG Nai Huei, \n\rProfessor Jeroen Bastiaan VAN AMEIJDE", "Miss WANG Nai Huei, \n\rProfessor Jeroen Bastiaan VAN AMEIJDE"]}}}, "assessments": {"Essays": "30", "Others": "70"}}, {"code": "5731", "title": "Topical Studies in Urban Design 1 - Urban Processes", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-tripLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Architecture", "requirements": "For students of MArch, MSc in Urban Design and MSSc in Housing Studies", "description": "The course focuses on the urban processes involved in the development and redevelopment of cities. Through lectures and seminars key issues, problems and challenges associated with urbanization and current trends within regional and international context are discussed. The plan making process in Hong Kong including public engagement within the city and the wider PRD context is introduced. Current trends in urban transformation processes in other parts of the world are looked at through regional and international case studies.", "outcome": "Students deepen their apprecaition for the urban processes involved in the development and redevelopment of cities and begin to understand the complex nature of problems and challenges associated with city development and urbanization processes. Students explore critical issues related to urban core developments, urban renewal of older urban districts, urban expansion through reclamation and new town development. Students learn to differentiate between top down and bottom up approaches and the importance of involving the public in the planning and the decision making process to create a sense of ownership of the city.  ", "syllabus": "", "required_readings": "", "recommended_readings": "The Government of the HKSAR (1998), Territorial Development Strategy Review - Final\r Executive Report 1998, Hong Kong: Planning, Environment and Lands Bureau.\r The Government of the HKSAR (2001), Urban Renewal Strategy, Hong Kong: Planning and Lands Bureau.\r Town Planning Ordinance, Chapter 131, Laws of Hong Kong\r Friedmann, J. (2005) China’s Urban Transition, University of Minnesota Press\r Kostof, S. (2005) The City Assembled, W.W. Norton & Co Inc.\r Urban Renewal Authority Ordinance, Chapter 563, Laws of Hong Kong", "terms": {"2020-21 Term 1": {"--LEC (3628)": {"startTimes": ["18:30"], "endTimes": ["21:30"], "days": [2], "locations": ["Online Teaching"], "instructors": ["Professor GOVADA Sujata Subbu"]}}}, "assessments": {"Essays": "80", "Presentation": "20"}}, {"code": "5732", "title": "Topical Studies in Urban Design 2 - Urban Transport Networks", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-tripLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Architecture", "requirements": "For students of MArch, MSc in Urban Design and MSc in Advanced Environmental Planning Technologies.", "description": "The course will provide an introduction into history and application of complex urban transportation systems that are globally in use or conception. It will provide introduction to transport concepts, planning aspects, technical requirements and ways of implementation.", "outcome": "Holistic understanding of key infrastructure aspects required for urban design enabling participation in real projects.\r Understanding of involvement of stakeholders and various professional disciplines and their roles throughout planning process.\r Knowledge of means of communication to various stakeholders realistically participating in similar projects.\r Make CUHK a recogniced institution where teaching and discourse on this topic are conducted.", "syllabus": "", "required_readings": "", "recommended_readings": "URBAN TRANSPORT FOR DEVELOPMENT Towards an Operationally-Oriented Strategy, Slobodan Mitric, World Bank 2008\r PEDESTRIAN PLANNING AND DESIGN, John J. Fruin. Published 1971\r  PLAN OF CHICAGO, Burnham & Bennet, Commercial Club of Chicago 2009 \r MASDAR CITY, Masterplan and Concept, UAE 2008", "terms": {"2020-21 Term 1": {"--LEC (3788)": {"startTimes": ["9:30"], "endTimes": ["12:15"], "days": [1], "locations": ["Online Teaching"], "instructors": ["Professor PAETZOLD Daniel Amos Sebastian"]}}}, "assessments": {"Essays": "60", "Others": "20", "Presentation": "20"}}, {"code": "5733", "title": "Topical Studies in Urban Design 3 - Urban Management", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-tripLectureInteractive Tutorial", "campus": "Main Campus", "academic_group": "Div of Architecture", "requirements": "For students of MSc in Urban Design.", "description": "This course provides a base for understanding urban management including the political and socio-economic aspects of urban development, governance issues, planning, policy framework and decision making within a Western and Asian development context. Through a series of lectures and seminars students are introduced to urban management methods and strategies in key areas such as land management, environmental management and public services delivery including associated problems and challenges within the context of Hong Kong and the PRD region.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "5734", "title": "Topical Studies in Urban Design 4 - International Workshop", "career": "Postgraduate - Taught", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-tripLectureStudio", "campus": "Main Campus", "academic_group": "Div of Architecture", "requirements": "For students of MSc in Urban Design.", "description": "This course is organized as an intensive workshop and allows students to explore in teams with students and advisors from various international universities a specific issue of urban design. Different international urban conditions are explored through comparative analyses and design. Students can benefit from the exposure to different urban cultures and design approaches. The course also prepares students for a working practice in diverse teams and in different cultural contexts.", "outcome": "In an increasingly globalized design practice, the international workshop offers the opportunity to: 1) increase the understanding of different urban conditions and cultures; 2) to learn from different design approaches; 3) to train the working in interdisciplinary and international teams; 4) and, to formulate coherent design and planning concepts in a short period of time.", "syllabus": "", "required_readings": "", "recommended_readings": "Literature will be selected according to the specific theme and place of the international workshop.", "terms": {"2020-21 Summer Session": {"--LEC (1135)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Lee Shau Kee Archi Bldg 501"], "instructors": ["Professor Hendrik TIEBEN"]}, "-F01-FLD (1132)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Lee Shau Kee Archi Bldg 501"], "instructors": ["Professor Hendrik TIEBEN"]}, "-U01-STD (1133)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Lee Shau Kee Archi Bldg 501"], "instructors": ["Professor Hendrik TIEBEN"]}}}, "assessments": {"Others": "75", "Presentation": "25"}}, {"code": "6701", "title": "Urban Design Thesis", "career": "Postgraduate - Taught", "units": "6.00", "grading": "Graded", "components": "Studio", "campus": "Main Campus", "academic_group": "Div of Architecture", "requirements": "For students of MSc in Urban Design.;Prerequisite: URBD5720 Urban Design Studio II", "description": "This course covers the general procedures of theoretical inquiry as it relates to urban design, from scoping the research terrain, identifying and focusing on conceptual frameworks and research questions, to determining the techniques, scope and phasing of investigations, as well as criteria for the development of interpretations and paradigms. For the dissertation, students will develop a proposal and produce intellectually rigorous piece of written or designed work. The topic will be defined in discussion with advisors, either in relationship with the design studio, or as an independent research on a topic related to urban design.", "outcome": "The main objective of the thesis work is to provide an opportunity for the student to conduct an independent research and/or design proposal related to a specific interest in the field of Urban Design. The student shall learn to formulate research and/or design problem, define researchable questions and develop solutions for the defined problems.\r Students will implement their knowledge on an advanced level and demonstrate an in depth capacity to address challenges stemming from the complex ways in which cities function, grow and develop. The students will gain the professional and theoretical tools to conduct an in depth research as well as to implement their skills and knowledge through the process of design or a written report.", "syllabus": "", "required_readings": "", "recommended_readings": "Literature will depend on individual topics.", "terms": {"2020-21 Summer Session": {"AU01-STD (1016)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Lee Shau Kee Archi Bldg 501"], "instructors": ["Mr. Darren SNOW, \n\rProfessor Jeroen Bastiaan VAN AMEIJDE"]}, "BU01-STD (1120)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["Lee Shau Kee Archi Bldg 501"], "instructors": ["Staff"]}}}, "assessments": {"Others": "70", "Presentation": "30"}}]